Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/network/electrumx-server.po
Languages: fr, it, ru

source: Guide to installing a Dash ElectrumX server
fr: Guide d'installation d'un serveur Dash ElectrumX
it: Guida all'installazione di un server Dash ElectrumX
ru: Гайд по запуску сервера Dash ElectrumX

source: dash, electrum, guide, setup
fr: dash, electrum, guide, installation
it: dash, electrum, guida, configurazione

source: ElectrumX Server
fr: Serveur ElectrumX
ru: Сервер ElectrumX

source: ElectrumX is a lightweight Electrum server written in Python that supports a variety of cryptocurrencies including Dash. It provides the backend services necessary to support the :ref:`Dash Electrum wallet <dash-electrum-wallet>`.
fr: ElectrumX est un serveur léger Electrum, écrit en Python et qui est compatible avec une série de cryptomonnaies, dont Dash. Il fournit les services d'arrière-plan nécessaires pour soutenir le :ref:`portefeuille Dash Electrum <dash-electrum-wallet>`.
it: ElectrumX è un server Electrum leggero scritto in Python che supporta una varietà di criptovalute tra cui Dash. Fornisce i servizi di backend necessari per supportare il :ref:`Dash Electrum wallet <dash-electrum-wallet>`.
ru: ElectrumX - это легкий сервер Electrum, написанный на языке Python и поддерживающий различные криптовалюты, включая Dash. Он предоставляет бэкэнд-сервисы, необходимые для поддержки :ref:`кошелёка Dash Electrum <dash-electrum-wallet>`.

source: An ElectrumX server requires running a full node in addition to the ElectrumX software. The following steps assume a Dash Core full node has already been installed on the server and is configured with transaction indexing enabled (``txindex=1`` in ``dash.conf``).
fr: Un serveur ElectrumX nécessite de faire tourner un nœud complet en complément du logiciel ElectrumX. Les étapes suivantes supposent qu'un nœud complet Dash Core a déjà été installé sur le serveur, et qu'il est configuré de façon à ce que l'indexation des transactions soit active (``txindex=1`` dans ``dash.conf``).
it: Un server ElectrumX richiede l'esecuzione di un nodo completo oltre al software ElectrumX. I passaggi seguenti presuppongono che un nodo completo Dash Core sia già stato installato sul server e sia configurato con l'indicizzazione delle transazioni abilitata (``txindex=1`` in ``dash.conf``).
ru: Для работы сервера ElectrumX помимо программного обеспечения ElectrumX требуется запуск полной ноды. Следующие шаги предполагают, что на сервере уже установлена полная нода Dash Core и настроена индексация транзакций (``txindex=1`` в файле ``dash.conf``).

source: Please see :ref:`this page (VPS setup)<vps-setup>` and :ref:`this page (OS setup)<vps-os-setup>` for details regarding server configuration. **When creating the new user, use** ``electrumx`` **for the user name.**
fr: Veuillez consulter :ref:`cette page (mise en place d'un VPS)<vps-setup>` et :ref:`cette page (mise en place d'un OS)<vps-os-setup>` pour des détails sur la configuration de serveur. **Quand vous créez le nouvel utilisateur, veuillez utiliser** ``electrumx`` **comme nom d'utilisateur.**
it: Consulta :ref:`questa pagina (configurazione VPS)` e :ref:`questa pagina (configurazione sistema operativo)<vps-setup>` per i dettagli relativi alla configurazione del server. **Quando crei il nuovo utente, utilizza** ``electrumx`` **come nome utente.**
ru: Подробнее о настройке сервера см. на :ref:`этой странице (настройка VPS)<vps-setup>` и :ref:`этой странице (настройка ОС)<vps-os-setup>`. **При создании нового пользователя используйте** ``electrumx`` **для имени пользователя.**

source: Check Dash Core Configuration
fr: Vérifier la configuration Dash Core
it: Controlla la configurazione di Dash Core
ru: Проверка конфигурации Dash Core

source: Before beginning the ElectrumX setup, make sure that your Dash Core node is configured to allow RPC access and perform transaction indexing. These settings can be checked by viewing the ``dash.conf`` configuration file (:ref:`default location<dashcore-rpc>`).
fr: Avant de commencer l'installation d'ElectrumX, assurez-vous que votre nœud Dash Core est configuré pour permettre l'accès RPC et exécuter l'indexation des transactions. Ces réglages peuvent être vérifiés en consultant le fichier de configuration ``dash.conf`` (:ref:`lieu par défaut<dashcore-rpc>`).
it: Prima di iniziare la configurazione di ElectrumX, assicurati che il tuo nodo Dash Core sia configurato per consentire l'accesso RPC ed eseguire l'indicizzazione delle transazioni. Queste impostazioni possono essere verificate visualizzando il file di configurazione ``dash.conf`` (:ref:`default location<dashcore-rpc>`).
ru: Перед началом настройки ElectrumX убедитесь, что ваша нода Dash Core настроена на разрешение доступа по протоколу RPC и выполнение индексации транзакций. Эти настройки можно проверить, просмотрев файл конфигурации ``dash.conf`` (:ref:`default location1`).

source: RPC Access
fr: Accès RPC
it: Accesso RPC
ru: RPC Доступ

source: The ``dash.conf`` file must include values for ``rpcuser``, ``rpcpassword``, and ``rpcallowip`` (it may also include ``rpcport``). They will be used in the *Set network values* step of `Install and Configure ElectrumX`_ . If the values are not present, add them as shown below.
fr: Le fichier ``dash.conf`` doit comporter des valeurs pour ``rpcuser``, ``rpcpassword`` et ``rpcallowip`` (il peut aussi comporter ``rpcport``). Elles seront utilisées lors de l'étape *Définir des valeurs de réseau* de `Installer et configurer ElectrumX`_ . Si ces valeurs sont absentes, ajoutez-les comme montré ci-dessous.
it: Il file ``dash.conf`` deve includere valori per ``rpcuser``, ``rpcpassword`` e ``rpcallowip`` (può anche includere ``rpcport``). Verranno utilizzati nel passaggio *Imposta valori di rete* di `Installa e configura ElectrumX`_. Se i valori non sono presenti, aggiungerli come mostrato di seguito.
ru: Файл ``dash.conf`` должен содержать значения ``rpcuser``, ``rpcpassword`` и ``rpcallowip`` (также может содержать ``rpcport``). Они будут использоваться на шаге *Установка сетевых значений* команды `Установка и настройка ElectrumX`_ . Если эти значения отсутствуют, добавьте их, как показано ниже.

source: Replace the fields marked with ``XXXXXXX`` as follows:
fr: Remplacez les champs marqués ``XXXXXXX`` comme suit :
it: Sostituisci i campi contrassegnati con ``XXXXXXX`` come segue:
ru: Замените все поля с ``XXXXXXX`` следующим образом::

source: ``rpcuser``: enter any string of numbers or letters, no special characters allowed
fr: ``rpcuser``: saisissez une chaîne alphanumérique aléatoire, sans caractères spéciaux
it: ``rpcuser``: inserisci qualsiasi stringa di numeri o lettere, non sono ammessi caratteri speciali
ru: ``rpcuser``: введите любой набор цифр или букв, без специальных символов

source: ``rpcpassword``: enter any string of numbers or letters, no special characters allowed
fr: ``rpcpassword`` : saisissez une chaîne alphanumérique aléatoire, sans caractères spéciaux
it: ``rpcpassword``: inserisci qualsiasi stringa di numeri o lettere, non sono ammessi caratteri speciali
ru: ``rpcpassword``: введите любой набор цифр или букв, без специальных символов

source: Transaction Indexing
fr: Indexation de transactions
it: Indicizzazione delle transazioni
ru: Индексирование транзакции

source: Make sure the following line is present in ``dash.conf``. If it's not present, add it and restart the node using the ``-reindex`` option. Note that reindexing can take a long time.
fr: Assurez-vous que la ligne ci-dessous soit présente dans ``dash.conf``. Si elle est absente, ajoutez-la et redémarrez le nœud avec l'option ``-reindex``. Veuillez noter que la réindexation peut être longue.
it: Assicurati che la seguente riga sia presente in ``dash.conf``. Se non è presente, aggiungilo e riavvia il nodo utilizzando l'opzione ``-reindex``. Tieni presente che la reindicizzazione può richiedere molto tempo.
ru: Убедитесь, что в файле ``dash.conf`` присутствует следующая строка. Если ее нет, добавьте ее и перезапустите ноду, используя опцию ``-reindex``. Обратите внимание, что переиндексация может занять длительное время.

source: Install Dependencies
fr: Installation de dépendances
it: Installa le Dipendenze
ru: Установочные зависимости

source: Python 3.7 is required for ElectrumX, ``build-essential`` and ``-dev`` version of Python are required for ``x11_hash``, and ``daemontools`` is required to manage the ElectrumX service.
fr: Python 3.7 est obligatoire pour ElectrumX, la version ``build-essential`` et ``-dev`` de Python est requise pour ``x11_hash``, et ``daemontools`` est nécessaire pour gérer le service ElectrumX.
it: Python 3.7 è richiesto per ElectrumX, le versioni ``build-essential`` e ``-dev`` di Python sono richieste per ``x11_hash`` e ``daemontools`` è richiesto per gestire il servizio ElectrumX.
ru: Для ElectrumX требуется Python 3.7, для ``x11_hash`` - ``build-essential`` и ``-dev`` версии Python, а для управления сервисом ElectrumX - ``daemontools``.

source: Install Python 3.7 and the required build tools via the package system:
fr: Installez Python 3.7 et les outils de compilation nécessaires, grâce au système de paquets :
it: Installa Python 3.7 e gli strumenti di compilazione richiesti tramite il sistema di pacchetti:
ru: Установите Python 3.7 и необходимые инструменты сборки через систему пакетов:

source: Now that Python 3.7 is installed, make it the default version:
fr: Maintenant que Python 3.7 est installé, faites-en la version par défaut :
it: Ora che Python 3.7 è installato, rendilo la versione predefinita:
ru: Теперь, когда Python 3.7 установлен, сделайте его версией по умолчанию:

source: Since the default version of Python has potentially changed, reinstall setuptools and then install X11 library:
fr: Comme la version par défaut de Python a peut-être été changée, réinstallez setuptools puis installez la bibliothèque X11 :
it: Poiché la versione predefinita di Python è potenzialmente cambiata, reinstallare setuptools e quindi installare la libreria X11:
ru: Поскольку версия Python по умолчанию потенциально изменилась, переустановите setuptools, а затем установите библиотеку X11:

source: Generate an SSL key and an associated certificate file for the server:
fr: Générez une clé SSL et un fichier certificat associé pour le serveur :
it: Genera una chiave SSL e un file di certificato associato per il server:
ru: Сгенерируйте SSL-ключ и соответствующий файл сертификата для сервера:

source: Install and Configure ElectrumX
fr: Installation et configuration d'ElectrumX
it: Installa e configura ElectrumX
ru: Установка и конфигурирование ElectrumX

source: Install ElectrumX
fr: Installer ElectrumX
it: Installa ElectrumX
ru: Установка ElectrumX

source: Clone ElectrumX from GitHub via git:
fr: Clonez ElectrumX depuis GitHub avec git :
it: Clonare ElectrumX da GitHub tramite git:
ru: Клонируйте ElectrumX с GitHub через git:

source: Build and install the project:
fr: Compilez et installez le projet :
it: Compila e installa il progetto:
ru: Соберите и установите проект:

source: Configure ElectrumX
fr: Configurer ElectrumX
it: Configura ElectrumX
ru: Конфигурируйте ElectrumX

source: Create the ElectrumX directories and copy files into them. These directories will be located in the ``electrumx`` user's home directory:
fr: Créez les répertoires ElectrumX et copiez les fichiers à l'intérieur. Ces répertoires seront trouvables dans le répertoire de l'utilisateur ``electrumx`` :
it: Crea le directory ElectrumX e copia i file al loro interno. Queste directory si troveranno nella directory home dell'utente ``electrumx``:
ru: Создайте каталоги ElectrumX и скопируйте в них файлы. Эти каталоги будут располагаться в домашнем каталоге пользователя ``electrumx'':

source: Set the server banner message and the coin type that the server will host:
fr: Définissez le message-bannière du serveur et le type de monnaie que le serveur hébergera :
it: Imposta il messaggio banner del server e il tipo di moneta che il server ospiterà:
ru: Установите баннерное сообщение сервера и тип монет, которые будут размещены на сервере:

source: Set network values:
fr: Définissez les valeurs de réseau :
it: Imposta i valori di rete:
ru: Установите значения сети:

source: ElectrumX requires Dash Core RPC details so it can connect properly. Set ``RPC_USER``, ``RPC_PASS``, ``RPC_IP``, and ``RPC_PORT`` variables to the values found in your ``dash.conf`` file. These values were previously checked in the `RPC Access`_ section.
fr: ElectrumX a besoin des détails RPC Dash Core pour se connecter correctement. Définissez les variables ``RPC_USER``, ``RPC_PASS``, ``RPC_IP`` et ``RPC_PORT`` selon les valeurs trouvées dans votre fichier ``dash.conf``. Ces valeurs ont été précédemment vérifiées dans la section `Accès RPC`_.
it: ElectrumX richiede i dettagli Dash Core RPC per potersi connettere correttamente. Imposta le variabili ``RPC_USER``, ``RPC_PASS``, ``RPC_IP`` e ``RPC_PORT`` sui valori trovati nel tuo file ``dash.conf``. Questi valori sono stati precedentemente controllati nella sezione "Accesso RPC"_.
ru: Для корректного подключения ElectrumX необходимы данные Dash Core RPC. Установите для переменных ``RPC_USER``, ``RPC_PASS``, ``RPC_IP`` и ``RPC_PORT`` значения, содержащиеся в файле ``dash.conf``. Эти значения были проверены ранее в разделе `RPC Access`_.

source: Use the values provided below for the ElectrumX network setting if configuring a Testnet server. If configuring a Mainnet server, use the alternate values shown in the comments.
fr: Utilisez les valeurs fournies ci-dessous pour les réglages réseau ElectrumX si vous configurez un serveur sur réseau de test. Si vous configurez un serveur sur réseau principal, utilisez les valeurs alternatives affichées dans les commentaires.
it: Utilizzare i valori forniti di seguito per l'impostazione di rete ElectrumX se si configura un server Testnet. Se si configura un server Mainnet, utilizzare i valori alternativi mostrati nei commenti.
ru: При конфигурировании сервера тестовой сети используйте приведенные ниже значения сетевых настроек ElectrumX. При настройке сервера для основной сети используйте альтернативные значения, указанные в комментариях.

source: Set the SSL values:
fr: Définissez les valeurs SSL :
it: Imposta i valori SSL:
ru: Установите значения SSL:

source: Set the ElectrumX username to match our current user:
fr: Définissez le nom d'utilisateur ElectrumX pour le faire coïncider avec l'utilisateur actuel :
it: Imposta il nome utente ElectrumX in modo che corrisponda al nostro utente corrente:
ru: Установите имя пользователя ElectrumX, соответствующее нашему текущему пользователю:

source: Set the ElectrumX log directory:
fr: Définissez le répertoire de journaux ElectrumX :
it: Imposta la directory del registro ElectrumX:
ru: Задайте директорию логов ElectrumX:

source: The log directory path is set in the ``scripts/electrumx/log/run`` file. Replace the ``/path/to/log/`` line in that file with ``/home/electrumx/var/log/electrumx``:
fr: Le chemin du répertoire de journaux est défini dans le fichier ``scripts/electrumx/log/run``. Remplacez la ligne ``/path/to/log/`` dans ce fichier avec ``/home/electrumx/var/log/electrumx`` :
it: Il percorso della directory di registro è impostato nel file "scripts/electrumx/log/run". Sostituisci la riga ``/path/to/log/`` in quel file con ``/home/electrumx/var/log/electrumx``:
ru: Путь к директории журнала задается в файле ``scripts/electrumx/log/run``. Замените строку ``/path/to/log/`` в этом файле на ``/home/electrumx/var/log/electrumx``:

source: Manage ElectrumX as a service
fr: Gestion d'ElectrumX en tant que service
it: Gestisci ElectrumX come servizio
ru: Управление ElectrumX как сервисом

source: Add the service
fr: Ajouter le service
it: Aggiungi il servizio
ru: Добавить сервис

source: Start the service
fr: Démarrer le service
it: Avvia il servizio
ru: Запустить сервис

source: Stop the service
fr: Arrêter le service
it: Interrompi il servizio
ru: Остановить сервис

source: View Logs
fr: Voir les journaux
it: Visualizza registri
ru: Посмотреть логи
