Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/advanced.po
Languages: fr, zh_cn

source: Coin control, HD wallets, multisig, KeePass and multiple wallet files using the Dash Core wallet
fr: Contrôle des pièces, portefeuilles HD, multi-signature, KeePass et fichiers de portefeuille multiples avec le portefeuille logiciel Dash Core
zh_cn: 货币控制、HD 钱包、多重签名、KeePass和使用Dash Core钱包的各个钱包文件。

source: dash, core, wallet, backup, restore, wallet.dat, multisig, KeePass, hd, seed, passphrase, mnemonic, coin control, hierarchical deterministic
fr: dash, core, portefeuille logiciel, sauvegarde, restauration, wallet.dat, multi-signature, KeePass, HD, graine, phrase de passe, mnémonique, contrôle des pièces, déterministe hiérarchique
zh_cn: dash，core，钱包，备份，恢复，wallet.dat，多重签名，KeePass，hd，种子，密码，助记符，货币控制，分层确定性

source: Advanced topics
fr: Fonctions avancées
zh_cn: 高级主题

source: Coin Control
fr: Contrôle des pièces
zh_cn: 货币控制

source: Coin Control allows users of the Dash Core Wallet to specify which addresses and Unspent Transaction Outputs (UTXOs) should be used as inputs in transactions. This allows you to keep a specific balance on certain addresses in your wallet, while spending others freely. In Dash Core Wallet, click **Settings > Options > Wallet > Enable coin control features**. Now, when you go to the Send tab in your wallet, a new button labelled **Inputs…** will appear. Click this button to select which UTXOs can be used as input for any transactions you create. The following window appears:
fr: Le Contrôle des pièces permet aux utilisateurs du portefeuille logiciel Dash Core de choisir quelles adresses et quelles sorties de transaction non dépensées (UTXO) doivent être utilisées comme entrées de transaction. Cela vous permet de conserver un solde donné sur certaines adresses de votre portefeuille, tout en dépensant les autres librement. Dans le portefeuille logiciel Dash Core, cliquez sur **Réglages > Options > Portefeuille > Activer les fonctionnalités de contrôle des pièces**. Désormais, quand vous allez dans l'onglet Envoyer de votre portefeuille, un nouveau bouton nommé **Entrées…** est affiché. Cliquez sur ce bouton pour choisir les UTXO pouvant servir d'entrées pour les transactions que vous créez. La fenêtre suivante s'affiche :
zh_cn: 货币控制选项帮助Dash Core钱包的用户指定地址，此时，未经支付（UTXOs）的输出应当用作交易输入。这项功能不仅帮助用户在指定的钱包地址上留存指定余额，同时还能让他们自由支配其余资金。以Dash Core钱包为例，用户需要点击 **设置 > 选项 > 钱包 > 启用货币控制功能** 。现在用户只要访问钱包的发送选项卡，就会看到一个新的 **输入** 按键。只要点击这个按键，用户就能选定交易所使用的未经支付的输出了。操作页面如下所示：

source: Coin Selection window in Dash Core wallet, showing two masternodes (testnet)
fr: Fenêtre de Contrôle des pièces dans le portefeuille logiciel Dash Core, affichant deux masternodes (du réseau de test)
zh_cn: Dash Core钱包中的货币选择界面，显示两个主节点（测试网）

source: Right click on the transaction(s) you do not want to spend, then select **Lock unspent**. A small lock will appear next to the transaction. You can click the **Toggle lock state** button to invert the locked/unlocked state of all UTXOs. When you are ready to continue, click **OK**. You can now safely create transactions with your remaining funds without affecting the locked UTXOs.
fr: Faites un clic-droit sur la ou les transaction(s) que vous ne souhaitez pas dépenser, puis choisissez **Verrouiller les transactions non dépensées**. Une petite icône en forme de cadenas sera affichée à côté de la transaction. Vous pouvez cliquer sur **Inverser le verrouillage** pour inverser l'état verrouillé/déverrouillé de toutes les UTXO. Quand vous êtes prêt à continuer, cliquez sur **OK**. Vous pouvez désormais créer des transactions en toute sécurité avec les fonds restants, sans que cela n'affecte les UTXO verrouillées.
zh_cn: 单击鼠标右键选择不想支出的（多个）交易项，然后选择 **锁定未支付**。此时，交易的旁边将会出现一把小锁的标志。用户可以点击 **切换锁定状态** 按键来切换未经支付的输出的状态，即锁定或解锁状态。完成操作后，用户应点击 **OK** 按键。以不影响已锁定的未经支付的输出为前提，用户就可以安全地创建交易了。

source: Locking UTXOs in Dash Core wallet
fr: Verrouillage de transactions de sortie (UTXO) dans le portefeuille logiciel Dash Core
zh_cn: 在Dash Core钱包当中锁定未经支付的输出

source: HD Wallets
fr: Portefeuilles HD
zh_cn: HD 钱包

source: Since version 0.12.2.0, Dash Core has included an implementation of BIP39/BIP44 compatible hierarchical deterministic (HD) key generation. This functionality is only available from the command line by specifying the ``usehd`` option when starting Dash Core for the first time. Use this function with care, since the mnemonic seed and keys will be stored in plain text until you specify a wallet passphrase. Note that the wallet passphrase is different to the mnemonic passphrase, which is often also referred to as the "25th word" or "extension word". The wallet passphrase encrypts the wallet file itself, while the mnemonic passphrase is used to specify different derivation branches from the same mnemonic seed.
fr: Depuis sa version 0.12.2.0, le portefeuille logiciel Dash Core comporte une implémentation compatible BIP39/BIP44 de la génération hiérarchique déterministe (HD) de clés. Cette fonctionnalité n'est disponible qu'en ligne de commande, en indiquant l'option ``usehd`` au premier démarrage de Dash Core. Veuillez utiliser cette fonction avec prudence, car la graine mnémonique et les clés seront stockées en clair si vous ne définissez pas de phrase de passe pour votre portefeuille. Veuillez noter que la phrase de passe du portefeuille est différente de la phrase de passe mnémonique, laquelle est souvent appelée "25e mot" ou "mot d'extension". La phrase de passe du portefeuille chiffre le fichier portefeuille lui-même, tandis que la phrase de passe mnémonique est utilisée pour indiquer des branches de dérivation différentes depuis la même graine mnémonique.
zh_cn: 从 0.12.2.0 版本开始，Dash Core钱包就具备了兼容 BIP39/BIP44 的分层确定性（HD）密码生成功能。只有在初次启动Dash Core钱包时指定 ``usehd`` 选项的用户才能通过命令行使用这一功能。用户应当慎用这一功能，因为助记符种子和密码需要以纯文本格式存储，直到用户为钱包指定密码短语。值得注意的是，钱包密码与助记符密码不同，后者通常也被称作 "第25个字符" 或 "扩展字符"。此外，钱包密码用于加密钱包文件本身，而助记符密码则用于指定来自同一助记符种子的不同派生分支。

source: We will use the Windows GUI wallet in this example, but the commands are similar if using ``dash-qt`` or ``dashd`` on other operating systems. Enter the following command to get started with a randomly generated HD wallet seed and no mnemonic passphrase::
fr: Nous nous servirons du portefeuille à interface graphique pour Windows dans cet exemple, mais les commandes sont similaires si vous utilisez ``dash-qt`` ou ``dashd`` sur d'autres systèmes d'exploitation. Commencez par taper la commande suivante pour générer une graine HD de portefeuille aléatoire, sans phrase de passe mnémonique ::
zh_cn: 在下文中，我们将以Windows GUI钱包为例，但如果用户在其他操作系统上使用 ``dash-qt`` 或 ``dashd``，那么要用到的命令行就是一样的。用户可以输入以下命令，以便启用随机生成的分层确定性钱包种子，此时，钱包并不具备助记符密码::

source: A new HD wallet will be generated and Dash Core will display a warning informing you that you must encrypt your wallet after verifying it works correctly. Open the console from **Tools -> Debug console** or issue the following RPC command from ``dash-cli`` to view the mnemonic seed::
fr: Un nouveau portefeuille HD sera généré et Dash Core affichera un avertissement pour vous dire de chiffrer votre portefeuille une fois que vous aurez vérifié son bon fonctionnement. Ouvrez la console en allant dans le menu **Outil > Console de débogage** ou envoyez la commande RPC suivante dans ``dash-cli`` pour afficher la graine mnémonique ::
zh_cn: 新的HD钱包已经生成，Dash Core钱包将显示一则通知，告知用户必须在验证程序可正确运行后对钱包进行加密。用户可以通过 **工具 -> 调试控制台** 或在 ``dash-cli`` 上执行远程过程调用命令，以便浏览助记符种子::

source: Dash Core will display the HD seed in both hexadecimal and as a BIP39 mnemonic. To restore an existing HD wallet, or define your own separately generated mnemonic and/or passphrase, ensure no ``wallet.dat`` file exists in the ``datadir`` and enter the following command::
fr: Dash Core affichera la graine HD au format hexadécimal et en tant que mnémonique BIP39. Pour restaurer un portefeuille HD existant, ou définir vos propres mnémonique et/ou phrase de passe générés séparément, veuillez vous assurer qu'aucun fichier ``wallet.dat`` n'existe dans le répertoire ``datadir`` et saisissez la commande suivante ::
zh_cn: Dash Core钱包将以十六进制和 BIP39 助记符显示HD钱包的种子。如需恢复已有的HD钱包或者定义单独生成的助记符和密码，用户需要确保 ``datadir`` 中不存在 ``wallet.dat`` 文件，然后再输入以下命令::

source: The HD wallet will be restored and your balance will appear once sync is complete.
fr: Le portefeuille HD sera restauré et votre solde apparaîtra une fois que la synchronisation sera achevée.
zh_cn: HD钱包可以恢复，并且用户的余额将在完成同步后予以显示。

source: This section presents a worked example to demonstrate multisig functionality in Dash Core. While the transactions are no longer visible on the current testnet blockchain and some address formats or RPC responses may differ slightly from the version shown here, the principle and commands are the same. The example demonstrates how to set up a 2-of-3 multisig address and create a transaction. The example parties involved are a buyer, a seller and an arbiter. This example is based on:
fr: Cette section présente un exemple fonctionnel de multi-signature dans le portefeuille logiciel Dash Core. Les transactions ne sont plus visibles sur la blockchain de test actuelle, et quelques formats d'adresse ou réponses RPC peuvent différer légèrement de l'exemple ci-dessous, mais le principe et les commandes restent les mêmes. Cet exemple montre comment configurer une adresse multi-signature "2 sur 3" et créer une transaction. Les parties impliquées dans cet exemple sont un acheteur, un vendeur et un arbitre. Cet exemple se base sur :
zh_cn: 本章节介绍了Dash Core钱包中的多重签名功能。尽管交易在当前的测试网区块链上是不可见的，并且地址格式或远程过程调用与本文显示的稍有不同，但原则和命令是相同的。本章节提供了创建2 -3多重签名地址及交易的例子，其中涉及三方，即买卖双方和仲裁者。实例如下列网站所示：

source: Step 1: Create three addresses
fr: Étape 1 : Création de trois adresses
zh_cn: 步骤 1：创建三个地址

source: Seller::
fr: Vendeur ::
zh_cn: 卖方::

source: Buyer::
fr: Acheteur ::
zh_cn: 买方::

source: Arbiter::
fr: Arbitre ::
zh_cn: 仲裁者::

source: This results in three keypairs (public/private)::
fr: Cela donne trois couples de clés (publique et privée) ::
zh_cn: 结果会产生三对密钥（公钥/私钥）::

source: Step 2: Create multisig address
fr: Étape 2 : Création d'une adresse multi-signature
zh_cn: 步骤 2：创建多重签名地址

source: The ``createmultisig`` command takes as variables the number n signatures of m keys (supplied as json array) required. In this example, 2 of 3 keys are required to sign the transaction.
fr: La commande ``createmultisig`` accepte comme variables le nombre n de signature sur m clés requises (fournies comme tableau JSON). Dans cet exemple, 2 clés sur 3 sont requises pour signer la transaction.
zh_cn: ``createmultisig`` 命令可以创建n/m的多重签名变量（json数据提供）。本文示例创建的是2/3多重签名。

source: Note: The address can be created by anyone, as long as the public keys and their sequence are known (resulting address and redeemScript are identical, see below).
fr: À noter : l'adresse peut être créée par n'importe qui, du moment que les clés publiques et leur séquence sont connues (l'adresse résultante et redeemScript sont identiques, voir ci-dessous).
zh_cn: 值得注意的是：只要公钥和序列已知（则地址和redeemScript都是一样的），那么任何人都可以创建地址。

source: Step 3: Buyer funds the multisig address
fr: Étape 3 : L'acheteur alimente l'adresse multi-signature
zh_cn: 步骤 3：买方为多重签名地址提供资金

source: This works the same as a usual transaction.
fr: Cela se passe de la même façon que dans une transaction habituelle.
zh_cn: 买方为多重签名地址提供资金的流程与寻常交易相同。

source: The seller/arbiter can trace the transaction by its txid in the block explorer. Or from the console as follows.
fr: Le vendeur ou l'arbitre peuvent suivre la transaction par son identifiant dans l'explorateur de blocs, ou bien depuis la console comme suit.
zh_cn: 卖方/仲裁者可以通过区块浏览器中的交易ID跟进交易情况或通过控制台来完成操作。

source: Step 4: Spending the multisig
fr: Étape 4 : Dépense de l'adresse multi-signature
zh_cn: 步骤 4：通过多重签名功能完成支付

source: Now we assume the deal is complete, the buyer got the goods and everyone is happy. Now the seller wants to get his Dash. As a 2-of-3 multisig was used, the transaction must be signed by 2 parties (seller + buyer or arbiter). The seller creates a transaction (we will reuse his public address from above).
fr: Nous supposons que l'affaire s'est conclue, l'acheteur a reçu ses biens et tout le monde est content. À présent, le vendeur veut obtenir ses dashs. Comme une multi-signature "2 sur 3" a été utilisée, la transaction doit être signée par 2 parties (vendeur + acheteur ou arbitre). Le vendeur crée une transaction (nous réutiliserons son adresse publique déjà vue ci-dessus).
zh_cn: 现在我们假定交易已完成，那么买卖双方都会得到满意的结果。如果卖方希望领取个人的达世币，那么在2 -3多重签名的情况下，交易需要取得三方中的两方的签名许可（即卖方的签名加上买方或仲裁者的签名）。这时候，卖方就可以创建交易了（在这里，我们重复使用了上述的公共地址）。

source: And partially signs it, using the redeemScript, scriptPubKey and his private key
fr: Puis le vendeur la signe partiellement, en utilisant le redeemScript, la scriptPubKey et sa clé privée.
zh_cn: 使用redeemScript、scriptPubKey和个人私钥对多重签名交易进行部分签名

source: Note that the output hex is getting longer, but complete flag is "false" as the transaction needs another signature. So now either the buyer or the arbiter can complete the signature of the transaction, using the output from above and their private key. Let's assume the buyer is completing the signature.
fr: Veuillez noter que la sortie hexadécimale augmente en taille, mais que le signal complet reste sur "faux" tant que la transaction est en attente d'une autre signature. Donc, à présent, soit l'acheteur soit l'arbitre peut achever la signature de la transaction, en utilisant la sortie ci-dessus et sa clé privée. Supposons que ce soit l'acheteur qui achève la signature.
zh_cn: 值得注意的是，十六进制的输出变得越来越长，但由于交易还需要另一个签名，因此输出的完成情况备注为 "false" 。这时，买方或仲裁者就可以使用上述输出和私钥来完成交易签名了。我们假设买方正在完成签名。

source: The signature is complete now, and either of the parties can transmit the transaction to the network.
fr: La signature est désormais terminée, et l'une ou l'autre des parties peut transmettre la transaction au réseau.
zh_cn: 现在交易签名已经完成了，任何一方都可以将交易传输到达世币网络上了。

source: Again, this transaction can be traced in a block explorer. And the seller is happy to receive his coins at his public address as follows.
fr: Une fois de plus, cette transaction peut être suivie sur un explorateur de blocs. Quant au vendeur, il est content de recevoir ses fonds à son adresse publique, comme suit.
zh_cn: 同样，用户也可以在区块浏览器中跟进交易。卖方也很乐意在如下所示的个人公共地址上接收达世币。

source: Dash can be run as a background process (or daemon) on Linux systems. This is particularly useful if you are running Dash as a server instead of as a GUI node. This guide assumes you have installed Dash Core for Linux as described in the :ref:`dashcore-installation-linux`.
fr: Dash peut tourner en tant que processus d'arrière-plan (daemon) sur les systèmes Linux. C'est particulièrement utile si vous faites tourner Dash en tant que serveur, plutôt qu'en tant que nœud avec interface utilisateur. Ce guide présuppose que vous avez installé Dash Core pour Linux tel que décrit par :ref:`dashcore-installation-linux`.

source: Create a user and group to run the daemon::
fr: Créez un utilisateur et un groupe pour faire tourner le daemon ::

source: Create a data directory for Dash in the new user's home directory::
fr: Créez un répertoire de données pour Dash dans le répertoire personnel du nouvel utilisateur ::

source: Create a configuration file in the new Dash data directory::
fr: Créez un fichier de configuration dans le nouveau répertoire de données Dash ::

source: Paste the following basic configuration to your ``dash.conf`` file, replacing the password with a long and random password::
fr: Copiez-collez cette configuration basique dans votre fichier ``dash.conf``, en remplaçant le mot de passe par un mot de passe long et aléatoire ::

source: Register the ``dashd`` daemon as a system service by creating the following file::
fr: Enregistrez le daemon ``dashd`` en tant que service système, en créant le fichier suivant ::

source: Paste the following daemon configuration into the file::
fr: Collez la configuration du daemon suivante dans le fichier ::

source: Register and start the daemon with systemd::
fr: Enregistrez et démarrez le daemon avec systemd ::

source: Dash is now installed as a system daemon. View the status as follows::
fr: Dash est à présent installé en tant que daemon système. Vérifiez son état comme suit ::

source: View logs as follows::
fr: Vérifiez les journaux comme suit ::

source: `Tor <https://www.torproject.org/>`__ is free and open-source software for enabling anonymous communication. The name derived from the acronym for the original software project name "The Onion Router". Tor directs Internet traffic through a free, worldwide, volunteer overlay network consisting of more than seven thousand relays to conceal a user's location and usage from anyone conducting network surveillance or traffic analysis.
fr: `Tor <https://www.torproject.org/>`__ est un logiciel libre et open-source permettant des communications anonymes. Son nom est l'acronyme du projet logiciel originel, "The Onion Router". Tor redirige le trafic Internet à travers un réseau de second niveau, libre et mondial, constitué de plus de sept mille relais permettant de masquer, à tous ceux qui surveillent les réseaux ou font de l'analyse de trafic, la localisation d'un utilisateur et les données transmises.

source: Dash Core GUI
fr: Interface graphique Dash Core

source: Dash Core traffic can be directed to pass through Tor by specifying a running Tor service as a proxy. First install Tor by visiting https://www.torproject.org/download/ and downloading the appropriate Tor Browser bundle for your system. Set up the Tor browser by following the documentation on `Installation <https://tb-manual.torproject.org/installation/>`__ and `Running Tor Browser for the First Time <https://tb-manual.torproject.org/running-tor-browser/>`__.
fr: Le trafic de Dash Core peut être redirigé à travers Tor en indiquant un service Tor fonctionnel à utiliser comme serveur mandataire (proxy). Installez d'abord Tor en allant à l'adresse https://www.torproject.org/download/ et en y téléchargeant le paquet Tor Browser approprié à votre système. Configurez le navigateur Tor en suivant la documentation sur les pages `Installation <https://tb-manual.torproject.org/installation/>`__ et `Utiliser Tor Browser la première fois <https://tb-manual.torproject.org/running-tor-browser/>`__.

source: Once Tor Browser is running, you have two options to configure Dash Core to use Tor for network traffic.
fr: Une fois que Tor Browser tourne, vous avez deux façons de configurer Dash Core pour qu'il utilise Tor pour le trafic réseau.

source: **Using the GUI:** Start Dash Core and go to **Settings > Options > Network** and enable the **Connect through SOCKS5 proxy** setting. Specify ``127.0.0.1`` for the **Proxy IP** and ``9150`` for the **Port**. Click **OK** and restart Dash Core.
fr: **En utilisant l'interface graphique :** démarrez Dash Core, allez au menu **Réglages > Options > Réseau** et activez le réglage **Se connecter à travers un proxy SOCKS5**. Indiquez ``127.0.0.1`` comme **IP du proxy** et ``9150`` comme **port**. Cliquez sur **OK** et redémarrez Dash Core.

source: **Using dash.conf:** Ensure Dash Core is not running and edit your ``dash.conf`` settings file. Add the line ``proxy=127.0.0.1:9150``, save the file and start Dash Core.
fr: **En utilisant dash.conf :** assurez-vous que Dash Core ne tourne pas, puis modifiez le fichier de configuration ``dash.conf``. Ajoutez-y la ligne ``proxy=127.0.0.1:9150``, enregistrez le fichier puis redémarrez Dash Core.

source: You are now connected through the Tor network. You will need to remember to start the Tor Browser each time before you start Dash Core or you will not be able to sync.
fr: Vous êtes à présent connecté à travers le réseau Tor. Vous devrez vous souvenir de bien lancer le navigateur Tor chaque fois avant de lancer Dash Core, sinon la synchronisation ne sera pas possible.

source: Tor onion service
fr: Service onion Tor

source: Tor onion services allows other users to connect to your Dash node using an onion address, providing further anonymity by concealing your IP address. Follow these steps to set up an onion service under Ubuntu Linux:
fr: Les services onion Tor permettent aux autres utilisateurs de se connecter à votre nœud Dash en utilisant une adresse onion, ce qui améliore l'anonymat en masquant votre adresse IP. Veuillez suivre ces étapes pour installer un service onion sous Linux Ubuntu :

source: Install tor::
fr: Installez Tor ::

source: Add the following line to the ``torrc`` file::
fr: Ajoutez la ligne suivante au fichier ``torrc`` ::

source: Restart Tor::
fr: Redémarrez Tor ::

source: Determine the group Tor is running under (usually the last entry in your groups file)::
fr: Déterminez sous quel groupe fonctionne Tor (en général la dernière entrée de votre fichier de groupes) ::

source: The group is usually ``debian-tor`` under Debian-based Linux distributions.
fr: Le groupe est en général ``debian-tor`` pour les distributions Linux basées sur Debian.

source: Add the user running Dash to the Tor group::
fr: Ajoutez l'utilisateur faisant tourner Dash au groupe Tor ::

source: Add the following two lines to ``dash.conf``::
fr: Ajoutez les deux lignes suivantes au fichier ``dash.conf`` ::

source: Restart Dash and monitor ``debug.log`` for onion informatoin::
fr: Redémarrez Dash et surveillez le journal ``debug.log`` pour les infos Tor ::

source: You should see a line similar to the following::
fr: Vous devriez voir une ligne similaire à celle-ci ::

source: Your onion service is now available at the shown address.
fr: Votre service onion est désormais disponible à l'adresse affichée.

source: Multiple wallets
fr: Portefeuilles multiples
zh_cn: 多款钱包

source: It is possible to select between different Dash wallets when starting Dash Core by specifying the ``wallet`` argument, or even run multiple instances of Dash Core simultaneously by specifying separate data directories using the ``datadir`` argument.
fr: Il est possible de choisir entre différents portefeuilles Dash au démarrage du portefeuille logiciel Dash Core en indiquant l'argument "wallet", ou bien de lancer simultanément plusieurs instances du portefeuille logiciel Dash Core en indiquant des répertoires de données distincts au moyen de l'argument "datadir".
zh_cn: 用户可以通过 ``wallet`` 参数来启动Dash Core钱包，并在此时选用不同类型的钱包。此外，用户还可以通过 ``datadir`` 参数来指定不同的数据目录，从而同时运行Dash Core钱包的不同实例。

source: To begin, install the Dash Core wallet for your system according to the :ref:`installation instructions <dashcore-installation>`. When you get to the step **Running Dash Core for the first time**, you can decide whether you want to maintain separate ``wallet.dat`` files in the default location (simpler if you do not need to run the wallets simultaneously), or specify entirely separate data directories such as e.g. ``C:\Dash1`` (simpler if you do want to run the wallets simultaneously).
fr: Pour commencer, installez le portefeuille logiciel Dash Core pour votre ordinateur, en suivant les :ref:`instructions d'installation <dashcore-installation>`. Quand vous atteignez l'étape **Premier lancement du portefeuille logiciel Dash Core**, vous pouvez décider si vous voulez avoir des fichiers ``wallet.dat`` séparés dans l'emplacement par défaut (ce qui est plus simple si vous n'avez pas besoin de lancer simultanément les portefeuilles), ou si vous indiquez des répertoires de données entièrement différents, tels que ``C:\Dash1`` (ce qui est plus simple si vous souhaitez lancer simultanément plusieurs portefeuilles).
zh_cn: 首先，用户应根据\ :ref:`安装指南<dashcore-installation>`\ 的指示在个人的计算机系统上安装Dash Core钱包。在 **初次运行Dash Core钱包的时候** ，用户可以决定是否将独立的 ``wallet.dat`` 文件保存在默认地址上（如果用户不需要同时运行钱包，那就更简单了）。用户也可以指定完全独立的数据目录，例如 ``C:\Dash1`` （如果用户希望同时运行钱包，那么设置将相对更简单）。

source: Separate wallet.dat files
fr: Fichiers "wallet.dat" distincts
zh_cn: 独立的wallet.dat文件
