Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/advanced.po
Languages: fr, zh_cn

source: For this scenario, we will create two shortcuts on the desktop, each using a different wallet file. Navigate to the binary file used to start Dash Core (typically locatd at ``C:\Program Files\DashCore\dash-qt.exe`` or similar) and create two shortcuts on the desktop. Then open the **Properties** window for each of these shortcuts.
fr: Dans ce scénario, nous allons créer deux raccourcis sur le bureau, utilisant chacun un fichier de portefeuille différent. Allez jusqu'au fichier exécutable utilisé pour démarrer le portefeuille logiciel Dash Core (en général ``C:\Program Files\DashCore\dash-qt.exe`` ou similaire) puis créez deux raccourcis sur le bureau. Ensuite, ouvrez la fenêtre **Propriétés** pour chacun de ces raccourcis.
zh_cn: 在这种情况下，用户需要分别通过不同的钱包文件在桌面上创建两个快捷方式。具体来说，用户需要导航到用于启动Dash Core钱包的二进制文件（文件通常位于 ``C:\Program Files\DashCore\dash-qt.exe`` 或在类似文件中），然后在桌面上创建两个快捷方式。随后，达世币需要打开这些快捷方式的 **属性** 窗口。

source: Creating desktop shortcuts using Windows 10
fr: Création de raccourcis sur le bureau Windows 10
zh_cn: 使用Windows 10创建桌面快捷方式

source: Modify the **Target** property of each shortcut to point to a different wallet file by specifying the ``wallet`` argument when starting the wallet. If you do not specify a ``wallet`` argument, ``wallet.dat`` will be used by default. The specified wallet file will be created if it does not exist. The following example demonstrates two wallets named ``workwallet.dat`` and ``homewallet.dat``:
fr: Modifiez la propriété **Cible** de chaque raccourci pour le faire pointer vers un fichier de portefeuille différent, en indiquant l'argument ``wallet`` au démarrage du portefeuille. Si vous n'indiquez pas d'argument ``wallet``, le fichier ``wallet.dat`` sera utilisé par défaut. Le fichier de portefeuille indiqué sera créé s'il n'existe pas déjà. Les exemples suivants montrent deux portefeuilles nommés ``workwallet.dat`` et ``homewallet.dat`` :
zh_cn: 通过在启动钱包时指定 ``钱包`` 参数，用户可以修改各个快捷方式的 **目标** 属性，从而指向不同的钱包文件。如果用户没有指定 ``钱包`` 参数，那么钱包将默认使用 ``wallet.dat`` 。如果指定的钱包文件并不存在，那么文件将会自行创建。下文以 ``workwallet.dat`` 和 ``homewallet.dat`` 这两个文件为例：

source: Wallet Target 1: ``"C:\Program Files\DashCore\dash-qt.exe" -wallet=workwallet.dat``
fr: Portefeuille cible 1 : ``"C:\Program Files\DashCore\dash-qt.exe" -wallet=workwallet.dat``

source: Wallet Target 2: ``"C:\Program Files\DashCore\dash-qt.exe" -wallet=homewallet.dat``
fr: Portefeuille cible 2 : ``"C:\Program Files\DashCore\dash-qt.exe" -wallet=homewallet.dat``

source: Specifying separate wallet files
fr: Indication de fichiers portefeuille distincts
zh_cn: 指定独立的钱包文件

source: You can now use the two icons to quickly and easily open different wallets from your desktop. Note that you cannot open both wallets simultaneously. To do this, you will need two separate data directories, as described below.
fr: Vous pouvez à présent utiliser les deux icônes pour ouvrir facilement et rapidement différents portefeuilles depuis votre Bureau. À noter que vous ne pourrez pas ouvrir les deux portefeuilles simultanément. Pour faire cela, vous aurez besoin de deux répertoires de données distincts, comme décrit ci-dessous.
zh_cn: 现在，用户可以使用这两个快捷图标轻松迅速地从桌面打开不同的钱包了。请注意，用户无法同时打开两个钱包。如果用户需要两个独立的数据目录，操作步骤如下所述。

source: Separate data directories
fr: Répertoire de données distincts
zh_cn: 独立的数据目录

source: Start Dash Core and allow it to synchronize with the network, then close Dash Core again. You can now create two directories at e.g. ``C:\Dash1`` and ``C:\Dash2`` and copy the ``blocks`` and ``chainstate`` directories from the synchronized data directory into the new directories. Each of these will serve as a separate data directory, allowing you to run two instances of Dash Core simultaneously. Create two (or more) shortcuts on your desktop as described above, then specify arguments for ``datadir`` as shown below:
fr: Lancez le portefeuille logiciel Dash Core et laissez-le se synchroniser au réseau, puis quittez-le. Vous pouvez à présent créer deux répertoires, par exemple aux emplacements ``C:\Dash1`` et ``C:\Dash2``, puis copier les répertoires ``blocks`` and ``chainstate`` depuis le répertoire de données synchronisé vers les nouveaux répertoires. Chacun d'eux servira de répertoire de données distinct, vous permettant de lancer simultanément deux instances du portefeuille logiciel Dash Core. Créez deux raccourcis (ou plus) sur votre Bureau tel que décrit ci-dessus, puis indiquez des arguments pour "datadir" tel que ci-dessous :
zh_cn: 用户需启动Dash Core钱包，并等待钱包与网络同步，然后再关闭Dash Core钱包。此时，用户可以创建两个独立的数据目录，例如 ``C:\Dash1`` 和 ``C:\Dash2`` ，然后将同步数据目录下的 ``blocks`` 和 ``chainstate`` 复制到新的目录之下。它们将作为独立的数据目录，帮助Dash Core钱包同时运行不同的实例。用户可参照上述步骤创建两个（或更多的）快捷方式，并按以下方式为 ``datadir`` 指定参数。

source: Datadir Target 1: ``"C:\Program Files\DashCore\dash-qt.exe" -datadir=C:\Dash1 -listen=0``
fr: Répertoire de données cible 1 : ``"C:\Program Files\DashCore\dash-qt.exe" -datadir=C:\Dash1 -listen=0``

source: Datadir Target 2: ``"C:\Program Files\DashCore\dash-qt.exe" -datadir=C:\Dash2 -listen=0``
fr: Répertoire de données cible 2 : ``"C:\Program Files\DashCore\dash-qt.exe" -datadir=C:\Dash2 -listen=0``

source: Specifying separate datadirs
fr: Configuration de répertoire de données distincts
zh_cn: 指定独立的数据路径

source: You can now use the two icons to quickly and easily open different wallets simultaneously from your desktop. Both wallets maintain separate and full copies of the blockchain, which may use a lot of drive space. For more efficient use of drive space, consider using an SPV or "light" wallet such as :ref:`Dash Electrum <dash-electrum-wallet>` to maintain multiple separate wallets without keeping a full copy of the blockchain.
fr: Vous pouvez à présent utiliser les deux icônes pour ouvrir rapidement et facilement deux portefeuilles différents depuis votre Bureau. Chacun des deux portefeuilles a sa propre copie complète de la blockchain, ce qui peut utiliser beaucoup de votre espace disque. Pour mieux employer cet espace, vous pouvez envisager l'utilisation d'un portefeuille SPV ou "léger", tel que :ref:`Dash Electrum <dash-electrum-wallet>`, pour disposer de portefeuilles multiples sans devoir conserver une copie intégrale de la blockchain.
zh_cn: 现在，用户可以使用这两个快捷图标快速轻松地从桌面打开不同的钱包了。两个钱包都独立地保存着区块链的完整副本，这可能会占用较大的磁盘空间。为了更有效地使用磁盘空间，用户可以考虑使用SPV或 "轻"钱包。在这种情况下，用户可以参照\ :ref:`达世币轻钱包 <dash-electrum-wallet>`\ 的指示在无需保存区块链完整副本的前提下维护多个独立的钱包。

source: Two instances of Dash Core running simultaneously
fr: Deux instances du portefeuille logiciel Dash Core tournant simultanément
zh_cn: Dash Core钱包同时运行两个实例

source: Since version 0.11.0, Dash Core has supported integration with KeePass, the popular open source password manager. This guide describes how to configure the association between Dash Core and KeePass, and how to save a Dash Core wallet passphrase in KeePass using the integration. When this is done, KeePass can be used to unlock the wallet.
fr: Depuis sa version 0.11.0, le portefeuille logiciel Dash Core est compatible avec KeePass, le gestionnaire de mots de passe open source très répandu. Ce guide décrit comment mettre en place le lien entre Dash Core et KeePass, et comment enregistrer la phrase de passe du portefeuille logiciel Dash Core dans KeePass en utilisant son intégration. Une fois terminé, KeePass peut servir à déverrouiller le portefeuille logiciel.
zh_cn: 从0.11.0版本开始，Dash Core钱包支持与流行的开源密码管理器KeePass的集成。本指南介绍了Dash Core钱包与KeePass之间建立关联的步骤，并指导用户通过集成在KeePass上保存Dash Core钱包的密码。在用户完成上述操作后， 用户就可以通过KeePass来解锁钱包了。

source: You will need the following:
fr: Vous aurez besoin de ceci :
zh_cn: 用户可能需要参考以下网址上的信息：

source: KeePassHttp plugin: https://github.com/pfn/keepasshttp
fr: Plug-in KeePassHttp : https://github.com/pfn/keepasshttp

source: Dash Core: https://www.dash.org
fr: Portefeuille logiciel Dash Core : https://www.dash.org

source: If not already installed, install these packages according to the instructions linked below:
fr: S'ils ne sont pas déjà installés, veuillez installer ces paquets en suivant les instructions ci-dessous :
zh_cn: 如果未安装，则根据下方链接指南进行安装：

source: Dash Core: https://docs.dash.org/en/stable/wallets/dashcore/installation.html
fr: Portefeuille logiciel Dash Core : https://docs.dash.org/fr/stable/wallets/dashcore/installation.html

source: Commands
fr: Commandes
zh_cn: 命令

source: The following KeePass RPC commands are available in the Dash Core client console or server:
fr: Les commandes KeePass RPC suivantes sont disponibles dans la console du client Dash Core ou du serveur :
zh_cn: 用户可以在Dash Core钱包的客户端或服务器上使用以下的KeePass远程过程调用命令：

source: Generates a base64 encoded 256 bit AES key that can be used for communication with KeePassHttp. This is only necessary for manual configuration. Use init for automatic configuration.
fr: Génère une clé AES de 256 bits encodée base64, qui peut être utilisée pour communiquer avec KeePassHttp. Elle n'est nécessaire que pour une configuration manuelle. Utilisez init pour une configuration automatique.
zh_cn: 用户可生成base64编码的256位AES密钥，以便用于与KeePassHttp之间的通信。只有人工设置才需要用到这一命令，自动设置用到的则是init命令。

source: Sets up the association between Dash and KeePass by generating an AES key and sending an association message to KeePassHttp. This will trigger KeePass to ask for an ID for the association. Returns the association and the base64 encoded string for the AES key.
fr: Configure le lien entre Dash Core et KeePass en générant une clé AES et en envoyant un message d'association à KeePassHttp. Cela amènera KeePass à demander un identifiant pour l'association. Renvoie l'association et la chaîne encodée base64 pour la clé AES.
zh_cn: 用户可以通过生成AES密钥并向KeePassHttp发送关联消息来设置达世币和KeePass之间的关联。在此期间，KeePass将申请建立关联所需的ID。随后，达世币核心钱包将返回AES密钥的关联和Base64编码字符串。

source: Updates the passphrase in KeePassHttp to a new value. This should match the passphrase you intend to use for the wallet. Please note that the standard RPC commands walletpassphrasechange and the wallet encryption from the QT GUI already send the updates to KeePassHttp, so this is only necessary for manual manipulation of the password.
fr: Met à jour la phrase de passe dans KeePassHttp avec une nouvelle valeur. Elle doit correspondre à la phrase de passe que vous voulez utiliser pour le portefeuille logiciel. Veuillez noter que les commandes RPC standard walletpassphrasechange et le chiffrage de portefeuille depuis l'interface utilisateur Dash Core envoient déjà les mises à jour à KeePassHttp, donc ce n'est nécessaire que dans le cadre d'une manipulation manuelle du mot de passe.
zh_cn: 更新KeePassHttp中的密码，此密码应与用户想要用于钱包的密码相匹配。请注意，标准的远程过程调用命令walletpassphrasechange和来自QT GUI的钱包加密已经将更新发送到了KeePassHttp，因此只有人工设置才需要借助KeePassHttp的密码更新。

source: The following new arguments are available for dashd and dash-qt:
fr: Les nouveaux arguments suivants sont disponibles pour dashd et dash-qt :
zh_cn: 以下新参数可用于dashd和dash-qt：

source: Use KeePass 2 integration using KeePassHttp plugin (default: 0)
fr: Utilise l'intégration KeePass 2 avec le plug-in KeePassHttp (par défaut : 0)
zh_cn: 借助KeePassHttp插件来使用KeePass 2集成功能（默认值：0）

source: Connect to KeePassHttp on port <port> (default: 19455)
fr: Connexion à KeePassHttp par le port <port> (par défaut : 19455)
zh_cn: 通过端口<port>上连接到KeePassHttp（默认值：19455）

source: KeePassHttp key for AES encrypted communication with KeePass
fr: Clé KeePassHttp pour la communication chiffrée AES avec KeePass
zh_cn: 借助KeePassHttp密钥使用KeePass 加密通信功能

source: KeePassHttp id for the established association
fr: Identifiant KeePassHttp pour la connexion déjà établie
zh_cn: 已建立关联的KeePassHttp身份

source: Name to construct url for KeePass entry that stores the wallet passphrase
fr: Nom pour former l'URL pour l'entrée KeePass qui stocke la phrase de passe du portefeuille
zh_cn: 用于为KeePass条目构建网址的名称。该条目存储了钱包的密码

source: Multisignature
zh_cn: 多重签名

source: Installation
zh_cn: 安装
