Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/backup.po
Languages: ru

source: How to safely back up and restore the Dash Core wallet
ru: Как безопасно сделать резервную копию и восстановить кошелёк Dash Core

source: dash, core, wallet, backup, restore, wallet.dat
ru: dash, core, кошелёк, резервная копия, восстановление, wallet.dat

source: Wallet backup and restore
ru: Создание резервной копии кошелька и восстановление

source: Backup
ru: Резервная копия

source: This documentation describes how to safely back up your wallet file for safe storage in case your computer or laptop is damaged or lost. Dash Core stores all data necessary to control your Dash addresses in a single file called *wallet.dat*. This wallet is in the Berkeley DB format and stores the pairs of private/public cryptographic keys used to manage your balances on the Dash blockchain. Dash Core makes most of these operations transparent and even generates automatic backups of your wallet file in case it is corrupted, but the user is responsible for ensuring that these backups are stored in a safe place. **If you lose access to your wallet file, you will permanently lose access to your Dash.**
ru: В этой документации описывается процесс безопасного создания резервной копии вашего файла кошелька для безопасного хранения в случае утраты или повреждения компьютера или ноутбука. Dash Core сохраняет все данные, которые необходимы для контроля ваших Dash адресов в едином файле, который называется *wallet.dat*. Этот файл выполнен в формате Berkeley DB и хранит пары приватных/публичных криптографических ключей, которые используются для управления вашими балансами на блокчейне Dash. Dash Core делает большинство этих операций прозрачными и даже создаёт автоматические резервные копии вашего файла кошелька на случай, если он повредится, но только пользователь несёт ответственность за обеспечение хранения резервных копий в надёжном месте. **Если вы потеряете доступ к своему файлу кошелька, вы навсегда потеряете доступ к своим DASH.**

source: It is important to consider that if you have not encrypted your wallet using the **Settings > Encrypt Wallet** menu item, anyone with access to the backed up wallet.dat file will immediately have full access to your Dash. If you do choose to encrypt your wallet, do not store the password in the same place as the wallet.dat file, particularly if you are saving the backup to the cloud.
ru: Важно учитывать, что если вы не зашифровали свой кошелёк используя пункт меню **Настройки > Зашифровать кошелёк**, любой, кто получит доступ к резервной копии вашего файла wallet.dat, тут же получит полный доступ к вашим DASH. Если вы решили зашифровать свой кошелек, не храните пароль в том же месте, где находится файл wallet.dat, особенно если вы сохраняете резервную копию в облаке.

source: Backup from Dash Core
ru: Создание резервной копии с помощью кошелька Dash Core

source: Firstly, never copy your wallet.dat file while Dash Core is open. Always use the **File > Backup Wallet** menu if the wallet is open. When you select this menu item, a dialog box will appear to specify where the file should be saved. Enter a name for the file, select a location and click **Save**. The example below shows saving the file to a USB stick. Keep this file in a physically separate location to your computer.
ru: Первое, о чём стоит сказать, никогда не копируйте ваш файл wallet.dat во то время, когда открыт Dash Core. Если кошелёк открыт, всегда используйте для резервного копирования меню **Файл > Сделать резервную копию кошелька**. После выбора этого пункта меню, появится диалоговое окно с вопросом определить место для сохранения файла. Введите имя для файла, выберите расположение и кликните **Сохранить**. В приведённом ниже примере показано сохранение файла на USB-накопитель. Храните этот файл в физически отдельном от вашего компьютера месте.

source: Backing up the Dash Core wallet from the File menu
ru: Создание резервной копии кошелька Dash Core с помощью меню Файл.

source: Backup by copying wallet.dat
ru: Создание резервной копии с помощью копирования файла wallet.dat

source: **If Dash Core is not running**, you can also backup your wallet by simply copying the *wallet.dat* file to another location. This file is located in the *DashCore* data folder. You were given the option to specify the location of this folder during installation, but by default the folder is in the following locations on different operating systems:
ru: **Если Dash Core не запущен**, вы также можете сделать резервную копию вашего кошелька простым копированием файла *wallet.dat* в другое место. Этот файл расположен в папке с данными *DashCore*. Вам предоставлялась возможность указать расположение этой папки во время установки, но по умолчанию папка находится по следующему расположению для разных операционных систем:

source: You can access this folder directly by **Windows Key + R** and typing ``%APPDATA%\DashCore``
ru: Вы можете напрямую получить доступ к этой папке, нажав **Windows Key + R** и набрав ``%APPDATA%\DashCore``

source: You can access this folder directly by typing ``cd ~/.dashcore`` at the terminal or ``~/.dashcore`` in the path bar using the **Go > Enter Location...** menu item in Files
ru: Вы можете напрямую получить доступ к этой папке, набрав в терминале ``cd ~/.dashcore`` или ``~/.dashcore`` в адресной строке, используя пункты **Go > Enter Location...** в меню Files

source: You can access this folder by typing ``cd ~/Library/Application Support/DashCore`` at the terminal or ``~/Library/Application Support/DashCore`` in dialog at the **Go > Go To Folder** menu item in Finder
ru: Вы можете получить доступ к этой папке набрав в терминале ``cd ~/Library/Application Support/DashCore`` или ``~/Library/Application Support/DashCore`` в диалоговом окне из пункта **Go > Go To Folder** в меню Finder

source: Ensure Dash Core is not running, then simply copy the *wallet.dat* file from this folder to another folder in the normal way for your operating system. The example below shows copying the file to a USB stick using simple drag and drop while holding down **Ctrl** on a Windows system. On most operating systems, you can also right click on the file and select **Copy**, then select **Paste** in the target folder. Keep this file in a physically separate location to your computer. Be careful to copy (not move) the file!
ru: Убедитесь, что Dash Core не запущен и просто скопируйте файл *wallet.dat* из этой папки в другую обычным, предусмотренным вашей операционной системой, способом. В примере ниже показано копирование файла на USB-накопитель с использованием простого метода "drag and drop" с удержанием клавиши **Ctrl** на ОС Windows. На большинстве операционных систем вы также можете кликнуть правой кнопкой мыши на файле и выбрать **Копировать**, затем выбрать **Вставить** в паке назначения. Храните этот файл в физически отдельном от вашего компьютера месте. Будьте внимательны, чтобы скопировать файл (а не переместить его)!

source: Backing up wallet.dat by copying to another folder
ru: Создание резервной копии файла wallet.dat копированием его в другую папку

source: Automatic backups
ru: Автоматическое резервное копирование

source: Every time you open Dash Core, it will automatically create a backup copy of *wallet.dat* in the *dashcore/backups* folder. Up to 10 backups can be kept here by default, and the oldest backup will be deleted as each additional new backup is created. You can modify the number of backups kept here using the ``-createwalletbackups=n`` parameter at the command line or in *dash.conf*. Setting this value to 0 completely disables backups.
ru: Каждый раз открывая Dash Core, он будет автоматически создавать резервную копию файла *wallet.dat* в папке *dashcore/backups*. По умолчанию здесь может храниться до 10 резервных копий, и самая старая резервная копия будет удаляться при создании каждой новой дополнительной резервной копии. Вы можете изменить количество сохранённых здесь резервных копий, используя параметр ``-createwalletbackups=n`` в командной строке или в файле *dash.conf*. Установка этого значения в 0 полностью отключает резервное копирование.

source: You can view the automatic backups folder by browsing to *DashCore* folder at the location specified above for *wallet.dat* and opening the backups folder, or by selecting **Tools > Show Automatic Backups** from the menu in Dash Core. Since these files are not active when Dash Core is running, you can safely copy them at any time. They are also a handy backup if the original files in the DashCore folder become corrupted due to improper shutdown of the Dash Core app.
ru: Вы можете посмотреть папку с автоматическими резервными копиями, перейдя в папку *DashCore*, расположение которой для файла *wallet.dat* указано выше и открыв папку резервных копий, или выбрав из меню Dash Core **Инструменты > Показать автоматические резервные копии**. Поскольку эти файлы не активны во время работы Dash Core, вы можете безопасно копировать их в любое время. Они также являются удобной резервной копией, если исходные файлы в папке DashCore повреждены из-за неправильного завершения работы приложения Dash Core.

source: Restore
ru: Восстановление

source: To restore a backup, install Dash Core on the target system (or stop it, if already installed) and rename the existing *wallet.dat* file in the *DashCore* folder.
ru: Чтобы восстановить резервную копию, установите Dash Core в целевой системе (или остановите его, если он уже установлен) и переименуйте существующий файл *wallet.dat* в папке *DashCore*.

source: Renaming the old wallet.dat file to wallet.old in the DashCore folder
ru: Переименование старого файла wallet.dat в файл wallet.old в папке DashCore

source: Then copy the backup wallet file to the *DashCore* folder and ensure it is named *wallet.dat*. Now, when you start Dash Core again, it will load the new wallet. Do not replace *wallet.dat* while Dash Core is running, since this will result in data corruption!
ru: Затем скопируйте файл резервного кошелька в папку *DashCore* и убедитесь, что он называется *wallet.dat*. Теперь, когда вы снова запустите Dash Core, он загрузит новый кошелёк. Не заменяйте *wallet.dat* во время работы Dash Core, так как это приведет к повреждению данных!

source: Copying the backup file into the DashCore folder and renaming it to wallet.dat
ru: Копирование резервной копии файла в папку DashCore и переименование его на wallet.dat

source: Backup storage considerations
ru: Соображения относительно хранения резервной копии

source: Any backup depends to some extent on the existence of software capable of reading the data at some future point in time. As such, it is good practice to store a copy of the software used to create the backup together with the backup file itself. In this case, this would be a copy of the version of Dash Core you used to create the backup.
ru: Любое резервное копирование зависит в некоторой степени от наличия программного обеспечения, способного считывать данные в определённый момент времени. Поэтому, рекомендуется хранить копию программного обеспечения, используемого для создания резервной копии, вместе с самим файлом резервной копии. В этом случае это будет копия версии Dash Core, которую вы использовали для создания резервной копии.

source: The *wallet.dat* file itself should be encrypted using a password set from the **Settings > Encrypt Wallet** menu item. However, this only prevents someone with access to the file from creating transactions, not from opening the file. You could additionally store the file in another encrypted container, such as a USB stick using `BitLocker <https://docs.microsoft.com/en-us/windows/security/information-protection/bitlocker/bitlocker-to-go-faq>`_ in Windows, `LUKS <https://help.ubuntu.com/community/EncryptedFilesystemsOnRemovableStorage>`_ in Linux or `FileVault <https://support.apple.com/en-us/HT204837>`_ on macOS. It is also possible to create `disk images <https://support.apple.com/guide/disk-utility/create-a-disk-image-dskutl11888/mac>`_ or `zip files <https://www.howtogeek.com/203590/how-to-create-secure-encrypted-zip-or-7z-archives-on-any-operating-system/>`_ with password encryption - the choice is yours. For further reading on encrypted containers, see `here <https://theintercept.com/2015/04/27/encrypting-laptop-like-mean/>`_.
ru: Сам файл *wallet.dat* должен быть зашифрован заданием пароля с помощью пункта меню **Настройки > Зашифровать кошелёк**. Однако это препятствует только тому, чтобы кто-то с доступом к файлу создавал транзакции, а не открывал файл. Вы можете дополнительно сохранить файл в другом зашифрованном контейнере, таком как USB-накопитель, используя `BitLocker <https://docs.microsoft.com/en-us/windows/security/information-protection/bitlocker/bitlocker-to-go-faq>`_ в Windows, `LUKS <https://help.ubuntu.com/community/EncryptedFilesystemsOnRemovableStorage>`_ в Linux или `FileVault <https://support.apple.com/en-us/HT204837>`_ на macOS. Также возможно создание `образов диска <https://support.apple.com/guide/disk-utility/create-a-disk-image-dskutl11888/mac>`_ или `zip-файлов <https://www.howtogeek.com/203590/how-to-create-secure-encrypted-zip-or-7z-archives-on-any-operating-system/>`_ с шифрованием паролем - выбор за вами. Для получения более подбробной информации о зашифрованных контейнерах, перейдите `сюда <https://theintercept.com/2015/04/27/encrypting-laptop-like-mean/>`_.

source: Where you store this file is then up to you. It could be in your home, in a safe deposit box at a bank, a waterproof or fireproof container, or on cloud storage such as Google Drive, Dropbox or iCloud. Consider where you will store any passwords needed to restore access to the wallet (in your head, on paper, in a password manager, etc.) and who may need access to the password in the future.
ru: Где вы будете храните этот файл, зависит только от вас. Вы можете хранить его у себя дома, в сейфе в банке, в водонепроницаемом или огнеупорном контейнере или облачном хранилище, таком как Google Drive, Dropbox или iCloud. Подумайте, где вы будете хранить любые пароли, необходимые для восстановления доступа к кошельку (в своей голове, на бумаге, в менеджере паролей и т. д.), а также о том, кому может понадобиться доступ к паролю в будущем.

source: Finally it is important to understand that *wallet.dat* itself is a relatively dangerous way to store large amounts of funds - it is simply a database file storing private keys. While the convenience of storing a wallet file directly is fine for smaller holdings, it is more secure to to store large amounts of Dash on a single predefined address in a way that you are guaranteed access through any software supporting the protocol, rather than a specific implementation of that protocol. If you are interested in this, read more about paper wallets, where the private key can be printed directly or also encrypted using BIP38 for safe storage.
ru: Наконец, важно понимать, что *wallet.dat* сам по себе является относительно опасным способом хранения больших сумм денег - это просто файл базы данных, хранящий закрытые ключи. Хотя такой удобный способ хранения файла кошелька подходит для непосредственного хранения небольших средств, большие объёмы DASH более безопасно хранить на одном заранее заданном адресе таким образом, чтобы вам был гарантирован доступ к нему с помощью любого программного обеспечения, поддерживающего протокол, а не через специальную реализацию этого протокола. Если вы заинтересованы в этом, почитайте больше о бумажных кошельках, где закрытый ключ может быть распечатан напрямую, а также зашифрован с использованием алгоритма BIP38 для безопасного хранения.

source: Verifying backups
ru: Верификация резервных копий

source: There is no fixed procedure to verify your backup, but you should test restoring it at least once to make sure it works. If you have a simple copy of the file, try to restore it to your current *DashCore* folder and start Dash Core to make sure it opens without any errors. If you decided to store the file in an encrypted zip file, make sure you can unzip it and that it opens correctly in Dash Core. In short, make sure that you (or the person you are trusting to eventually go through this process for you) can actually reverse your backup process to get access to your Dash, instead of relying on the fact that this process should theoretically be reversible.
ru: Не существует фиксированной процедуры для проверки вашей резервной копии, но вы должны проверить её восстановление хотя бы один раз, чтобы убедиться, что она рабочая. Если у вас есть простая копия файла, попробуйте восстановить её в текущей папке *DashCore* и запустите Dash Core, чтобы убедиться, что он открывается без ошибок. Если вы решили сохранить файл кошелька в зашифрованном zip-файле, убедитесь, что можете распаковать его и правильно открыть в Dash Core. Короче говоря, убедитесь, что вы (или человек, которому вы доверяете в конечном итоге пройти этот процесс за вас), действительно можете задействовать процесс резервного копирования, чтобы получить доступ к вашим DASH, вместо того, чтобы полагать, что этот процесс теоретически должен сработать.
