Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/installation-windows.po
Languages: ar, fr, ko, pt, ru, vi, zh_cn

source: How to download, install and encrypt the Dash Core wallet in Windows
ar: كيفية تنزيل وتثبيت وتشفير محفظة داش كور في الويندوز
fr: Comment télécharger, installer et chiffrer le portefeuille logiciel Dash Core sous Windows
ko: Windows에서 대시 코어 지갑을 다운로드, 설치 및 암호화하는 방법
pt: Como baixar, instalar e criptografar a carteira do Dash Core no Windows
ru: Как скачать, установить и зашифровать кошелёк Dash Core в Windows
vi: Làm thế nào để tải xuống, cài đặt và mã hoá ví Dash Core cho Windows
zh_cn: 如何在Windows下载、安装和加密Dash Core钱包

source: dash, core, wallet, windows, installation
ar: داش، كور، محفظة، ويندوز، التتبيث
fr: dash, core, portefeuille, windows, installation
ko: 대시, 코어, 지갑, 윈도우즈, 설치
pt: dash, core, carteira, windows, Instalação
ru: dash, core, кошелёк, windows, установка
vi: dash, core, ví, windows, cài đặt, tải xuống
zh_cn: 达世币，核心，钱包，windows，安装

source: Windows Installation Guide
ar: دليل التتبيث في الويندوز
fr: Guide d'installation pour Windows
ko: 윈도우 설치 가이드
pt: Guia de Instalação no Windows
ru: Руководство по установке в Windows
vi: Hướng dẫn cài đặt trên Windows
zh_cn: Windows安装指南

source: This guide describes how to download, install and encrypt the Dash Core wallet for Windows. The guide is written for Windows 10, but the steps should be similar for Windows XP, Vista, 7 and 8.
ar: يوضح هذا الدليل كيفية تنزيل وتثبيت وتشفير محفظة داش كور الخاصة بنظام الويندوز. تمت كتابة الدليل لنظام التشغيل ويندوز 10 ، ولكن يجب أن تكون الخطوات مماثلة لنظام التشغيل ويندوز XP و Vista و 7 و 8.
fr: Ce guide montre comment télécharger, installer et chiffrer le portefeuille logiciel Dash Core pour Windows. Ce guide est écrit pour Windows 10, mais les étapes devraient être analogues pour Windows XP, Vista, 7 et 8.
ko: 이 가이드는 윈도우용 대시 코어(Dash Core) 지갑을 다운로드, 인스톨 및 암호화 하는 방법을 기술합니다. 이 가이드는 윈도우 10을 기준으로 작서오디었으나, 아래의 단계는 윈도우 XP, Vista, 7 및 8에서도 유사합니다.
pt: Este guia descreve como baixar, instalar e criptografar a carteira do Dash Core para Windows. O guia foi escrito para o Windows 10, mas as etapas devem ser semelhantes para o Windows XP, Vista, 7 e 8.
ru: Это руководство объясняет как скачать, установить и зашифровать кошелёк Dash Core для Windows. Руководство написано для Windows 10, но описанные в нём шаги подходят для Windows XP, Vista, 7 и 8.
vi: Hướng dẫn này sẽ mô tả cách tải, cài đặt và mã hoá ví Dash Cor trên Windows. Hướng dẫn này viết trên Windows 10, nhưng các bước thì cũng tương tự như vậy đối với Windows XP, Vista, 7 hoặc 8.
zh_cn: 本指南介绍了如何下载、安装和加密Windows Dash Core钱包。指南是基于Windows 10的，但Windows XP、Vista、7和8的步骤类似。

source: Downloading the Dash Core wallet
ar: تحميل محفظة داش كور
fr: Téléchargement du portefeuille Dash Core
ko: 대시 코어 지갑 다운로드 하기
pt: Downloading da Carteira Dash Core
ru: Процедура скачивания кошелька Dash Core
vi: Tải ví Dash Core
zh_cn: 下载Dash Core钱包

source: Visit https://www.dash.org/downloads/ to download the latest Dash Core wallet. In most cases, the website will properly detect which version you need. Click **Download Installer** to download the installer directly.
fr: Visitez https://www.dash.org/fr/telechargements pour télécharger le portefeuille logiciel Dash Core le plus récent. Dans la plupart des cas, le site détectera correctement la version dont vous avez besoin. Cliquez sur **Télécharger l'installeur** pour télécharger directement l'installeur.

source: The website properly detects the wallet appropriate for your system
ar: يكتشف الموقع بشكل صحيح المحفظة المناسبة لنظامك
fr: Le site détecte correctement le portefeuille approprié à votre système d'exploitation
ko: 웹사이트는 당신의 시스템에 맞는 적절한 지갑을 감지합니다.
pt: O site detecta corretamente a carteira apropriada para o seu sistema
ru: Сайт автоматически определит кошелёк, подходящий для вашей системы
vi: Website tự động xác định phiên bản ví phù hợp cho hệ thống của bạn
zh_cn: 网站会正确检测到适合你系统的钱包软件

source: If detection does not work, you will need to manually choose your operating system and whether you need a 32 or 64 bit version. If you are unsure whether your version of Windows is 32 or 64 bit, you can check in Windows 10 under **Start > Settings > System > About**. For details on how to check this in other versions of Windows, see `here <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__.
ar: إذا لم يعمل الكشف ، فستحتاج إلى اختيار نظام التشغيل يدويًا وما إذا كنت تحتاج إلى إصدار 32 أو 64 بت. إذا كنت غير متأكد مما إذا كان إصدار الويندوز الخاص بك هو 32 أو 64 بت ، فيمكنك التحقق من ويندوز 10 تحت **بدء> إعدادات> النظام> حول**. للحصول على تفاصيل حول كيفية التحقق من ذلك في إصدارات الويندوز الأخرى ، راجع `هنا <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__.
fr: Si la détection ne fonctionne pas, vous devrez choisir manuellement votre système d'exploitation et si vous avez besoin d'une version 32 ou 64 bits. Si vous ne savez pas si votre version de Windows est 32 ou 64 bits, vous pouvez le vérifier dans Windows 10 dans **Démarrer > Réglages > Système > À propos**. Pour plus de détails sur les autres versions de Windows, voir `ici <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__.
ko: 만일 감지가 제대로 작동하지 않는다면, 당신의 운영 체제 및 32 혹은 64 비트 버전 여부에 맞는 지갑을 수동으로 선택하십시오. 만일 당신의 윈도우가 32 혹은 64 비트 중 어떤 버전인지 확실하지 않다면, 윈도우 10을 기준으로 **시작>설정>시스템>정보**\ 를 통해 확인하실 수 있습니다. 다른 버전의 윈도우에서 이를 확인하는 방법에 관하여는 `이곳 <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__\ 을 참조하십시오.
pt: Se a detecção não funcionar, você precisará escolher manualmente o sistema operacional e se precisa de uma versão de 32 ou 64 bits. Se não tiver certeza se sua versão do Windows é de 32 ou 64 bits, você pode fazer check-in no Windows 10, em **Iniciar > Configurações > Sistema > Sobre**. Para obter detalhes sobre como verificar isso em outras versões do Windows, consulte `aqui <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows -2624475>`__.
ru: Если автоматическое определение не работает, то вам будет необходимо вручную выбрать вашу операционную систему и указать, какая версия необходима, 32-битная или 64-битная. Если вы не знаете, какая у вас верcия Windows, 32-битная или 64-битная, то в Windows 10 можно это проверить следующим образом: **Start > Settings > System > About**. Для подробностей, как это проверить в других версиях Windows, обратитесь сюда: `здесь <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__.
vi: Nếu tính năng tự động nhận dạng không hoạt động, bạn cần phải tự chọn hệ điều hành tương ứng nếu nó là 32 bit hay 64 bit. Nếu bạn không chắc chắn bạn đang dùng bản Windows nào 32 bit hay 64 bit, bạn có thể kiểm tra trong Windows 10 bằng cách vào **Start > Settings > System > About**. Để có hướng dẫn cụ thể về việc kiểm tra trên các phiên bản Windows khác hãy xem `ở đây <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__.
zh_cn: 如果检测不到，就需要手动选择你的操作系统，以及你需要的是32位的还是64位的版本。如果你也不太确定你的Windows系统是32位还是64位的，可以在Windows 10的\ **开始 > 设置 > 系统 > 关于**\ 进行查找。如何在其它Windows版本下查找此信息，请参见\ `这里 <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__\ 。

source: In Windows Settings, click System
ar: في إعدادات الويندوز ، انقر فوق النظام
fr: Dans les réglages Windows, cliquez sur Système
ko: 윈도우 설정에서 시스템을 클릭하세요.
pt: Em Configurações do Windows, clique em Sistema.
ru: В Панели управления Windows зайдите в раздел Система
vi: Trong Windows Settings, click vào System
zh_cn: 在Windows设置，点击系统

source: Under the System section, click About to view the System type. This is a 64 bit system.
ar: تحت قسم النظام ، انقر فوق حول لعرض نوع النظام. هذا هو نظام 64 بت.
fr: Dans la section Système, cliquez sur À propos pour afficher le type de système. Ici, il s'agit d'un système 64 bits.
ko: 시스템 칸에서 정보를 눌러 시스템 유형을 확인하세요. 이 컴퓨터는 64 비트 시스템입니다.
pt: Na seção Sistema, clique em Sobre para visualizar o tipo de sistema. Este é um sistema de 64 bits.
ru: Во вкладке Система зайдите в раздел "О системе", чтобы увидеть тип системы. В данном случае это 64-битная система.
vi: Trong phần System, click vào About để xem thông tin về hệ thống. Đây là một hệ thống 64 bit.
zh_cn: 在系统项中，点击关于查看系统类型。这是一个64位的系统。

source: Once you know which version you need, download the Dash Core Installer to your computer from https://www.dash.org/downloads/ and save the file you downloaded to your Downloads folder.
fr: Une fois que vous savez de quelle version vous avez besoin, téléchargez le portefeuille Dash Core depuis l'adresse https://www.dash.org/fr/telechargements et enregistrez le fichier téléchargé dans votre dossier Téléchargements.

source: Verifying Dash Core
ar: تحقق من داش كور
fr: Vérification de Dash Core
ko: 대시 코어 검증하기
pt: Verificando Dash Core
ru: Проверка кошелька Dash Core
vi: Kiểm tra Dash Core
zh_cn: 验证Dash Core

source: This step is optional, but recommended to verify the authenticity of the file you downloaded. This is done by checking its detached signature against the public key published by the Dash Core development team. To download the detached signature, click the **Installer Signature** button on the wallet download page and save it to the same folder as the downloaded binary.
fr: Cette étape est facultative, mais recommandée. Elle consiste à vérifier l'authenticité du fichier que vous avez téléchargé. Cela se fait en comparant sa signature de hachage avec celle publiée par l'équipe de développement Dash Core. Pour télécharger la signature publiée, cliquez sur le bouton **Fichier de hachage** sur la page de téléchargement du portefeuille et enregistrez-la dans le même répertoire que le logiciel téléchargé.

source: All releases of Dash are signed using GPG with one of the following keys:
fr: Toutes les versions de Dash sont signées avec GPG avec une des clés suivantes :

source: Alexander Block (codablock) with the key ``63A9 6B40 6102 E091``, `verifiable here on Keybase <https://keybase.io/codablock>`__ (`download <https://keybase.io/codablock/pgp_keys.asc>`__)
fr: Alexander Block (codablock) avec la clé ``63A9 6B40 6102 E091``, `vérifiable ici sur Keybase <https://keybase.io/codablock>`__ (`télécharger <https://keybase.io/codablock/pgp_keys.asc>`__)

source: Pasta (pasta) with the key ``5252 7BED ABE8 7984``, `verifiable here on Keybase <https://keybase.io/pasta>`__ (`download <https://keybase.io/pasta/pgp_keys.asc>`__)
fr: Pasta (pasta) avec la clé ``5252 7BED ABE8 7984``, `vérifiable ici sur Keybase <https://keybase.io/pasta>`__ (`télécharger <https://keybase.io/pasta/pgp_keys.asc>`__)

source: Download the key files above. Install `Gpg4win <https://gpg4win.org/>`__ if it is not already available on your computer. Once it is installed, open the **Kleopatra** certificate manager and click **File -> Import**. Import the key files and verify the Key-ID matches the ID above.
fr: Téléchargez les fichiers clé ci-dessus. Installez `Gpg4win <https://gpg4win.org/>`__ s'il ne l'est pas déjà sur votre ordinateur. Une fois installé, ouvrez le gestionnaire de certificats **Kleopatra** et cliquez sur **Fichier -> Importer**. Importez les fichiers de clé et vérifiez si le Key-ID correspond à la clé ci-dessus.

source: Importing codablock's GPG public key
fr: Importation de la clé GPG publique de Codablock

source: Selecting the signature file for verification
fr: Sélection du fichier de signature pour vérification

source: The binary installer has been verified
fr: L'installeur a été vérifié

source: Running the Dash Core installer
ar: تشغيل مثبت داش كوري
fr: Lancement de l'installeur de Dash Core
ko: 대시 코어 인스톨러 실행하기
pt: Executando o instalador do Dash Core
ru: Запуск установщика кошелька Dash Core
vi: Chạy file cài đặt của Dash Core
zh_cn: 运行Dash Core安装程序

source: Double-click the file to start installing Dash Core.
ar: انقر نقرًا مزدوجًا فوق الملف لبدء تثبيت داش كور.
fr: Double-cliquez sur le fichier pour commencer l'installation de Dash Core.
ko: 대시 코어를 설치하기 위해 파일을 더블클릭 하십시오.
pt: Clique duas vezes no arquivo para iniciar a instalação do Dash Core.
ru: Сделайте двойной щелчок мышкой на файле для запуска установки кошелька Dash Core.
vi: Click đúp vào file để bắt đầu cài đặt Dash Core.
zh_cn: 双击文件启动Dash Core安装程序。

source: The Dash Core installer in the Downloads folder
ar: مثبت داش كور في مجلد التنزيلات
fr: L'installeur Dash Core dans le dossier Téléchargements
ko: 다운로드 폴더의 대시 코어 인스톨러
pt: O instalador do Dash Core na pasta Downloads
ru: Установочный файл кошелька Dash Core находится в папке Загрузки
vi: Chương trình cài đặt Dash Core trong thư mục Downloads
zh_cn: Dash Core安装程序在下载文件夹中

source: At this point, you may see a warning from Windows SmartScreen that the app is unrecognized. You can safely skip past this warning by clicking **More info**, then **Run anyway**.
ar: في هذه المرحلة ، قد ترى تحذيرًا من الشاشة الذكية في الويندوز أن التطبيق غير معروف. يمكنك تخطي هذا التحذير بأمان عن طريق النقر **مزيد من المعلومات** ، ثم **تشغيل على أي حال**.
fr: À cette étape, vous verrez peut-être un avertissement de Windows SmartScreen, selon lequel l'application n'est pas reconnue. Vous pouvez sauter cette étape en toute sécurité en cliquant sur **Plus d'informations**, puis sur **Lancer quand même**.
ko: 이 단계에서 당신은 윈도우 스마트스크린(SmartScreens)으로부터 이 응용 프로그랩을 인식할 수 없다는 경고를 받을 지 모릅니다. 이 경우 **더 알아보기**, 그리고 **계속 실행하기**\ 를 클릭함으로써 이 경고를 안전하게 통과할 수 있습니다.
pt: Neste momento, você pode ver um aviso do Windows SmartScreen que o aplicativo não é reconhecido. Você pode ignorar este aviso com segurança clicando em **Mais informações** e em **Executar mesmo assim**.
ru: На данном этапе, Защитник Windows может выдать предупреждение о нераспознанной угрозе. Вы можете пропустить это предупреждение, не беспокоясь о безопасности, нажав **Подробнее**, далее **Выполнить в любом случае**.
vi: Ở lúc này, bạn có thể sẽ nhìn thấy một cảnh báo từ SmartScreen của Windows nói rằng chương trình này là không được xác định. Bạn có thể yên tâm bỏ qua phần thông báo này bằng cách click vào **More info**, rồi **Run anyway**.
zh_cn: 此时，你会看到Windows有一条弹出窗口报警显示有不可识别应用。你可以按以下步骤安全地跳过报警，点击\ **更多信息**\ ，然后\ **退出**\ 。

source: Bypassing Windows SmartScreen to run the app. This warning is known as a “false positive”.
ar: تجاوز الشاشة الذكية في الويندوز لتشغيل التطبيق. يُعرف هذا التحذير بأنه "إيجابي كاذب".
fr: Contournement de Windows SmartScreen pour lancer l'application. Cet avertissement est appelé un "faux positif".
ko: 이 응용 프로그램을 실항하기 위해서 윈도우 스마트스크린을 우회합니다. 이 경고 메시지는 '긍정 오류'라고도 알려져 있습니다.
pt: Ignorando o Windows SmartScreen para executar o aplicativo. Esse aviso é conhecido como "falso positivo".
ru: Обход Защитника Windows для запуска приложения. Предупреждение от него является "ложноположительным".
vi: Bỏ qua SmartScreen của Windows để chạy chương trình. Cảnh báo đó được biết là "cảnh báo không đúng".
zh_cn: 忽略弹出窗口运行应用程序。此报警可被视为"误报"。

source: The installer will then guide you through the installation process.
ar: بعد ذلك سيرشدك المثبِّت خلال عملية التثبيت
fr: L'installeur vous guidera ensuite le long des étapes de la procédure d'installation.
ko: 그 다음에는 인스톨러가 당신을 설치 과정으로 안내할 것입니다.
pt: O instalador irá guiá-lo através do processo de instalação.
ru: Далее, установщик проведёт вас через процесс установки.
vi: Chương trình cài đặt sẽ hướng dẫn bạn tiến trình cài đặt.
zh_cn: 安装程序随后会指导你完成安装流程。

source: The Dash Core installer welcome screen
ar: شاشة الترحيب من مثبت برنامج داش كور
fr: L'écran de bienvenue de l'installeur Dash Core
ko: 대시 코어 인스톨러 환영 화면
pt: A tela de boas-vindas do instalador do Dash Core
ru: Приветственный экран установщика кошелька Dash Core
vi: Màn hình Chào mừng của trình cài đặt Dash Core
zh_cn: Dash Core安装程序欢迎界面

source: Click through the following screens. All settings can be left at their default values unless you have a specific reason to change something.
ar: انقر خلال الشاشات التالية. يمكن ترك جميع الإعدادات في قيمها الافتراضية ما لم يكن لديك سبب محدد لتغيير شيء ما.
fr: Cliquez sur chacun des écrans suivants. Tous les réglages peuvent être laissés à leur valeur par défaut, à moins que vous n'ayez une raison particulièrement de modifier quelque chose.
ko: 다음의 화면에 따라 클릭합니다. 당신이 설정을 변경하기 위한 특정한 이유가 있지 않은 한, 모든 설정은 기본값으로 둘 수 있습니다.
pt: Clique nas telas a seguir. Todas as configurações podem ser deixadas com seus valores padrão, a menos que você tenha um motivo específico para alterar alguma coisa.
ru: Пройдите через все последующие окна. Все настройки можно оставить на значениях по умолчанию, кроме случаев, когда у вас есть конкретная причина для их изменения.
vi: Bấm qua các màn hình sau. Tất cả các tuỳ chọn có thể bỏ qua như giá trị ngầm didnhj của nó trừ khi bạn có lý do cụ thể để thay đổi chúng.
zh_cn: 接下来的界面可以下一步点过。所有设置可以默认执行，除非你有做特别修改的原因。

source: Select the installation location
ar: حدد موقع التثبيت
fr: Sélection de l'emplacement d'installation
ko: 설치 경로를 지정합니다.
pt: Selecione o local de instalação
ru: Выберите расположение для установки
vi: Chọn thư mục cài đặt
zh_cn: 选择安装目录

source: Select the Start menu folder
ar: حدد مجلد قائمة ابدأ
fr: Sélection du dossier du menu Démarrer
ko: 시작 메뉴 폴더를 선택합니다.
pt: Selecione a pasta do menu Iniciar
ru: Выберите папку в меню Пуск
vi: Chọn thư thư mục menu Start
zh_cn: 选择开始目录文件夹

source: Dash Core is being installed
ar: بدأ تنزيل داش كور
fr: Installation de Dash Core en cours
ko: 대시 코어가 설치되고 있습니다.
pt: Dash Core está sendo instalado
ru: Кошелёк Dash Core устанавливается
vi: Dash Core đang được cài đặt
zh_cn: Dash Core正在被安装

source: Installation is complete
ar: تم التتبث بنجاح
fr: Installation terminée
ko: 설치가 완료되었습니다.
pt: A instalação está completa
ru: Установка завершена
vi: Cài đặt đã xong
zh_cn: 安装完成

source: Running Dash Core for the first time
ar: شغل داش كور لأول مرة
fr: Premier lancement de Dash Core
ko: 처음으로 대시 코어 실행하기
pt: Executando o Dash Core pela primeira vez
ru: Первый запуск кошелька Dash Core
vi: Chạy Dash Core lần đầu tiên
zh_cn: 首次运行Dash Core

source: Once installation is complete, Dash Core will start up immediately. If it does not, click **Start > Dash Core > Dash Core** to start the application. The first time the program is launched, you will be offered a choice of where you want to store your blockchain and wallet data. Choose a location with enough free space, as the blockchain can reach 30GB+ in size. It is recommended to use the default data folder if possible.
ar: بمجرد اكتمال التثبيت ، ستبدأ داش كور فورًا. إذا لم يكن كذلك ، فانقر فوق **ابدأ> داش كور>داش كور** لبدء التطبيق. في المرة الأولى التي يتم فيها إطلاق البرنامج ، سيتاح لك اختيار المكان الذي تريد فيه تخزين بيانات بلوكشين و المحفظة الخاصة بك. اختر موقعًا به مساحة خالية كافية ، حيث يمكن أن يصل حجم بلوكشين إلى 30+ جيجابايت. من المستحسن استخدام مجلد البيانات الافتراضي إذا أمكن ذلك.
fr: Une fois l'installation terminée, Dash Core démarrera aussitôt. Si ce n'est pas le cas, cliquez sur **Démarrer > Dash Core > Dash Core** pour lancer l'application. Au premier lancement, il vous sera demandé l'emplacement où vous souhaitez stocker la blockchain et les données de portefeuille. Choisissez un emplacement avec suffisamment d'espace libre, car la blockchain peut atteindre une taille de 30+ Go. Il est recommandé d'utiliser le dossier proposé par défaut, dans la mesure du possible.
ko: 일단 설치가 완료되면, 대시 코어는 즉시 실행될 것입니다. 만일 실행되지 않는다면 **시작>대시 코어>대시 코어**를 클릭하여 이 응용 프로그램을 시작하십시오. 프로그램이 설치된 후 첫 실행에서 당신은 당신의 블록체인과 지갑 데이터를 어디에 저장할 것인지를 설정할 수 있습니다. 블록체인이 30GB+를 차지할 수 있는 만큼, 충분한 사용 공간이 있는 장소를 선택하십시오, 가능하다면 기본 데이터 폴더를 사용하시는 것을 권장합니다.
pt: Quando a instalação estiver concluída, o Dash Core será iniciado imediatamente. Se isso não acontecer, clique em **Iniciar > Core do Dash > Core do Dash** para iniciar o aplicativo. Na primeira vez que o programa for lançado, você terá a opção de escolher onde deseja armazenar seus dados de blockchain e carteira. Escolha um local com espaço livre suficiente, pois o blockchain pode atingir cerca de 30GB+. Recomenda-se usar a pasta de dados padrão, se possível.
ru: По завершению установки, кошелёк Dash Core сразу запустится. Если этого не произойдёт, то нажмите **Start > Dash Core > Dash Core** для запуска приложения. При первом запуске программы, вам будет предложено выбрать расположение места хранения блокчейна и данных кошелька. Выберите расположение с достаточным свободным местом на диске, поскольку размер блокчейна может достигать 30+ гигабайт. При возможности, рекомендуется использовать место, предлагаемое по умолчанию.
vi: Khi việc cài đặt hoàn tất, Dash Core sẽ khởi động ngay sau đó. Nếu nó không chạy, click vào **Start > Dash Core > Dash Core** để khởi động chương trình. Trong lần chạy đầu tiên của chương trình, bạn sẽ được hỏi về chọn nơi bạn muốn lưu trữ blockchain và dữ liệu ví. Chọn nơi có đủ không gian trống, và blockchain có thể đạt kích thước 30GB+. Bạn nên sử dụng thư mục dữ liệu ngầm định thì càng tốt.
zh_cn: 安装完成后，Dash Core钱包会马上启动程序。如果没有，请点击\ **开始 > Dash Core > Dash Core**\ 来启动。程序首次启动时，会问到你准备将区块链和钱包数据存储在哪里。区块链的大小能达到30GB+，所以请选择一个有足够可用空间的地方。建议尽量使用默认的数据文件夹。

source: Choosing the Dash Core data folder
ar: إختار مجلد داش كور
fr: Sélection du dossier de données Dash Core
ko: 대시 코어 데이터 폴더 선택하기
pt: Escolhendo a pasta de dados do Dash Core
ru: Выбор места хранения данных кошелька Dash Core
vi: Chọn thư mục dữ liệu cho Dash Core
zh_cn: 选择Dash Core数据文件夹

source: Dash Core will then start up. This will take a little longer than usual the first time you run it, since Dash Core needs to generate cryptographic data to secure your wallet.
ar: ثم تبدأ داش كور. سيستغرق ذلك وقتًا أطول قليلاً من المعتاد في المرة الأولى التي تقوم بتشغيلها ، حيث يحتاج داش كور إلى إنشاء بيانات تشفير لتأمين محفظتك.
fr: Dash Core démarrera alors. Le lancement prendra un peu plus de temps la première fois, car Dash Core doit générer des données cryptographiques pour sécuriser votre portefeuille.
ko: 이후 대시 코어가 실행될 것입니다. 첫 실행 시에는 다소 긴 시간이 소요되는데, 이는 대시 코어가 당신의 지갑을 안전하게 보호하기 위하여 암호화된 데이터를 생성하기 때문입니다.
pt: O Dash Core será iniciado. Isso levará um pouco mais do que o normal na primeira vez que você executá-lo, já que o Dash Core precisa gerar dados criptográficos para proteger sua carteira.
ru: Произойдёт запуск кошелька Dash Core. Первый запуск проходит дольше обычного, поскольку кошельку Dash Core необходимо создать криптографические данные для обеспечения безопасности вашего кошелька.
vi: Sau đó Dash Core sẽ khởi động. Nó sẽ mất một chút lâu hơn so với bình thường trong lần chạy đầu tiên, vì Dash Core cần phải sinh ra một số dữ liệu mã hoá để đảm bảo an toàn cho ví của bạn.
zh_cn: Dash Core随后便开始运行了。第一次运行会比正常情况时间久一点，因为Dash Core需要生成一些加密数据来保护你的钱包。

source: Starting Dash Core
ar: بدأ داش كور
fr: Démarrage de Dash Core
ko: 대시 코어 시작하기
pt: Iniciando Dash Core
ru: Запуск кошелька Dash Core
vi: Khởi động Dash Core
zh_cn: 启动Dash Core

source: Synchronizing Dash Core to the Dash network
ar: تزامن داش كور إلى شبكة داش
fr: Synchronisation de Dash Core avec le réseau Dash
ko: 대시 코어와 대시 네트워크 동기화하기
pt: Sincronizando o Dash Core na rede do Dash
ru: Синхронизация кошелька Dash Core с сетью Dash
vi: Đồng bộ dữ liệu Dash Core với mạng lưới Dash
zh_cn: Dash Core和达世币网络进行同步
