Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/installation-windows.po
Languages: ar, fr, ko, pt, ru, vi, zh_cn

source: Once Dash Core is successfully installed and started, you will see the wallet overview screen. You will notice that the wallet is “out of sync”, and the status bar at the bottom of the window will show the synchronization progress.
ar: بمجرد تثبيت داش كور وتثبيته بنجاح ، سترى شاشة نظرة عامة على المحفظة. ستلاحظ أن المحفظة "غير متزامنة" ، وسيظهر شريط الحالة في أسفل النافذة تقدم المزامنة.
fr: Une fois Dash Core installé et démarré avec succès, vous verrez apparaître le tableau de bord du portefeuille. Veuillez noter que le portefeuille n'est "pas encore synchronisé", et que la barre de progression en bas de la fenêtre montre la progression de la synchronisation.
ko: 대시 코어가 성공적으로 설치 및 시작되는 경우, 당신은 지갑 개요 화면을 보게 될 것입니다. 또한 당신의 지갑이 동기화 되지 않은 상태임을 확인할 수 있으며, 또한 창의 하단 상태 바에서 동기화 진행 상황을 보실 수 있습니다.
pt: Depois que o Dash Core for instalado e iniciado com sucesso, você verá a tela de visão geral da carteira. Você notará que a carteira está "fora de sincronia" e a barra de status na parte inferior da janela mostrará o andamento da sincronização.
ru: Как только кошелёк Dash Core будет успешно установлен и запущен, вы увидете экран обзора кошелька. В увидете что кошелёк "не синхронизирован" и полосу прогресса статуса синхронизации в нижней части экрана.
vi: Khi Dash Core đã được cài đặt và khởi động thành công, bạn sẽ thấy màn hình tổng thể của ví. Bạn sẽ thấy rằng ví "chưa được đồng bộ", và thanh trạng thái ở đáy của cửa sổ sẽ hiển thị tiến trình đồng bộ.
zh_cn: 一旦Dash Core成功安装并启动，你就会看到钱包的主屏幕界面。这时钱包是“非同步状态”，窗口下面会有进度条显示同步的进程。

source: Dash Core begins synchronizing with the Dash network
ar: تبدأ داش كور جار المزامنة مع شبكة داش
fr: Dash Core démarre la synchronisation avec le réseau Dash
ko: 대시 코어가 대시 네트워크와 동기화를 진행하고 있습니다.
pt: Dash Core começa a sincronizar com a rede do Dash
ru: Кошелёк Dash Core начнёт синхронизацию с сетью Dash
vi: Dash Core bắt đầu đồng bộ với mạng lưới Dash
zh_cn: Dash Core和达世币网络同步

source: During this process, Dash Core will download a full copy of the Dash blockchain from other nodes to your device. Depending on your internet connection, this may take a long time. If you see the message “No block source available”, check your internet connection. When synchronization is complete, you will see a small blue tick in the lower right corner.
ar: خلال هذه العملية ، ستقوم داش كور بتنزيل نسخة كاملة من بلوكشين داش من العقد الأخرى إلى جهازك. اعتمادًا على اتصالك بالإنترنت ، قد يستغرق هذا الأمر وقتًا طويلاً. إذا ظهرت لك الرسالة "لا يوجد مصدر كتلة متاح" ، فتحقق من اتصالك بالإنترنت. عند اكتمال المزامنة ، سترى علامة زرقاء صغيرة في الزاوية اليمنى السفلى.
fr: Durant cette étape, Dash Core télécharge sur votre ordinateur une copie complète de la blockchain Dash auprès d'autres nœuds du réseau. En fonction de votre connexion Internet, cela peut prendre du temps. Si vous voyez le message "Aucune source de blocs disponible", veuillez vérifier votre connexion Internet. Quand la synchronisation est achevée, vous verrez une petite coche bleue dans le coin inférieur droit.
ko: 이 과정에서 대시 코어는 다른 노드로부터 당신의 기기에 대시 블록체인의 전체 복사본을 다운로드 할 것입니다. 당신의 인터넷 연결 상태에 따라 이 과정은 긴 시간이 소요될 수 있습니다. 만일 당신이 '사용할 수 있는 블록 소스 없음' 메시지를 받는다면, 당신의 인터넷 연결 상황을 확인하십시오. 동기화가 완료되면, 작은 파란색 체크 표시를 볼 수 있을 것입니다.
pt: Durante esse processo, o Dash Core baixará uma cópia completa do blockchain de outros nós para o seu dispositivo. Dependendo da sua conexão com a internet, isso pode levar muito tempo. Se você vir a mensagem "Nenhuma fonte de bloqueio disponível", verifique sua conexão com a Internet. Quando a sincronização estiver concluída, você verá um pequeno sinal azul no canto inferior direito.
ru: Во время этого процесса, кошелёк Dash Core скачает с нод сети полную копию блокчейна Dash на ваше устройство. В зависимости от интернет-соединения, это может занят как мало времени, так и много. Если вы увидете сообщение "Отсутствует источник блоков", проверьте ваше соединение с интернетом.
vi: Trong tiến trình này, Dash Core sẽ tải bản đầy đủ của blockchain của Dash từ những nút khác vào thiết bị của bạn. Tuỳ thuộc vào tốc độ kết nối Internet của bạn, nó có thể mất khá nhiều thời gian. Nếu bạn thấy thông báo "Không có nguồn block", hãy kiểm tra kết nối internet. Khi việc đồng bộ hoàn tất, bạn sẽ nhìn thấy hình đánh dấu tích nhỏ màu xanh ở góc dưới bên phải của cửa sổ chương trình.
zh_cn: 在同步过程中，Dash Core会从其它节点下载达世币区块链的完整拷贝到你的设备上。这可能会花上很长的一段时间，取决于你的网速。如果你看到“没有区块资源可用”的信息，请检查你的网络连接。当同步结束后，你会看到右下角出现一个蓝色的对勾。

source: Dash Core synchronization is complete
ar: تم انتهاء مزامنة داش كور
fr: La synchronisation de Dash Core est achevée
ko: 대시 코어 동기화가 완료되었습니다.
pt: A sincronização do Dash Core está concluída
ru: Синхронизация кошелька Dash Core завершена
vi: Việc đồng bộ của Dash Core đã hoàn tất
zh_cn: Dash Core同步完成

source: You can now begin to use your wallet to send and receive funds.
ar: يمكنك الآن البدء في استخدام محفظتك لإرسال الأموال وتلقيها.
fr: Vous pouvez à présent utiliser votre portefeuille pour envoyer et recevoir des fonds.
ko: 이제 당신은 당신의 지갑을 이용하여 자금을 보내고 받을 수 있습니다.
pt: Agora você pode começar a usar sua carteira para enviar e receber fundos.
ru: Теперь вы можете начать использовать кошелёк для отправки или получения средств.
vi: Bây giờ bạn có thể bắt đầu dùng ví của mình để gửi và nhận tiền.
zh_cn: 你现在可以通过你的钱包发送和接收资金了。

source: Encrypting your Dash wallet
ar: تشفير محفظتك داش
fr: Chiffrage de votre portefeuille Dash
ko: 당신의 대시 지갑 암호화하기
pt: Criptografando sua carteira do Dash
ru: Ваш кошелёк Dash Core зашифровывается
vi: Mã hoá ví Dash của bạn
zh_cn: 加密你的达世币钱包

source: After your wallet has synchronized with the Dash network, it is strongly advised to encrypt the wallet with a password or passphrase to prevent unauthorized access. You should use a strong, new password that you have never used somewhere else. Take note of your password and store it somewhere safe or you will be locked out of your wallet and lose access to your funds.
ar: بعد مزامنة محفظتك مع شبكة داش ، ينصح بشدة بتشفير المحفظة بكلمة مرور أو عبارة مرور لمنع الوصول غير المصرح به. يجب عليك استخدام كلمة مرور قوية وجديدة لم تستخدمها من قبل في مكان آخر. خذ علما بكلمة المرور الخاصة بك وقم بتخزينها في مكان آمن أو سيتم قفلك من محفظتك وفقدان إمكانية الوصول إلى أموالك.
fr: Après la synchronisation de votre portefeuille avec le réseau Dash, il est fortement conseillé de chiffrer le portefeuille avec un mot de passe ou une phrase de passe, de manière à interdire les accès non autorisés. Vous devriez utiliser un mot de passe fort et neuf, que vous n'avez jamais utilisé ailleurs. Prenez note de votre mot de passe et conservez-le dans un endroit sûr, ou bien vous serez interdit d'accès à votre propre portefeuille, et vous perdrez tous vos fonds.
ko: 당신의 지갑이 대시 네트워크와 동기화를 마치면, 지갑을 암호 혹은 암호문을 통해 암호화 할 것을 강력하게 권장합니다. 이 경우 다른 곳에서 사용한 적 없는 강력하고 새로운 암호를 사용하여야 합니다. 당신의 암호를 별도로 적어 안전한 곳에 저장하십시오. 그렇지 않으면 지갑이 잠기게 되어 스스로의 자금에 접근할 수 없게 됩니다.
pt: Depois que sua carteira for sincronizada com a rede do Dash, é altamente recomendável criptografar a carteira com uma senha para impedir o acesso não autorizado. Você deve usar uma senha nova e forte que nunca usou em outro lugar. Anote sua senha e armazene-a em algum lugar seguro ou você será bloqueado fora de sua carteira e perderá acesso a seus fundos.
ru: Как только ваш кошелёк синхронизируется с сетью Dash, то для предотвращения несанкционированного доступа к нему, настойчиво рекомендуем вам зашифровать кошелёк с помощью пароля или кодовой фразы. Необходимо использовать надежный, новый пароль, который вы не использовали ранее нигде. Запишите свой пароль и храните его в безопасном месте, иначе вы можете потерять доступ к кошельку и вашим средствам.
vi: Sau khi ví của bạn được đồng bộ với mạng lưới Dash, thì điều chúng tôi đặc biệt khuyến cáo đó là mã hoá ví của bạn bằng một mật khẩu để ngăn chặn việc truy cập mà bạn không mong muốn. Bạn nên sử dụng mật khẩu mới và mạnh mà bạn chưa từng dùng ở nơi nào khác. Hãy ghi lại mật khẩu của bạn và lưu nó ở nơi an toàn để sao cho bạn không bị mất quyền truy cập đến tài sản tiền số của mình.
zh_cn: 当你的钱包与达世币网络同步完成后，强烈建议你为钱包设置一个密码或口令，以避免未经授权的登录。密码应该有一些难度，而且是你没有在别的地方使用过的新密码。记下你的密码，存放在一个安全的地方，否则你有可能因忘记密码而无法进入钱包获取资金。

source: To encrypt your wallet, click **Settings > Encrypt Wallet**.
ar: لتشفير محفظتك ، انقر على **الإعدادات> تشفير المحفظة**.
fr: Pour chiffrer votre portefeuille, cliquez sur **Réglages > Chiffrer le portefeuille**.
ko: 지갑을 암호화하기 위해서는 **설정>지갑 암호화** 를 클릭하십시오.
pt: Para criptografar sua carteira, clique em **Definições >Criptografar Carteira**.
ru: Для того, чтобы зашифровать кошелёк, нажмите **Настройки > Зашифровать кошелёк**
vi: Để mã hoá ví, click **Tuỳ chỉnh > Mã hoá ví**.
zh_cn: 加密你的钱包，请点击\ **设置 > 加密钱包**\ 。

source: Encrypting the Dash wallet with a password
ar: تشفير محفظة داش بالرقم السري
fr: Chiffrage du portefeuille Dash avec un mot de passe
ko: 대시 지갑을 암호문으로 암호화하고 있습니다.
pt: Criptografar a carteira do Dash com uma senha
ru: Кошелёк Dash шифруется паролем
vi: Mã hoá ví Dash với một mật khẩu
zh_cn: 对达世币钱包进行加密

source: You will be asked to enter and verify a password.
ar: سيُطلب منك إدخال الرقم السري والتحقق منها
fr: Il vous sera demandé de saisir et de vérifier votre mot de passe.
ko: 암호문을 입력하고 확인하십시오.
pt: Você será solicitado a inserir e verificar uma senha.
ru: Вам поступит запрос ввести и подтвердить пароль.
vi: Bạn sẽ được hỏi để nhập lại và xác nhận mật khẩu.
zh_cn: 你将被要求输入和验证密码。

source: Enter a password
ar: أدخل الرقم السري
fr: Saisissez un mot de passe
ko: 암호문을 입력합니다.
pt: insira uma senha
ru: Введите пароль
vi: Nhập mật khẩu
zh_cn: 输入密码

source: Confirm you want to encrypt your wallet
ar: تأكيد لتشفير محفظتك
fr: Confirmez que vous souhaitez chiffrer votre portefeuille
ko: 당신이 지갑을 암호화하고 싶은 것이 맞는지 확인합니다.
pt: Confirme que você deseja criptografar sua carteira
ru: Подтвердите, что вы хотите зашифровать кошелёк
vi: Xác nhận rằng bạn muốn mã hoá ví
zh_cn: 确认你想要加密你的钱包

source: When the encryption process is complete, you will see a warning that past backups of your wallet will no longer be usable, and be asked to shut down Dash Core. When you restart Dash Core, you will see a small blue lock in the lower right corner.
ar: عند اكتمال عملية التشفير ، سترى تحذيرًا بأن النسخ الاحتياطية السابقة من محفظتك لن تكون قابلة للاستخدام ، ويُطلب منك إيقاف داش كور. عند إعادة تشغيل داش كور ، سترى قفلًا أزرقًا صغيرًا في الزاوية اليمنى السفلى.
fr: Quand le processus de chiffrage est terminé, vous verrez un avertissement selon lequel les anciennes sauvegardes de votre portefeuille ne seront plus utilisables, et il vous sera demandé de quitter l'application Dash Core. Au redémarrage de Dash Core, vous verrez un petit cadenas bleu dans le coin inférieur droit.
ko: 지갑 암호화 과정이 완료되면, 당신은 지갑의 지난 백업을 더이상 사용할 수 없다는 경고문을 받게 됩니다. 또한 대시 코어를 종료하라는 메시지 역시 받게 될 것입니다. 대시 코어를 재시작하면 우측 하단 코너에서 작은 파란색 자물쇠 표시를 확인하실 수 있습니다.
pt: Quando o processo de criptografia estiver concluído, você verá um aviso de que os backups anteriores da sua carteira não serão mais utilizáveis e será solicitado a encerrar o Dash Core. Quando você reiniciar Dash Core, você verá uma pequena trava azul no canto inferior direito.
ru: Когда процесс шифрования завершится, вы увидете предупреждение, что старые резервные копии вашего кошелька более не могут быть использованы, после чего вам будет предложено закрыть кошелёк Dash Core. Когда вы перезапустите кошелёк Dash Core, то увидете небольшой синий знак замка в нижней правой части экрана.
vi: Khi quá trình mã hoá được hoàn tất, bạn sẽ thấy một cảnh báo rằng những bản sao lưu của ví của bạn sẽ không còn dùng được nữa, và bạn sẽ được hỏi việc thoát khỏi chương trình Dash Core. Khi bạn khởi động Dash Core, bạn sẽ thấy một hình chiếc khoá màu xanh ở góc dưới bên phải của màn hình.
zh_cn: 当加密过程结束后，你会看到一条提示说钱包之前的备份已不可用，并要求关闭Dash Core。当你重新启动Dash Core后，你会看到右下角出现了一个蓝色的小锁。

source: Fully encrypted and synchronized Dash Core wallet
ar: مشفرة تماما ومتزامنة داش كور المحفظة
fr: Portefeuille Dash Core entièrement chiffré et synchronisé
ko: 대시 코어 지갑이 완전히 암호화되고 동기화되었습니다.
pt: Carteira Dash Core totalmente criptografada e sincronizada
ru: Кошелёк Dash Core полностью зашифрован и синхронизирован
vi: Ví Dash Core của bạn đã được mã hoá và đồng bộ hoàn chỉnh
zh_cn: Dash Core钱包完成同步和加密

source: You can now begin to use your wallet to safely send and receive funds.
ar: يمكنك الآن البدء في استخدام محفظتك لإرسال الأموال وتلقيها بأمان.
fr: Vous pouvez maintenant commencer à utiliser votre portefeuille en toute sécurité, et à envoyer et recevoir des fonds.
ko: 이제 당신은 지갑을 이용하여 자금을 안전하게 보내고 받을 수 있습니다.
pt: Agora você pode começar a usar sua carteira para enviar e receber fundos com segurança.
ru: Теперь вы можете начать использовать свой кошелёк для отправки и получения средств.
vi: Bây giờ bạn có thể bắt đầu dùng ví của mình để gửi và nhận tiền một cách an toàn.
zh_cn: 你现在可以通过你的钱包安全地发送和接收资金了。
