Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/interface.po
Languages: ar, de, es

source: This documentation describes the functionality of the Dash Core Options dialog, available under the **Settings > Options** menu in Dash Core.
ar: تصف هذه الوثائق وظيفة مربع الحوار إعدادات داش كور ، المتوفر تحت قائمة **الإعدادات > خيارات** في داش كور.
de: Diese Dokumentation beschreibt die Einstellungsmöglichkeiten innerhalb der Dash Core Konfigurationseinstellungen, der sich unter **Einstellungen > Konfiguration** im Dash Core Menüs befindet.
es: Esta documentación describe la funcionalidad del dialogo de opciones de la Dash Core, disponible en el menú **Configuración > Opciones** en la Dash Core.

source: Main tab
ar: الجدول الرئيسي
de: Allgemein-Tab
es: Pestaña Principal

source: The Main tab of the Options dialog contains settings related to startup and performance of the Dash Core app.
ar: تحتوي الجدول الرئيسية بمربع الحوار "خيارات" على الإعدادات المتعلقة ببدء تشغيل تطبيق داش كور وأدائه.
de: Der Allgemein-Tab der Konfigurationseinstellungen beinhaltet Einstellungen, die sich auf den Start und die Leistungsstärke der Dash Core Wallet beziehen.
es: La pestaña principal del dialogo de Opciones contiene configuraciones relacionadas al inicio y desempeño de la aplicación Dash Core.

source: The Main tab of the Dash Core Options dialog
ar: علامة الجدول الرئيسية لمربع حوارخيارت داش كور
de: Der Allgemein-Tab der Dash Core Konfigurationseinstellungen
es: Pestaña Principal del dialogo de Opciones de la Dash Core

source: Start Dash Core on system login
ar: بدء داش كور على تسجيل الدخول النظام
de: Starte Dash Core nach Systemanmeldung
es: Iniciar la Dash Core al ingresar al sistema

source: This option causes Dash Core to start automatically when the current user logs in. On most computers there is only one main user account which is logged in automatically when the computer turns on, so this option is effectively the same as starting Dash Core together with the operating system.
ar: يؤدي هذا الخيار إلى بدء تشغيل داش كور تلقائيًا عند تسجيل دخول المستخدم الحالي. في معظم أجهزة الكمبيوتر ، يوجد حساب مستخدم رئيسي واحد فقط يتم تسجيل دخوله تلقائيًا عند تشغيل الكمبيوتر ، بحيث يكون هذا الخيار هو نفسه تمامًا مثل بدء تشغيل داش كور جنبًا إلى جنب مع نظام التشغيل.
de: Wenn diese Einstellung aktiviert wird, startet die Dash Core Wallet automatisch nach dem Login. Sollte der Computer ein automatisches Login durchführen, da nur ein Benutzerkonto existiert, ist dies gleichbedeutend mit einem Start der Dash Core Wallet bei Systemstart.
es: Esta opción hace que la Dash Core inicie automáticamente cuando el usuario actual inicia sesión. En la mayoría de los computadores hay solo una cuenta de usuario principal que inicia automáticamente cuando el computador se enciende, entonces esta opción es efectivamente la misma que iniciar la Dash Core junto con el sistema operativo.

source: Size of database cache
ar: حجم ذاكرة التخزين المؤقت لقاعدة البيانات
de: Größe des Datenbankcaches
es: Tamaño de la memoria caché en la base de datos

source: This option specifies the size of the database cache in memory. A higher value will result in increased performance when adding new blocks at the cost of higher memory usage. The default value is 100MB and it should not be set lower than this level.
ar: يحدد هذا الخيار حجم ذاكرة التخزين المؤقت لقاعدة البيانات في الذاكرة. ستؤدي القيمة الأعلى إلى زيادة الأداء عند إضافة كتل جديدة بتكلفة استخدام الذاكرة الأعلى. القيمة الافتراضية هي 100 ميغابايت ويجب ألا يتم تعيينها أقل من هذا المستوى.
de: Diese Einstellung bestimmt die Größe, welche die Datenbank im Cache beanspruchen darf. Ein höherer Wert führt dazu, dass neue Blöcke schneller hinzugefügt werden, diese aber auch mehr Datenbankcache verbrauchen. Der Standardwert liegt bei 100MB und er sollte nicht auf eine geringere Zahl gesetzt werden.
es: Esta opción especifica el tamaño de la cache de base de datos en la memoria. Un valor más alto dará como resultado un mayor rendimiento al agregar nuevos bloques con un mayor consumo de memoria. El valor predeterminado es 100MB y no debe ser establecido por debajo de este nivel.

source: Number of script verification threads
ar: عدد مؤشرات التحقق من البرنامج النصي
de: Anzahl an Skript-Verifizierungs-Threads
es: Número de hilos de verificación de instrucciones

source: This option sets the number of script verification threads, ranging from -4 to 16. `Script verification <https://en.bitcoin.it/wiki/Script>`__ is the process of following instructions recorded in the blockchain to ensure the transactions are valid. 0 means automatic and will allow script verification to scale to the number of cores available on your processor. Setting a positive number specifies that Dash Core should use that number of processor cores, while setting a negative number will leave that number of processor cores free.
ar: يحدد هذا الخيار عدد سلاسل عمليات التحقق من البرنامج النصي ، والتي تتراوح من -4 إلى 16. `Script verification <https://en.bitcoin.it/wiki/Script>` __ هي عملية اتباع الإرشادات المسجلة في بلوكشين لضمان المعاملات صالحة. 0 تعني تلقائي وسيسمح بالتحقق من البرنامج النصي إلى عدد النوى المتوفرة على المعالج. يحدد تحديد رقم موجب أن داش كور يجب أن يستخدم هذا العدد من نوى المعالج ، بينما يؤدي تعيين رقم سالب إلى ترك هذا العدد من معالجات المعالج مجانية.
de: Diese Einstellung setzt die Anzahl der Skript-Verifizierungs-Threads auf einen Wert zwischen -4 und 16. `Skript-Verifizierung <https://en.bitcoin.it/wiki/Script>`__ ist der Name des Prozesses, der Instruktionen innerhalb der Blockchain verfolgt, um sicherzustellen, dass eine Transaktion gültig ist. 0 bedeutet automatisch und erlaubt es dem Skript bis zur maximalen Anzahl der CPU-Kerne zu skalieren. Eine positive Zahl bedeutet, dass die entsprechende Anzahl verwendet werden soll, während eine negative Zahl bedeutet, dass die entsprechende Anzahl nicht verwendet werden soll.
es: Esta opción establece el número de hilos de verificación de secuencia de comandos, estableciendo desde -4 hasta 16. `La secuencia de comandos de verificación <https://en.bitcoin.it/wiki/Script>`__ es el proceso de seguir instrucciones grabadas en la cadena de bloques para asegurar que las transacciones son validas. 0 significa automático y permitirá la verificación secuencia de comandos para escalar el número de núcleos disponibles de su procesador. Configurar un numero positivo establece que la Dash Core debería usar ese numero de núcleos del procesador, mientras si configura un numero negativo dejara ese numero núcleos del procesador libres.

source: Wallet tab
ar: شريط المحفظة
es: Pestaña Billetera

source: The Wallet tab of the Options dialog contains settings related to how addresses are managed in the Dash Core app. The first time you run Dash Core, it will generate a new wallet containing 1000 unique Dash addresses. This tab allows you to configure how these addresses are used as inputs with the Coin Control, PrivateSend and Masternode features.
ar: تحتوي علامة تبويب المحفظة في مربع الحوار خيارات على إعدادات مرتبطة بكيفية إدارة العناوين في تطبيق داش كور. في المرة الأولى التي تقوم فيها بتشغيل داش كور ، سيتم إنشاء محفظة جديدة تحتوي على 1000 عنوان فريد من نوع داش. تسمح لك علامة التبويب هذه بتكوين كيفية استخدام هذه العناوين كمدخلات مع ميزات التحكم في عملة ، و الإرسال المخفي و ماسترنود.
de: Der Wallet-Tab der Konfigurationseinstellungen beinhaltet Einstellungsmöglichkeiten zur Verwaltung der Coins, die sich in einer Wallet befinden. Wenn Dash Core zum ersten Mal gestartet wird, wird es 1000 einzigartige Dash-Adressen generieren. Dieser Tab gibt dem Nutzer die Möglichkeit zu konfigurieren, wie diese Adressen verwendet werden, wenn es um Coin Control, PrivateSend und Masternode-Funktionen geht.
es: La pestaña Billetera del dialogo Opciones contiene configuraciones relacionadas a como las direcciones son administradas en la aplicación Dash Core. La primera vez que ejecuta su Dash Core, generara una nueva billetera con 1000 únicas direcciones Dash. Esta pestaña le permite configurar como estas direcciones son usadas como entradas con las caracteristicas Coin Control, PrivateSend y Masternodes.

source: The Wallet tab of the Dash Core Options dialog
ar: شريط المحفظة في مربع الحوار خيارات الأساسي الأساسية
de: Der Wallet-Tab der Dash Core Konfigurationseinstellungen
es: Pestaña Billetera del cuadro de Opciones de la Dash Core

source: Enable coin control features
ar: تمكين ميزات التحكم في العملة
de: "Coin Control"-Funktionen aktivieren
es: Activar características de Coin Control

source: Your Dash Core wallet balance is actually the sum total of all addresses holding balance that are associated with your wallet. When you spend Dash, Dash Core will withdraw from as many inputs as necessary to make up the desired amount of Dash to be transferred. This behavior may be undesirable if you want to keep a certain balance on one address. The most common use case is the requirement to maintain 1000 Dash on a single address as collateral for a masternode. Enabling this option will add a button labelled **Inputs** on the **Send** tab. This provides access to the **Coin selection** dialog, which can be used to lock, unlock and prioritize different addresses in your wallet. See :ref:`here <coin-control>` for a more detailed explanation of Coin Control.
ar: رصيدك في المحفظة الأساسية في داش كور هو في الواقع مجموع جميع العناوين التي تحتوي على رصيد يرتبط بمحفظة المحفظة. عندما تنفق داش ، سينسحب داش كور من أكبر عدد ممكن من المدخلات اللازمة لتعويض المبلغ المطلوب من داش ليتم نقله. قد يكون هذا السلوك غير مرغوب إذا كنت ترغب في الاحتفاظ بتوازن معين على عنوان واحد. حالة الاستخدام الأكثر شيوعًا هي متطلبات الاحتفاظ بـ 1000 داش على عنوان واحد كضمان ل ماسترنود. سيؤدي تمكين هذا الخيار إلى إضافة زر يسمى **مدخلات** على علامة التبويب **إرسال**. يوفر هذا إمكانية الوصول إلى مربع الحوار **تحديد العملة** ، والذي يمكن استخدامه لقفل عناوين مختلفة في محفظتك وفتحها وتحديد أولوياتها. :ref:`هنا <coin-control>` للحصول على شرح أكثر تفصيلاً للتحكم في العملة.
de: Der Betrag, der als Dash Core Wallet Gesamtguthaben angezeigt wird, ist die Summe aller Einzelguthaben, die in den unterschiedlichen Adressen liegen. Wenn eine Transaktion durchgeführt wird, hebt die Dash Core Wallet automatisch von so vielen Adressen ab, wie notwendig ist. Dieses Verhalten kann unter Umständen unerwünscht sein, wenn die Inhalte verschiedener Adressen nicht miteinander vermischt werden sollen. Dies kann z.B. der Fall sein, wenn in einer Adresse 1000 Dash liegen, die für eine Masternode hinterlegt sind. Wenn die Funktion aktiviert wird, erscheint ein Knopf mit der Aufschrift **Inputs** unter **Überweisen**. Durch diesen Knopf wird das **Coin-Control** Menü geöffnet, durch welches bestimmte Adressen einer Wallet verschlossen und andere priorisiert werden können. :ref:`Hier<coin-control>` ist eine detaillierte Erklärung der CoinControl-Funktion zu finden.
es: El saldo de tu billetera Dash Core es en realidad la suma total de todas las direcciones con saldo que están asociadas con su billetera. Cuando gastas Dash, Dash Core retirará tantas entradas como sea necesario para compensar la cantidad deseada de Dash que se transferirá. Este comportamiento puede ser indeseable si desea mantener un cierto saldo en una dirección. El caso de uso más común es el requisito de mantener 1000 Dash en una sola dirección como garantía para un masternode. Habilitar esta opción agregará un botón etiquetado como **Entradas** en la pestaña **Enviar**. Esto proporciona acceso al cuadro de diálogo **Selección de moneda**, que se puede usar para bloquear, desbloquear y priorizar diferentes direcciones en tu billetera. Ver :ref:`aquí <coin-control>` para una explicación más detallada sobre el control de monedas.

source: Show Masternodes tab
ar: إضهار شريط ماسترنود
de: Masternode Tabulator anzeigen
es: Mostrar Pestaña Masternodes

source: Enabling this option causes Dash Core to display an additional Masternodes tab to the right of the Transactions tab. This option requires you to restart the Dash Core app. The Masternodes tab can be used to manage interactions (start, stop, check status, etc.) with masternodes controlled by this wallet. This tab is an advanced feature not required by users that do not operate a masternode on the Dash network.
ar: يؤدي تمكين هذا الخيار إلى عرض داش كور على شريط ماسترنود إضافية على يسار شريط المعاملات. يتطلب هذا الخيار إعادة تشغيل تطبيق داش كور. يمكن استخدام علامة التبويب ماسترنود لإدارة التفاعلات (البدء ، والتوقف ، والتحقق من الحالة ، وما إلى ذلك) مع ماسترنود التي تسيطر عليها هذه المحفظة. شريط هذه هي ميزة متقدمة غير مطلوبة من قبل المستخدمين الذين لا يشغلون ماسترنود على شبكة داش.
de: Durch diese Option wird Dash Core ein Masternode-Tab rechts des Transaktions-Tab anzeigen. Diese Funktion erfordert einen Neustart der Dash Core Wallet. Der Masternode-Tab kann dazu verwendet werden mit einer Masternode, die von dieser Wallet kontrolliert wird, zu interagieren (starten, stoppen, Status anzeigen, etc.). Dieser Tab zeigt erweiterte Funktionen, die für Nutzer, die keine Masternode im Dash-Netzwerk besitzen, nicht relevant ist.
es: Habilitar esta opción hace que Dash Core muestre una pestaña de masternodes adicional a la derecha de la pestaña Transacciones. Esta opción requiere que reinicies la aplicación Dash Core. La pestaña de masternodes se puede usar para gestionar las interacciones (inicio, detención, comprobación de estado, etc.) con los masternodes controlados por esta billetera. Esta pestaña es una función avanzada no requerida por los usuarios que no operan un masternode en la red Dash.

source: Enable advanced PrivateSend interface
ar: تمكين واجهة الإرسال المخفي المتقدمة
de: Erweiterte PrivateSend Schnittstelle anzeigen
es: Habilitar interfaz avanzada de PrivateSend

source: Enabling this option changes the PrivateSend mixing interface on the Overview tab of the Dash Core wallet to include more options, such as Try Mix and percentage completion. See :ref:`here <dashcore-privatesend-instantsend>` for a full explanation of how to use PrivateSend.
ar: يؤدي تمكين هذا الخيار إلى تغيير واجهة خلط الإرسال المخفي في علامة التبويب نظرة عامة في محفظة داش كور لتضمين المزيد من الخيارات ، مثل خلط وإكمال النسبة المئوية. نرى :ref:`هنا <dashcore-privatesend-instantsend>` أو شرح كامل لكيفية استخدام الإرسال المخفي.
de: Diese Funktion verändert die PrivateSend Mixing-Anzeige im Übersichts-Tab der Dash Core Wallet, wodurch erweiterte Funktionen, wie etwa eine Prozentanzeige aktiviert werden. :ref:`Hier<dashcore-privatesend-instantsend>` befindet sich eine detaillierte Erklärung des PrivateSend-Vorgangs.
es: Al habilitar esta opción cambia la interfaz de mezcla de PrivateSend en la pestaña de Overview de la billetera Dash Core para incluir más opciones, como Try Mix y porcentaje de finalización. Ver :ref:`aquí <dashcore-privatesend-instantsend>` para una explicación completa de como usar PrivateSend.

source: Warn if PrivateSend is running out of keys
ar: تحذير إذا نفدت مفاتيح الإرسال المخفي
de: Warnung anzeigen, wenn alle Schlüssel aufgebraucht sind
es: Advertir si PrivateSend se esta quedando sin llaves

source: Enabling this option will cause Dash Core to display a warning when your original set of 1000 addresses is running out, which may affect PrivateSend mixing. Every time a mixing event happens, up to 9 of your addresses are used up. This means those 1000 addresses last for about 100 mixing events. When 900 of them are used, your wallet must create more addresses. It can only do this, however, if you have automatic backups enabled. Consequently, users who have backups disabled will also have PrivateSend disabled.
ar: يؤدي تمكين هذا الخيار إلى ظهور داش كور لعرض تحذير عند نفاد مجموعتك الأصلية المكونة من 1000 عنوان ، مما قد يؤثر على خلط الإرسال المخفي. في كل مرة يحدث فيها حدث خلط ، يتم استخدام ما يصل إلى 9 عناوين من عناوينك. هذا يعني أن 1000 عنوان تدوم لحوالي 100 حدث خلط. عند استخدام 900 منهم ، يجب أن تنشئ محفظتك المزيد من العناوين. يمكن فقط القيام بذلك ، ومع ذلك ، إذا قمت بتمكين النسخ الاحتياطي التلقائي. وبالتالي ، سيتم تعطيل الإرسال المخفي أيضًا للمستخدمين الذين لديهم نسخ احتياطية معطلة.
de: Diese Funktion lässt eine Warnung anzeigen, sobald die ursprünglichen 1000 Adressen fast aufgebraucht wurden und der PrivateSend-Mischvorgang dadurch beeinträchtigt werden könnte. Während jedes Mischvorgangs werden bis zu 9 Adressen verbraucht, was bedeutet, dass 1000 Adressen etwa 100 Mischvorgänge ermöglichen. Sobald 900 davon verbraucht wurden, muss die Wallet weitere Adressen generieren. Dies ist nur möglich, wenn automatische Backups aktiviert wurden. Dies bedeutet, dass Nutzer, die keine automatischen Backups aktiviert haben, auch kein PrivateSend verwenden können.
es: Habilitando esta opción la Dash Core mostrar a una advertencia cuando su conjunto original de 1000 direcciones se esté acabando, lo Qué puede afectar el mezclado de PrivateSend. Cada vez que el mezclado sucede, hasta 9 de sus direcciones son usadas. Esto significa que esas 1000 direcciones durarán alrededor de 100 mezclados. Cuando 900 de ellas son usadas, su billetera debe crear más direcciones. Sólo puede hacer esto, sin embargo, si tiene respaldo automático habilitado. Consecuentemente los usuarios que tienen los respaldos deshabilitados también tendrán PrivateSend deshabilitado

source: Enable PrivateSend multi-session
ar: تمكين الإرسال المخفي متعددة الجلسة
de: PrivateSend multisession aktivieren
es: Habilitar multisesión de PrivateSend

source: Normally PrivateSend mixing is completed in several consecutive rounds, each using a single masternode. Enabling this option allows multi-session, which means you can use multiple masternode servers at the same time, greatly increasing the speed of the mixing process at the cost of creating more addresses and thus requiring more frequent wallet backups. This feature is experimental as of Dash Core 12.1.5.
ar: اكتمل عادة خلط الإرسال المخفي في عدة جولات متتالية ، كل منها يستخدم ماسترنود واحد. يتيح تمكين هذا الخيار جلسات متعددة ، مما يعني أنه يمكنك استخدام عدة خوادم ماسترنود في نفس الوقت ، مما يزيد بشكل كبير من سرعة عملية الخلط على حساب إنشاء المزيد من العناوين ، وبالتالي يتطلب نسخ احتياطي للمحفظة بشكل متكرر. هذه الميزة تجريبية اعتبارًا من داش كور 12.1.5.
de: Normalerweise wird PrivateSend-Mixing in mehreren aufeinander folgenden Runden, die jeweils eine Masternode verwenden, durchgeführt. Mit dieser Option ist es möglich mehrere Mischvorgänge gleichzeitig durchzuführen, was die Geschwindigkeit des Gesamtvorgangs erhöht, aber auch zur Erzeugung zusätzlich Adressen führt, wodurch häufigere Wallet-Backups nötig werden. Diese Funktion ist seit Dash Core 12.1.5 als experimentell enthalten.
es: Normalmente el mezclado de PrivateSend se completa en varias rondas consecutivas, cada una usando un solo masternode. Habilitando esta opción permite la multisesion, lo que significa que podrá usar los servicios de múltiples masternodes al mismo tiempo, sincronizando enormemente la velocidad del proceso de mezclado a costa de crear más direcciones y requiriendo respaldos de la billetera más frecuentes. Esta característica es experimental desde Dash Core 12.1.5

source: Spend unconfirmed change
ar: اقضي على تغيير غير مؤكد
de: Unbestätigtes Wechselgeld darf ausgegeben werden
es: Gastar cambio no confirmado

source: When this option is enabled, the Dash Core wallet permits you to immediately spend change from previous transactions that has been transferred internally between addresses associated with the same wallet. This is possible even if the transaction has not yet been confirmed because the wallet knows it will eventually be confirmed since it created the internal transaction itself. Leaving this option enabled allows you to create new transactions even if previous transactions have not yet been confirmed.
ar: عند تمكين هذا الخيار ، تسمح لك محفظة داش كور بإنفاق التغيير من المعاملات السابقة التي تم نقلها داخليًا بين العناوين المرتبطة بنفس المحفظة. وهذا ممكن حتى إذا لم يتم تأكيد المعاملة بعد لأن المحفظة تعرف أنه سيتم تأكيدها في النهاية لأنها أنشأت المعاملة الداخلية نفسها. يسمح لك ترك هذا الخيار بتمكينك من إنشاء معاملات جديدة حتى إذا لم يتم تأكيد المعاملات السابقة.
de: Wenn diese Funktion aktiviert wird, erlaubt die Dash Core Wallet das sofortige Versenden von Guthaben, welches innerhalb der eigenen Wallet zwischen verschiedenen Adressen versandt wurde. Dies ist möglich, da die Wallet weiß, dass die Transaktionen die benötigten Bestätigungen erhalten werden, da sie diese innerhalb von sich selbst durchgeführt hat. Diese Option ermöglicht es neue Transaktionen zu erstellen, selbst wenn die vorherigen noch nicht bestätigt wurden.
es: Cuando esta opción está habilitada, la billetera Dash Core le permite gastar inmediatamente el saldo de transacciones previas que hayan sido transferidas internamente entre direcciones asociadas con la misma billetera. Esto es posible Incluso si las transacciones aún no han sido confirmadas porque la billetera sabe que eventualmente se confirmaran ya que ella misma ha creado la transacción. Dejando esta opción habilitada le permite crear nuevas transacciones Incluso si sus transacciones previas aún no están confirmadas.

source: PrivateSend rounds to use
ar: الإرسال المخفي و جولات للاستخدام
de: PrivateSend Runden
es: Rondas de PrivateSend para usar

source: Use this option to control the number of rounds of PrivateSend mixing to be carried out for your chosen balance. Each round of mixing uses a new masternode. The higher the number of rounds, the more difficult it becomes to trace the Dash to its original address. This is at the expense of more time required for mixing and potentially higher fees. See here for a full explanation of how to use PrivateSend.
ar: استخدم هذا الخيار للتحكم في عدد جولات خلط الإرسال المخفي ليتم تنفيذها من أجل التوازن الذي اخترته. كل جولة من خلط يستخدم ماسترنود جديدة. كلما زاد عدد الجولات ، كلما أصبح من الصعب تعقب داش إلى عنوانه الأصلي. هذا هو على حساب مزيد من الوقت اللازم لخلط والرسوم التي يحتمل أن تكون أعلى. انظر هنا للحصول على شرح كامل لكيفية استخدام الإرسال المخفي.
de: Über diese Option wird ausgewählt wie viele Runden PrivateSend-Guthaben gemischt wird, bevor es verwendet werden kann. Jede Runde greift auf eine zusätzliche Masternode zu. Je öfter der Mischvorgang durchgeführt wird, desto schwieriger wird es die Dash zur Ursprungsadresse zurückzuverfolgen. Je öfter die Coins gemischt werden, desto länger dauert der Vorgang jedoch und desto teurer wird er. An dieser Stelle befindet sich eine detaillierte Erklärung des PrivateSend-Vorgangs.
es: Utilice esta opción para controlar el número de rondas de mezclado de PrivateSend a llevarse a cabo para su balance escogido. Cada Ronda de mezclado usa un nuevo Masternode. Mientras más alto el número de rondas, mayor será la dificultad para rastrear los Dash hasta su dirección original. Esto a expensas de requerir más tiempo para el mezclado y potencialmente comisiones mayores. Vea aquí para una explicación completa de cómo usar PrivateSend.

source: Amount of Dash to keep anonymized
ar: مبلغ من داش للحفاظ على مجهولة المصدر
de: Anzahl anonymisierter Dash
es: Cantidad de Dash a mantener anónima
