Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/interface.po
Languages: ar, de, es

source: The Console tab provides an interface with the Dash Core RPC (remote procedure call) console. This is equivalent to the ``dash-cli`` command on headless versions of Dash, such as ``dashd`` running on a masternode. Click the red ``–`` icon to clear the console, and see the detailed documentation on RPC commands to learn about the possible commands you can issue.
ar: توفر شريط وحدة التحكم واجهة مع وحدة تحكم داش كور RPC (استدعاء إجراء بعيد). هذا يعادل الأمر `` dash-cli`` على الإصدارات بلا رأس من داش ، مثل `` dashd`` الذي يعمل على ماسترنود. انقر فوق رمز أحمر `` –`` لمسح وحدة التحكم ، وشاهد الوثائق التفصيلية الخاصة بأوامر RPC للتعرف على الأوامر المحتملة التي يمكنك إصدارها.
de: Der Tab Konsole bietet eine Schnittstelle mit der Dash Core RPC-Konsole (Remote Procedure Call). Dies stellt das Äquivalent eines ``dash-cli`` Befehls, wie ``dashd`` zum Betreiben einer Masternode, dar. Über das rote ``–`` Symbol kann die Konsole gesäubert werden. Eine detaillierte Beschreibung der RPC-Befehle, die verfügbar sind, kann ebenfalls eingesehen werden.
es: La pestaña consola provee una interfaz con la consola RPC (llamada remota de procedimiento) de Dash Core. Esto es equivalente al comando ``dash-cli`` en versiones sin cabeza de Dash, como ``dashd`` corriendo en un masternode. Clic en el icono rojo ``–`` para limpiar la consola, y ver la documentación detallada de los comandos RPC para aprender acerca de los posibles comandos que pueda emitir.

source: The Console tab of the Dash Core Tools dialog
ar: شريط وحدة التحكم في مربع حوار أدوات داش كور
de: Der Konsole-Tab der Dash Core Werkzeugleiste
es: Pestaña Consola del cuadro de dialogo de Herramientas de la Dash Core

source: Network Traffic tab
ar: شريط مرزر الشبكة
de: Netzwerkauslastungs-Tab
es: Pestaña Trafico de Red

source: The Network Traffic tab shows a graph of traffic sent and received to peers on the network over time. You can adjust the time period using the slider or **Clear** the graph.
ar: شريط مرور الشبكة رسمًا بيانيًا لحركة المرور المرسلة والمستلمة للأقران على الشبكة مع مرور الوقت. يمكنك ضبط الفترة الزمنية باستخدام شريط التمرير أو **واضح** الرسم البياني.
de: Der Tab zur Netzwerksauslastung zeigt einen Graphen, der den versendeten und empfangenen Traffic mit dem Netzwerk über einen längeren Zeitraum darstellt. Der Zeitabschnitt kann über den Schieberegler geändert werden und der Graph kann zudem **gesäubert** werden.
es: La pestaña Trafico de Red muestra un gráfico de trafico enviado y recibido a pares en la red a lo largo del tiempo. Puede ajustar el periodo de tiempo usando el deslizador o **Limpiando** el gráfico.

source: The Network Traffic tab of the Dash Core Tools dialog
ar: شريط مرور الشبكة في مربع الحوار أدوات داش كور
de: Der Netzwerkauslastungs-Tab der Dash Core Werkzeugsleiste
es: Pestaña Trafico de Red del cuadro de dialogo de Herramientas de la Dash Core

source: Peers tab
ar: شريط الأقران
de: Gegenstellen-Tab
es: Pestaña Pares

source: The Peers tab shows a list of other full nodes connected to your Dash Core client. The IP address, version and ping time are visible. Selecting a peer shows additional information on the data exchanged with that peer.
ar: شريط الأقران قائمة بالعقد الكاملة الأخرى المتصلة بعميل داش كور. عنوان IP والإصدار ووقت ping مرئيان. إن اختيار النظير يعرض معلومات إضافية عن البيانات المتبادلة مع هذا النظير.
de: Der Gegenstellen-Tab zeigt eine Liste anderer Full Nodes an, die mit dem Dash Core Client verbunden sind. IP-Adresse, Version und Ping-Zeit sind sichtbar. Die Auswahl eines Peers zeigt detaillierte Informationen zu den Daten, die mit einem Peer ausgetauscht wurden.
es: La pestaña Pares muestra una lista de otros nodos completos conectados a su cliente Dash Core. La dirección IP, versión y tiempo de ping son visibles. Seleccionando un par se muestra información adicional sobre los datos intercambiados con ese par.

source: The Peers tab of the Dash Core Tools dialog
ar: شريط الأقران من مربع الحوار أدوات داش كور
de: Der Gegenstellen-Tab der Dash Core Werkzeugleiste
es: Pestaña Pares del cuadro de dialogo de Herramientas de la Dash Core

source: Wallet Repair tab
ar: شريط إصلاح المحفظة
de: Wallet-Reparatur-Tab
es: Pestaña Reparar Billetera

source: The Wallet Repair tab offers a range of startup commands to restore a wallet to a functional state. Selecting any of these commands will restart Dash Core with the specified command-line option.
ar: تقدم شريط إصلاح المحفظة نطاقًا من أوامر بدء التشغيل لاستعادة المحفظة إلى حالة وظيفية. سيؤدي تحديد أي من هذه الأوامر إلى إعادة تشغيل داش كور باستخدام خيار سطر الأوامر المحدد.
de: Der Wallet-Reparatur-Tab zeigt verschiedene Startbefehle an, durch die eine Wallet repariert werden kann. Jeder dieser Befehle startet die Wallet neu und greift dabei auf ein spezifisches Startkommando zurück.
es: La pestaña Reparar Billetera ofrece un rango de comandos de inicio para restaurar una billetera a un estado funcional. Seleccionando cualquiera de estos comandos se reiniciara la Dash Core con la opcion especifica de linea de comando.

source: The Wallet Repair tab of the Dash Core Tools dialog
ar: شريط إصلاح المحفظة في مربع الحوار أدوات داش كور
de: Der Wallet-Reparatur-Tab der Dash Core Werkzeugleiste
es: Pestaña Reparar Billetera del cuadro de dialogo de Herramientas de la Dash Core

source: Salvage wallet
ar: محفظة الإنقاذ
de: Wallet Datenwiederherstellung
es: Salvar billetera

source: Salvage wallet assumes wallet.dat is corrupted and cannot be read. It makes a copy of wallet.dat to wallet.<date>.bak and scans it to attempt to recover any private keys. Check your debug.log file after running salvage wallet and look for lines beginning with "Salvage" for more information on operations completed.
ar: يفترض محفظة الإنقاذ wallet.dat تالفة ولا يمكن قراءتها. يجعل نسخة من wallet.dat إلى محفظة. <date> باك ومسحه في محاولة لاستعادة أي مفاتيح خاصة. تحقق من ملف debug.log بعد تشغيل محفظة النقود وابحث عن الخطوط التي تبدأ بـ "Salvage" لمزيد من المعلومات حول العمليات المكتملة.
de: Die Datenwiederherstellung der Wallet setzt voraus, dass eine wallet.dat korrumpiert wurde und nicht gelesen werden kann. Hierdurch wird eine Kopie der wallet.dat unter wallet.<date>.bak erstellt und ein Scan versucht alle privaten Schlüssel zu extrahieren. Nachdem der Befehl ausgeführt wurde, kann unter debug.log nach Zeilen gesucht werden, die mit „Salvage“ beginnen, damit diesen weitere Informationen über den Abschluss des Vorgangs entnommen werden können.
es: Salvar billetera asume que el archivo wallet.dat esta corrupto y no puede ser leído. Hace una copia del archivo wallet.dat a wallet.<date>.bak y lo escanea para intentar recuperar cualquier llave privada. Revise su archivo debug.log después de correr salvar billetera y busque lineas que comiencen con "Salvaje" para mas información de las operaciones completas.

source: Rescan blockchain files
ar: إعادة فحص ملفات بلوكشين
de: Dateien der Blockchain erneut durchsuchen
es: Volver a escanear los archivos de la cadena de bloques

source: Rescans the already downloaded blockchain for any transactions affecting accounts contained in the wallet. This may be necessary if you replace your wallet.dat file with a different wallet or a backup - the wallet logic will not know about these transactions, so a rescan is necessary to determine balances.
ar: فحص بلوكشين الذي تم تنزيله بالفعل لأية معاملات تؤثر على الحسابات الموجودة في المحفظة. قد يكون هذا ضروريًا إذا قمت باستبدال ملف wallet.dat بمحفظة مختلفة أو نسخة احتياطية - لن يعرف منطق المحفظة عن هذه المعاملات ، لذا من الضروري إعادة المسح لتحديد الأرصدة.
de: Die bereits heruntergeladene Blockchain nach Transaktionen durchsuchen, welche Adressen der Wallet betreffen. Dies kann notwendig werden, wenn die wallet.dat mit einer anderen Wallet oder einem Backup ausgetauscht wird - die Wallet-Logik wird nichts von derartigen Transaktionen wissen, wodurch ein erneuter Scan notwendig ist, um das tatsächliche Guthaben zu bestimmen.
es: Volver a escanear la cadena de bloques ya descargada para cualquier transacción que afecte a las cuentas contenidas en la billetera. Esto puede ser necesario si reemplaza su archivo wallet.dat con una billetera o un respaldo diferentes - la lógica de la billetera no conocerá estas transacciones, por lo que es necesario volver a analizarlas para determinar los saldos.

source: Recover transactions
ar: إسترجاع المعاملات
de: Transaktion wiederherstellen
es: Recuperar transacciones

source: The recover transactions commands can be used to remove unconfirmed transactions from the memory pool. Your wallet will restart and rescan the blockchain, recovering existing transactions and removing unconfirmed transactions. Transactions may become stuck in an unconfirmed state if there is a conflict in protocol versions on the network during PrivateSend mixing, for example, or if a transaction is sent with insufficient fees when blocks are full.
ar: يمكن استخدام أوامر المعاملات استرداد لإزالة المعاملات غير المؤكدة من تجمع الذاكرة. ستتم إعادة تشغيل محفظتك وإعادة فحص بلوكشين واسترداد المعاملات الحالية وإزالة المعاملات غير المؤكدة. قد تتعطل المعاملات في حالة غير مؤكدة إذا كان هناك تعارض في إصدارات البروتوكول على الشبكة أثناء خلط الأرسال المخفي ، على سبيل المثال ، أو إذا تم إرسال معاملة مع رسوم غير كافية عندما تكون الكتل ممتلئة.
de: Durch die Funktion Transaktion wiederherstellen können unbestätigte Transaktionen aus dem Memory Pool entfernt werden. Hierdurch wird die Wallet neu starten und die Blockchain erneut scannen, wodurch existierende Transaktionen erkannt und unbestätigte entfernt werden. Transaktionen können unbestätigt bleiben, falls ein Konflikt zwischen Protokollversionen z.B. während des PrivateSend-Mischvorgangs auftritt oder wenn eine Transaktionen mit nicht ausreichenden Gebühren versandt wird, während der Block bereits voll ist.
es: Los comandos de recuperación de transacciones pueden ser usados para remover transacciones sin confirmar del bloque de memoria. Su billetera se reiniciara y volverá a escanear la cadena de bloques, recuperando las transacciones existentes y removiendo las transacciones sin confirmar. Las transacciones pueden estancarse en un estado sin confirmar si hay conflictos en las versiones de protocolo en la red durante el mezclado de PrivateSend, por ejemplo, o si una transacción es enviada con comisiones insuficientes cuando el bloque esta lleno.

source: Upgrade wallet format
ar: ترقية تنسيق المحفظة
de: Wallet-Format aktualisieren
es: Actualizar el formato de la billetera

source: This command is available for very old wallets where an upgrade to the wallet version is required in addition to an update to the wallet software. You can view your current wallet version by running the ``getwalletinfo`` command in the console.
ar: هذا الأمر متوفر للمحافظ القديمة جدًا حيث يلزم ترقية إصدار المحفظة بالإضافة إلى تحديث لبرنامج المحفظة. يمكنك عرض نسخة المحفظة الحالية الخاصة بك عن طريق تشغيل الأمر ``getwalletinfo`` في وحدة التحكم.
de: Dieser Befehl ist notwendig, wenn die Wallet sehr alt ist und zusätzlich zur Aktualisierung der Wallet Software auch einer Aktualisierung der Wallet Version bedarf. Die aktuelle Version kann herausgefunden werden, wenn der Befehlt ``getwalletinfo`` in der Konsole eingegeben wird.
es: Este comando está disponible para billeteras muy antiguas en las que se requiere una actualización de versión de billetera, además de una actualización del software de billetera. Puedes ver tu versión actual de billetera ejecutando el comando ``getwalletinfo`` en la consola.

source: Rebuild index
ar: إعادة بناء الفهرس
de: Index neu aufbauen
es: Reconstruir indice

source: Discards the current blockchain and chainstate indexes (the database of unspent transaction outputs) and rebuilds it from existing block files. This can be useful to recover missing or stuck balances.
ar: يتجاهل بلوكشين الحالي ومؤشرات chainstate (قاعدة بيانات مخرجات المعاملة غير المنفقة) ويعيد بناءه من ملفات كتلة موجودة. هذا يمكن أن يكون مفيدا لاستعادة الأرصدة المفقودة أو عالقة
de: Hierdurch werden die aktuelle Blockchain und die Chainstate Indixes (die Datenbanken der nicht-ausgegebenen Outputs) verworfen und aus bestehenden Block-Dateien wiederaufgebaut. Dies kann nützlich sein, wenn es darum geht verschollene oder festhängende Guthaben zurückzugewinnen.
es: Descarta la cadena de bloques e indices del estado de la cadena actual (la base de datos de transacciones de salidas de transacción no utilizadas) y reconstruirla de archivos de bloques existentes. Esto puede ser util para recuperar saldos perdidos o estancados.
