Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/interface.po
Languages: ar, de, es

source: Description of dialogs and interfaces in the Dash Core wallet
ar: وصف الحوارات والواجهات في محفظة داش كور
de: Beschreibung der Optionen und Oberflächen der Dash Core Wallet
es: Descripción de diálogos e interfaces en la billetera Dash Core

source: dash, core, wallet, interface, dialog, synchronisation, tools options
ar: داش ، كور ، المحفظة ، واجهة ، الحوار ، التزامن ، خيارات الأدوات.
de: dash, core, wallet, interface, dialog, synchronisierung, werkzeug einstellungen
es: dash, core, billetera, interfaz, dialogo, sincronización, opciones de herramientas

source: Interface
ar: جهة التعامل
es: Interfaz

source: The Dash Core Wallet is an application that runs on your computer and allows you to make transactions on the Dash network. Most transactions are for sending or receiving Dash, but it is also possible to create signed messages or control a masternode, for example. The Dash Core Wallet interface is described in detail in the following sections.
ar: محفظة داش كور عبارة عن تطبيق يعمل على جهاز الكمبيوتر الخاص بك ويسمح لك بإجراء المعاملات على شبكة داش. معظم المعاملات هي لإرسال أو استقبال داش ، ولكن من الممكن أيضا إنشاء رسائل موقعة أو التحكم في ماسترنود ، على سبيل المثال. تم وصف واجهة محفظة داش بالتفصيل في الأقسام التالية.
de: Das Dash Core Wallet ist eine Anwendung, die auf Ihrem Computer läuft und es Ihnen ermöglicht, Transaktionen im Dash-Netzwerk durchzuführen. Die meisten Transaktionen dienen zum Senden oder Empfangen von Dash, aber es ist auch möglich, signierte Nachrichten zu erstellen oder z.B. einen Masternode zu steuern. Das Interface der Dash Core Wallet wird in den folgenden Abschnitten ausführlich beschrieben.
es: La billetera Dash Core es una aplicación que se ejecuta en su computador y le permite hacer transacciones en la red de Dash. La mayoría de las transacciones son para enviar o recibir Dash, pero también es posible crear mensajes firmados o controlar un masternode, por ejemplo. La interfaz de la billetera Dash Core es descrita en detalle en las secciones siguientes.

source: The Main Window
ar: النافذة الرئيسية
de: Das Hauptfenster
es: Ventana Principal

source: The Dash Core Wallet
ar: محفظة داش كور
de: Das Dash Core Wallet
es: La Billetera Dash Core

source: The Dash Core window is broken up into several areas:
ar: يتم تقسيم نافذة لوحة المفاتيح الأساسية إلى عدة مناطق:
de: Das Dash Core Fenster ist in mehrere Bereiche aufgeteilt:
es: Las ventanas de la Dash Core están dividas en varias áreas:

source: The menu bar
ar: شريط القائمة
de: Die Menüleiste
es: Barra de Menú

source: The tab bar
ar: شريط علامات
de: Die Tab-Leiste
es: Barra de pestañas

source: The main area
ar: المجال الرئيسي
de: Der Hauptbereich
es: Área principal

source: The status bar
ar: شريط الحالة
de: Die Statusleiste
es: Barra de estatus

source: The Menu Bar
ar: شريط القائمة
de: Die Menüleiste
es: Barra de Menú

source: The menu bar provides access to all functions of Dash Core. There are four menus available:
ar: يوفر شريط القوائم الوصول إلى جميع وظائف داش كور. هناك أربع قوائم متوفرة:
de: Die Menüleiste bietet Zugriff auf alle Funktionen von Dash Core. Es stehen vier Menüs zur Verfügung:
es: La barra de menú provee acceso a todas las funciones de Dash Core. Hay cuatro menús disponibles:

source: File
ar: ملف
de: Ordner
es: Archivo

source: The File menu is used to manage your wallet, messages and addresses.
ar: يتم استخدام القائمة ملف لإدارة محفظتك والرسائل والعناوين.
de: Das Menü Datei dient zur Verwaltung Ihres Wallets, Ihrer Nachrichten und Adressen.
es: El menú de Archivo es utilizado para manejar su billetera, mensajes y direcciones.

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración

source: The Settings menu provides access to wallet encryption options and general software settings.
ar: توفر قائمة الإعدادات إمكانية الوصول إلى خيارات تشفير المحفظة وإعدادات البرامج العامة.
de: Das Menü Einstellungen bietet Zugriff auf Verschlüsselungsoptionen und allgemeine Softwareeinstellungen.
es: El menú de configuraciones provee acceso a las opciones de encriptación de la billetera y las configuraciones generales del programa.

source: Tools
ar: الأدوات
de: Werkzeuge
es: Herramientas

source: The Tools menu provides information on the network, allows you modify masternode configuration files and other advanced functions.
ar: توفر قائمة الأدوات معلومات على الشبكة ، وتسمح لك بتعديل ملفات تهيئة ماسترنود والوظائف المتقدمة الأخرى
de: Das Menü Extras bietet Informationen über das Netzwerk, erlaubt es Ihnen, die Konfigurationsdateien für Masternode und andere erweiterte Funktionen zu ändern.
es: El menú de Herramientas provee información sobre la red, permite modificar los archivos de configuración de los masternodes y otras funciones avanzadas.

source: Help
ar: مساعدة
de: Hilfe
es: Ayuda

source: The Help menu links to documentation, guides and legal statements relating to Dash Core.
ar: ترتبط قائمة المساعدة بالوثائق والأدلة والبيانات القانونية المتعلقة ببرنامج داش كور.
de: Im Menü Hilfe finden Sie Links zu Dokumentationen, Handbüchern und rechtlichen Hinweisen zu Dash Core.
es: El menú de Ayuda enlaza a la documentación, guías y estatus legales relacionados a Dash Core.

source: The Tab Bar
ar: شريط المهام
de: Die Tab-Leiste
es: La Barra de Pestañas

source: The tab bar is used to quickly switch between the main areas of the Dash Core. The content in the main area of Dash Core changes depending on which tab you have selected. The following tabs are available:
ar: يتم استخدام شريط علامات التبويب للتبديل بسرعة بين المناطق الرئيسية لـ داش كور. يتغير المحتوى الموجود في المنطقة الرئيسية لـ داش كور بناءً على علامة التبويب التي اخترتها. علامات التبويب التالية متوفرة:
de: Die Tab-Leiste dient zum schnellen Umschalten zwischen den Hauptbereichen des Dash Core. Der Inhalt im Hauptbereich von Dash Core ändert sich je nachdem, welche Registerkarte Sie ausgewählt haben. Die folgenden Registerkarten sind verfügbar:
es: La barra de pestañas es usada para cambiar rápidamente entre las principales áreas de la billetera Dash Core. El contenido en el área principal de Dash Core cambia dependiendo de cual pestaña haya seleccionado. Las siguientes pestañas están disponibles:

source: The Overview tab
ar: شريط النظرة العامة
de: Die Registerkarte Übersicht
es: Pestaña General

source: The overview tab offers quick access to your balance and most recent transactions, as well as the PrivateSend feature and options for coin mixing.
ar: توفر شريط "نظرة عامة" وصولاً سريعًا إلى رصيدك وأحدث المعاملات ، فضلاً عن ميزة الإرسال المخفي وخيارات خلط العملات.
de: Die Registerkarte Übersicht bietet schnellen Zugriff auf Ihr Guthaben und die letzten Transaktionen, sowie die PrivateSend-Funktion und Optionen für das Coin-Mixing.
es: La pestaña de descripción general ofrece acceso rápido a su balance y mas recientes transacciones, así como las características de PrivateSend y opciones para el mezclado de monedas.

source: The Dash Core Overview tab
ar: شريط داش كور
de: Die Dash Core Übersicht Registerkarte
es: Pestaña de Descripción General de la billetera Dash Core

source: The left part of the main area is divided into two areas. The upper area shows your balances:
ar: وينقسم الجزء الأيسر من المنطقة الرئيسية إلى منطقتين. تعرض المنطقة العلوية الأرصدة الخاصة بك:
de: Der linke Teil des Hauptbereichs ist in zwei Bereiche unterteilt. Der obere Bereich zeigt Ihr Guthaben an:
es: La parte izquierda del área principal esta divida en dos áreas. El área superior muestra sus balances:

source: Available
ar: متاح
de: Verfügbar
es: Disponible

source: This shows your current liquid balance. This is the amount of Dash you can spend now.
ar: هذا يبين رصيدك الحالي. هذا هو مقدار داش يمكنك أن تنفقه الآن.
de: Hier wird Ihr aktueller Liquiditätssaldo angezeigt. Das ist der Betrag von Dash, den du jetzt ausgeben kannst.
es: Muestra su balance liquido actual. Esta es la cantidad de Dash que usted puede gastar ahora.

source: Pending
ar: في طور الإنجاز
de: Ausstehend
es: Pendiente

source: This shows funds waiting for a transaction to complete.
ar: يوضح هذا الأموال في انتظار اكتمال المعاملة.
de: Hier werden die Beträge angezeigt, die auf den Abschluss einer Transaktion warten.
es: Muestra los fondos en espera por una transacción para ser completada.

source: Immature
ar: غير متاح
de: Unfertig
es: Inmaduro

source: This shows funds from masternode or mining payments which have not yet reached the required number of confirmations.
ar: هذا يدل على الأموال من المدفوعات ماسترنود أو التعدين التي لم تصل بعد إلى العدد المطلوب من التأكيدات.
de: Hier werden Beträge aus Masternode- oder Miningzahlungen angezeigt, die noch nicht die erforderliche Anzahl von Bestätigungen erreicht haben.
es: Muestra los fondos de los pagos de masternode o minería que aun no alcanzan el número requerido de confirmaciones.

source: Total
ar: المجموع
de: Gesamtbetrag

source: This is simply your available and pending funds added together.
ar: هذا هو ببساطة الأموال المتاحة والمعلقة معلقة معا.
de: Dies ist einfach die Summe Ihrer verfügbaren und ausstehenden Beträge.
es: Esto simplemente es la suma de sus fondos disponibles y pendientes.

source: The lower area shows the status of PrivateSend and allows you to mix your funds using the Dash Masternode Network.
ar: تعرض المنطقة السفلية حالة الإرسال المخفي وتسمح لك بمزج أموالك باستخدام شبكة ماسترنود داش.
de: Der untere Bereich zeigt den PrivateSend-Status an und erlaubt das Mischen der Coins durch das Dash Masternode Netzwerk.
es: El área inferior muestra el estatus de PrivateSend y permite mezclar sus fondos usando la de Masternode de Dash.

source: The right part of the screen shows your recent transactions. These are identified by icons as follows:
ar: يعرض الجزء الأيمن من الشاشة معاملاتك الأخيرة. يتم تحديد هذه من خلال الرموز على النحو التالي:
de: Die rechte Seite des Fensters zeigt die letzten Transaktionen an. Diese sind mit den folgenden Symbolen versehen:
es: La parte derecha de la pantalla muestra sus transacciones recientes. Estas se identifican con los iconos siguientes:

source: Recent incoming transactions appear black, prefixed by a + sign
ar: المعاملات الأخيرة الواردة تظهر سوداء ، مسبوقة بعلامة +
de: Die zuletzt eingegangenen Transaktionen sind schwarz und ihnen steht ein + voran
es: Las transacciones entrantes recientes aparecen en negrita, con el signo + como prefijo

source: Recent outgoing transactions appear red, prefixed by a – sign
ar: المعاملات الصادرة الأخيرة تظهر حمراء ، مسبوقة بعلامة -
de: Die zuletzt getätigten Transaktionen sind rot und ihnen steht ein - voran
es: Las transacciones salientes recientes aparecen en rojo con el signo - como prefijo

source: Incoming mining or masternode payments also appear black
ar: كما تظهر التعدينات القادمة أو عمليات ماسترنود في الاتجاه الصعودي باللون الأسود
de: Eingehende Mining- oder Masternode-Zahlungen sind ebenfalls schwarz
es: Pagos entrantes de minería o masternodes también aparecerán en negrita

source: For more details on your transaction history, see the Transactions tab.
ar: لمزيد من التفاصيل حول سجل معاملاتك ، انظر شريط "المعاملات".
de: Weitergehende Details zur Transaktionsgeschichte befinden sich im Transaktions-Tab.
es: Para más detalles de su histórico de transacciones, vaya a la pestaña transacciones

source: The Send Tab
ar: شريط الإرسال
de: Der Überweisen-Tab
es: Pestaña Enviar

source: The Send tab allows you to send funds to another address on the Dash network. It contains fields to enter the recipient’s address, a label for the address, and the amount of Dash you wish to send. Options related to the transaction fee, InstantSend and PrivateSend are also available. A quick view of your total balance is also available in the lower right corner.
ar: تتيح لك علامة التبويب "إرسال" إرسال الأموال إلى عنوان آخر على شبكة داش. يحتوي على حقول لإدخال عنوان المستلم ، وإسم للعنوان ، ومقدار إعلان داش الذي تريد إرساله. تتوفر أيضًا الخيارات المتعلقة برسوم المعاملة ، و الإرسال الفوري و الإرسال المخفي. نظرة سريعة على الرصيد الإجمالي الخاص بك هو متاح أيضا في الزاوية اليمنى السفلى.
de: Der Überweisen-Tab ermöglicht das Versenden eines Betrages an eine andere Adresse im Dash-Netzwerk. Im Tab können die Empfängeradresse, Notizen zu dieser und der Sendungsbetrag eingetragen werden. Zudem gibt es Optionen für die Transaktionsgebühr, InstantSend und PrivateSend. Am unteren rechten Rand des Fensters befindet sich auch eine Anzeige, die das aktuelle Guthaben der Wallet anzeigt.
es: La pestaña enviar le permite enviar fondos a otras direcciones en la red de Dash. Contiene Campos para colocar la dirección del receptor, una etiqueta para la dirección, y la cantidad de Dash que usted desea enviar. Las opciones relacionadas a la comisión de la transacción, InstandSend y PrivateSend también están disponibles. Una vista rápida al total de su balance también está disponible en la esquina inferior derecha.

source: The Send tab
ar: شريط الإرسال
de: Der Überweisen-Tab
es: Pestaña Enviar

source: The Receive Tab
ar: شريط الإستقبال
de: Der Empfangen-Tab
es: Pestaña Recibir

source: The Receive tab allows you to create addresses to receive Dash. You can create a request for a specific amount of Dash or include a specific message, and send it to another user as a link or QR code.
ar: تتيح لك شريط تلقي إنشاء عناوين لتلقي داش. يمكنك إنشاء طلب للحصول على مبلغ محدد من داش أو تضمين رسالة محددة وإرساله إلى مستخدم آخر كحلقة اتصال أو رمز QR.
de: Der Empfangen-Tab ermöglicht es dem Nutzer eine Dash-Adresse zu erstellen. Diese Adresse kann über einen Link oder QR-Code weitergeben werden, der einen spezifischen Betrag oder auch eine Nachricht übermitteln kann.
es: La pestaña recibir le permite crear direcciones para recibir Dash. Puede crear una solicitud para un monto específico de Dash o incluir un mensaje específico, y enviarlo a otro usuario como un link o código QR.

source: The Receive tab
ar: شريط الإستقبال
de: Der Empfangen-Tab
es: Pestaña Recibir

source: The Transactions Tab
ar: شريط المعاملات
de: Der Transaktionen-Tab
es: Pestaña Transacciones

source: The transactions tab shows the entire transaction history for all addresses associated with your wallet. This appears as a table showing the time, type, label and amount of Dash for each transaction. You can also export the transaction history as a CSV file by clicking the Export button in the bottom right corner of the window.
ar: تعرض شريط المعاملات سجل المعاملة بالكامل لكافة العناوين المرتبطة بمحفظة. يظهر هذا كجدول يوضح الوقت ، النوع ، التصنيف ومقدار داش لكل معاملة. يمكنك أيضًا تصدير سجل المعاملات كملف CSV من خلال النقر على الزر تصدير في الجانب السفلي الأيسر من النافذة.
de: Der Transaktionen-Tab zeigt den gesamten Transaktionsverlauf aller Adressen an, die zu der Wallet eines Nutzers gehören. Dies geschieht über eine Tabelle, welche Zeit, Art, Beschreibung und Betragshöhe einer Transaktion anzeigt. Der Transaktionsverlauf kann zudem als CSV-Datei exportiert werden. Hierfür muss der Knopf mit der Aufschrift „Exportieren“ gedrückt werden.
es: La pestaña transacciones muestra el histórico completo de las transacciones para todas las direcciones asociadas con su billetera. Esto aparece como una tabla mostrando la fecha, tipo, etiqueta y monto de Dash para cada transacción. Puede también exportar las transacciones históricas a un archivo CSV clickeando el botón Exportar en la esquina inferior derecha de la ventana.

source: The icons in the leftmost column indicate the status of the transaction. A tick indicates that the recommended number of confirmations has been passed, while a clock indicates that the transaction has yet to reach six confirmations.
ar: تشير الرموز الموجودة في العمود الموجود في أقصى اليمين إلى حالة المعاملة. تشير العلامة إلى أن عدد التأكيدات الموصى به قد تم تمريره ، بينما تشير الساعة إلى أن المعاملة لم تصل بعد إلى ستة تأكيدات.
de: Die Symbole in der linken Spalte zeigen den Status der Transaktion an. Ein Haken bedeutet, dass die notwendige Zahl an Bestätigungen erreicht wurde, während eine Uhr darauf hinweist, dass die Transaktion noch nicht mindestens 6-mal bestätigt wurde.
es: El icono en la columna del mas a la izquierdo indica el estatus de la transacción. Una marca indica que el número recomendado de confirmaciones ha pasado, mientras un reloj indica que la transacción aún debe alcanzar seis confirmaciones.

source: The transactions tab
ar: شريط المعاملات
de: Der Transaktionen-Tab
es: Pestaña transacciones

source: The Status Bar
ar: شريط الحالة
de: Die Statusleiste
es: Barra de Estatus

source: The status bar shows a synchronization progress bar and a row of status icons which indicate the status of your connection to the Dash network.
ar: يعرض شريط الحالة شريط تقدم المزامنة وصفًا من رموز الحالة التي تشير إلى حالة الاتصال بشبكة داش.
de: Die Statusleiste zeigt den Synchronisierungsfortschritt und eine Reihe an Symbolen, welche den Status der Verbindung mit dem Dash-Netzwerk wiedergeben.
es: La barra de estatus muestra una barra de progreso de sincronización y una fila de iconos estatus que indican el estatus de la conexión a la red de Dash

source: The Synchronization Bar
ar: شريم المزامنة
de: Der Synchronisierungsfortschritt
es: Barra de Sincronización

source: This bar shows the synchronization status of Dash Core with the Dash network. Each time you open Dash Core, it will begin downloading the blocks which have been created on the blockchain in the time since you last opened the app. These blocks are downloaded from other Dash users and masternodes. If you have never opened the app before, this could mean several years’ worth of blocks need downloading. The following statuses are possible:
ar: يعرض هذا الشريط حالة التزامن لـ داش كور مع شبكة داش. في كل مرة تفتح فيها داش كور ، سيبدأ تنزيل الكتل التي تم إنشاؤها على بلوكشين في الوقت منذ آخر فتح التطبيق. يتم تنزيل هذه الكتل من مستخدمي داش الآخرين و ماسترنود. إذا لم تكن قد فتحت التطبيق من قبل ، فقد يعني هذا أن العديد من القطع تحتاج إلى تنزيل. الحالات التالية ممكنة:
de: Diese Leiste zeigt den Synchronisierungsstatus der Dash Core Wallet mit dem Dash-Netzwerk an. Jedes mal, wenn Dash Core geöffnet wird, beginnt es damit die Blöcke herunterzuladen, welche seit dem letzten Öffnen der App entstanden sind. Diese Blöcke werden von anderen Dash-Nutzern und den Masternodes bezogen. Wenn die Wallet neu ist, bedeutet dies, dass mehrere Jahre an Blöcken heruntergeladen werden müssen. Die folgenden Statusanzeigen können auftreten:
es: Esta barra muestra el estatus de la sincronización de la Dash Core con la red de Dash. Cada vez que abre la Dash Core, comenzara a descargar los bloques que han sido creados en la cadena de bloques desde la ultima vez que abrió la aplicación. Estos bloques son descargados desde otros usuarios y masternodes Dash. Si nunca ha abierto la aplicación, esto podría significar la necesidad de descargar varios años de bloques. Los siguientes estatus son posibles:

source: No block source available
ar: لا يوجد مصدر كتلة المتاحة
de: Keine Block-Quelle verfügbar
es: Ninguna fuente de bloques disponible

source: This occurs if your internet connection is down, or if the ports required by Dash Core are blocked by a firewall.
ar: يحدث هذا إذا كان اتصال الإنترنت الخاص بك معطلاً ، أو إذا تم حظر المنافذ المطلوبة بواسطة داش كور بواسطة جدار حماية.
de: Dieses Symbol erscheint, wenn keine Internetverbindung besteht oder eine Firewall die Ports verschließt, welche von Dash Core verwendet werden.
es: Esto ocurre si su conexión a internet esta caída, o si los puertos requeridos por la Dash Core son bloqueados por un firewall.

source: Synchronizing with network
ar: التزامن مع الشبكة
de: Synchronisierung mit dem Netzwerk
es: Sincronizando con la red

source: Dash Core is downloading blocks from the network.
ar: داش كور تحمل الكتل من الشبكة
de: Dash Core lädt Blöcke aus dem Netzwerk herunter.
es: Dash Core esta descargando los bloques de la red.

source: Synchronizing masternodes/masternode payments/governance objects
ar: تزامن ماسترنود / ماسترنود المدفوعات / مهمات الحوكمة
de: Synchronisiere Masternodes/Masternode Zahlungs-/Governance-Objekte
es: Sincronizando masternodes/pagos de masternode/objetos de gobierno

source: Dash Core is synchronizing other data with the second layer network.
ar: تعمل داش كور على مزامنة البيانات الأخرى مع شبكة الطبقة الثانية
de: Dash Core synchronisiert zusätzliche Daten mit der zweiten Netzwerksebene
es: Dash Core esta sincronizando otros datos con la segunda capa de red.

source: Once synchronization is complete, the progress bar will disappear and a tick will appear on the right of the status bar.
ar: بمجرد اكتمال المزامنة ، سيختفي شريط التقدم وسيظهر علامة على يمين شريط الحالة.
de: Nachdem der Synchronisierungsvorgang abgeschlossen wurde, verschwindet die Fortschrittsleiste und am rechten Rand der Statusleiste erscheint ein Haken.
es: Una vez que la sincronización esta completa, la barra de progreso desaparecerá y un tilde aparecerá a la derecha de la barra de estatus.

source: The Status Icons
ar: أيقونات الحالة
de: Die Status-Symbole
es: Iconos de Estatus

source: The lock icons indicate the status of your wallet: either locked or unlocked. You need to unlock your wallet to send funds or perform certain other actions.
ar: تشير رموز القفل إلى حالة محفظتك: إما مقفلة أو غير مقفلة. تحتاج إلى إلغاء تأمين محفظتك لإرسال الأموال أو تنفيذ إجراءات معينة أخرى.
de: Das Schloss-Symbol zeigt den Status der Wallet an: entweder verschlossen oder aufgeschlossen. Die Wallet muss aufgeschlossen werden, damit Transaktionen oder bestimmte andere Funktionen durchgeführt werden können.
es: El icono bloqueado indica el estatis de su billetera: ya sea bloqueada o desbloqueada. Necesita desbloquear su billetera para enviar fondos o realizar otras acciones.

source: These icons indicate the quality of your connection to the Dash network. If you cannot connect because of network problems, you will see the icon on the left. More bars indicate more connections to your peers on the network.
ar: تشير هذه الرموز إلى جودة الاتصال بشبكة داش. إذا لم تتمكن من الاتصال بسبب مشاكل في الشبكة ، فسترى الرمز على اليسار. تشير المزيد من الأشرطة إلى مزيد من الاتصالات بأقرانك على الشبكة.
de: Diese Symbole geben die Verbindungsstärke mit dem Dash-Netzwerk wieder. Wenn keine Verbindung hergestellt werden konnte, da Netzwerkprobleme aufgetreten sind, wird das Symbol links erscheinen. Je mehr Striche angezeigt werden, desto stärker ist die Verbindung zu anderen Netzwerksteilnehmern.
es: Este icono indica la calidad de su conexión a la red Dash. Si no puede conectarse por problemas de red, vera el icono a la izquierda. Mas barras indican mas conexiones a sus pares en la red.

source: These icons show the synchronization status of Dash Core with the network. Once synchronization is complete, the refresh icon will become a blue tick.
ar: تعرض هذه الرموز حالة التزامن لـ داش كور مع الشبكة. بمجرد اكتمال المزامنة ، سيصبح رمز التحديث علامة زرقاء.
de: Diese Symbole stellen den Synchronisierungszustand der Dash Core Wallet mit dem Netzwerk da. Sobald die Synchronisierung abgeschlossen wurde, wird aus dem Aktualisierungs-Symbol ein blauer Haken.
es: Estos iconos muestran el estatus de sincronización de la Dash Core con la red. Una vez que la sincronización esta completa, el icono refrescar se convertirá en un tilde azul.

source: These icons indicate whether your wallet is running in hierarchical deterministic (HD) mode or standard mode.
ar: تشير هذه الرموز إلى ما إذا كانت محفظتك تعمل في وضع حتمية هرمية (HD) أم وضع قياسي.
de: Diese Symbole zeigen an, ob die Wallet im hierarchisch-deterministischen (HD) Modus oder im Standardmodus ausgeführt werden.
es: Estos iconos indican si su billetera se esta ejecutando en modo jerárquica determinista (HD) o en modo estandar.

source: The Options Dialog
ar: حوار الخيارات
de: Die Konfigurationseinstellungen
es: Dialogo de Opciones
