Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/interface.po
Languages: ar, de, es

source: This option allows you to specify how much Dash should be kept on balance in a ready-to-use anonymized state, meaning it has already passed through the PrivateSend mixing process. If you do not have sufficient Dash available in your balance of unlocked inputs, the amount will be automatically reduced to the available balance and shown in red in the PrivateSend interface on the Overview tab.
ar: يتيح لك هذا الخيار تحديد كم يجب أن تبقى داش في حالة توازن في حالة مجهولة جاهزة للاستخدام ، مما يعني أنها مرت بالفعل عبر عملية خلط الإرسال المخفي. إذا لم يكن لديك داش كافٍ متوفر في رصيدك من المدخلات غير المؤمَّنة ، فسيتم تخفيض المبلغ تلقائيًا إلى الرصيد المتاح ويظهر باللون الأحمر في واجهة الإرسال المخفي في علامة التبويب نظرة عامة.
de: Diese Funktion ermöglicht es festzulegen wie viel Dash maximal gemischt werden soll, wie viel also maximal über PrivateSend verwendbar sein soll, nachdem es bereits gemischt wurde. Wenn dieses Maximum nicht erreicht werden kann, werden alle verfügbaren Denominationen gemischt und die Gesamtsumme wird im PrivateSend-Interface des Übersicht-Tabs in Rot angezeigt.
es: Esta opción le permite especificar cuanto Dash sera mantenido en balance listo-para-usar en estado anónimo, lo que significa que ya ha pasado por el proceso de mezclado de PrivateSend. Si no tiene suficiente Dash disponible en su balance de entradas desbloqueadas, la cantidad sera automáticamente reducida al balance disponible y se mostrara en rojo en la interfaz PrivateSend en la pestaña General.

source: Network tab
ar: شريط الشبكة
de: Netzwerk-Tab
es: Pestaña Red

source: This tab includes options related to how your connection to the Dash network is made.
ar: تتضمن شريط هذه خيارات مرتبطة بكيفية إجراء اتصالك بشبكة داش.
de: Dieser Tab beinhaltet Optionen zur Verbindungsherstellung mit dem Dash-Netzwerk.
es: Esta pestaña incluye opciones de como se realiza la conexión a la red de Dash.

source: The Network tab of the Dash Core Options dialog
ar: شريط الشبكة في مربع الحوار خيارات الأساسي الأساسية
de: Der Netzwerk-Tab der Dash Core Konfigurationseinstellungen
es: Pestaña Red del cuadro Opciones Dash Core

source: Map port using UPnP
ar: ميناء الخريطة باستخدام UPnP
de: Portweiterleitung via UPnP
es: Mapear puerto usando UPnP

source: This option causes Dash Core to automatically attempt to open and map the client port on your router using `UPnP <https://en.wikipedia.org/wiki/Universal_Plug_and_Play>`__ (Universal Plug and Play). This feature is supported by most modern home routers and will allow you to connect to the Dash network without making any special settings on your router.
ar: يؤدي هذا الخيار إلى قيام داش كور بمحاولة فتح منفذ العميل وتعيينه تلقائيًا على الموجه باستخدام `UPnP <https://en.wikipedia.org/wiki/Universal_Plug_and_Play>` __ (التوصيل والتشغيل العالمي). هذه الميزة مدعومة من قبل معظم أجهزة التوجيه المنزلية الحديثة وسوف تسمح لك بالاتصال بشبكة داش دون القيام بأي إعدادات خاصة على جهاز التوجيه الخاص بك.
de: Durch diese Option wird Dash Core eine automatische Portweiterleitung über den Router mit `UPnP <https://en.wikipedia.org/wiki/Universal_Plug_and_Play>`__ (Universal Plug and Play) einrichten. Diese Funktion ist bei den meisten modernen Routern verfügbar und erlaubt eine Verbindung zum Dash-Netzwerk, ohne, dass spezielle Einstellungen am Router geändert werden müssen.
es: Esta opción hace que la Dash Core automáticamente intente abrir y mapear el puerto cliente en su router usando `UPnP <https://en.wikipedia.org/wiki/Universal_Plug_and_Play>`__ (Universal Plug and Play). Esta característica es soportada por los routers caseros mas modernos y le permitirán conectarse a la red Dash sin hacer ninguna configuración especial en su router.

source: Allow incoming connections
ar: السماح بالاتصالات الواردة
de: Eingehende Verbindungen erlauben
es: Permitir conexiones entrantes

source: This option causes your client to accept external connections. Since Dash is a peer-to-peer network and Dash Core is considered a full client because it stores a copy of the blockchain on your device, enabling this option helps other clients synchronize the blockchain and network through your node.
ar: يتسبب هذا الخيار في قبول العميل للاتصالات الخارجية. بما أن داش هي شبكة نظير إلى نظير ، فإن داش كور يعتبر عميل كامل لأنه يخزن نسخة من بلوكشين على جهازك ، مما يساعد هذا الخيار على مساعدة العملاء الآخرين على مزامنة بلوكشين والشبكة من خلال العقدة.
de: Diese Option lässt den Client eine externe Verbindung akzeptieren. Da Dash ein Peer-to-Peer-Netzwerk ist und Dash Core ein Full-Client, da es die gesamte Blockchain auf dem Gerät speichert, wird diese Funktion zur Blockchain- und Netzwerk-Synchronisierung mit anderen Clients über den eigenen Knoten verwendet.
es: Esta opción hace que su cliente acepte conexiones externas. Dash es una red punto-a-punto y Dash Core es considerada un cliente completo porque almacena una copia de la cadena de bloques en su dispositivo, habilitando esta opción ayuda a otros clientes a sincronizar la cadena de bloques y la red a través de su nodo.

source: Connect through SOCKS5 proxy (default proxy)
ar: الاتصال عبر وكيل SOCKS5 (الوكيل الافتراضي)
de: Über einen SOCKS5-Proxy verbinden (Standardproxy)
es: Conectar a través de proxy SOCKS5 (proxy predeterminado)

source: These options allow users on an intranet requiring a proxy to reach the broader internet to specify the address of their proxy server to relay requests to the internet. Contact your system administrator or check out the network settings in your web browser if you are unable to connect and suspect a proxy may be the source of the problem.
ar: تسمح هذه الخيارات للمستخدمين على الإنترانت بطلب وكيل للوصول إلى الإنترنت الأوسع لتحديد عنوان الخادم الوكيل الخاص بهم لنقل الطلبات إلى الإنترنت. اتصل بمسؤول النظام أو تحقق من إعدادات الشبكة في متصفح الويب الخاص بك إذا كنت غير قادر على الاتصال وتشك في أن الوكيل قد يكون مصدر المشكلة
de: Diese Option ermöglicht es Nutzern, die sich in einem Intranet befinden, über einen Proxy eine Verbindung zum allgemeinen Internet herzustellen, indem sie die Adresse des Proxy-Servers, der Anfragen an das Internet weiterleitet, spezifizieren. Bei Problemen mit der Herstellung einer Verbindung, bei denen ein Proxy das Problem darstellen könnte, sollte der Systemadministrator kontaktiert werden oder eine entsprechende Einstellung im Internetbrowser gesucht werden.
es: Estas opciones permiten a los usuarios de una intranet que requieren de un proxy para llegar a internet, especificar la dirección de su servidor proxy para transmitir las solicitudes a Internet. Contacte a su administrador de sistema o revise la configuración de su red en su navegador web si no puede conectarse y sospecha que un proxy puede ser la fuente del problema.

source: Use separate SOCKS5 proxy to reach peers via Tor hidden services
ar: استخدم بروكسي SOCKS5 منفصل للوصول إلى الأقران عبر خدمات تور المخفية
de: Separaten SOCKS5-Proxy verwenden, um Gegenstellen über versteckte Tor-Dienste zu erreichen
es: Utilizar un proxy SOCKS5 separado para llegar a los pares a través de los servicios ocultos de Tor

source: These options allow you to specify an additional proxy server designed to help you connect to peers on the Tor network. This is an advanced option for increased privacy and requires a Tor proxy on your network. For more information about Tor, see `here <https://www.torproject.org/>`__.
ar: تتيح لك هذه الخيارات تحديد خادم وكيل إضافي مصمم لمساعدتك في الاتصال بأقرانك على شبكة تور. هذا هو خيار متقدم لزيادة الخصوصية ويتطلب وكيل تور على شبكتك. لمزيد من المعلومات حول تور ، راجع `هنا <https://www.torproject.org/>`__.
de: Diese Funktion ermöglicht es einen zusätzlichen Proxy-Server einzugeben, welcher dafür geschaffen ist sich über das Tor-Netzwerk mit den Peers zu verbinden. Diese erweiterte Option dient dazu einen höheren Grad an Privatsphäre zu erreichen und sie bedarf eines Tor-Proxys im eigenen Netzwerk. Weitere Informationen über Tor sind `hier <https://www.torproject.org/>`__ zu finden.
es: Estas opciones le permiten especificar un servidor proxy adicional diseñado para ayudar a conectarse a los pares en la red Tor. Esta en una opción avanzada para incrementar la privacidad y requiere un proxy Tor en su red. Para mas información acerca de Tor, vea `aquí <https://www.torproject.org/>`__.

source: Window tab
ar: النافدة الرئيسية
de: Programmfenster-Tab
es: Pestaña Ventana

source: This option contains options governing behavior of the Dash Core app window under Microsoft Windows.
ar: يحتوي هذا الخيار على خيارات تحكم سلوك نافذة تطبيق داش كور ضمن ويندوز ميكروسوفت.
de: Diese Option behandelt Funktionen, die sich auf das Verhalten des Dash Core Programmfensters unter Microsoft Windows auswirken.
es: Esta opción contiene opciones que rigen el comportamiento de la ventana de la aplicación Dash Core en Microsoft Windows.

source: The Window tab of the Dash Core Options dialog
ar: خيارات النافدة الرئيسية لداش كور
de: Der Programmfenster-Tab der Dash Core Konfigurationseinstellungen
es: Pestaña Ventana del cuadro de dialogo Opciones de la Dash Core

source: Hide tray icon
ar: إخفاء الأيقونة
de: Infosymbol verbergen
es: Ocultar el icono de la bandeja

source: When this option is enabled, Dash Core will not display an icon in the system tray. This option cannot be selected at the same time as **Minimize to the tray instead of the taskbar**.
ar: عند تمكين هذا الخيار ، لن تعرض داش كور رمزًا في علبة النظام. لا يمكن تحديد هذا الخيار في نفس الوقت **تصغير إلى الدرج بدلاً من شريط المهام**.
de: Wenn diese Option gewählt wurde, wird kein Dash Core Symbol in der Taskleiste erscheinen. Diese Option kann nicht gleichzeitig mit der Option **In den Infobereich anstatt in die Taskleiste minimieren** gewählt werden.
es: Cuando esta opción este activa, la Dash Core no mostrara icono en la bandeja del sistema. Esta opción no puede ser seleccionada al mismo tiempo que **Minimizar a la en vez de la barra de tarea**.

source: Minimize to the tray instead of the taskbar
ar: تصغير إلى علبة بدلاً من شريط المهام
de: In den Infobereich anstatt in die Taskleiste minimieren
es: Minimizar en la bandeja en vez de en la barra de tarea

source: When this option is enabled and the Dash Core window is minimized, it will no longer appear in your taskbar as a running task. Instead, Dash Core will keep running in the background and can be re-opened from the Dash icon in the system tray (the area next to your system clock). This option cannot be selected at the same time as **Hide tray icon**.
ar: عند تمكين هذا الخيار وتقليص إطار داش كور ، لن يظهر في شريط المهام كمهمة قيد التشغيل. بدلاً من ذلك ، سيستمر تشغيل داش كور في الخلفية ويمكن إعادة فتحه من رمز داش في علبة النظام (المنطقة المجاورة لساعة النظام). لا يمكن تحديد هذا الخيار في نفس الوقت مثل **إخفاء الأيقونة**.
de: Diese Option führt dazu, dass Dash Core nicht länger in der Taskleiste erscheint, nachdem das Fenster minimiert wurde. Stattdessen wird Dash Core im Hintergrund weiterlaufen und das Fenster kann über das Dash-Symbol im Infobereich geöffnet werden (der Bereich neben der Uhrzeitanzeige). Diese Option kann nicht gleichzeitig mit **Infosymbol verbergen** ausgewählt werden.
es: Cuando esta opción este activa y la ventana de la Dash Core este minimizada, no aparecerá mas en su barra de tareas como una tarea en ejecución. En cambio Dash Core se mantendrá en ejecución en segundo plano y podrá se re-abierto desde el icono de Dash en la bandeja de sistema (el área cercana al reloj del sistema). Esta opción no puede ser seleccionada al mismo tiempo que **Ocultar icono en la bandeja**.

source: Minimize on close
ar: تصغير عند الإغلاق
de: Beim Schließen minimieren
es: Minimizar al cerrar

source: When this option is enabled, clicking the X button in the top right corner of the window will cause Dash Core to minimize rather than close. To completely close the app, select **File > Exit**.
ar: عند تمكين هذا الخيار ، يؤدي النقر فوق الزر X الموجود في الركن العلوي الأيسر من الإطار إلى تقليل داش كور بدلاً من إغلاقه. لإغلاق التطبيق تمامًا ، حدد **ملف> خروج**.
de: Sollte diese Option ausgewählt werden, führt das drücken des X-Knopfs am oberen rechten Rand des Bildschirms dazu, dass Dash Core minimiert und nicht geschlossen wird. Um das Programm zu schließen, muss dann stattdessen **Datei > Beenden** ausgewählt werden.
es: Cuando esta opción esta activada, cliqueando el botón X en la esquina superior derecha de la ventana hará que la Dash Core se minimice en vez de cerrarse. Para cerrar completamente la aplicación, seleccione **Archivo > Salir**.

source: Display tab
ar: شريط العرض
de: Anzeige-Tab
es: Pestaña Visualización

source: This tab contains options relating to the appearance of the Dash Core app window.
ar: تحتوي علامة التبويب هذه على خيارات تتعلق بمظهر نافذة تطبيق داش كور.
de: Diese Option behandelt Funktionen, die sich auf das Aussehen des Dash Core Programmfensters auswirken.
es: Esta pestaña contiene opciones relacionadas a la apariencia de la ventana de la aplicación Dash Core.

source: The Display tab of the Dash Core Options dialog
ar: شريط عرض في مربع الحوار خيارات الأساسي الأساسية
de: Der Anzeige-Tab der Dash Core Konfigurationseinstellungen
es: Pestaña Visualización del cuadro de dialogo Opciones de la Dash Core

source: User interface language
ar: لغة واجهة المستخدم
de: Sprache der Benutzeroberfläche
es: Idioma de la interfaz de usuario

source: Select your preferred language from this drop-down menu. Changing the language requires you to restart the Dash Core app.
ar: اختر لغتك المفضلة من هذه القائمة المنسدلة. يتطلب تغيير اللغة إعادة تشغيل تطبيق داش كور.
de: Die bevorzugte Benutzeroberfläche kann über ein Menü ausgewählt werden. Nachdem die Sprache geändert wurde, muss die Dash Core Wallet neu gestartet werden.
es: Seleccione su idioma preferido del menú desplegable. Cambiar el idioma requiere que reinicie la aplicación Dash Core.

source: User interface theme
ar: موضوع واجهة المستخدم
de: Design/Thema der Benutzeroberfläche
es: Tema de la Interfaz de Usuario

source: You can use this option to select a different theme governing the appearance of the Dash Core window. All functionality is identical under the different themes, although the default Dash-light theme is most recent and most likely to work without any display artifacts.
ar: يمكنك استخدام هذا الخيار لتحديد نسق مختلف يحكم مظهر نافذة داش كور. تتشابه جميع الوظائف مع المظاهر المختلفة ، على الرغم من أن المظهر الافتراضي للضوء من نوع Dash-light هو الأكثر حداثة ويعمل على الأرجح بدون أي عناصر عرض.
de: Diese Option kann dazu verwendet werden, verschiedene Designs auszuwählen, die das Aussehen des Dash Core Fensters verändern. Die Funktionen sind in den unterschiedlichen Designs identisch, doch das Dash-Light Design ist das aktuellste und führt am unwahrscheinlichsten zu Anzeigefehlern.
es: Puede usar esta opción para seleccionar un tema diferente que rija la apariencia de la ventana de Dash Core. Todas el funcionamiento es idéntico bajo un tema diferente, aunque el tema predeterminado Dash-light es más reciente y es más probable que funcione sin artefactos de visualización.

source: Unit to show amounts in
ar: وحدة لإظهار المبالغ في
de: Einheit der Beträge
es: Unidad para mostrar cantidades

source: This allows you to change the default unit of currency in Dash Core from DASH to mDASH, µDASH or duffs. Each unit shifts the decimal separator three places to the right. Duffs are the smallest unit into which Dash may be separated.
ar: يسمح لك هذا بتغيير الوحدة الافتراضية للعملة في داش كور من داش إلى mDASH أو µDASH أو duffs. تقوم كل وحدة بنقل الفاصل العشري إلى ثلاثة أماكن على اليمين. Duffs هي أصغر وحدة يمكن فصل داش عنها.
de: Diese Option ändert die Standardeinheit, in der Dash Core Beträge anzeigt, von DASH auf mDASH, µDASH oder Duffs. Jede Einheit verschiebt die Dezimalstelle weitere 3 Stellen nach rechts. Duffs sind die kleinste Einheit, in die Dash aufgeteilt werden kann.
es: Esto le permite cambiar la unidad de divisa predeterminada en la Dash Core desde DASH hasta mDASH, µDASH o duffs. Cada unidad cambia el separador decimal tres espacios a la derecha. Duffs son la unidad mas pequeña en la que Dash puede ser separada.

source: Decimal digits
ar: أرقام عشرية
de: Dezimalziffern
es: Dígitos decimales

source: This option allows you to select how many decimal digits will be displayed in the user interface. This does not affect internal accounting of your inputs and balance.
ar: يتيح لك هذا الخيار تحديد عدد الأرقام العشرية التي سيتم عرضها في واجهة المستخدم. هذا لا يؤثر على المحاسبة الداخلية من المدخلات الخاصة بك والتوازن.
de: Diese Option ermöglicht eine Änderung der Dezimalstellen, die in der Wallet angezeigt werden. Hierdurch wird nicht der reale Gesamtbetrag der vorhandenen Beträge beeinflusst.
es: Esta opción le permite seleccionar cuantos decimales se mostraran en la interfaz de usuario. Esto no afecta la contabilidad interna de sus entradas y balance.

source: Third party transaction URLs
ar: عناوين لجهات خارجية
de: Externe Transaktions-URLs
es: URLs de transacciones de terceros

source: This option allows you to specify and external website to inspect a particular address or transaction on the blockchain. Several blockchain explorers are available for this. To use this feature, enter the URL of your favorite blockchain explorer, replacing the %s with the transaction ID. You will then be able to access this blockchain explorer directly from Dash Core using the context menu of any given transaction.
ar: يتيح لك هذا الخيار تحديد موقع ويب خارجي لفحص عنوان أو معاملة معينة على بلوكشين. يتوفر العديد من المستكشفين بلوكشين لهذا الغرض. لاستخدام هذه الميزة ، أدخل عنوان الخاص بك مستكشف بلوكشين المفضل ، واستبدال %s مع معرف المعاملة. ستتمكن بعد ذلك من الوصول إلى مستكشف بلوكشين مباشرة من داش كور باستخدام قائمة السياق لأي معاملة معينة.
de: Diese Option ermöglicht es eine Website auszuwählen, mit deren Hilfe eine bestimmte Adresse oder Transaktion auf der Blockchain angezeigt wird. Hierfür gibt es verschiedene Blockchain-Explorer. Um auf einen Blockchain-Explorer zuzugreifen, muss dessen URL hier eingetragen werden und die %s muss durch die Transaktions-ID ersetzt werden. Über das Kontextmenü jeder beliebigen Transaktion kann Dash Core hierdurch direkt auf den Blockchain-Explorer zugreifen.
es: Esta opción le permite especificar una pagina web externa para inspeccionar una dirección particular o transacción en la cadena de bloques. Varios exploradores cadena de bloques están disponibles para esto. Para usar esta característica, ingrese la URL de su explorador cadena de bloques favorito, reemplazando el %s con el ID de transacción. A continuación, podrá acceder a este explorador cadena de bloques directamente desde la Dash Core usando el menú de contexto de cualquier transacción.

source: The Tools Dialog
ar: حوار الأدوات
de: Die Werkzeugsleiste
es: Cuadro de dialogo Herramientas

source: This documentation describes the functionality of the Dash Core Tools dialog, available under the **Tools** menu in Dash Core.
ar: تصف هذه الوثائق وظيفة مربع حوار أدوات داش كور ، المتوفر تحت قائمة **الأدوات** في داش كور
de: Diese Dokumentation beschreibt die Dash Core Werkzeugsleiste, die sich unter **Werkzeuge** im Dash Core Menü befindet.
es: Esta documentación describe las funcionalidades del cuadro de dialogo Herramientas de la Dash Core, disponible en el menú **Herramientas** en la Dash Core.

source: Information tab
ar: شريط المعلومات
es: Pestaña Información

source: The Information tab of the Dash Core Tools dialog
ar: شريط المعلومات في مربع الحوار أدوات داش كور
de: Der Information-Tab der Dash Core Werkzeugsleiste
es: Pestaña Información del cuadro de dialogo de Herramientas de la Dash Core

source: General
ar: عموما
de: Allgemein

source: This section displays information on the name and version of the client and database, and the location of the current application data directory.
ar: يعرض هذا القسم معلومات عن اسم وإصدار العميل وقاعدة البيانات ، وموقع دليل بيانات التطبيق الحالي.
de: Dieser Abschnitt führt Informationen über den Namen und die Version des Clients und der Datenbank sowie den momentanen Speicherort der Anwendung.
es: Esta sección muestra información en el nombre y versión del cliente y la base de datos, y la localización actual del directorio de datos de la aplicación.

source: Network
ar: الشبكة
de: Netzwerk
es: Red

source: This section displays information and statistics on the network to which you are connected.
ar: يعرض هذا القسم المعلومات والإحصائيات على الشبكة التي تتصل بها.
de: Dieser Abschnitt führt Informationen und Statistiken zu dem Netzwerk, mit welchem der Client verbunden ist.
es: Esta seccion muestra información y estadisticas de la red a la que esta conectada.

source: Block chain
ar: بلوكشين
es: Cadena de bloques

source: This section shows the current status of the blockchain.
ar: يوضح هذا القسم الوضع الحالي لـ بلوكشين
de: Dieser Abschnitt zeigt den momentanen Status der Blockchain an.
es: Esta sección muestra el estatus actual de la cadena de bloques.

source: Memory pool
ar: تجمع الذاكرة
es: Bloque de memoria

source: This section shows the status of the memory pool, which contains transactions that could not yet be written to a block. This includes both transactions created since the last block and transactions which could not be entered in the last block because it was full.
ar: يعرض هذا القسم حالة تجمع الذاكرة ، الذي يحتوي على معاملات لا يمكن كتابتها بعد إلى كتلة. يتضمن هذا كلا المعاملات التي تم إنشاؤها منذ آخر كتلة والمعاملات التي تعذر إدخالها في آخر كتلة لأنها كانت ممتلئة.
de: Dieser Abschnitt zeigt den Status des Memory Pools an, welcher Transaktionen führt, die noch nicht in einen Block geschrieben werden konnten. Dies umfasst sowohl Informationen, die seit dem letzten Block neu hinzukamen, sowie Informationen, die die Speicherkapazität des letzten Blocks überschritten hatten.
es: Esta sección muestra el estatus del bloque de memoria, que contiene las transacciones que aun no pudieron ser escritas en un bloque. Esto incluye ambas, transacciones creadas desde el ultimo bloque y transacciones que no pudieron entrar en el ultimo bloque porque estaba lleno.

source: Open debug log file
ar: فتح ملف سجل التصحيح
de: Debugprotokolldatei öffnen
es: Abrir archivo de registro de depuración

source: This button opens debug.log from the application data directory. This file contains output from Dash Core which may help to diagnose errors.
ar: يفتح هذا الزر debug.log من دليل بيانات التطبيق. يحتوي هذا الملف على إخراج من داش كور والذي قد يساعد في تشخيص الأخطاء.
de: Dieser Knopf öffnet die Datei debug.log aus dem Speicherort der Anwendung. Diese Datei beinhaltet Angaben der Dash Core Wallet, die beim Finden eines Fehlers helfen können.
es: Este botón abre debug.log desde el directorio de datos de la aplicación. Este archivo contiene salidas de la Dash Core que pueden ayudar a diagnosticar errores.

source: Console tab
ar: شريط وحدة التحكم
de: Konsole-Tab
es: Pestaña Consola
