Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/privatesend-instantsend.po
Languages: ar, es, zh_cn

source: You can only use PrivateSend for payments once you have mixed enough Dash to make up the amount you are trying to send. Because the mixing process takes time, it must be done in advance before you create the send transaction. A PrivateSend transaction is effectively the same as any other transaction on the blockchain, but it draws only from input addresses where the denomination has previously been mixed to ensure anonymity of funds. Because several input addresses are usually required to make up the amount you are trying to send, a PrivateSend transaction will usually take up more space (in kilobytes) on the blockchain, and therefore will be charged a slightly higher fee.
ar: يمكنك فقط استخدام الإرسال المخفي للدفعات بمجرد أن يكون لديك ما يكفي من داش لتعويض المبلغ الذي تحاول إرساله. نظرًا لأن عملية المزج تستغرق وقتًا ، فيجب إجراؤها مقدمًا قبل إنشاء معاملة الإرسال. تعتبر معاملة الإرسال المخفي هي نفسها تمامًا مثل أي معاملة أخرى على بلوكشين ، ولكنها ترسم فقط من عناوين المدخلات التي سبق أن اختلطت فيها التسمية لضمان إخفاء الأموال. نظرًا لأن العديد من عناوين الإدخال مطلوبة عادةً لتعويض المبلغ الذي تحاول إرساله ، فعادة ما تشغل صفقة الإرسال المخفي مساحة أكبر (بالكيلو بايت) على بلوكشين ، وبالتالي سيتم تحصيل رسوم أعلى قليلاً.
es: Solo puedes usar PrivateSend para pagos una vez que hayas mezclado suficientes Dash para compensar el monto que estás tratando de enviar. Debido a que el proceso de mezcla lleva tiempo, debe hacerse por adelantado antes de crear la transacción de envío. Una transacción de PrivateSend es efectivamente igual a cualquier otra transacción en el blockchain, pero solo se basa en las direcciones de entrada donde la denominación se ha mezclado previamente para garantizar el anonimato de los fondos. Debido a que generalmente se requieren varias direcciones de entrada para compensar la cantidad que estás tratando de enviar, una transacción de PrivateSend generalmente ocupará más espacio (en kilobytes) en la cadena de bloques y, por lo tanto, se te cobrará una comisión ligeramente más alta.
zh_cn: 在完成既定额度的混币之后，用户可以使用匿名发送功能来完成支付了。由于混币流程需要时间，因此用户必须在创建交易之前就提前完成混币。匿名发送交易和其它类型的交易在区块链上的有效性是一样的，不同之处在于前者的资金是在输入地址上抽取的，并因此实现了匿名性。由于不同的输入地址上的资金共同构成了匿名发送，因此匿名发送就会占用更大的区块链空间（千字节）。正因为这样，使用匿名发送功能的用户需要支付比普通交易稍高的费用。

source: To send a payment using PrivateSend, go to the **Send** tab of the Dash Core wallet and enable the **PrivateSend** option. The balance displayed will change to show your PrivateSend balance instead of the total balance. You can then enter the **Pay To** address, **Label**, **Amount** and click **Send** as usual. Your payment will be rounded up to completely spend the lowest possible denomination of mixed balance available (currently to the nearest 0.01 DASH). You will be prompted to enter your password and receive a detailed breakdown of the fee structure for PrivateSend before sending.
zh_cn: 需要使用匿名发送功能的用户应打开Dash Core钱包的\ **发送**\ 选项卡，并启用\ **匿名发送**\ 选项。此时，钱包上显示的余额将从资金的总余额变为匿名发送的金额。用户可以输入\ **发送至**\ 的地址、\ **标签**\ 和\ **金额**\ ，再点击\ **发送**\ 。用户的匿名发送金额将累加至所需的最小面值（当前发送的最小额度是0.01个达世币）。接下来，用户将会被提示输入密码，并在发送之前收到发送款项的具体组成部分。

source: Dash Core ready to send a PrivateSend transaction. Note PrivateSend is enabled and the amount to be sent is less than the available PrivateSend balance
ar: داش كور جاهز لإرسال معاملة الإرسال المخفي. ملاحظة تم تمكين الإرسال المخفي والمبلغ الذي سيتم إرساله أقل من رصيد الإرسال المخفي المتوفر
es: Dash Core listo para enviar una transacción de PrivateSend. Nota que PrivateSend está habilitado y el monto que se enviará es menor que el saldo de PrivateSend disponible
zh_cn: Dash Core钱包已经做好了匿名发送的准备。值得注意的是，匿名发送功能已经启用了，发送的金额比余额少

source: InstantSend
ar: إرسال فوري
zh_cn: 即时支付

source: Introduction
ar: المقدمة
es: Introducción
zh_cn: 介绍

source: This documentation describes how to use InstantSend to instantly send funds to any other Dash user around the world. Dash InstantSend is supported by many wallets and vendors, including (but not limited to) the following:
ar: توضح هذه الوثائق كيفية استخدام الإرسال الفوري لإرسال الأموال على الفور إلى أي مستخدم داش آخر حول العالم. يتم دعم داش الإرسال الفوري من قبل العديد من المحافظ والبائعين ، بما في ذلك (على سبيل المثال لا الحصر) ما يلي:
es: Esta documentación describe cómo usar InstantSend para enviar fondos instantáneamente a cualquier otro usuario de Dash alrededor de todo el mundo. Dash InstantSend es compatible con muchas billeteras y proveedores, incluidos (entre otros) los siguientes:
zh_cn: 本文档阐述了如何使用即时发送功能立即完成对全球其它用户的支付。达世币的即时发送功能涉及多个钱包和代理服务器，其中包括（不仅限）：

source: Dash Core Wallet
ar: محفظة داش كور
es: Billetera Dash Core
zh_cn: 达世币核心钱包

source: Dash Android Wallet
ar: محفظة الدش في الأندرويد
es: Cartera Dash para Android
zh_cn: 达世币安卓钱包

source: Dash iOS Wallet
ar: محفظة داش في الأيفون
es: Cartera Dash para iOS
zh_cn: 达世币iOS钱包

source: Dash Copay Wallet
zh_cn: 达世币Copay钱包

source: and many more...
ar: و أكثر من ذلك بكثير...
es: y muchos más...
zh_cn: 还有更多...

source: You can read more about InstantSend theory and processes :ref:`here <instantsend>`.
ar: يمكنك قراءة المزيد عن نظرية وعمليات الإرسال الفوري :ref:`هنا <instantsend>`.
es: Puedes leer más sobre la teoría y procesos de InstantSend :ref:`aquí <instantsend>`.
zh_cn: 请\ :ref:`点击此处 <instantsend>`\ 阅读有关即时发送功能的更多理论知识和应用流程。

source: Paying with InstantSend
ar: إدفع عن طريق الإرسال الفوري
es: Pago con InstantSend
zh_cn: 通过即时发送支付

source: InstantSend functions by setting a flag on the transaction, causing deterministic selection of a quorum of 10 masternodes for each input spent in an InstantSend transaction. The masternodes examine the input, and if a majority determines it has at least six confirmations, they then accept the transaction. The input is then locked until the transaction has been confirmed in six mined blocks, at which point the output can be used as an input in another InstantSend transaction. This differs from inputs used in normal transactions, which can be spent after just one confirmation regardless of whether the Dash was received using InstantSend or not. A higher fee will be charged for InstantSend transactions, according to the :ref:`fee schedule <fees>`. Note that the receiving wallet must also be aware of InstantSend in order to be able to immediately continue with the transaction or display an appropriate notification that the transaction should be considered locked. If the receiving wallet is not aware of InstantSend, it will simply appear as a normal transaction and you will need to wait for standard block confirmations.
zh_cn: 即时发送功能通过在交易中标记，从而选定即时发送交易的各项输入所需的10个主节点组成仲裁链。这些主节点可以检验交易输入，如果大部分主节点都认定交易至少经过了六次确认，那么仲裁连就会认可该交易。接下来，达世币交易输入将会锁定，直到它在六个已挖的区块上完成确认，这样，相应交易的输出才能用作其它即时支付的输入。这一设置和其它普通交易的输入不同——不管收款方是否使用即时发送功能，普通交易在完成一次交易确认之后就可以用于其它交易了。根据\ :ref:`费率标准 <fees>`\ 的要求，使用即时发送功能的用户需要缴纳稍高的交易费用。值得注意的是，收款方的钱包必须知悉即时发送的资讯，以便立即继续完成交易或公告交易可被视作已锁定。如果收款的钱包并未知悉即时发送的资讯，那么即时发送将以普通发送的名义出现，并且需要根据要求等待区块确认完成。

source: To pay with InstantSend, simply check the relevant checkbox in your app. The following screenshots indicate where this setting can be found in the Dash Core, iOS and Android wallets.
ar: للدفع باستخدام الإرسال الفوري ، ما عليك سوى التحقق من مربع الاختيار المناسب في تطبيقك. توضح لقطات الشاشة التالية أين يمكن العثور على هذا الإعداد في محافظ داش كور و الأيفون و الأندرويد.
es: Para pagar con InstantSend, simplemente marca la casilla correspondiente en tu aplicación. Las siguientes capturas de pantalla indican dónde se puede encontrar esta configuración en las billeteras Dash Core en iOS y en Android.
zh_cn: 如需使用即时发送功能，用户只要选中应用中的相关复选框就可以了。以下截屏显示了在Dash Core钱包、IOS和安卓钱包中找到相关设置的位置。

source: Dash Wallets showing InstantSend option
ar: داش محافظ تظهر خيار الإرسال الفوري
es: Billeteras de Dash muestran la opción InstantSend
zh_cn: 达世币钱包中显示即时发送功能的选项

source: Wallet funds were broken into PrivateSend denominations (Step 1 :ref:`here <privatesend>`)
ar: تم تقسيم أموال المحفظة إلى فئات الإرسال المخفي (الخطوة 1 :ref:`هنا <privatesend>`)
es: Los fondos de la billetera se dividen en denominaciones de PrivateSend (Paso 1 :ref:`aquí <privatesend>`)

source: A transaction was sent to a masternode in order to participate in a mixing session (Step 3 :ref:`here <privatesend>`)
ar: تم إرسال معاملة إلى ماسترنود للمشاركة في جلسة خلط (الخطوة 3 :ref:`هنا <privatesend>`)
es: Una transacción fue enviada a un masternode para participar en una sesión de mezcla (Paso 3 :ref:`aquí <privatesend>`)

source: My Dash Wallet
ar: محفظتي لداش
es: Mi billetera de Dash
