Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/privatesend-instantsend.po
Languages: ar, es, zh_cn

source: Using InstantSend and PrivateSend with Dash
ar: باستخدام الأرسال الفوري و الإرسال المخفي مع داش
es: Usando InstantSend y PrivateSend con Dash
zh_cn: 使用达世币即时支付和匿名支付

source: dash, core, mobile, wallet, privatesend, instantsend
ar: داش، كور، هاتف، محفظة، الإرسال المخفي، الإرسال الفوري
es: dash, core, movil, billetera, privatesend, instantsend
zh_cn: dash，core，移动，钱包，匿名支付，即时支付

source: PrivateSend and InstantSend
ar: الإرسال المخفي و الإرسال الفوري
es: PrivateSend e InstantSend
zh_cn: 匿名发送和即时发送

source: PrivateSend
ar: الإرسال المخفي
zh_cn: 匿名支付

source: This documentation describes how to use Dash Core to send Dash anonymously. PrivateSend, released as DarkSend in RC4 of the DarkCoin client and rebranded to PrivateSend in May 2016, is a trustless method of running a sequence of transactions (known as "mixing") such that an external observer is unable to determine the source of funding when a PrivateSend transaction is created. This gives your Dash the same anonymous properties as cash withdrawn from an ATM, for example. The mixing and denomination process is seamless, automatic, and requires no intervention on the part of the user. The current implementation of PrivateSend in the Dash Core wallet allows any amount of Dash to be mixed for later use in PrivateSend transactions. As of April 2018, PrivateSend is not currently available in other Dash wallets.
zh_cn: 本文档介绍了如何使用Dash Core钱包来匿名发送达世币。匿名发送功能始创于Darkcoin RC4客户端，最初被称作Darksend。随后，这个功能在2016年5月被重新命名为匿名发送。它无需信任第三方就能完成一系列的交易操作（这一环节通常也被称作混币）。混币期间，外部的服务器无法确定匿名发送功能所涉资金的来源。匿名发送功能赋予了用户在ATM取现一样的匿名属性。混币和面值的处理过程是自动完成、无缝对接的，以用户的角度来看，他们不会受到任何干扰。Dash Core钱包当前的匿名发送功能可以帮助用户混合任意金额的达世币，以便之后匿名发送的使用。截至2018年4月，匿名发送功能还没有推广到其它版本的达世币钱包。

source: Knowledge of the exact number of rounds of PrivateSend mixing used in any given PrivateSend transaction has a `quantifiable effect <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_ on the confidence an adversary may have when attempting to guess the source of a PrivateSend transaction. For this reason, the recommended (and default) number of rounds of PrivateSend mixing is set to four.
ar: معرفة العدد الدقيق لجولات الخلط الإرسال المخفي المستخدمة في أي صفقة الإرسال المخفي معين `تأثير قابل للقياس الكمي <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_ على الثقة التي قد يواجهها الخصم عند محاولة تخمين مصدر معاملة الإرسال المخفي. لهذا السبب ، يتم تعيين عدد الموصى به (والافتراضي) لجولات خلط الإرسال المخفي إلى أربعة.
es: El conocimiento del número exacto de rondas de mezcla de PrivateSend utilizadas en cualquier transacción de PrivateSend tiene un `efecto cuantificable <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_ sobre la confianza que un adversario puede tener al intentar adivinar el origen de una transacción de PrivateSend. Por esta razón, el número recomendado (y predeterminado) de rondas de mezcla de PrivateSend se establece en cuatro.
zh_cn: 对于任何既定匿名发送交易来说，有关匿名发送功能的具体混币次数取决于\ `量化效果 <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_\ ，它涉及到对手追溯匿名发送资金来源时的可能性。考虑到这一点，匿名发送功能的混币环节通常（默认）为四轮。

source: You can read more about PrivateSend theory and processes :ref:`here <privatesend>`.
ar: يمكنك قراءة المزيد عن نظرية الإرسال المخفي والعمليات :ref:`هنا <privatesend>`.
es: Puedes leer más sobre la teoría y procesos de PrivateSend :ref:`aquí <privatesend>`.
zh_cn: 如需了解有关匿名发送功能的更多理论知识和流程，请\ :ref:`点击此处 <privatesend>`\ 。

source: Configuration
ar: إدارة الإعدادات
es: Configuración
zh_cn: 配置

source: Open your Dash Core wallet, go to **Settings** and select **Options**. Go to the **Wallet** tab.
ar: افتح محفظة داش كور ، وانتقل إلى **الإعدادات** واختر **أدوات**. انتقل إلى علامة **المحفظة**.
es: Abre tu billetera de Dash Core, ve a **Ajustes** y selecciona **Opciones**. Ve a la pestaña **Billetera**.
zh_cn: 用户需要打开\ **设置**\ 并选择\ **选项**\ ，然后再打开\ **钱包**\ 选项卡。

source: Next to **PrivateSend rounds to use**, enter a value between 1-8. Each round of PrivateSend performs one denominated fund mixing transaction. Higher numbers of rounds increase your overall level of anonymity while decreasing the chance of detection via node collusion. 8 is the highest number of rounds currently available.
zh_cn: 在设置\ **匿名发送回合次数**\ 时，用户可以选择1-8之间的数值。每一轮的混币都会对涉及的资金进行一次混合，回合次数越多，匿名性就越高；节点串通的可能性也就越低。目前，混币最高轮数为8轮。

source: NOTE: To prevent system abuse, an average of one in ten rounds of masternode mixing incurs a fee of .001 DASH.
zh_cn: 注意：为了防止系统资源的滥用，平均十分之一的主节点混币会花费.001 达世币的费用。

source: Enter a target value for **Amount of Dash to keep anonymized**. This value provides a lower boundary on the final amount of funds to be anonymized. Depending on how the client splits your wallet balance, you may end up with denominated inputs whose sum total is greater than the target amount. In this case the client will use all existing denominated inputs in the PrivateSend process. The final anonymized amount may be higher than your target, but should be close.
ar: أدخل قيمة مستهدفة لـ **رصيد داش للاحتفاظ بهويتها مجهولة المصدر**. توفر هذه القيمة حدًا أدنى للمبلغ النهائي للأموال المراد إخفاء هويتها. اعتمادًا على كيفية تقسيم العميل لتوازن المحفظة ، قد ينتهي بك الأمر مع المدخلات المقومة التي يزيد مجموعها الإجمالي عن المبلغ المستهدف. في هذه الحالة ، سيستخدم العميل جميع المدخلات القائمة في عملية الإرسال المخفي. قد يكون المبلغ النهائي المجهول النهائي أعلى من هدفك ، ولكن يجب أن يكون قريبًا.
es: Ingresa el valor deseado para **Cantidad de Dash para mantener en el anonimato**. Este valor proporciona un límite inferior en la cantidad final de fondos para ser anonimizados. Dependiendo de cómo el cliente divide el saldo de su billetera, puedes terminar con entradas denominadas cuya suma total es mayor que la cantidad deseada. En este caso, el cliente utilizará todas las entradas denominadas existentes en el proceso PrivateSend. La cantidad anonimizada final puede ser mayor que tu cantidad deseada, pero debe estar cerca.
zh_cn: 输入希望\ **维持匿名的达世币金额**\ 数值 。这个数值设定了维持匿名的达世币金额的最低限额。根据客户端对钱包余额的拆分，用户最终实现匿名的金额会高于期望值。在这种情况下，客户端将在匿名发送的交易过程中使用现有的所有匿名金额。虽然最终的匿名金额可能高于用户的预期，但也应该和期望值很接近。

source: Click **OK** to save settings.
ar: إظغط على **أوكي** لحفظ الإعدادات.
es: Haz click en **OK** para salvar los ajustes.
zh_cn: 点击 **OK** 来保存设置。

source: PrivateSend is disabled by default when you open the wallet. It will only start after you set the number of rounds and number of Dash to mix under settings and click **Start Mixing** on the **Overview** tab of your wallet.
ar: يتم تعطيل الإرسال المخفي بشكل افتراضي عند فتح المحفظة. سيبدأ فقط بعد تعيين عدد الجولات وعدد الداش للخلط تحت إعدادات وانقر فوق **بدء خلط** في علامة **نظرة عامة** في محفظتك.
es: PrivateSend está deshabilitado de forma predeterminada cuando abres la billetera. Solo se iniciará después de establecer el número de rondas y el número de Dash para mezclar, en la configuración haz click en **Iniciar mezcla** en la pestaña **Información general** de tu billetera.
zh_cn: 当用户启动钱包后，匿名发送功能是默认禁用的。只有用户在选项中设定混币轮数、数量并点击钱包\ **概览**\ 中的\ **开始混币**\ 后，这项功能才会被激活。

source: Starting Mixing
ar: بدأ الخلط
es: Iniciar mezcla
zh_cn: 开始混币

source: The PrivateSend process is initiated by clicking the **Start Mixing** button on the **Overview** tab of the Dash Core wallet. Mixing is possible once the following conditions have been met:
ar: تبدأ عملية الإرسال المخفي بالنقر فوق الزر **بدء الخلط** في علامة **نظرة عامة** في محفظة داش كور. الاختلاط ممكن بمجرد استيفاء الشروط التالية:
es: El proceso de PrivateSend se inicia haciendo click en el botón **Iniciar mezcla** en la pestaña **Información general** de la billetera Dash Core. La mezcla es posible una vez que se han cumplido las siguientes condiciones:
zh_cn: 在用户点击Dash Core钱包的\ **概览**\ 中的\ **开始混币**\ 后，匿名发送功能就会启用。一旦满足以下条件，用户就可以进行混币了：

source: The wallet contains sufficient non-anonymized funds to create the minimum required denominated values
ar: ﺗﺤﺘﻮي اﻟﻤﺤﻔﻈﺔ ﻋﻠﻰ أﻣﻮال آﺎﻓﻴﺔ ﻏﻴﺮ ﻣﺠﻬﻮﻟﺔ ﻟﺘﺤﺪﻳﺪ اﻟﻘﻴﻢ اﻟﺪﻧﻴﺎ اﻟﻤﻄﻠﻮﺑﺔ
es: La billetera contiene suficientes fondos no anonimizados para crear los valores denominados mínimos requeridos
zh_cn: 钱包中具备大量的非匿名资金，能够创建最低限度的交易面值

source: The user has not disabled PrivateSend in the Options dialog
ar: لم يقم المستخدم بتعطيل الإرسال المخفي في مربع الحوار خيارات
es: El usuario no ha deshabilitado PrivateSend en el cuadro de diálogo Opciones
zh_cn: 用户没有在选项中禁用匿名发送功能

source: The target value for anonymized Funds in the Options dialog is greater than zero
ar: القيمة المستهدفة للأموال المجهولة المصدر في مربع الحوار خيارات أكبر من الصفر
es: El valor deseado para Fondos anónimos en el cuadro de diálogo Opciones es mayor que cero
zh_cn: 选项中匿名金额的目标值大于零

source: If your wallet is encrypted (highly recommended), you will be asked to enter your wallet passphrase. Enable the **Only for mixing via PrivateSend** checkbox to unlock the wallet for mixing only.
ar: إذا كانت محفظتك مشفرة (موصى به للغاية) ، سيُطلب منك إدخال عبارة المرور الخاصة بك. تمكين خانة الاختيار **فقط للخلط عبر الإرسال المخفي** لفتح المحفظة للاختلاط فقط.
es: Si tu billetera está encriptada (muy recomendado), se te pedirá que ingreses su contraseña de la billetera. Activa la casilla **Solo para mezclar mediante PrivateSend** para desbloquear la billetera solo para mezclar.
zh_cn: 如果用户的钱包已经加密（强烈推荐进行加密），那么钱包将要求用户输入钱包密码。启用\ **仅用于通过匿名发送功能进行混币**\ 复选框，以便解锁钱包的混币功能。

source: Entering a password for PrivateSend mixing only
ar: إدخال كلمة مرور لدمج الإرسال المخفي فقط
es: Ingresar una contraseña para PrivateSend solo para mezclar
zh_cn: 输入匿名发送功能混币环节所需的密码

source: This will unlock your wallet, and the PrivateSend mixing process will begin. The wallet will remain unlocked until PrivateSend mixing is complete, at which point it will be locked automatically.
ar: سيؤدي هذا إلى فتح محفظتك ، وستبدأ عملية خلط الإرسال المخفي. ستبقى المحفظة مفتوحة حتى اكتمال خلط الإرسال المخفي ، وعند هذه النقطة سيتم قفله تلقائيًا.
es: Esto desbloqueará tu billetera y comenzará el proceso de mezcla de PrivateSend. La billetera permanecerá desbloqueada hasta que se complete la mezcla de PrivateSend, en cuyo punto se bloqueará automáticamente.
zh_cn: 这一步骤不仅会解锁钱包，而且还意味着匿名发送功能的混币流程已经开始了。在该流程完成之前，钱包将会维持已解锁的状态。混币完成后，钱包将自动结束解锁状态。

source: PrivateSend interface after clicking the **Start Mixing** button. Note the **Status** is **Enabled**.
ar: واجهة الإرسال المخفي بعد النقر على زر **بدأ الخلط**. لاحظ أن **الحالة** هي **ممكّنة**.
es: La interfaz de PrivateSend después de hacer click en el botón **Iniciar mezcla**. Tenga en cuenta que **Estado** está **Activado**.
zh_cn: 匿名发送功能的界面将在点击\ **开始混币**\ 后出现。请注意，此时的\ **状态**\ 显示为\ **启用**\ 。

source: PrivateSend will begin creating transactions and your PrivateSend balance will gradually increase. This process can take some time, so be patient. You can monitor the process in more detail as described in the following section.
ar: سيبدأ الإرسال المخفي في إنشاء معاملات وسيزداد تدريجياً رصيد الإرسال المخفي الخاص بك. قد تستغرق هذه العملية بعض الوقت ، لذا كن صبورًا. يمكنك مراقبة العملية بمزيد من التفصيل كما هو موضح في القسم التالي.
es: PrivateSend comenzará a crear transacciones y tu saldo de PrivateSend aumentará gradualmente. Este proceso puede tomar algo de tiempo, así que se paciente. Puedes supervisar el proceso con más detalle, como se describe en la siguiente sección.
zh_cn: 匿名发送功能将开始创建交易，用户的匿名发送金额将会逐渐增加。这个过程可能需要花费一些时间，所以用户需要一些耐心。在此期间，用户可以对整个流程进行监控，具体细节如下所述。

source: Any of the following actions will interrupt the mixing process. Because the transactions are atomic (they either take place completely, or do not take place at all), it should be possible to safely interrupt PrivateSend mixing at any time.
ar: أي من الإجراءات التالية سيؤدي إلى مقاطعة عملية الخلط. نظرًا لأن المعاملات ذرية (إما أنها تتم بالكامل ، أو لا تحدث على الإطلاق) ، فيمكن أن يكون من الممكن مقاطعة خلط الإرسال المخفي بأمان في أي وقت.
es: Cualquiera de las siguientes acciones interrumpirá el proceso de mezcla. Debido a que las transacciones son atómicas (o se llevan a cabo por completo, o no realizan), debería ser posible interrumpir de manera segura la mezcla de PrivateSend en cualquier momento.
zh_cn: 以下行为都有可能会造成混币流程的中断。由于交易是由众多币混合形成的（因此它要么处于完成的状态，要么就处于没有完成的状态）。正因为这样，用户可以安全地中断匿名发送功能的混币流程。

source: Clicking the Stop Mixing button on the Overview tab
ar: النقر فوق الزر إنهاء الخلط في علامة انظرة عامة
es: Hacer click en el botón Detener mezcla en la pestaña Descripción general
zh_cn: 点击概览中的停止混币按键

source: Closing the client before PrivateSend mixing is completed
ar: اكتمال إغلاق العميل قبل خلط الإرسال المخفي
es: Cerrar el cliente antes de que se complete la mezcla de PrivateSend
zh_cn: 在匿名发送功能的混币流程完成之前关闭客户端

source: Sending PrivateSend funds from the wallet before PrivateSend rounds are completed
ar: يتم إرسال أموال الإرسال المخفي من المحفظة قبل انتهاء جولات الإرسال المخفي
es: Envío de fondos de PrivateSend desde la billetera antes de completar las rondas de PrivateSend
zh_cn: 在混币流程完成之前用钱包进行匿名发送

source: Disabling PrivateSend before the process is complete
ar: تعطيل الإرسال المخفي قبل اكتمال العملية
es: Deshabilitar PrivateSend antes de que se complete el proceso
zh_cn: 在混币结束后禁用匿名发送

source: Monitoring Mixing
ar: مراقبة الاختلاط
es: Monitorear la mezcla
zh_cn: 对混币的监控

source: If you want to monitor PrivateSend in more detail, you need to enable some advanced features of the wallet. Go to **Settings**, select **Options** and go to the **Wallet** tab. Check the boxes next to the **Enable coin control features** and **Enable advanced PrivateSend interface** options.
ar: إذا كنت ترغب في مراقبة الإرسال المخفي بمزيد من التفاصيل ، فستحتاج إلى تمكين بعض الميزات المتقدمة للمحفظة. انتقل إلى **الإعدادات** ، حدد **خيارات** وانتقل إلى علامة **المحفظة**. حدد المربعات المجاورة لميزات **تمكين ميزات التحكم في العملة** و **تمكين واجهة الإرسال المخفي المتقدمة**.
es: Si deseas monitorear PrivateSend con más detalle, debes habilitar algunas características avanzadas de la billetera. Ve a **Ajustes**, selecciona **Opciones** y ve a la pestaña **Billetera**. Marca las casillas junto a las opciones **Habilitar las funciones de control de monedas** y **Habilitar la interfaz avanzada de PrivateSend**.
zh_cn: 如果想要对匿名发送功能进行更细致的监控，用户就需要启用一些更加高级的钱包功能。用户需要访问\ **设置**\ ，选中\ **选项**\ ，再打开\ **钱包**\ 选项卡。接下来，用户需要选中\ **启用混币管控功能**\ 和\ **启用高级的匿名发送界面**\ 。

source: Enabling advanced options for PrivateSend in the Dash Core wallet settings
ar: تمكين الخيارات المتقدمة لـ الإرسال المخفي في إعدادات محفظة داش كور
es: Habilitar opciones avanzadas para PrivateSend en los ajustes de la billetera Dash Core
zh_cn: 在Dash Core钱包的设置中启用匿名发送的高级选项

source: This will allow you to monitor progress and see which individual operations PrivateSend is carrying out in the background.
ar: سيسمح لك ذلك بمراقبة التقدم ومعرفة العمليات الفردية التي يقوم بها الإرسال المخفي في الخلفية.
es: Esto te permitirá monitorear el progreso y ver qué operaciones individuales realiza PrivateSend en segundo plano.
zh_cn: 这将帮助用户监控混币流程，跟进匿名发送在后台的进展。

source: Monitoring PrivateSend progress
ar: رصد تقدم الإرسال المخفي
es: Monitorear el proceso de PrivateSend
zh_cn: 监控匿名发送的进程

source: Since PrivateSend mixing creates a lot of new address keys to send and receive the anonymized denominations, you may receive a warning when the number of remaining keys runs low. This is nothing to be worried about, since the wallet will simply create more keys as necessary. However, these keys will not exist in any previous backups of your wallet. For this reason, it is important to backup your wallet again after mixing is complete.
ar: نظرًا لأن إنشاء الإرسال المخفي يؤدي إلى إنشاء الكثير من مفاتيح العنوان الجديدة لإرسال واستقبال الفئات المجهولة الهوية ، فقد تتلقى تحذيرًا عند انخفاض عدد المفاتيح المتبقية. لا داعي للقلق حيال ذلك ، لأن المحفظة ستقوم ببساطة بإنشاء المزيد من المفاتيح حسب الضرورة. ومع ذلك ، لن تكون هذه المفاتيح موجودة في أي نسخ احتياطية سابقة من محفظتك. لهذا السبب ، من المهم الاحتفاظ بنسخة احتياطية من محفظتك مرة أخرى بعد اكتمال الخلط.
es: Dado que la mezcla de PrivateSend crea muchas llaves de dirección nuevas para enviar y recibir denominaciones anónimas, puedes recibir una advertencia cuando el número de llaves restantes sea bajo. No hay nada de qué preocuparse, ya que la billetera simplemente creará más llaves según sea necesario. Sin embargo, estas llaves no existirán en ningún respaldo anterior de tu billetera. Por esta razón, es importante hacer un respaldo de tu billetera nuevamente después de que se complete la mezcla.
zh_cn: 由于匿名发送功能会用到许多用于收发匿名资金的新地址，因此，用户可能会收到地址数量不足的警告。用户不必紧张，因为钱包会在必要的时候创建新的地址。不过，已经使用了的地址不会在于过去的钱包备份中，因此，用户最好在混币完成后进行新的钱包备份。

source: You can also monitor PrivateSend progress by viewing the transactions created by the mixing process on the **Transactions** tab.
ar: يمكنك أيضًا مراقبة تقدم الإرسال المخفي عن طريق عرض المعاملات التي أنشأتها عملية الخلط في علامة **المعاملات**.
es: También puedes monitorear el progreso de PrivateSend al ver las transacciones creadas por el proceso de mezcla en la pestaña **Transacciones**.
zh_cn: 用户也可以通过在\ **交易**\ 选项中浏览混币流程创建的交易来监控匿名发送功能。

source: Transactions created by PrivateSend on the Transactions tab
ar: المعاملات التي تم إنشاؤها بواسطة الإرسال المخفي على علامة المعاملات
es: Transacciones creadas por PrivateSend en la pestaña Transacciones
zh_cn: 交易选项中由匿名发送产生的交易

source: The following table describes the PrivateSend-related transactions displayed in the Type column of the **Transactions** tab:
ar: يصف الجدول التالي المعاملات ذات الصلة الإرسال المخفي المعروضة في عمود النوع من علامة **المعاملات**.
es: La siguiente tabla describe las transacciones relacionadas con PrivateSend que se muestran en la columna de la pestaña **Transacciones**:
zh_cn: 以下表格显示了与匿名发送功能相关的交易，它将显示在\ **交易**\ 选项中的类型列表当中：

source: PrivateSend Transaction Type
ar: نوع المعاملة الإرسال المخفي
es: Tipo de transacción de PrivateSend
zh_cn: 匿名发送交易类型

source: Transaction Description
ar: وصف العملية
es: Descripción de transacción
zh_cn: 交易描述

source: PrivateSend Make Collateral Inputs (*Mixing*)
ar: الإرسال المخفي جعل المدخلات الجانبية (*خلط*)
es: PrivateSend hace entradas colaterales (*Mezclando*)
zh_cn: 匿名发送功能创建的保证金输入（\ *混币*\ ）

source: Wallet funds were moved to collateral inputs that will be used to make collateral payments. This is done to minimize traceability of collaterals.
ar: تم تحويل أموال المحفظة إلى مدخلات الضمانات التي سيتم استخدامها في سداد مدفوعات الضمانات. يتم ذلك للحد من إمكانية تتبع الضمانات.
es: Los fondos de la billetera se transfirieron a insumos de garantía que se usarán para realizar pagos de garantías. Esto se hace para minimizar la trazabilidad de las garantías.
zh_cn: 钱包的资金将被移用作保证金输入，从而完成有担保的支付。这将降低他人追溯资金来源的可能性。

source: PrivateSend Create Denominations (*Mixing*)
ar: الإرسال المخفي إنشاء فئات (*خلط*)
es: PrivateSend crea denomiaciones (*Mezclando*)
zh_cn: 匿名发送功能创建的交易面值（\ *混币*\ ）

source: Wallet funds were broken into PrivateSend denominations (Step 1 :ref:`here<privatesend>`)
zh_cn: 钱包中的资金面额化（步骤1 请参考\ :ref:`这里 <privatesend>`\ ）

source: PrivateSend Denominate (*Mixing*)
ar: تسمية الأرسال المخفي (*خلط*)
es: PrivatSend Denomina (*Mezclando*)
zh_cn: 匿名发送的面额化（\ *混币*\ ）

source: A transaction was sent to a masternode in order to participate in a mixing session (Step 3 :ref:`here<privatesend>`)
zh_cn: 交易将被发送到主节点上，以便参与到混币流程当中（步骤3 请参考\ :ref:`这里 <privatesend>`\ ）

source: PrivateSend Collateral Payment (*Mixing*)
ar: الإرسال المخفي الدفع الجانبي (*خلط*)
es: PrivateSend pago de garantías (*Mezclando*)
zh_cn: 匿名发送功能的保证金发送（\ *混币*\ ）

source: The mixing session collateral was claimed. This fee is charged in ~10% of mixing sessions to prevent spam attacks.
ar: تمت المطالبة بمزج ضمانات الجلسة. يتم فرض هذه الرسوم في ~ 10٪ من جلسات الخلط لمنع هجمات البريد العشوائي.
es: Se reclamó la garantía de la sesión de mezcla. Esta comisión se cobra en ~ 10% de las sesiones de mezcla para evitar los ataques de spam.
zh_cn: 收取混币流程的保证金。为了避免垃圾邮件的攻击，混币流程需要用户支付混币金额的~10%作为保证金。

source: PrivateSend (*Spending*)
ar: الإرسال المخفي (*الأنفاق*)
es: PrivateSend (*Gasto*)
zh_cn: 匿名发送（\ *发送*\ ）

source: Mixed funds were used to send a payment to someone. Note: Unlike the previous 4 transaction types, this is not a mixing process transaction.
ar: تم استخدام صناديق مختلطة لإرسال دفعة لشخص ما. ملاحظة: على عكس أنواع المعاملات 4 السابقة ، هذه ليست معاملة عملية خلط.
es: Se usaron fondos mixtos para enviar un pago a alguien. Nota: A diferencia de los 4 tipos de transacciones anteriores, esta no es una transacción de proceso de mezcla.
zh_cn: 完成混币后的资金将被发送给其他用户。请注意：与上述的4种交易类型不同的是，这是一个不涉及混币流程的交易。

source: You can also use the coin control feature to view which addresses hold mixed denominations ready to be used for PrivateSend transactions. Go to the **Send** tab of your wallet and click **Inputs** to view the possible input addresses for your transactions. You can see how each address holds given denominations of mixed Dash, and how many rounds of mixing have been completed. This is to ensure that an efficient combination of addresses can be used as inputs in PrivateSend transactions without too much change, since amount in a PrivateSend transaction must be rounded up to completely spend all inputs. The current minimum balance for an input used in a PrivateSend transaction is 0.01000010 DASH.
zh_cn: 用户可以通过货币管控功能来浏览哪些地址上存有混币的面额并且确定它们是否可用于匿名交易。用户需要访问钱包的\ **发送**\ 选项卡中，并点击\ **输入**\ 来浏览交易可用的输入地址。用户可以查看各个地址上的经过了混币处理的达世币数量和它们所经历的混币的回合次数。这些操作的目的是确保这些地址的组合不必经太多改动就能完成匿名发送，因为地址上的金额已经完全可以满足交易的需求了。目前，匿名发送使用的最小输入额度是0.01000010个达世币。

source: Coin Selection dialog showing addresses holding PrivateSend mixed balances in different denominations
ar: مربع حوار تحديد العملة الذي يعرض العناوين التي تحتفظ بأرصدة الإرسال المخفي المختلطة في فئات مختلفة
es: El Cuadro de diálogo de Selección de moneda muestra las direcciones que contienen saldos mixtos de PrivateSend en diferentes denominaciones
zh_cn: 货币选择对话框显示了不同地址上以不同面额显示的匿名发送资金的余额

source: Paying with PrivateSend
ar: الدفع عن طريق الإرسال المخفي
es: Pago con PrivateSend
zh_cn: 通过匿名发送功能进行支付
