Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/developers/index.po
Languages: ru

source: Developers guide and information about Dash version history
ru: Руководство для разработчиков и информация об истории версий Dash

source: Developers
ru: Разработчикам

source: The `Dash Platform Developer Documentation <https://dashplatform.readme.io/>`_ contains technical documentation intended to help developers quickly and easily get started with Dash Platform. The :ref:`Dash Core Developer Documentation <core:core-index>` provides detailed documentation on the Dash Core code base, and serves as a reference for experienced developers. These documentation portals can help developers to quickly and efficiently integrate external applications with the Dash ecosystem. Anyone can contribute to the documentation by suggesting edits in the documentation system.
ru: Документация разработчика платформы Dash Platform <https://dashplatform.readme.io/>`_ содержит техническую документацию, призванную помочь разработчикам быстро и легко начать работу с платформой Dash Platform. Портал :ref:`документации разработчиков Dash Core<core:core-index>` содержит подробную документацию по кодовой базе Dash Core и служит справочным пособием для опытных разработчиков. Эти порталы документации помогут разработчикам быстро и эффективно интегрировать внешние приложения в экосистему Dash. Любой желающий может внести свой вклад в развитие документации, предложив ее редактирование в системе документации.

source: The Dash Core Team also maintains the `Dash Roadmap <https://www.dash.org/roadmap/>`_, which sets out delivery milestones for future releases of Dash and includes specific technical details describing how the development team plans to realise each challenge. The Dash Roadmap is complemented by the `Dash Improvement Proposals <https://github.com/dashpay/dips>`_, which contain detailed technical explanations of proposed changes to the Dash protocol itself.
ru: Команда разработчиков Dash Core Team также поддерживает `Dash Roadmap <https://www.dash.org/roadmap/>`_, в котором определены этапы поставки будущих релизов Dash и приведены конкретные технические детали, описывающие, как команда разработчиков планирует реализовать каждую задачу. Дорожную карту Dash дополняет документ `Dash Improvement Proposals <https://github.com/dashpay/dips>`_, содержащий подробные технические пояснения к предлагаемым изменениям в самом протоколе Dash.

source: The Dash community organise discussion and development of Dash apps using the following resources:
ru: Сообщество Dash организует обсуждение и разработку приложений для Dash, используя следующие ресурсы:

source: `Awesome Dash Platform <https://dashdevs.org/>`__
ru: `Прекрасная Dash Platform <https://dashdevs.org/>`__

source: `Dash Dapp Devs Discord <https://chat.dashdevs.org>`__
ru: `Дискорд разработчиков dApps на Dash <https://chat.dashdevs.org>`__

source: `Dash Bounty Board <https://trello.com/invite/b/FPJzDcok/ea9fc798043d35d61aa8a5df0917cba7/dash-bounty-board>`__
ru: `Доска объявлений Dash <https://trello.com/invite/b/FPJzDcok/ea9fc798043d35d61aa8a5df0917cba7/dash-bounty-board>`__

source: The remaining sections available below describe practical steps to carry out common development tasks in Dash.
ru: В оставшихся разделах, приведённых ниже, описаны практические шаги для выполнения общих задач разработки в Dash.

source: Version History
ru: История версий

source: Full release notes and the version history of Dash are available here:
ru: Полная информация о выпуске и история версий Dash доступны по ссылке:
