Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/developers/integration.po
Languages: it, ru

source: Technical guides for developers integrating Dash.
it: Guide tecniche per gli sviluppatori che integrano Dash.
ru: Технические руководства для разработчиков, интегрирующих Dash.

source: dash, merchants, API, SDK, instantsend, python, .NET, java, javascript, nodejs, php, objective-c
it: dash, commercianti, API, SDK, instantsend, python, .NET, java, javascript, nodejs, php, objective-c
ru: dash, мерчанты, API, SDK, instantsend, python, .NET, java, javascript, nodejs, php, objective-c

source: Integration Overview
it: Panoramica di integrazione
ru: Обзор по интеграции

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_IntegrationOverview.pdf>`__.
it: Questa documentazione è disponibile anche come `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_IntegrationOverview.pdf>`__.
ru: Данная документация также доступна в формате `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_IntegrationOverview.pdf>`__.

source: `Dash Core <https://github.com/dashpay/dash/releases>`__ is a fork of `Bitcoin Core <https://github.com/bitcoin/bitcoin>`__ and shares many common functionalities. Key differences are found in existing JSON-RPC commands which have been customized to support unique functionalities such as InstantSend.
it: `Dash Core <https://github.com/dashpay/dash/releases>`__ è un fork di `Bitcoin Core <https://github.com/bitcoin/bitcoin>`__ e condivide molte funzionalità comuni. Le differenze principali si trovano nei comandi JSON-RPC esistenti che sono stati personalizzati per supportare funzionalità uniche come InstantSend.
ru: `Dash Core <https://github.com/dashpay/dash/releases>`__ является “форком” Биткойна и имеет с ним много общих функций. Ключевые отличия находятся в существующих JSON-RPC командах, которые были изменены таким образом, чтобы можно было поддерживать такие уникальные функции, как InstantSend.

source: The Basics
it: Le basi
ru: Основы

source: Dash is a Proof of Work network, and similar to Bitcoin, Dash has a mining network but uses a different block hashing algorithm. Dash serves as an improvement of Bitcoin's shortcomings by offering a robust solution for instant transactions, enhancing user privacy, and offering a self-sustainable decentralized governance model.
it: Dash è una rete Proof of Work e, simile a Bitcoin, Dash ha una rete di mining ma utilizza un diverso algoritmo di hashing dei blocchi. Dash serve a migliorare le carenze di Bitcoin offrendo una solida soluzione per transazioni istantanee, migliorando la privacy degli utenti e offrendo un modello di governance decentralizzata autosostenibile.
ru: Dash - это сеть Proof of Work, в которой, как и в Bitcoin, есть сеть майнинга, но используется другой алгоритм хеширования блоков. Dash служит улучшением недостатков Bitcoin, предлагая надежное решение для мгновенных транзакций, повышая конфиденциальность пользователей и предлагая самодостаточную децентрализованную модель управления.

source: Notably, Dash InstantSend provides a mechanism for zero-confirmation transactions to be safely accepted and re-spent. InstantSend also provides enhanced security compared to the conventional practice of waiting for multiple block confirmations. Therefore, :ref:`implementing InstantSend <integration-instantsend>` is the recommended best practice for all Dash integrations.
it: In particolare, Dash InstantSend fornisce un meccanismo per accettare e spendere nuovamente in modo sicuro le transazioni a conferma zero. InstantSend fornisce inoltre una maggiore sicurezza rispetto alla pratica convenzionale di attendere più conferme di blocco. Pertanto, :ref:`implementare InstantSend <integration-instantsend>` è la procedura consigliata per tutte le integrazioni Dash.
ru: В частности, Dash InstantSend обеспечивает механизм безопасного принятия и повторного проведения транзакций с нулевым подтверждением. Кроме того, InstantSend обеспечивает повышенную безопасность по сравнению с традиционной практикой ожидания подтверждения от нескольких блоков. Поэтому :ref:`внедрение InstantSend <integration-instantsend>` является рекомендуемой лучшей практикой для всех интеграций Dash.

source: Block time: ~2.6 minutes per block
it: Tempo di blocco: ~2,6 minuti per blocco
ru: Время нахождения блока: ~2,6 минуты

source: Latest release: https://github.com/dashpay/dash/releases/latest
it: Ultima versione: https://github.com/dashpay/dash/releases/latest
ru: Последний релиз: https://github.com/dashpay/dash/releases/latest

source: JSON-RPC Interface
it: Interfaccia JSON-RPC
ru: Интерфейс JSON-RPC

source: The majority of commands are unchanged from Bitcoin making integration into existing systems relatively straightforward. For a complete listing of RPC commands please refer to the :ref:`​Dash Developer Guide <core:guide-index>`.
it: La maggior parte dei comandi è rimasta invariata rispetto a Bitcoin, rendendo l'integrazione nei sistemi esistenti relativamente semplice. Per un elenco completo dei comandi RPC, fare riferimento alla :ref:`​Dash Developer Guide <core:guide-index>`.
ru: Большинство команд остались неизменными по сравнению с Bitcoin, что делает интеграцию в существующие системы относительно простой. Полный список RPC-команд приведен в :ref:`Руководство разработчика Dash <core:guide-index>`.

source: Note that the following commands have been modified to support InstantSend:
it: Tieni presente che i seguenti comandi sono stati modificati per supportare InstantSend:
ru: Обратите внимание, что следующие команды были изменены для поддержки InstantSend:

source: Special Transactions
it: Transazioni Speciali
ru: Специальные транзакции

source: Dash Core v0.13.0 introduced the concept of “Special Transactions” as specified in `DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__. Special Transactions provide a more native way to implement additional features which do not fit into the original concept of transactions. Please see the :ref:`Special Transactions <integration-special-transactions>` section below for more information.
it: Dash Core v0.13.0 ha introdotto il concetto di "Transazioni speciali" come specificato in `DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__. Le transazioni speciali forniscono un modo più nativo per implementare funzionalità aggiuntive che non rientrano nel concetto originale di transazioni. Per ulteriori informazioni, consultare la sezione :ref:`Transazioni speciali <integration-special-transactions>` di seguito.
ru: В Dash Core v0.13.0 введена концепция "специальных транзакций", как указано в `DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__. Специальные транзакции позволяют реализовать дополнительные возможности, которые не вписываются в первоначальную концепцию транзакций. Более подробная информация приведена ниже в разделе :ref:`Специальные транзакции <integration-special-transactions>`.

source: Block Hashing Algorithm
it: Algoritmo di hashing dei blocchi
ru: Алгоритм хэширующий блоки

source: Dash uses the X11 algorithm in place of SHA256 used in Bitcoin. It’s important to note, however, that this only affects the hashing of the block itself. All other internals utilize SHA256 hashes (transactions, merkle root, etc.), which allows for most existing libraries to work in the Dash ecosystem.
it: Dash utilizza l'algoritmo X11 al posto di SHA256 utilizzato in Bitcoin. È importante notare, tuttavia, che ciò influisce solo sull’hashing del blocco stesso. Tutti gli altri componenti interni utilizzano hash SHA256 (transazioni, merkle root, ecc.), che consentono alla maggior parte delle librerie esistenti di funzionare nell'ecosistema Dash.
ru: Dash использует алгоритм X11, вместо SHA256, который используется в Биткойне. Однако стоит отметить, что это относится только к хешированию Блока. Все прочие внутренние функции работают с хешами SHA256 (транзакции, корни merkle, и т.д.), благодаря чему большинство существующих библиотек совместимы с экосистемой Dash.

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Transaction-Types.pdf>`__.
it: Questa documentazione è disponibile anche come `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Transaction-Types.pdf>`__.
ru: Эта документация также доступна в формате `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Transaction-Types.pdf>`__.

source: Dash 0.13.0 and higher implement `DIP002 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, which form a basis for new transaction types that provide on-chain metadata to assist various consensus mechanisms. The following special transaction types exist:
it: Dash 0.13.0 e versioni successive implementano `DIP002 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>` __, che costituiscono una base per i nuovi tipi di transazione che forniscono on-chain metadati per assistere vari meccanismi di consenso. Esistono i seguenti tipi di transazioni speciali:
ru: В Dash 0.13.0 и в последующих релизах, реализованы `Специальные Транзакции DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, которые формируют основу для новых типов транзакций, снабжающих блокчейн метаданными, которые оказывают помощь в работе различных механизмов консенсуса. Существуют следующие типы специальных транзакций:

source: Version
it: Versione
ru: Версия

source: Type
it: Modello
ru: Тип

source: Payload Size
ru: Размер нагрузки

source: Transaction Purpose / Example
it: Scopo/Esempio della transazione
ru: Назначение транзакции / Пример

source: Standard Transaction
it: Transazione standard
ru: Стандартная транзакция

source: variable
it: variabile
ru: переменная

source: :ref:`Masternode Registration <core:ref-txs-proregtx>`
ru: :ref:`Регистрация мастерноды <core:ref-txs-proregtx>`

source: :ref:`Update Masternode Service <core:ref-txs-proupservtx>`
ru: :ref:`Обновления сервиса мастерноды <core:ref-txs-proupservtx>`

source: :ref:`Update Masternode Operator <core:ref-txs-proupregtx>`
ru: :ref:`Обновление оператора мастерноды <core:ref-txs-proupregtx>`

source: :ref:`Masternode Revocation <core:ref-txs-prouprevtx>`
ru: :ref:`Отзыв мастерноды <core:ref-txs-prouprevtx>`

source: :ref:`Masternode List Merkle Proof <core:ref-txs-cbtx>`
ru: :ref:`Доказательство Меркла списка мастернод <core:ref-txs-cbtx>`

source: :ref:`Quorum Commitment <core:ref-txs-qctx>`
ru: :ref:`Обязательство по кворуму <core:ref-txs-qctx>`

source: Integration notes:
it: Note di integrazione:
ru: Примечания по интеграции:

source: `DIP002 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ introduced a new Transaction Version and related “Payload” to the network.
it: `DIP002 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ ha introdotto una nuova versione della transazione e il relativo "Payload" nella rete.
ru: `DIP002 Специальный транзакции <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ представил в сети новую версию транзакции и связанную с ней "полезную нагрузку".

source: Integrated Systems must be able to `serialize and deserialize <https://github.com/dashpay/dips/blob/master/dip-0002.md#serialization-hashing-and-signing>`__ these new Transaction Types to accurately encode and decode Raw Transaction data.
it: I sistemi integrati devono essere in grado di `serializzare e deserializzare <https://github.com/dashpay/dips/blob/master/dip-0002.md#serialization-hashing-and-signing>`__ questi nuovi tipi di transazione per codificare accuratamente e decodificare i dati grezzi delle transazioni.
ru: Интегрированные системы должны быть способны к `сериализации и десериализации <https://github.com/dashpay/dips/blob/master/dip-0002.md#serialization-hashing-and-signing>`__ этих новых Типов Транзакций, чтобы шифрование и дешифровка данных Исходных Транзакций происходила успешно.

source: From a `backwards compatibility <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__ perspective, the 4 byte (32-bit) ``version`` field included in Classical Transactions was split into two fields: ``version`` and ``type`` (each consisting of 2 bytes).
it: Dal punto di vista della "compatibilità con le versioni precedenti <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>"__, il campo "versione" da 4 byte (32 bit) incluso in Classical Transactions è stato suddiviso in due campi: "versione" e "tipo" (ciascuno composto da 2 byte).
ru: С точки зрения обратной совместимости <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__, 4-байтовое (32-битное) поле ``версия``, включенное в классические транзакции, было разделено на два поля: ``версия`` и ``тип`` (каждое из которых состоит из 2 байт).

source: Refer to the :ref:`Special Transactions <core:ref-txs-special-txs>` section of the Dash developer reference for additional detail on these data types, e.g. <variable int>.
it: Fare riferimento alla sezione :ref:`Transazioni speciali <core:ref-txs-special-txs>` del riferimento per sviluppatori Dash per ulteriori dettagli su questi tipi di dati, ad es. <variable int>.
ru: Дополнительную информацию об этих типах данных см. в разделе :ref:`Специальные транзакции <core:ref-txs-special-txs>` справочника разработчика Dash, например, <variable int>.

source: :ref:`InstantSend <integration-instantsend>` status and Payload JSON (e.g. ``proRegTx``) is included in the JSON-RPC response, please note that this data is not part of the calculated hash and is provided for convenience.
it: :ref:`InstantSend <integration-instantsend>` e Payload JSON (ad esempio ``proRegTx``) sono inclusi nella risposta JSON-RPC, tieni presente che questi dati non fanno parte dell'hash calcolato e vengono forniti per comodità.
ru: Статус `InstantSend <integration-instantsend>`__ и JSON нагрузка (например ``proRegTx``) включёна в ответ JSON-RPC, пожалуйста, обратите внимание, что эти данные не являются частью рассчитываемого хеша и предоставлены для удобства.

source: See the `transaction types integration documentation (PDF) <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Transaction-Types.pdf>`__ for worked examples of each transaction type.
it: Consulta la `documentazione sull'integrazione dei tipi di transazione (PDF) <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Transaction-Types.pdf>`__ per esempi pratici di ciascun tipo di transazione .
ru: Отработанные примеры каждого типа транзакций см. в документации по интеграции типов транзакций (PDF) <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Transaction-Types.pdf>`__.

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_v0.14_LLMQ_InstantSend.pdf>`__.
it: Questa documentazione è disponibile anche come file `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_v0.14_LLMQ_InstantSend.pdf>`__.
ru: Эта документация также доступна в формате `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_v0.14_LLMQ_InstantSend.pdf>`__.

source: InstantSend is a feature provided by the Dash network that allows for zero-confirmation transactions to be safely accepted and re-spent. The network attempts to lock the inputs of every valid transaction when it is broadcast to the network. Every secured transaction is included in a following block in accordance with standard blockchain principles. Transactions are typically locked by InstantSend within 3 seconds of being propagated to the network.
it: InstantSend è una funzionalità fornita dalla rete Dash che consente di accettare e spendere nuovamente in modo sicuro le transazioni senza conferma. La rete tenta di bloccare gli input di ogni transazione valida quando viene trasmessa alla rete. Ogni transazione protetta è inclusa in un blocco successivo in conformità con i principi standard della blockchain. Le transazioni vengono generalmente bloccate da InstantSend entro 3 secondi dalla propagazione alla rete.
ru: InstantSend - это функция, предоставляемая сетью Dash, которая позволяет безопасно принимать и повторно проводить транзакции с нулевым подтверждением. Сеть пытается заблокировать входы каждой действительной транзакции, когда она транслируется в сеть. Каждая защищенная транзакция включается в следующий блок в соответствии со стандартными принципами блокчейна. Транзакции обычно блокируются InstantSend в течение 3 секунд после их распространения в сети.

source: InstantSend is enabled by the Masternode Network which comprises several thousand masternode servers. These nodes are differentiated from standard nodes by having proven ownership of 1,000 Dash, making the network `highly resistant to Sybil attacks <https://en.wikipedia.org/wiki/Sybil_attack>`__. Masternodes form `Long-Living Masternode Quorums (LLMQs) <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, which are responsible for providing near-instant certainty to the transaction participants that the transaction inputs cannot be re-spent, and that the transaction will be included in a following block instead of a conflicting transaction.
it: InstantSend è abilitato dalla rete Masternode che comprende diverse migliaia di server masternode. Questi nodi si differenziano dai nodi standard per aver dimostrato di possedere 1.000 Dash, rendendo la rete `altamente resistente agli attacchi Sybil <https://en.wikipedia.org/wiki/Sybil_attack>`__. I Masternode formano `Long-Living Masternode Quorums (LLMQ) <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, che hanno il compito di fornire certezza quasi istantanea ai partecipanti alla transazione che gli input della transazione non possono essere spesi nuovamente e che la transazione verrà inclusa in un blocco successivo invece che in una transazione in conflitto.
ru: InstantSend обеспечивается сетью мастернод, состоящей из нескольких тысяч серверов мастернод. Эти узлы отличаются от обычных узлов тем, что имеют подтвержденное право собственности на 1000 Dash, что делает сеть `высокоустойчивой к атакам Sybil` <https://en.wikipedia.org/wiki/Sybil_attack>`__. Мастерноды формируют "долгоживущие кворумы мастернод" (LLMQ) <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, которые отвечают за практически мгновенную уверенность участников транзакций в том, что средства, вложенные в транзакцию, не могут быть потрачены повторно, и что транзакция будет включена в следующий блок вместо конфликтующей транзакции.

source: This concept works as an extension to Nakamoto Consensus to provide additional security. InstantSend enables transacted funds to be immediately and securely re-spent by the recipient, even before the transaction is included in a block.
it: Questo concetto funziona come un'estensione del Consenso Nakamoto per fornire ulteriore sicurezza. InstantSend consente al destinatario di rispendere immediatamente e in modo sicuro i fondi negoziati, anche prima che la transazione venga inclusa in un blocco.
ru: Эта концепция работает как расширение консенсуса Накамото, обеспечивая дополнительную безопасность. InstantSend позволяет получателю немедленно и безопасно повторно расходовать транзакции, даже до того, как транзакция будет включена в блокчейн.

source: Receiving InstantSend Transactions
it: Ricezione di transazioni InstantSend
ru: Получение транзакций InstantSend

source: An "InstantSend Transaction" is simply a standard transaction that has been provided additional assurances by the masternode network. As a result, and from an integration perspective, the only technical difference is the InstantSend status.
it: Una "Transazione InstantSend" è semplicemente una transazione standard a cui sono state fornite ulteriori garanzie dalla rete masternode. Di conseguenza, e dal punto di vista dell'integrazione, l'unica differenza tecnica è lo stato InstantSend.
ru: Транзакция InstantSend - это просто стандартная транзакция, получившая дополнительные гарантии от сети мастернодов. В результате, с точки зрения интеграции, единственным техническим отличием является статус InstantSend.

source: Receiving an InstantSend Transaction introduces two requirements:
it: La ricezione di una transazione InstantSend introduce a due requisiti:
ru: Вводится два требования для получения транзакций InstantSend:

source: The ability to determine the “InstantSend Status” of a given transaction.
it: Capacità di determinare lo "Status di InstantSend" di una data transazione.
ru: Возможность определить "статус InstantSend" в заданной транзакции.

source: The ability to adjust “Confirmation Status” independently of block confirmation.
it: Possibilità di regolare lo "Status di conferma" indipendentemente dalla conferma del blocco.
ru: Возможность настройки "статуса подтверждения" независимо от подтверждения блока.

source: InstantSend Status is provided by the dash daemon, typically through a direct connection (e.g. RPC), :ref:`ZMQ notification <core:examples-receiving-zmq-notifications>`, or through the usage of an external wallet notification script.
it: Lo status di InstantSend viene fornito dal dash daemon, in genere tramite una connessione diretta (ad esempio RPC), :ref:`notifica ZMQ <core:examples-receiving-zmq-notifications>` o tramite l'utilizzo di uno script di notifica del wallet esterno.
ru: Статус InstantSend предоставляется демоном dash, обычно через прямое соединение (например, RPC), :ref:`ZMQ уведомление<core:examples-receiving-zmq-notifications>`, или через использование внешнего скрипта уведомления кошелька.

source: Direct Connection
it: Connessione diretta
ru: Прямое соединение

source: InstantSend Status can be identified through direct connection with the Dash daemon using JSON-RPC protocol. The ``instantlock`` attribute of the JSON response reflects the status of the transaction and is included in the following commands:
it: Lo stato di InstantSend può essere identificato tramite la connessione diretta con il demone Dash utilizzando il protocollo JSON-RPC. L'attributo ``instantlock`` della risposta JSON riflette lo stato della transazione ed è incluso nei seguenti comandi:
ru: Статус InstantSend может быть определен путем прямого соединения с демоном Dash по протоколу JSON-RPC. Атрибут ``instantlock`` JSON-ответа отражает статус транзакции и включается в следующие команды:

source: ZMQ Notification
it: Notifica ZMQ
ru: Уведомление ZMQ

source: Whenever a transaction enters the mempool and whenever a transaction is locked in the mempool, ZMQ notifications can be broadcast by the node. Refer to `the list of possible ZMQ notifications <https://github.com/dashpay/dash/blob/master/doc/zmq.md#usage>`__ for more details.
it: Ogni volta che una transazione entra nella mempool e ogni volta che una transazione è bloccata nel mempool, le notifiche ZMQ possono essere trasmesse dal nodo. Fare riferimento all'elenco delle possibili notifiche ZMQ <https://github.com/dashpay/dash/blob/master/doc/zmq.md#usage>`__ per maggiori dettagli.
ru: Всякий раз, когда транзакция попадает в mempool и когда транзакция блокируется в mempool, узел может транслировать уведомления ZMQ. Более подробная информация приведена в `списке возможных ZMQ-уведомлений <https://github.com/dashpay/dash/blob/master/doc/zmq.md#usage>`__.

source: The following notifications are relevant for recognizing transactions and their corresponding instantlocks:
it: Le seguenti notifiche sono rilevanti per il riconoscimento delle transazioni e dei relativi blocchi istantanei:
ru: Для распознавания транзакций и соответствующих им мгновенных блокировок актуальны следующие уведомления:
