Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/developers/integration.po
Languages: it, ru

source: Wallet Notification
it: Notifica del portafoglio
ru: Уведомление кошелька

source: The Dash Core Daemon can be configured to execute an external script whenever an InstantSend transaction relating to that wallet is observed. This is configured by adding the following line to the dash.conf file::
it: Il Dash Core Daemon può essere configurato per eseguire uno script esterno ogni volta che viene osservata una transazione InstantSend relativa a quel portafoglio. Questo viene configurato aggiungendo la seguente riga al file dash.conf::
ru: Dash Core Daemon может быть настроен на выполнение внешнего скрипта каждый раз, когда наблюдается транзакция InstantSend, относящаяся к данному кошельку. Это настраивается путем добавления следующей строки в файл dash.conf::

source: This is typically used with a wallet that has been populated with `watch-only <https://docs.dash.org/projects/core/en/stable/docs/resources/glossary.html#watch-only-address>`__ addresses.
it: Questo viene in genere utilizzato con un portafoglio che è stato popolato con "watch-only <https://docs.dash.org/projects/core/en/stable/docs/resources/glossary.html#watch-only-address>" __ indirizzi.
ru: Обычно это используется с кошельком, в который добавлены адреса `только для просмотра <https://docs.dash.org/projects/core/en/stable/docs/resources/glossary.html#watch-only-address>`__.

source: Broadcasting InstantSend Transactions
it: Trasmissione di transazioni InstantSend
ru: Распространение транзакций InstantSend

source: Because all transactions on the Dash network are automatically InstantSend, no procedural changes are required to broadcast transactions as InstantSend.
it: Poiché tutte le transazioni sulla rete Dash vengono automaticamente inviate a InstantSend, non sono necessarie modifiche procedurali per trasmettere le transazioni come InstantSend.
ru: Поскольку все транзакции в сети Dash автоматически являются InstantSend, никаких процедурных изменений для трансляции транзакций как InstantSend не требуется.

source: Since Dash v0.14.0 established LLMQs on the Dash network, quorums will now attempt to lock every valid transaction by default without any additional fee or action by the sending wallet or user. A transaction is eligible for InstantSend when each of its inputs is considered confirmed. This is the case when at least one of the following circumstances is true:
it: Poiché Dash v0.14.0 ha stabilito LLMQs sulla rete Dash, i quorum tenteranno ora di bloccare ogni transazione valida per impostazione predefinita senza alcuna commissione o azione aggiuntiva da parte del portafoglio o dell'utente che invia. Una transazione è idonea per InstantSend quando ciascuno dei suoi input è confermato. Questo è il caso in cui si verifica almeno una delle seguenti circostanze:
ru: С момента появления в сети Dash версии 0.14.0 LLMQ, кворумы теперь будут пытаться заблокировать каждую действительную транзакцию по умолчанию без какой-либо дополнительной комиссии или действий со стороны отправляющего кошелька или пользователя. Транзакция имеет право на InstantSend, когда все ее входы считаются подтвержденными. Это происходит, если верно хотя бы одно из следующих обстоятельств:

source: the previous transaction referred to by the input is confirmed with 6 blocks
it: la transazione precedente a cui fa riferimento l'entrata viene confermata con 6 blocchi
ru: предыдущая транзакция, на которую ссылается вход, подтверждена 6 блоками

source: the previous transaction is confirmed through an older InstantSend lock
it: la transazione precedente viene confermata tramite un blocco InstantSend più vecchio
ru: предыдущая транзакция подтверждается через более старую блокировку InstantSend

source: the block containing the previous transaction is `ChainLocked <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__
it: il blocco contenente la transazione precedente è `ChainLocked <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__
ru: блок, содержащий предыдущую транзакцию, является `ChainLocked <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__.

source: When checking the previous transaction for an InstantSend lock, it is important to do this on mempool (non-mined) transactions. This allows chained InstantSend locking.
it: Quando si controlla la transazione precedente per un blocco InstantSend, è importante farlo sulle transazioni mempool (non estratte). Ciò consente il blocco InstantSend concatenato.
ru: При проверке предыдущей транзакции на наличие блокировки InstantSend важно выполнять эту проверку для транзакций mempool (не майнинговых). Это позволяет использовать блочную блокировку InstantSend.

source: Additional Resources
it: Risorse addizionali
ru: Дополнительные ресурсы

source: The following resources provide additional information about InstantSend and are intended to help provide a more complete understanding of the underlying technologies.
it: Le seguenti risorse forniscono ulteriori informazioni su InstantSend e hanno lo scopo di fornire una comprensione più completa delle tecnologie sottostanti.
ru: Следующие ресурсы предоставляют дополнительную информацию о функции InstantSend и предназначены для обеспечения более полного понимания базовых технологий.

source: `InstantSend Technical Information <https://github.com/dashpay/dash/blob/master/doc/instantsend.md#zmq>`__
it: `InstantSend informazioni tecniche <https://github.com/dashpay/dash/blob/master/doc/instantsend.md#zmq>`__
ru: `Техническая информация по InstantSend <https://github.com/dashpay/dash/blob/master/doc/instantsend.md#zmq>`__

source: :ref:`InstantSend Developer Documentation <core:guide-features-instantsend>`
it: :ref:`Documentazione per sviluppatori di InstantSend <core:guide-features-instantsend>`
ru: :ref:`Документация InstantSend для разработчиков <core:guide-features-instantsend>`

source: :ref:`Receiving ZMQ notifications <core:examples-receiving-zmq-notifications>`
it: :ref:`Ricezione notifiche ZMQ <core:examples-receiving-zmq-notifications>`
ru: :ref:`Получение ZMQ-уведомлений <core:examples-receiving-zmq-notifications>`

source: `Product Brief: Dash Core v0.14 Release <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__
it: `Descrizione del prodotto: versione Dash Core v0.14 <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__
ru: `Кратко о продукте: Релиз Dash Core v0.14 <https://blog.dash.org/product-brief-dash-core-release-v0-13-0-5d7fddffb7ef>`__

source: ChainLocks are a feature provided by the Dash Network which provides certainty when accepting payments. This technology, particularly when used in parallel with :ref:`InstantSend <instantsend>`, creates an environment in which payments can be accepted immediately and without the risk of “Blockchain Reorganization Events”.
it: I ChainLocks sono una funzionalità fornita da Dash Network che fornisce certezza nell'accettazione dei pagamenti. Questa tecnologia, in particolare se utilizzata in parallelo con :ref:`InstantSend <instantsend>`, crea un ambiente in cui i pagamenti possono essere accettati immediatamente e senza il rischio di “Eventi di riorganizzazione Blockchain”.
ru: ChainLocks - это функция, предоставляемая сетью Dash, которая обеспечивает определенность при приеме платежей. Эта технология, особенно при использовании параллельно с :ref:`InstantSend <instantsend>`, создает условия, в которых платежи могут быть приняты немедленно и без риска "событий реорганизации блокчейна".

source: The risk of blockchain reorganization is typically addressed by requiring multiple :term:`confirmations` before a transaction can be safely accepted as payment. This type of indirect security is effective, but at a cost of time and user experience. ChainLocks are a solution for this problem.
it: Il rischio di riorganizzazione della blockchain viene in genere risolto richiedendo più :term:`conferme` prima che una transazione possa essere accettata in modo sicuro come pagamento. Questo tipo di sicurezza indiretta è efficace, ma comporta un costo in termini di tempo e di esperienza dell'utente. I ChainLocks sono una soluzione a questo problema.
ru: Риск реорганизации блокчейна обычно устраняется путем требования многократного :term:`подтверждения`, прежде чем транзакция может быть безопасно принята к оплате. Такой тип косвенной защиты эффективен, но требует больших затрат времени и пользовательского опыта. ChainLocks - это решение данной проблемы.

source: Receiving ChainLocks
it: Ricevere ChainLocks
ru: Получение ChainLocks

source: Once a ChainLock is observed for a block, each transaction in that block and all previous blocks can be considered irreversibly and fully confirmed.
it: Una volta osservato un ChainLock per un blocco, ogni transazione in quel blocco e in tutti i blocchi precedenti può essere considerata irreversibilmente e completamente confermata.
ru: Как только для блока наблюдается ChainLock, каждая транзакция в этом блоке и во всех предыдущих блоках может считаться необратимой и полностью подтвержденной.

source: Receiving a ChainLock introduces two requirements:
it: Ricevere un ChainLock introduce due requisiti:
ru: Получение ChainLock влечет за собой два требования:

source: The ability to determine the “ChainLock Status” of a given block or transaction.
it: La capacità di determinare lo “Stato ChainLock” di un determinato blocco o transazione.
ru: Возможность определения "ChainLock Status" данного блока или транзакции.

source: ChainLock status is provided by the dash daemon, typically through a direct connection (e.g. RPC) or by a :ref:`ZMQ notification <core:examples-receiving-zmq-notifications>`.
it: Lo status di ChainLock è fornito dal dash daemon, tipicamente attraverso una connessione diretta (ad esempio RPC) o da una :ref:`notifica ZMQ <core:examples-receiving-zmq-notifications>`.
ru: Статус ChainLock предоставляется демоном dash, обычно через прямое соединение (например, RPC) или через :ref:`уведомление ZMQ <core:examples-receiving-zmq-notifications>`.

source: ChainLock status can be identified through direct connection with the Dash daemon using JSON-RPC protocol. The boolean ``chainlock`` attribute of the JSON response reflects the ChainLock status of the block or transaction and is included in the following commands:
it: Lo stato di ChainLock può essere identificato tramite la connessione diretta con il demone Dash utilizzando il protocollo JSON-RPC. L'attributo booleano ``chainlock`` della risposta JSON riflette lo stato ChainLock del blocco o della transazione ed è incluso nei seguenti comandi:
ru: Статус ChainLock может быть определен через прямое соединение с демоном Dash по протоколу JSON-RPC. Атрибут boolean ``chainlock`` в JSON-ответе отражает статус ChainLock блока или транзакции и включается в следующие команды:

source: ChainLock signatures are created shortly after the related block has been mined. As a result it is recommended that integrated clients use :ref:`ZMQ (ZeroMQ) notifications <core:examples-receiving-zmq-notifications>` in order to ensure that this information is received as promptly as possible. Refer to `the list of possible ZMQ notifications <https://github.com/dashpay/dash/blob/master/doc/zmq.md#usage>`__ for more details.
it: Le firme ChainLock vengono create poco dopo che il blocco correlato è stato estratto. Di conseguenza si consiglia ai client integrati di utilizzare :ref:`notifiche ZMQ (ZeroMQ) <core:examples-receiving-zmq-notifications>` per garantire che queste informazioni vengano ricevute il più tempestivamente possibile. Fare riferimento all'elenco delle possibili notifiche ZMQ <https://github.com/dashpay/dash/blob/master/doc/zmq.md#usage>`__ per maggiori dettagli.
ru: Подписи ChainLock создаются вскоре после майнинга соответствующего блока. В связи с этим рекомендуется, чтобы интегрированные клиенты использовали :ref:`ZMQ (ZeroMQ) notifications 1` для обеспечения максимально оперативного получения этой информации. Более подробная информация приведена в `списке возможных ZMQ-уведомлений <https://github.com/dashpay/dash/blob/master/doc/zmq.md#usage>`__.

source: The following notifications are relevant for recognizing blocks and their corresponding ChainLocks:
it: Le seguenti notifiche sono rilevanti per il riconoscimento dei blocchi e dei relativi ChainLock:
ru: Следующие уведомления относятся к распознаванию блоков и соответствующих им ChainLocks:

source: This sample code uses the `js-dashd-zmq library <https://github.com/dashpay/js-dashd-zmq>`__ to listen for ChainLock ZMQ notifications and return the hash of blocks that receive a ChainLock.
it: Questo codice di esempio utilizza la libreria `js-dashd-zmq <https://github.com/dashpay/js-dashd-zmq>`__ per ascoltare le notifiche ChainLock ZMQ e restituire l'hash dei blocchi che ricevono un ChainLock.
ru: Данный пример использует библиотеку `js-dashd-zmq <https://github.com/dashpay/js-dashd-zmq>`__ для прослушивания ZMQ-уведомлений ChainLock и возврата хэша блоков, получивших ChainLock.

source: Subscribe to ChainLock hash ZMQ notifications
it: Iscriviti alle notifiche ZMQ dell'hash ChainLock
ru: Следить за ZMQ-уведомлениям ChainLock hash

source: The Dash Core daemon can be configured to execute an external script whenever a ChainLock is received. This is configured by adding the following line to the dash.conf file::
it: Il daemon Dash Core può essere configurato per eseguire uno script esterno ogni volta che viene ricevuto un ChainLock. Questo viene configurato aggiungendo la seguente riga al file dash.conf::
ru: Демон Dash Core может быть настроен на выполнение внешнего скрипта при получении ChainLock. Это настраивается путем добавления следующей строки в файл dash.conf::

source: :ref:`ChainLock Developer Documentation <core:guide-features-chainlocks>`
it: :ref:`Documentazione per gli sviluppatori di ChainLock <core:guide-features-chainlocks>`
ru: :ref:`Документация ChainLocks для разработчиков <core:guide-features-chainlocks>`

source: Github source: https://github.com/dashpay/dash
it: Fonte Github: https://github.com/dashpay/dash
