Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/developers/sporks.po
Languages: ru

source: Information about sporks
ru: Информация о sporks

source: Sporks
ru: Спорки

source: A multi-phased fork, colloquially known as a "spork", is a mechanism unique to Dash used to safely deploy new features to the network through network-level variables to avoid the risk of unintended network forking during upgrades. It can also be used to disable certain features if a security vulnerability is discovered - see the :ref:`features page <sporks>` for a brief introduction to sporks.
ru: Многоэтапный форк, в просторечии называемый «spork », - это уникальный для Dash механизм, используемый для безопасного развертывания новых функций в сети с помощью переменных сетевого уровня, чтобы избежать риска непреднамеренного форка сети во время обновлений. Он также может быть использован для отключения определенных функций в случае обнаружения уязвимости в системе безопасности - краткое введение в sporks смотрите на :ref:`странице функций <sporks>`.

source: Enforcement of spork-controlled code can be activated remotely by members of the core development team signing a network message using a relevant private key. Should problems arise, the code can be deactivated in the same manner, without the need for a network-wide rollback or client update. This documentation describes the meaning of each spork currently existing on the network, and how to check their respective statuses.
ru: Активация кода, контролируемого spork, может быть произведена удаленно, если члены основной команды разработчиков подпишут сообщение в сети, используя соответствующий приватный ключ. В этой документации описано значение каждого spork'а, существующего в настоящее время в сети, и как проверить их состояние.

source: Spork functions
ru: Функции спорков

source: Sporks are set using integer values. Many sporks may be set to a particular epoch datetime (number of seconds that have elapsed since January 1, 1970) to specify the time at which they will active. Enabled sporks are set to 0 (seconds until activation). This function is often used to set a spork enable date so far in the future that it is effectively disabled until changed. The following sporks currently exist on the network and serve functions as described below:
ru: Спорки устанавливаются с использованием целочисленных значений. Многие спорки могут быть установлены на определённую опорную метку времени (количество секунд, прошедших с 1 января 1970 года) для указания времени, в которое они будут активны. Метки времени активированных спорков устанавливаются на 0 (секунды до активации). Эта функция часто используется для установки даты активации спорка в отдалённом будущем, если он установлен в отключенный режим до изменения. В настоящее время в сети существуют следующие спорки и они выполняют функции, описанные ниже:

source: Mainnet spork values were `hardened <https://github.com/dashpay/dash/pull/6140>`__ by immutably setting them. Sporks continue to be valuable for testing on other networks; however, on mainnet, the risks of maintaining them now outweigh the benefits of retaining them.
ru: Значения spork в mainnet были «зафиксированы» <https://github.com/dashpay/dash/pull/6140>`__ путем их неизменной установки. Sporks по-прежнему ценны для тестирования в других сетях; однако в mainnet риски, связанные с их поддержанием, теперь перевешивают выгоды от их сохранения.

source: Governs the ability of Dash clients to use InstantSend functionality. InstantSend is described in `DIP0010 LLMQ-based InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__.
ru: Определяет возможность использования клиентами Dash функциональности InstantSend. InstantSend описан в `DIP0010 LLMQ-based InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__.

source: If enabled, masternodes will reject blocks containing transactions in conflict with locked but unconfirmed InstantSend transactions.
ru: Если активирован, Мастерноды будут отклонять блоки, содержащие транзакции, конфликтующие с заблокированными, но неподтверждёнными транзакциями InstantSend.

source: If enabled, superblocks are verified and issued to pay proposal winners.
ru: Если активирован, суперблоки проверяются и выдаются для оплаты победивших предложений.

source: Enables the `DKG process to create LLMQ quorums <https://github.com/dashpay/dips/blob/master/dip-0006.md>`_. This spork will be turned on once 80% masternodes are upgraded to v0.14, which will enable DKG and DKG-based PoSe.
ru: Включает процесс `DKG для создания кворумов LLMQ <https://github.com/dashpay/dips/blob/master/dip-0006.md>`_. Этот spork будет включен после обновления 80% мастернод до версии 0.14, что позволит использовать DKG и PoSe на основе DKG.

source: Enables :ref:`ChainLocks <chainlocks>`, a mechanism of preventing the risk to payments introduced by blockchain reorganization events. ChainLocks are described in `DIP0008 ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__.
ru: Включает :ref:`ChainLocks 1`, механизм предотвращения риска для платежей, возникающего при реорганизации блокчейна. ChainLocks описаны в разделе `DIP0008 ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__.

source: Enables connections between all masternodes in a quorum to optimize the signature recovery process.
ru: Активирует соединения между всеми мастернодами в кворуме для оптимизации процесса восстановления подписи.

source: Enforces Proof of Service requirements for masternodes to support a minimum protocol version and maintain open ports.
ru: Обеспечивает выполнение требований Proof of Service к мастернодам по поддержке минимальной версии протокола и поддержанию открытых портов.

source: Supports enhanced hard fork (EHF) testing.
ru: Поддерживает тестирование enhanced hard fork (EHF).

source: Viewing spork status
ru: Просмотр статуса спорков

source: The ``spork show`` and ``spork active`` commands issued in the debug window (or from ``dash-cli`` on a masternode) allow you to interact with sporks. You can open the debug window by selecting **Window > Console**.
ru: Команды ``spork show`` и ``spork active``, подаваемые в окне отладки (или из ``dash-cli`` на мастерноде), позволяют взаимодействовать со спиками. Открыть окно отладки можно, выбрав **Window > Console**.

source: spork show and spork active output in the Dash Core debug console
ru: Результат выполнения команд “spork show” и “spork active” доступен в консоли отладки Dash Core
