Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/developers/testnet.po
Languages: it, zh_cn

source: Dash testnet and devnets are used by Dash developers for testing using tDASH
it: Dash testnet e devnet vengono utilizzati dagli sviluppatori Dash per testare utilizzando tDASH
zh_cn: 达世币开发者使用测试网络和开发者网络，结合tDASH进行测试

source: Testnet and devnets
it: Testnet e devnet
zh_cn: 测试网络和开发者网络

source: Testnet is a fully functioning Dash blockchain with the one key exception that because the Dash on the network can be created freely, it has no value. This currency, known as tDASH, can be requested from a faucet to help developers test new versions of Dash, as well as test network operations using identical versions of the software before they are carried out on the mainnet. There are a few other key differences:
it: Testnet è una blockchain Dash completamente funzionante con l'unica eccezione fondamentale che, poiché il Dash sulla rete può essere creato liberamente, esso non ha valore. Questa valuta, nota come tDASH, può essere richiesta da un faucet per aiutare gli sviluppatori a testare le nuove versioni di Dash, nonché a testare le operazioni di rete utilizzando versioni identiche del software prima che vengano eseguite sulla mainnet. Ci sono diverse altre differenze fondamentali:
zh_cn: 测试网络是一个拥有完整达世币区块链功能的网络，唯一的区别是测试网络中的达世币可以随意创建，没有任何价值。这种货币称为tDASH，可从内接头处请求获取，它可以帮助开发人员测试新版本的达世币，还可在相同的软件版本进入主网络之前，测试它们的网络运行。当然还有一些其他的主要差异：

source: Testnet operates on port 19999 (instead of 9999)
it: Testnet opera sulla porta 19999 (invece di 9999)
zh_cn: 测试网络于端口19999上运行（而非9999）

source: Testnet addresses start with "y" instead of "X", ADDRESSVERSION is 140 (instead of 76)
it: Gli indirizzi di testnet iniziano con "y" invece di "X", ADDRESSVERSION è 140 (invece di 76)
zh_cn: Testnet地址以 "y" 开头，而非 "X"，ADDRESSVERSION为140（而非76）

source: Testnet balances are denominated in tDASH (instead of DASH)
it: I saldi Testnet sono denominati in tDASH (invece di DASH)
zh_cn: Testnet余额以tDASH显示（而非DASH）

source: Protocol message header bytes are 0xcee2caff (instead of 0xbf0c6bbd)
it: I byte dell'intestazione del messaggio del protocollo sono 0xcee2caff (invece di 0xbf0c6bbd)
zh_cn: 协议消息首标字节为0xcee2caff（而非0xbf0c6bbd）

source: Bootstrapping uses different DNS seeds: test.dnsseed.masternode.io, testnet-seed.darkcoin.qa, testnet-seed.dashpay.io
it: Il bootstrap utilizza diversi seed DNS: test.dnsseed.masternode.io, testnet-seed.darkcoin.qa, testnet-seed.dashpay.io
zh_cn: Bootstrapping使用不同的DNS种子：test.dnsseed.masternode.io, testnet-seed.darkcoin.qa, testnet-seed.dashpay.io

source: Launching Dash Core in testnet mode shows an orange splash screen
it: L'avvio di Dash Core in modalità testnet mostra una schermata iniziale arancione

source: To start Dash Core in testnet mode, find your dash.conf file and enter the following line::
it: Per avviare Dash Core in modalità testnet, trova il tuo file dash.conf e inserisci la seguente riga::
zh_cn: 要在测试网络模式下启动Dash Core，首先请找到您的dash.conf文件，然后输入::

source: With the release of Dash Core 12.3, Dash added support for a great new feature — **named devnets**. Devnets are developer networks that combine some aspects of testnet (the global and public testing network) and some aspects of regtest (the local-only regression testing mode that provides controlled block generation). Unlike testnet, multiple independent devnets can be created and coexist without interference. For practical documentation on how to use devnets, see the :ref:`developer documentation <core:examples-testing-applications>` or this `blog post <https://blog.dash.org/dash-devnets-bc27ecbf0085>`__.
it: Con il rilascio di Dash Core 12.3, Dash ha aggiunto il supporto per una nuova fantastica funzionalità — **denominata devnet**. Le Devnet sono reti di sviluppatori che combinano alcuni aspetti di testnet (la rete di test globale e pubblica) e alcuni aspetti di regtest (la modalità di test di regressione solo locale che fornisce la generazione di blocchi controllata). A differenza di testnet, è possibile creare più devnet indipendenti e coesistere senza interferenze. Per la documentazione pratica su come utilizzare le devnet, consulta la :ref:`documentazione per gli sviluppatori <core:examples-testing-applications>` o questo `post sul blog <https://blog.dash.org/dash-devnets-bc27ecbf0085>`__.

source: Tools and links
it: Strumenti e collegamenti
zh_cn: 工具和链接

source: The links below were collected from various community sources and may not necessarily be online or functioning at any given time. Please join `Dash Discord <http://staydashy.com/>`_ or the `Dash Forum <https://www.dash.org/forum/>`_ if you have a question relating to a specific service.
it: I collegamenti seguenti sono stati raccolti da varie fonti della comunità e potrebbero non essere necessariamente online o funzionanti in un dato momento. Iscriviti a `Dash Discord <http://staydashy.com/>`_ o al `Dash Forum <https://www.dash.org/forum/>`_ se hai una domanda relativa a un servizio specifico.

source: **Test builds:** https://gitlab.com/dashpay/dash/pipelines
it: **Test build:** https://gitlab.com/dashpay/dash/pipelines

source: **Discussion and help:** https://www.dash.org/forum/topic/testing.53/
it: **Discussione e aiuto:** https://www.dash.org/forum/topic/testing.53/

source: **Masternode tools:** https://test.dashninja.pl/masternodes.html
it: **Strumenti masternode:** https://test.dashninja.pl/masternodes.html

source: **Testnet for Bitcoin:** https://en.bitcoin.it/wiki/Testnet
it: **Testnet per Bitcoin:** https://en.bitcoin.it/wiki/Testnet
zh_cn: **比特币测试网:** https://en.bitcoin.it/wiki/Testnet

source: Faucets
it: Faucet

source: Explorers
it: Explorer
zh_cn: 浏览器

source: Pools
it: Pool

source: Installing a masternode under testnet generally follows the same steps as the :ref:`mainnet masternode installation guide <masternode-setup>`, but with a few key differences:
it: L'installazione di un masternode sotto testnet generalmente segue gli stessi passaggi della: ref: `guida all'installazione del mainnet masternode <masternode-setup>`, ma con alcune differenze chiave:
zh_cn: 在测试网络下安装主节点，步骤一般与 :ref:`主网主节点安装指南 <masternode-setup>` 所述相同，除了一些关键的区别：

source: You will probably be running a development version of Dash instead of the stable release. See `here <https://gitlab.com/dashpay/dash/pipelines>`__ for a list of builds, then choose the latest successful ``develop`` build and click **Artifacts** to view a list of binaries.
it: Probabilmente eseguirai una versione di sviluppo di Dash invece della versione stabile. Vedi `qui <https://gitlab.com/dashpay/dash/pipelines>`__ per un elenco di build , quindi scegli l'ultima build ``develop`` build e fai clic su ** Artifacts ** per visualizzare un elenco di programmi binari.

source: When opening the firewall, port 19999 must be opened instead of (or in addition to) 9999. Use this command: ``ufw allow 19999/tcp``
it: Quando si apre il firewall, è necessario aprire la porta 19999 invece di (o in aggiunta a) 9999. Utilizza questo comando: ``ufw allow 19999 / tcp``
zh_cn: 打开防火墙时，必须也打开端口19999，不要打开（或除了）端口9999。使用此指令： ``ufw allow 19999/tcp``

source: Your desktop wallet must be running in testnet mode. Add the following line to *dash.conf*: ``testnet = 1``
it: Il tuo desktop wallet deve essere in esecuzione in modalità testnet. Aggiungi la seguente riga a *dash.conf*: ``testnet = 1``
zh_cn: 您的桌面钱包必须以测试网络模式运行。添加 *dash.conf*: ``testnet = 1``

source: When sending the collateral, you can get the 1000 tDASH for free from a faucet (see above)
it: Quando invii la garanzia, puoi ottenere 1000 tDASH gratuitamente da un faucet (vedi sopra)
zh_cn: 发送保证金时，您可以从内接头处免费获得1000 tDASH（见上文）

source: Your masternode configuration file must also specify testnet mode. Add the following line when setting up *dash.conf* on the masternode: ``testnet = 1``
it: Il tuo file di configurazione masternode deve anche specificare la modalità testnet. Aggiungi la seguente riga quando imposti *dash.conf* sul masternode: ``testnet = 1``
zh_cn: 您的主节点配置文件必须指定测试网络模式。在设置 *dash.conf* 时，请在主节点上添加: ``testnet = 1``

source: As for mainnet masternodes, the RPC username and password must contain alphanumeric characters only
it: Come per i mainnet masternode, il nome utente e la password RPC devono contenere solo caratteri alfanumerici.
zh_cn: 对于主网的主节点，RPC用户名和密码只能包含字母数字字符

source: The wallet holding the masternode collateral will expect to find the ``masternode.conf`` file in ``~/.dashcore/testnet3/masternode.conf`` instead of ``~/.dashcore/masternode.conf``.
it: Il portafoglio che contiene il collaterale masternode si aspetterà di trovare il file ``masternode.conf`` in ``~/.dashcore/testnet3/masternode.conf`` invece di ``~/.dashcore/masternode.conf``.

source: In June 2020, the Dash team announced the start of testing of the upcoming Dash 0.16.0 release. Extensive internal testing has already been done on the 0.16.0 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
it: Nel giugno 2020, il team Dash ha annunciato l'inizio dei test della prossima versione Dash 0.16.0. Sono già stati effettuati test interni approfonditi sul codice 0.16.0, ma ci sono numerosi bug che possono essere rivelati solo con l'uso effettivo da parte di persone reali. Il team Dash invita chiunque sia interessato a scaricare il software e diventare attivo su testnet. Questa versione include:

source: Block reward reallocation
it: Riallocazione Block reward

source: Core Wallet UI/UX Improvements
it: Miglioramenti all'interfaccia utente/UX del Core Wallet

source: Quorum Signing Optimizations
it: Ottimizzazioni della firma del quorum

source: Network Threading Improvement
it: Miglioramento del Network Threading

source: Minimum Protocol Check
it: Controllo minimo del protocollo

source: Bitcoin 0.16 and 0.17 Backports
it: Bitcoin 0.16 e 0.17 Backports

source: Discussion:
it: Discussione:

source: Testnet announcement: https://www.dash.org/forum/threads/v0-16-testing.50294/
it: Annuncio Testnet: https://www.dash.org/forum/threads/v0-16-testing.50294/

source: Product brief: https://blog.dash.org/updated-product-brief-dash-core-release-v0-16-0-d3debdb6242e
it: Descrizione del prodotto: https://blog.dash.org/updated-product-brief-dash-core-release-v0-16-0-d3debdb6242e

source: Testnet tools: https://docs.dash.org/en/stable/developers/testnet.html
it: Strumenti per Testnet: https://docs.dash.org/en/stable/developers/testnet.html

source: Issue tracking: https://github.com/dashpay/dash/issues/new
it: Monitoraggio dei problemi: https://github.com/dashpay/dash/issues/new

source: Latest test binaries:
it: Ultimi file binari di test:

source: In December 2019, the Dash team announced the start of testing of the upcoming Dash 0.15.0 release. Extensive internal testing has already been done on the 0.15.0 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
it: A dicembre 2019, il team Dash ha annunciato l'inizio dei test della prossima versione Dash 0.15.0. Sono già stati effettuati test interni approfonditi sul codice 0.15.0, ma ci sono numerosi bug che possono essere rivelati solo con l'uso effettivo da parte di persone reali. Il team Dash invita chiunque sia interessato a scaricare il software e diventare attivo su testnet. Questa versione include:

source: Removal of legacy code
it: Rimozione del codice legacy

source: Testnet announcement: https://www.dash.org/forum/threads/v15-0-testing.49140/
it: Annuncio della Testnet: https://www.dash.org/forum/threads/v15-0-testing.49140/

source: Product brief: https://blog.dash.org/product-brief-dash-core-release-v0-15-0-acd7633a91ab
it: Descrizione del prodotto: https://blog.dash.org/product-brief-dash-core-release-v0-15-0-acd7633a91ab

source: In March 2019, the Dash team announced the start of testing of the upcoming Dash 0.14.0 release. Extensive internal testing has already been done on the 0.14.0 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
it: Nel marzo 2019, il team Dash ha annunciato l'inizio dei test della prossima versione Dash 0.14.0. Sono già stati effettuati test interni approfonditi sul codice 0.14.0, ma ci sono numerosi bug che possono essere rivelati solo con l'effettivo utilizzo da parte di persone reali. Il team Dash invita chiunque sia interessato a scaricare il software e diventare attivo su testnet. Questa versione include:

source: Testnet announcement: https://www.dash.org/forum/threads/v14-0-testing.44047/
it: Annuncio della Testnet: https://www.dash.org/forum/threads/v14-0-testing.44047/

source: Product brief: https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96
it: Descrizione del prodotto: https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96

source: In November 2018, the Dash team announced the start of testing of the upcoming Dash 0.13.0 release. Extensive internal testing has already been done on the 0.13.0 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
it: Nel novembre 2018, il team Dash ha annunciato l'inizio dei test della prossima versione Dash 0.13.0. Sono già stati effettuati test interni approfonditi sul codice 0.13.0, ma ci sono numerosi bug che possono essere rivelati solo con l'uso effettivo da parte di persone reali. Il team Dash invita chiunque sia interessato a scaricare il software e diventare attivo su testnet. Questa versione include:

source: Automatic InstantSend for Simple Transactions
it: Invio istantaneo automatico per transazioni semplici

source: Deterministic Masternode List
it: Lista dei Masternode Deterministici

source: 3 Masternode Keys: Owner, Operator and Voting
it: 3 Chiavi Masternode: Proprietario, Operatore e Votazione

source: Special Transactions
it: Transazioni Speciali

source: PrivateSend Improvements
it: Miglioramenti di PrivateSend

source: Testnet announcement: https://www.dash.org/forum/threads/v13-0-testing.41945/
it: Annuncio della Testnet: https://www.dash.org/forum/threads/v13-0-testing.41945/

source: Product brief: https://blog.dash.org/product-brief-dash-core-release-v0-13-0-5d7fddffb7ef
it: Descrizione del prodotto: https://blog.dash.org/product-brief-dash-core-release-v0-13-0-5d7fddffb7ef

source: In June 2018, the Dash team announced the start of testing of the upcoming Dash 0.12.3 release. Extensive internal testing has already been done on the 0.12.2 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
it: Nel giugno 2018, il team Dash ha annunciato l'inizio dei test della prossima versione Dash 0.12.3. Sono già stati effettuati test interni approfonditi sul codice 0.12.2, ma ci sono numerosi bug che possono essere rivelati solo con l'effettivo utilizzo da parte di persone reali. Il team Dash invita chiunque sia interessato a scaricare il software e diventare attivo su testnet. Questa versione include:

source: Named Devnets, to help developers quickly create multiple independent devnets
it: Devnet denominati, per aiutare gli sviluppatori a creare rapidamente più devnet indipendenti

source: New format of network message signatures
it: Nuovo formato delle firme dei messaggi di rete

source: Governance system improvements
it: Miglioramenti del sistema di governance

source: PrivateSend improvements
it: Miglioramenti di PrivateSend

source: Additional indexes cover P2PK now
it: Gli indici aggiuntivi ora coprono P2PK

source: Support for pruned nodes in Lite Mode
it: Supporto per nodi potati in modalità Lite

source: New Masternode Information Dialog
it: Nuova finestra di dialogo delle informazioni sul Masternode

source: In October 2017, the Dash team announced the launch of a testnet for public testing of the upcoming 0.12.2 release of the Dash software. Extensive internal testing has already been done on the 0.12.2 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
it: Nell'ottobre 2017, il team Dash ha annunciato il lancio di un testnet per testare pubblicamente la prossima versione 0.12.2 del software Dash. Sono già stati effettuati test interni approfonditi sul codice 0.12.2, ma ci sono numerosi bug che possono essere rivelati solo con l'effettivo utilizzo da parte di persone reali. Il team Dash invita chiunque sia interessato a scaricare il software e diventare attivo su testnet. Questa versione include:

source: DIP0001 implementation https://github.com/dashpay/dips/blob/master/dip-0001.md
it: Implementazione DIP0001 https://github.com/dashpay/dips/blob/master/dip-0001.md

source: 10x transaction fee reduction (including InstantSend fee)
it: Riduzione di 10x delle commissioni di transazione (inclusa la commissione InstantSend)

source: InstantSend vulnerability fix
it: Correzione della vulnerabilità InstantSend

source: Lots of other bug fixes and performance improvements
it: Molte altre correzioni di bug e miglioramenti delle prestazioni

source: Experimental BIP39/BIP44 complaint HD wallet (disabled by default, should be fully functional but there is no GUI yet)
it: Wallet HD sperimentale con reclamo BIP39/BIP44 (disabilitato per impostazione predefinita, dovrebbe essere completamente funzionante ma non è ancora disponibile la GUI)

source: Testnet 12.2 discussion: https://www.dash.org/forum/threads/v12-2-testing.17412/
it: Discussione Testnet 12.2: https://www.dash.org/forum/threads/v12-2-testing.17412/

source: Testnet tools: https://www.dash.org/forum/threads/testnet-tools-resources.1768/
it: Strumenti di testnet: https://www.dash.org/forum/threads/testnet-tools-resources.1768/

source: Latest successfully built develop branch binaries:
it: Gli ultimi binari di branch sviluppati con successo:

source: dash, masternodes, testnet, devnet, faucet, masternodes, testing, pool, explorer, mining pools, block explorer
zh_cn: 达世币，主节点，测试网，开发者网络，内接头，主节点，测试，池，浏览器，矿池，区块链浏览器

source: **Bugtracker:** https://github.com/dashpay/dash/issues/new
zh_cn: **错误追踪程序:** https://github.com/dashpay/dash/issues/new

source: Masternodes
zh_cn: 主节点
