Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/developers/translating.po
Languages: ar, es, fr, it, ru

source: This project contains all content from the Dash Documentation hosted at https://docs.dash.org (probably the site you are reading now). Each ``.html`` page in the documentation appears as a file in the resources section, named according to the navigation steps required to open the page. The Dash Documentation is written in a documentation language called `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ and built using the open-source `Sphinx Documentation Generator <https://www.sphinx-doc.org>`_. To simplify layout, most of the text has no markup or code marks at all, but hyperlinks and certain formatting must be reproduced in the target language as follows:
fr: Ce projet comporte tout le contenu de la documentation Dash hébergée à l'adresse https://docs.dash.org (sans doute le site que vous êtes en train de lire). Chaque page ".html" de la documentation apparaît comme fichier dans la section des ressources, nommé selon le chemin de navigation requis pour accéder à la page. La documentation Dash est écrite dans un langage de documentation appelé `reStructuredText <http://docutils.sourceforge.io/rst.html>`_ et elle est bâtie avec le logiciel open source `Sphinx Documentation Generator <http://www.sphinx-doc.org>`_. Pour simplifier la mise en page, la majorité du texte n'a pas de balises ou de marqueurs de code, mais les hyperliens et certains éléments de formatage doivent être reproduits dans la langue cible comme suit :
it: Questo progetto contiene tutta la documentazione Dash ospitata su https://docs.dash.org (probabilmente il sito che stai leggendo ora). Ogni pagina ``.html`` nella documentazione appare come un file nella sezione risorse, denominata in base ai passaggi di navigazione richiesti per aprire la pagina. La documentazione Dash è scritta in un linguaggio di documentazione chiamato `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ e creata utilizzando il generatore di documentazione open source `Sphinx Documentation Generator <https://www.sphinx-doc.org>`_. Per semplificare il layout, la maggior parte del testo non presenta alcun markup o codice, ma i collegamenti ipertestuali e alcune formattazioni devono essere riprodotti nella lingua di destinazione come segue:
ru: Этот проект содежит все материалы Документов Dash, находящихся по адресу https://docs.dash.org (вероятно, именно этот сайт вы сейчас читаете). Каждая ``.html`` страница в документации представляет собой файл в разделе ресурсов, названный в соответсnвии с теми шагами, которые необходимо предпринять, чтобы открыть соответствующую страницу. Документация Dash написана на специальном языке для составления документации, называемом `reStructuredText <https://docutils.sourceforge.io/rst.html>`_ и создана с помощью `Sphinx Documentation Generator <https://www.sphinx-doc.org>`_, написанном на открытом коде. Для упрощения представления, большая часть текста составлена без пометок или кодовых отметок, но гиперссылки и определённый формат должны быть воспроизведены и в языке перевода.

source: Inline literals
ar: القيم الحرفية المضمنة
es: Literales entre líneas
fr: Caractères littéraux en ligne
it: Inline letterali
ru: Встроенные литералы

source: **Source:** Type \`\`./dash-qt\`\` to run the file.
ar: **المصدر:** اكتب ``./dash-qt`` لتشغيل الملف.
es: **Fuente:** Escriba \`\`./dash-qt\`\` para correr el archivo.
it: ** Fonte: ** Digita \ `\` ./dash-qt \ `\` per eseguire il file.

source: **Target:** Escriba \`\`./dash-qt\`\` para correr el archivo.
es: **Objetivo:** Escriba \`\`./dash-qt\`\` para correr el archivo.
fr: **Cible :** Tapez \`\`./dash-qt\`\` pour lancer le fichier.
it: ** Fonte: ** Digita \ `\` ./dash-qt \ `\` per eseguire il file.

source: Note that two backticks `````` before and after a word or phrase will cause that text to appear as an ``inline literal``. This is commonly used to highlight code or commands to be typed by the user.
ar: لاحظ أن اثنين من `````` قبل وبعد كلمة أو عبارة سيؤدي إلى أن يظهر النص ك ``الحرفي مضمنة`` . يُستخدم هذا بشكل شائع لتمييز رمز أو أوامر ليتم كتابتها بواسطة المستخدم.
es: Ten en cuenta que dos comillas `````` antes y después de una palabra o frase harán que ese texto aparezca como un ``literal entre líneas``. Esto se usa comúnmente para resaltar códigos o comandos que el usuario debe escribir.
fr: Veuillez noter que les deux accents graves `````` avant et après un mot ou une phrase feront que le texte apparaîtra comme "caractères littéraux en ligne". Cela est communément employé pour souligner le code ou les commandes devant être tapés par l'utilisateur.
it: Nota che due backtick `` `` `` prima e dopo una parola o una frase faranno apparire quel testo come un `` inline letterale ''. Questo è comunemente usato per evidenziare codici o comandi che devono essere digitati dall'utente.
ru: Обратите внимание, что двойные обратные кавычки `````` до и после слова или фразы преобразят текст в ``встроенный литерал``. Это часто используется, чтобы выделить код или команды, которые нужно печатать пользователю.

source: Bold and italic
fr: Gras et italique
it: Grassetto e corsivo
ru: Шрифты: жирный и курсив

source: **Source:** ``To encrypt your wallet, click **Settings** > **Encrypt** wallet.``
ar: **المصدر:** ``لتشفير محفظتك ، انقر فوق **إعدادات**> **تشفير** المحفظة.``
es: **Fuente:** ``Para encriptar tu billetera, haz click en **Ajustes** > **Encriptar** billetera.``
it: ** Fonte: ** `` Per crittografare il tuo portafoglio, fai clic su ** Impostazioni **> ** Crittografa ** portafoglio. ''

source: **Target:** ``Para encriptar su billetera, haga click en **Settings** > **Encrypt** billetera.``
es: **Objetivo:** ``Para encriptar su billetera, haz click en **Ajustes** > **Encriptar** billetera.``
fr: **Cible :** ``Pour chiffrer votre portefeuille, cliquez sur **Réglages** > **Chiffrer** le portefeuille.``
it: ** Destinazione: ** `` Per crittografare il tuo portafoglio, fai clic su ** Impostazioni **> ** Crittografa ** portafoglio. ''

source: A single ``*`` before and after a word or phrase will render it in an *italic* font, while a double ``**`` will render it in **bold**.
ar: كلمة ``*`` مفردة قبل وبعد كلمة أو عبارة ستجعلها بخط *italic* ، في حين أن ثنائية ``**`` ستجعلها في **bold**.
es: Un solo ``*`` antes y después de una palabra o frase especificará una fuente *italic*, mientras que un ``**`` doble especificará una fuente **bold**.
fr: Un ``*`` unique avant et après un mot ou une phrase donnera un affichage en *italique*, tandis qu'un ``**`` double l'affichera en **gras**.
it: Un singolo ``*`` prima e dopo una parola o una frase renderà questa in un carattere * corsivo *, mentre un doppio ``**`` la convertirà in ** grassetto **.
ru: Одиночное``*`` перед и после слова или фразы поменяет написание на курсив, а двойное ``**`` поменяет написание на жирное.

source: Internal hyperlinks
ar: الارتباطات الداخلية
es: Hipervinculo interno
fr: Hyperliens internes
it: Collegamenti ipertestuali interni
ru: Внутренние гиперссылки

source: **Source:** ``See :ref:`here <sporks>` for a brief introduction to sporks.``
ar: **المصدر:** ``انظر :ref:`هنا <sporks>` للحصول على مقدمة موجزة عن السيقان.``
es: **Fuente:** ``Vea :ref:`aqui <sporks>` para una breve introduccióna los sporks.``
it: ** Fonte: ** `` Vedi: ref: `qui <sporks>` per una breve introduzione agli spork.``

source: **Target:** ``Ver :ref:`aquí <sporks>` para una breve introducción a sporks``
es: **Objetivo:** ``Ver :ref:`aquí <sporks>` para una breve introducción a sporks``
fr: **Cible :** ``Voir :ref:`ici <sporks>` une brève introduction aux sporks``
it: ** Destinazione: ** `` Vedi: ref: `qui <sporks>` per una breve introduzione agli spork.``

source: An internal hyperlink consists of the phrase ``:ref:``, followed by a single backtick `````, followed by some text which must be translated, followed by angle brackets with the link target ``< >``, followed by another backtick `````. Translate the text, but do not translate the text inside the angle brackets.
ar: يتكون الارتباط التشعبي الداخلي من عبارة ``:ref:`` ، متبوعة برمز خلفي مفرد ````` ، متبوعًا ببعض النص الذي يجب ترجمته ، متبوعًا بأقواس زاوية ذات هدف الارتباط ``<>`` ، تليها آخر ````` . ترجمة النص ، ولكن لا تترجم النص داخل أقواس زاوية.
es: Un hipervinculo interno consiste en la frase ``:ref:``, seguido por comilla simple `````, seguido por algún texto que debe ser traducido, seguido por paréntesis angulares con el enlace objetivo ``< >``, seguido por otra comilla `````. Traduzca el texto, pero no traduzca el texto dentro de los paréntesis angulares.
fr: Un hyperlien interne consiste en la mention ":ref:" suivie par un accent grave unique ````` et par le texte devant être traduit, puis par des signes "<>" contenant le lien cible, puis par un autre accent grave `````. Veuillez traduire le texte, mais ne traduisez pas le texte inclus entre les signes "<>".
it: Un collegamento ipertestuale interno è costituito dalla frase ``:ref:``, seguita da un singolo backtick `````, seguito da un testo che deve essere tradotto, seguito da parentesi angolari con l'obiettivo del collegamento ``< >``, seguito da un altro backtick `````. Traduci il testo, ma non tradurre il testo all'interno delle parentesi angolari.
ru: Внутренняя гиперссылка состоит из фразы ``:ref:``, за которой следуют одиночные обратные кавычки `````, за которыми следует текст, который необходимо перевести, после него идут угловые скобки, связывающие с изначальным текстом ``< >``, далее идут ещё обратные кавычки `````. Необходимо перевести текст, но не переводить текст внутри угловых скобок.

source: External hyperlinks
ar: الارتباطات الخارجية
es: Hyperlinks externos
fr: Hyperliens externes
it: Collegamenti ipertestuali esterni
ru: Внешние гиперссылки

source: **Source:** ``The `official Dash website <https://www.dash.org>`_ also provides a list of major exchanges offering Dash.``
ar: **المصدر:** `الموقع الرسمي لداش <https://www.dash.org>`_ كما يوفر قائمة من التبادلات الرئيسية التي تقدم داش.
es: **Fuente:** ``El `Stio web oficial de Dash <https://www.dash.org>`_ también proporciona una lista de las principales casas de cambio que ofrecen Dash.``
it: ** Fonte: ** `` Il `sito web ufficiale di Dash <https://www.dash.org>` _ fornisce anche un elenco dei principali exchange che offrono Dash. ``

source: **Target:** ``El `sitio web oficial de Dash <https://www.dash.org>`_ también proporciona una lista de las principales Casas de cambio o Exchanges que ofrecen Dash.``
es: **Objetivo:** ``El `sitio web oficial de Dash <https://www.dash.org>`_ también proporciona una lista de las principales Casas de cambio o Exchanges que ofrecen Dash.``
fr: **Cible :** ``Le `site officiel Dash <https://www.dash.org>`_ fournit également une liste des plus importantes plateformes de change proposant Dash.``
it: ** Destinazione: ** `` Il `sito web ufficiale di Dash <https://www.dash.org>` _ fornisce anche un elenco dei principali exchange che offrono Dash. ``

source: An external hyperlink consists of a single backtick `````, followed by some text which must be translated, followed by angle brackets with the link target ``< >``, followed by another backtick and a single or double underscore: ```_`` or ```__``. Translate the text, but do not translate the hyperlink (unless you want to link to a version of the page in the target language).
ar: يتألف الارتباط التشعبي الخارجي من مفرد ````` , متبوعًا ببعض النص الذي يجب أن يترجم ، متبوعًا بأقواس زاوية مع هدف الارتباط ``<>`` ، متبوعًا ب آخر وتسطير سفلي مفرد أو مزدوج: ``` _`` أو ```__`` . ترجمة النص ، ولكن لا تترجم الارتباط التشعبي (إلا إذا كنت تريد الارتباط بإصدار من الصفحة باللغة الهدف).
es: Un hipervinculo externo consiste de comilla simple `````, seguido por algún texto que debe ser traducido, seguido por paréntesis angulares con el enlace objetivo ``< >``, seguido por otra comilla y un guión bajo sencillo o doble: ```_`` o ```__``. Traduzca el texto, pero no traduzca el hipervinculo (a menos que quiera enlazar a una versión de la página en el lenguaje objetivo).
fr: Un hyperlien externe consiste en un accent grave unique `````, suivi par le texte devant être traduit, suivi par les signes ``< >`` contenant le lien cible, suivis par un autre accent grave et un trait soulignant simple ou double : ```_`` ou ```__``. Veuillez traduire le texte, mais ne traduisez pas l'hyperlien (sauf si vous souhaitez diriger le lien vers une version de la page dans votre langue cible).
it: Un collegamento ipertestuale esterno è costituito da un singolo backtick `````, seguito da un testo che deve essere tradotto, seguito da parentesi angolari con la destinazione del collegamento``<>``, seguito da un altro backtick e un carattere di sottolineatura singolo o doppio:```_`` o ```__``. Traduci il testo, ma non tradurre il collegamento ipertestuale (a meno che tu non voglia collegarti a una versione della pagina nella lingua di destinazione).
ru: Внешняя гиперссылка состоит из одиночных обратных кавычек `````, за которыми следует текст, который необходимо перевести, после него идут угловые скобки, связывающие с изначальным текстом ``< >``, далее идут ещё обратные кавычки и одиночное или двойное подчёркивание: ```_`` или ```__``. Необходимо перевести текст, но не переводить гиперссылку (если только вы не хотите дать ссылку на станицу в переведённом языке).

source: Dash visual products such as infographics, flyers and conference handouts are produced using Adobe InDesign, Adobe Illustrator or Microsoft Word and are available for use in the :ref:`Marketing section <marketing>` of the Dash Documentation. It is important to view the finished English layout during translation in order to understand the context of the text you are translating. For example, many words should be translated differently depending if they are a heading, a sentence or an item in a diagram.
ar: يتم إنتاج منتجات داش المرئية مثل الرسوم البيانية والنشرات الإعلانية والمؤتمرات باستخدام Adobe InDesign أو Adobe Illustrator أو Microsoft Word وهي متاحة للاستخدام في :ref:`قسم التسويق <marketing>` من وثيقة داش. من المهم عرض تخطيط اللغة الإنجليزية النهائي أثناء الترجمة لفهم سياق النص الذي تقوم بترجمته. على سبيل المثال ، يجب ترجمة العديد من الكلمات بشكل مختلف اعتمادًا على ما إذا كانت عنوانًا أو جملة أو عنصرًا في الرسم التخطيطي.
es: Los productos visuales de Dash como, por ejemplo, infografías, volantes y folletos de conferencias se producen con Adobe InDesign, Adobe Illustrator o Microsoft Word y están disponibles para su uso en la :ref:`Sección de mercadeo <marketing>` de la documentación de Dash. Es importante ver el diseño en inglés terminado durante la traducción para comprender el contexto del texto que estás traduciendo. Por ejemplo, muchas palabras deben traducirse de manera diferente dependiendo de si son un encabezado, una oración o un elemento en un diagrama.
fr: Les ressources graphiques Dash tels que les infographies, les tracts et les prospectus de conférence sont conçus avec Adobe InDesign, Adobe Illustrator ou Microsoft Word, et ils sont disponibles dans la :ref:`section marketing <marketing>` de la documentation Dash. Il est important de visualiser la mise en page anglaise pendant la traduction, afin de comprendre le contexte du texte que vous traduisez. Par exemple, beaucoup de mots doivent être traduits différemment selon qu'ils soient en en-tête, dans une phrase, ou encore sous forme d'élément d'un diagramme.
it: I prodotti visivi Dash come infografiche, volantini e dispense per conferenze sono prodotti utilizzando Adobe InDesign, Adobe Illustrator o Microsoft Word e sono disponibili per l'uso nella: ref: `Marketing section <marketing>` della documentazione Dash. È importante visualizzare il layout in inglese finito durante la traduzione per comprendere il contesto del testo che stai traducendo. Ad esempio, molte parole dovrebbero essere tradotte in modo diverso a seconda che si tratti di un'intestazione, una frase o un elemento in un diagramma.
ru: Визуальные материалы от Dash, такие как инфографика, флаеры, раздаточные материалы на конференциях создаются в Adobe InDesign, Adobe Illustrator или Microsoft Word и доступны к использованию в :ref:`Маркетинг зайдите <marketing>` Документации Dash. При переводе важно ознакомиться с законченным оформлением на английском языке, чтобы понимать контекст того, что вы переводите. Перевод многих слов может разниться, в зависимости от того, являются ли они заголовком, частью предложения или описанием на диаграмме.

source: Because these proprietary file formats are not easily handled by Transifex, the language content is exported to a text or Microsoft Excel file and uploaded to Transifex for processing. If you translate Dash Graphics, please send an email to leon.white@dash.org or @strophy on `Discord <http://dashchat.org>`_ when you are finished to request layout in the visual design.
ar: نظرًا لأنه لا يسهل التعامل مع تنسيقات الملفات الشخصية هذه بواسطة Transifex ، يتم تصدير محتوى اللغة إلى نص أو ملف Microsoft Excel وتحميله إلى Transifex للمعالجة. إذا كنت تترجم تصاميم داش ، فيرجى إرسال بريد إلكتروني إلى leon.white@dash.org أو strophy في `Discord <http://dashchat.org>`_ عند الانتهاء من طلب التخطيط في التصميم المرئي.
es: Debido a que estos formatos de archivo patentados no son manejados fácilmente por Transifex, el contenido del idioma se exporta a un archivo de texto o a Microsoft Excel y se carga a Transifex para su procesamiento. Si traduces gráficos de Dash, envís un correo electrónico a leon.white@dash.org o @strophy en `Discord <http://dashchat.org>`_ cuando haya sterminado de solicitar el diseño en el diseño visual.
fr: Ces formats de fichier propriétaires n'étant pas gérés facilement par Transifex, leur texte est exporté sous forme de fichier texte ou de fichier Excel, qui est téléversé dans Transifex pour être traduit. Si vous traduisez des ressources graphiques Dash, veuillez envoyer un message à leon.white@dash.org ou @strophy sur `Discord <http://dashchat.org>`_ quand vous avez terminé, afin de demander une mise en page du résultat.
it: Poiché questi formati di file proprietari non sono facilmente gestiti da Transifex, il contenuto della lingua viene esportato in un file di testo o Microsoft Excel e caricato su Transifex per l'elaborazione. Se traduci Dash Graphics, invia un'e-mail a leon.white@dash.org o @strophy su `Discord <http://dashchat.org>` _ quando hai finito di richiedere il layout nel design visivo.
ru: По причине того, что Transifex не просто обрабатывать эти проприетарные форматы файлов, их языковое содержимое экспортируется в текст или файл Microsoft Excel, после чего он загружается в Transifex для обработки. Если вы переводите Графические материалы Dash, то для того, чтобы запросить визуальное оформление, отправьте письмо на leon.white@dash.org или @strophy в `Discord <http://dashchat.org>`_ , после того как закончите.

source: Dash iOS Wallet
ar: محفظة داش في الأيفون
es: Billetera Dash para iOS
fr: Portefeuille IOS Dash
it: Portafoglio Dash iOS
ru: Кошелёк Dash для iOS

source: All language content from the :ref:`Dash iOS Wallet <dash-ios-wallet>` are available for translation in this project. Please have a device running the iOS wallet available during translation to understand the context of the text you are translating. Note that any placeholders in the source text segment must also appear in the target language, similar to the instructions above for Dash Core Wallet.
ar: كل محتوى اللغة من :ref:`محفظة داش في الأيفون <dash-ios-wallet>` متاحة للترجمة في هذا المشروع. يرجى أن يكون لديك جهاز يقوم بتشغيل محفظة الأيفون أثناء عملية الترجمة لفهم سياق النص الذي تقوم بترجمته. لاحظ أن أي عنصر نائب في جزء النص المصدر يجب أن يظهر أيضًا في اللغة الهدف ، على غرار الإرشادات الواردة أعلاه لمحفظة داش كور.
es: Todo el lenguaje del contenido de la :ref:`Biletera Dash iOS <dash-ios-wallet>` está disponible para la traducción en este proyecto. Ten a mano un dispositivo disponible con la billetera iOS durante la traducción para comprender el contexto del texto que estás traduciendo. Ten en cuenta que cualquier marcador de posición en el segmento de texto de origen también debe aparecer en el idioma de destino, similar a las instrucciones anteriores para la Billetera Dash Core.
fr: Tout le contenu texte du :ref:`portefeuille logiciel Dash pour iOS <dash-ios-wallet>` est disponible pour traduction dans ce projet. Veuillez disposer d'un appareil iOS pour lancer le portefeuille iOS pendant la traduction, et comprendre le contexte du texte que vous traduisez. Veuillez noter que tous les espaces réservés apparaissant dans le texte source doivent aussi apparaître dans le texte cible, de la même manière que dans les instructions ci-dessus relatives au portefeuille logiciel Dash Core.
it: Tutti i contenuti in lingua da: ref: `Dash iOS Wallet <dash-ios-wallet>` sono disponibili per la traduzione in questo progetto. Tieni a disposizione un dispositivo che esegue il portafoglio iOS durante la traduzione per comprendere il contesto del testo che stai traducendo. Tieni presente che tutti i segnaposto nel segmento di testo di origine devono apparire anche nella lingua di destinazione, in modo simile alle istruzioni per Dash Core Wallet.
ru: Все содержимое :ref:`Dash iOS Wallet <dash-ios-wallet>` доступно для перевода в этом проекте. Расположите рядом устройство с работающим iOS кошельком, чтобы понимать контекст переводимого. Имейте в виду, что все местозаполнители в исходном тексте должны быть и в переведённом тексте, точно так же, как в инструкции для кошелька Dash Core, которые находятся выше.

source: Dash Android Wallet
ar: محفظة الدش في الأندرويد
es: Billetera Dash para Android
fr: Portefeuille Android Dash
it: Portafoglio Dash Android
ru: Кошелёк Dash для Android
