Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/developers/translating.po
Languages: ar, es, fr, it, ru

source: Translate Dash products such as wallets, websites and documentation using Transifex
ar: ترجمة منتجات داش مثل المحافظ والمواقع الإلكترونية والوثائق باستخدام Transifex
es: Traducir productos Dash como las billeteras, páginas web y documentación usando Transifex
fr: Traduisez les produits Dash tels que les portefeuilles, les sites web et la documentation avec Transifex
it: Traduci prodotti Dash come wallet, siti Web e documentazione utilizzando Transifex
ru: Переводите продукты Dash, такие как кошельки, веб-сайты и документацию, используя Transifex

source: dash, translate, localize, syntax, website, android, ios, wallets, documentation, dash core
ar: داش ، ترجمة ، الأماكن ، المزامنة ، الموقع ، الأندرويد ، الأيفون ، محافظ ، وثائق ، داش كور
es: dash, traducción, localizar, sintaxis, página web, android, ios, billeteras, documentación, dash core
fr: dash, traduction, traduire, syntaxe, site web, android, ios, portefeuilles, documentation, dash core
it: dash, traduci, localizza, sintassi, sito web, android, ios, portafogli, documentazione, core di dash
ru: dash, переводить, локализовать, синтаксис, веб-сайт, android, ios, кошельки, документация, dash core

source: Translating Dash
ar: ترجمة داش
es: Traduciendo Dash
fr: Traduire Dash
it: Traduzione di Dash
ru: Перевод Dash на местные языки

source: Translations of all Dash products are managed courtesy of Transifex, which offers its own detailed documentation of all functions and features. Within Transifex, Dash maintains an organization which contains multiple projects and one team of translators assigned to all of the projects. Each project is assigned with one or more target languages for translation by the project maintainer. When a translator joins the team, they are able to choose the languages they feel able to translate. They can then work on any projects specifying this language as a target language.
ar: تتم إدارة ترجمات جميع منتجات داش بإذن من Transifex ، والتي تقدم وثائقها التفصيلية الخاصة بكل الوظائف والميزات. داخل Transifex ، تحافظ داش على منظمة تحتوي على عدة مشاريع وفريق واحد من المترجمين المعينين لجميع المشاريع. يتم تعيين كل مشروع بلغة هدف أو أكثر للترجمة من قبل المشرف على المشروع. عندما ينضم أحد المترجمين إلى الفريق ، سيكون بإمكانهم اختيار اللغات التي يشعرون أنهم قادرون على ترجمتها. ويمكنهم بعد ذلك العمل على أي مشاريع تحدد هذه اللغة كلغة مستهدفة.
es: Las traducciones de todos los productos Dash son administradas por cortesía de Transifex, que ofrece su propia documentación detallada de todas las funciones y características. Dentro de Transifex, Dash mantiene una organización que contiene múltiples proyectos y un equipo de traductores asignados a todos los proyectos. Cada proyecto está asignado a uno o más idiomas de destino para su traducción por el adminstrador del proyecto. Cuando un traductor se une al equipo, está habilitado para elegir el idioma en el que se sienta capaz de traducir. Los traductores pueden trabajar en cualquier proyecto que especifique este idioma como idioma de destino.
fr: Les traductions de tous les produits Dash sont gérées par Transifex, qui propose sa propre documentation détaillée sur toutes ses fonctionnalités et caractéristiques. Au sein de Transifex, Dash dispose d'une organisation qui comporte de nombreux projets et une équipe de traducteurs assignés à tous les projets. Chaque projet est affecté par son responsable d'une ou plusieurs langues cibles de traduction. Quand un traducteur rejoint l'équipe, il peut choisir la langue en laquelle il se sent capable de traduire. Il peut travailler sur tous les projets dont la langue en question est déclarée comme langue cible.
it: Le traduzioni di tutti i prodotti Dash sono gestite per gentile concessione di Transifex, che offre la propria documentazione dettagliata di tutte le funzioni e caratteristiche. All'interno di Transifex, Dash mantiene un'organizzazione che contiene più progetti e un team di traduttori assegnati a tutti i progetti. Ad ogni progetto viene assegnata una o più lingue di destinazione per la traduzione da parte del manutentore del progetto. Quando un traduttore si unisce al team, è in grado di scegliere le lingue che si sente in grado di tradurre. Possono quindi lavorare su qualsiasi progetto specificando questa lingua come lingua di destinazione.
ru: Перевод всех продуктов Dash производится благодаря Transifex, который предоставляет всю детальную документацию своих функций и возможностей. В среде Transifex Dash имеет организованную систему, состоящую из разнообразных проектов и команду переводчиков, назначаемых на эти проекты. Каждый проект назначется к переводу на один или более язык, назначение выполняется лицом, ведущим эти проекты. Когда переводчик присоединяется к команде, то может выбрать язык, которым он владеет. Переводчики могут работать над любым проектом, обозначая выбранный язык, как желаемый.

source: `Transifex Documentation <https://docs.transifex.com>`_
ar: `Transifex وتائق <https://docs.transifex.com>`_
es: `Documentación de Transifex <https://docs.transifex.com>`_
fr: `Documentation Transifex <https://docs.transifex.com>`_
it: `Documentazione Transifex <https://docs.transifex.com>`_
ru: `Документация Transifex <https://docs.transifex.com>`_

source: `Dash translation projects <https://www.transifex.com/dash/>`_
fr: `Projets de traduction Dash <https://www.transifex.com/dash/>`_
it: `Progetti di traduzione Dash <https://www.transifex.com/dash/>`_
ru: `Проекты по переводу Dash <https://www.transifex.com/dash/>`_

source: `Dash translators team <https://www.transifex.com/dash/teams/>`_
fr: `Équipe de traducteurs Dash <https://www.transifex.com/dash/teams/>`_
it: `Team di traduttori Dash <https://www.transifex.com/dash/teams/>`_
ru: `Команда переводчиков Dash <https://www.transifex.com/dash/teams/>`_

source: In general, languages with minimal regional variation are to be translated into the common language (rather than regional) target. Portuguese, for example, is simply translated into the ``pt`` target language, rather than two separate target languages ``pt_BR`` and ``pt_PT``, for Portuguese as spoken in Brazil and Portugal, respectively. As Dash grows, these languages may be separated out into their regional variants by proofreaders, depending on demand. Exceptions to this rule apply where the same spoken language is written differently, such as ``zh_CN`` and ``zh_TW`` for Simplified Chinese and Traditional Chinese.
ar: بشكل عام ، يجب ترجمة اللغات ذات الحد الأدنى من التنوع الإقليمي إلى الهدف المشترك (بدلاً من الإقليمي). اللغة البرتغالية ، على سبيل المثال ، يتم ترجمتها ببساطة إلى لغة الهدف ``pt`` ، بدلاً من لغتين مستهدفتين منفصلتين ``pt_BR`` و ``pt_PT`` ، للغة البرتغالية كما تحدث في البرازيل والبرتغال ، على التوالي. ومع تنامي داش ، يمكن فصل هذه اللغات إلى أشكالها الإقليمية من قبل المراجعين ، اعتمادًا على الطلب. تنطبق الاستثناءات من هذه القاعدة حيث يتم كتابة نفس اللغة المنطوقة بشكل مختلف ، مثل ``zh_CN`` و ``zh_TW`` للغة الصينية المبسطة والصينية التقليدية.
es: En general, los idiomas con variación mínima regional deben traducirse al idioma común de destino (en lugar de regional). El portugués, por ejemplo, se traduce al idioma de destino ``pt``, en lugar de dos idiomas de destino separados ``pt_BR`` y ``pt_PT``, para el portugués tal como se habla en Brasil y Portugal, respectivamente. A medida que Dash crece, estos idiomas podrán separarse en sus variantes regionales por correctores de pruebas, según la demanda. Las excepciones a esta regla se aplican cuando el mismo idioma hablado se escribe de manera diferente, como ``zh_CN`` y ``zh_TW`` para chino simplificado y chino tradicional.
fr: En général, les langues avec variations régionales minimes sont destinées à être traduites dans leur version commune (plutôt que dans une version régionale). Le portugais, par exemple, est traduit simplement dans la langue cible "pt", plutôt que dans deux langues cible "pt_BR" et "pt_PT" qui représenteraient le portugais parlé respectivement au Brésil et au Portugal. Au fur et à mesure que Dash grandit, ces langues pourront éventuellement être séparées en deux variantes régionales par des spécialistes, selon la demande. Il existe une exception à cette règle dans le cas où la même langue parlée s'écrit de différentes façons, comme dans le cas de "zh_CN" et "zh_TW" pour le chinois simplifié et le chinois traditionnel.
it: In generale, le lingue con variazioni regionali minime devono essere tradotte nella lingua comune (piuttosto che regionale). Il portoghese, ad esempio, viene semplicemente tradotto nella lingua di destinazione ``pt``, piuttosto che in due lingue di destinazione separate ``pt_BR`` e ``pt_PT``, per il portoghese parlato rispettivamente in Brasile e Portogallo. Man mano che Dash cresce, queste lingue possono essere separate nelle loro varianti regionali dai correttori di bozze, a seconda della richiesta. Le eccezioni a questa regola si applicano quando la stessa lingua parlata è scritta in modo diverso, come ``zh_CN`` e ``zh_TW`` per il cinese semplificato e il cinese tradizionale.
ru: В целом, следует придерживаться правила, когда перевод делается на главный "материнский" язык (а не на его региональные вариации). Например, при переводе на португальский ``pt``, не следует делать отдельно перевод на бразильский португальский и традиционный поругальский ``pt_BR`` и ``pt_PT``, для жителей Бразилии и Португалии, соответственно. По мере развития Dash и в зависимости от потребности, эти языки могут быть разделены корректорами по своим региональным вариациям. Исключение составляют языки, в которых вариации записывается разными символами, например, ``zh_CN`` и ``zh_TW`` - упрощённый китайский и традиционный китайский.

source: Keeping translations consistent over time as multiple translators work on each target language is a very important part of delivering a quality user experience. For this reason, if you come across any Dash-specific terminology such as `masternodes`, you should use the **Concordance** search function to see how the term has been translated in the past. Transifex will also provide **Suggestions** and **History** if it recognizes a similar string in the database of past translations. Stay consistent with past language use, but also ensure your terminology is up to date with current use!
ar: يعد الحفاظ على الترجمات متسقة بمرور الوقت ، حيث يعمل العديد من المترجمين على كل لغة مستهدفة ، وهو جزء مهم جدًا من تقديم تجربة مستخدم عالية الجودة. لهذا السبب ، إذا صادفت أي مصطلحات خاصة بـ داش مثل `ماسترنود` ، يجب عليك استخدام وظيفة البحث **فهرس أبجدي** لترى كيف تمت ترجمة المصطلح في الماضي. ستقدم Transifex أيضًا **اقتراحات** و **تاريخ** إذا كانت تعترف بسلسلة مماثلة في قاعدة بيانات الترجمات السابقة. حافظ على اتساق مع استخدام اللغة السابقة ، ولكن تأكد أيضًا من أن مصطلحاتك حديثة مع الاستخدام الحالي!
es: Mantener las traducciones consistentes a lo largo del tiempo, ya que varios traductores trabajan en cada idioma de destino, es una parte muy importante para entrega de una experiencia de usuario de calidad. Por esta razón, si encuentra una terminología específica de Dash como `masternodes`, debes usar la función de búsqueda **Concordancia** para ver cómo el término se ha traducido en el pasado. Transifex proporcionará **Sugerencias** e **Historial** si reconoce una cadena similar en la base de datos de traducciones anteriores. Mantente consistente con el uso del lenguaje utilizado anteriormente, ¡pero asegúrate de que tu terminología esté al día con el uso actual!
fr: Conserver des traductions cohérentes sur la durée, alors que plusieurs traducteurs peuvent travailler sur chaque langue cible, est un aspect très important si l'on veut fournir une qualité de traduction maximale. Pour cette raison, si vous tombez sur un terme spécifique à Dash tel que "masternode", vous devez utiliser la fonction de recherche de **Concordance** pour voir si ce terme a déjà été traduit auparavant. Transifex fournit également des **Suggestions** et un **Historique** s'il reconnaît un texte analogue dans sa base de données de traductions antérieures. Veuillez rester cohérent et respecter les choix de traduction antérieurs, mais veuillez aussi vous assurer que votre vocabulaire est à jour avec l'utilisation actuelle !
it: Mantenere le traduzioni coerenti nel tempo, poiché più traduttori lavorano su ciascuna lingua di destinazione, è una parte molto importante per offrire un'esperienza utente di qualità. Per questo motivo, se ti imbatti in una terminologia specifica per Dash come `masternodes`, dovresti usare la funzione di ricerca ** Concordance ** per vedere come il termine è stato tradotto in passato. Transifex fornirà anche ** Suggerimenti ** e ** Cronologia ** se riconosce una stringa simile nel database delle traduzioni precedenti. Rimani coerente con l'uso della lingua passato, ma assicurati anche che la tua terminologia sia aggiornata con l'uso corrente!
ru: При работе нескольких переводчиков важно, чтобы переводы соответствовали друг другу, это необходимо для предоставления читателям переводов качественной информации. При переводе вы будете сталкиваться со специфичной для Dash терминологией, например «мастернода», в этом случае, для того чтобы увидеть, как этот термин переводился ранее, следует использовать функцию **Concordance** поиска. Transifex также предложит использовать функции **Suggestions** и **History**, если распознает похожую строку из предыдущих переводов в своей базе данных. Используйте язык, который единообразен с прошлыми переводами, но, про этом, следите за актуальностью вашей терминологии!

source: The following documentation describes the various projects and any special features specific to the programming language in which the product is written.
ar: تصف المستندات التالية المشاريع المختلفة وأي ميزات خاصة محددة بلغة البرمجة التي تتم كتابة المنتج بها.
es: La siguiente documentación describe los distintos proyectos y cualquier función específica del lenguaje de programación en el que está escrito el producto.
fr: La documentation suivante détaille les différents projets ainsi que toute fonctionnalité spécifique au langage de programmation dans lequel le produit a été écrit.
it: La seguente documentazione descrive i vari progetti e le eventuali caratteristiche speciali specifiche del linguaggio di programmazione in cui il prodotto è scritto.
ru: Представленная далее документация описывает различные проекты и специфические функции, свойственные языкам программирования, на которых они написаны.

source: Dash Core
ar: داش كور
it: Core Dash

source: This project contains a file named ``dash_en.ts``, which is an export of all translatable user-facing content in the :ref:`Dash Core Wallet <dash-core-wallet>`. Languages with 80% or more of the translations complete will be integrated in the next release. Note that the software will often replace placeholders in the text with actual numbers, addresses or usernames. If you see a placeholder in the source text, it must also appear in the target text. If it does not, your translation cannot be used. The **Copy source string** button can help you copy everything over, so all you need to do is replace the English words surrounding the placeholders. You can change the order of the placeholders as necessary, according to the grammar of your target language.
ar: يحتوي هذا المشروع على ملف باسم ``dash_en.ts`` ، وهو عبارة عن تصدير لكل المحتويات التي يواجهها المستخدم القابلة للترجمة في :ref:`محفظة داش كور <dash-core-wallet>`. سيتم دمج اللغات التي تحتوي على 80٪ أو أكثر من الترجمات في الإصدار التالي. لاحظ أن البرنامج غالبًا ما يحل محل العناصر النائبة في النص بأرقام أو عناوين فعلية أو أسماء مستخدمين. إذا رأيت عنصرًا نائبًا في النص المصدر ، فيجب أن يظهر أيضًا في النص الهدف. إذا لم يحدث ذلك ، فلا يمكن استخدام ترجمتك. يمكن أن يساعدك زر **نسخ سلسلة المصدر** على نسخ كل شيء ، لذلك كل ما عليك فعله هو استبدال الكلمات الإنجليزية المحيطة بالعناصر النائبة. يمكنك تغيير ترتيب العناصر النائبة حسب الضرورة ، وفقًا لقواعد لغتك المستهدفة.
es: Este proyecto contiene un archivo llamado ``dash_en.ts``, que es una exportación de todo el contenido traducible con el que tendrá contacto el usuario en la :ref:`Billetera Dash Core<dash-core-wallet>`. Los idiomas con un 80% o más de las traducciones completas se integrarán en la próxima versión. Ten en cuenta que el software a menudo reemplazará marcadores de posición en el texto con números reales, direcciones o nombres de usuario. Si ves un marcador de posición en el texto de origen, también debe aparecer en el texto de destino. Si no es así, tu traducción no puede ser utilizada. El botón **Copiar cuerda de origen** puede ayudarte a copiar todo, por lo que todo lo que tienes que hacer es reemplazar las palabras en inglés que rodean a los marcadores de posición. Puedes cambiar el orden de los marcadores de posición según sea necesario, de acuerdo con la gramática del idioma de destino.
fr: Ce projet comporte un fichier ``dash_en.ts``, qui est une exportation de tout le contenu utilisateur traduisible du :ref:`portefeuille logiciel Dash Core <dash-core-wallet>`. Les langues avec 80% ou plus de traductions achevées seront intégrées à la prochaine version. Veuillez noter que le logiciel remplacera souvent les espaces réservés dans le texte source avec de vrais nombres, de vraies adresses ou de vrais noms d'utilisateur. Si vous voyez un espace réservé dans le texte source, il doit aussi apparaître dans le texte cible. Si ce n'est pas le cas, votre traduction ne pourra pas être utilisée. Le bouton **Copier la chaîne source** peut vous aider à tout copier, de façon à ce que vous n'ayez plus qu'à traduire les mots anglais en dehors des espaces réservés. Vous pouvez changer l'ordre des espaces réservés si nécessaire, selon la grammaire de votre langue cible.
it: Questo progetto contiene un file denominato ``dash_en.ts``, che è un'esportazione di tutto il contenuto traducibile rivolto agli utenti nel: ref: `Dash Core Wallet <dash-core-wallet>`. Le lingue con l'80% o più delle traduzioni completate verranno integrate nella prossima versione. Si noti che il software sostituirà spesso i segnaposto nel testo con numeri, indirizzi o nomi utente effettivi. Se vedi un segnaposto nel testo di origine, deve apparire anche nel testo di destinazione. In caso contrario, la tua traduzione non può essere utilizzata. Il pulsante ** Copia stringa sorgente ** può aiutarti a copiare tutto, quindi tutto ciò che devi fare è sostituire le parole inglesi che circondano i segnaposto. È possibile modificare l'ordine dei segnaposto secondo necessità, in base alla grammatica della lingua di destinazione.
ru: Этот проект содержит файл с названием ``dash_en.ts``, который осуществляет экспорт всего содержимого, видимого пользователю в :ref:`Dash Core Wallet <dash-core-wallet>`. Языки, перевод на которые выполнен на 80% и более будут интегрированы в последующей версии. Обратите внимание, что программное обеспечение зачастую будет заменять местозаполнители актуальными номерами, адресами, именами пользователей. Если вы видете местозаполнитель в исходном тексте, то он должен быть и в переведённом тексте. Если его там нет, то ваш перевод непригоден к использованию. С помощью кнопки **Copy source string** вы скопируете необходимый материал и всё, что вам нужно будет сделать это заменить английские слова вокруг местозаполнителя. Вы можете менять позицию местозаполнителя в предложении согласно грамматическим правилам языка, на который переводите.

source: Placeholders
ar: النائبة
es: Marcadores de posición
fr: Espaces réservés
it: segnaposti
ru: Местозаполнитель

source: **Source:** ``E&xit``
ar: **المصدر:** ``خروج``
es: **Fuente:** ``E&xit``
it: ** Fonte: ** `` E & xit``

source: Note that the ``&`` character is placeholder used to indicate a keyboard shortcut in a program menu, and must appear next to the appropriate character in your target language with no adjacent space. Placeholders such as ``%1`` or ``%s`` will be replaced by the software as it is running to indicate a name or number of something relating to the message. You must insert these placeholders in the grammatically appropriate position in your target text.
ar: لاحظ أن الحرف ``&`` هو عنصر نائب يستخدم للإشارة إلى اختصار لوحة المفاتيح في قائمة برنامج ، ويجب أن يظهر بجوار الحرف المناسب في لغتك المستهدفة بدون مساحة متجاورة. العناصر النائبة مثل ``٪ 1`` أو ``%s`` سيتم استبداله بالبرنامج أثناء تشغيله للإشارة إلى اسم أو رقم لشيء يتعلق بالرسالة. يجب عليك إدراج هذه العناصر النائبة في الموضع المناسب نحويًا في النص المستهدف.
es: Tenga en cuenta que el caracter ``&`` es un marcador de posición utilizado para indicar un atajo de teclado en un menú de programa, y debe aparecer junto al caracter apropiado en tu idioma de destino sin espacio adyacente. Marcadores de posición como ``% 1`` o ``%s`` serán reemplazados por el software mientras se está ejecutando para indicar un nombre o número de algo relacionado con el mensaje. Debes insertar estos marcadores de posición en una posición gramaticalmente adecuada en tu texto de destino.
fr: Veuillez noter que le caractère "&" est un espace réservé utilisé pour indiquer une combinaison de touches dans un menu d'application, et qu'il doit apparaître avant le caractère approprié dans votre langue cible, sans espace adjacent. Des espaces réservés comme ``%1`` ou ``%s`` seront remplacés par le logiciel en fonctionnement, pour indiquer un nom, un nombre, ou un élément relatif au message en question. Vous devez insérer ces espaces réservés à l'endroit grammaticalement adapté de votre texte cible.
it: Nota che il carattere `` & '' è un segnaposto utilizzato per indicare una scorciatoia da tastiera in un menu di programma e deve apparire accanto al carattere appropriato nella lingua di destinazione senza spazi adiacenti. Segnaposti come ``% 1 '' o ``%s`` verranno sostituiti dal software mentre è in esecuzione per indicare un nome o un numero di qualcosa relativo al messaggio. È necessario inserire questi segnaposto nella posizione grammaticalmente appropriata nel testo di destinazione.
ru: Обратите внимание, что символ ``&`` это местозаполнитель, использующийся для указания ссылки в программном меню и он должен появляться рядом с соответствующим символом в языке перевода, без пробела. Местозаполнители такие как ``%1`` или ``%s`` будут заменены программным образом, поскольку они выполнют функцию индикации чего-либо, касающегося текста, например имени или номера. Вам следует переносить эти местозаполнители на соответсвующую позицию в переведённом тексте.

source: Punctuation
ar: علامات ترقيم
es: Puntuación
fr: Ponctuation
it: Punteggiatura
ru: Пунктуация

source: **Source:** ``change from %1 (%2)``
ar: **المصدر:** ``التغيير من٪ 1 (٪ 2)``
es: **Fuente:** ``cambiar desde %1 (%2)``
it: ** Fonte: ** `` modifica da% 1 (% 2) ``

source: Note that any brackets ``()`` and punctuation such as full stops ``.`` at the end of a sentence must also exist in the target text.
ar: لاحظ أن أي قوسين ``()`` وعلامات الترقيم مثل التوقف الكامل ``.`` في نهاية الجملة يجب أن تكون موجودة أيضًا في النص المستهدف.
es: Ten en cuenta que los corchetes ``()`` y la puntuación, como las paradas completas ``.`` al final de una oración, también deben existir en el texto de destino.
fr: Veuillez noter que toutes parenthèses "()" ou toute ponctuation telle que des points "." de fin de phrase doivent aussi se retrouver dans le texte cible.
it: Nota che qualsiasi parentesi `` () '' e punteggiatura come i punti ``. '' alla fine di una frase devono essere presenti anche nel testo di destinazione.
ru: Обратите внимание, что скобки ``()`` и знаки пунктуации, такие как точка ``.`` на конце предложения, должны присутствовать и в переведённом тексте.
