Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/developers/translating.po
Languages: ar, es, fr, it, ru

source: All language content from the :ref:`Dash Android Wallet <dash-android-wallet>` are available for translation in this project. Please have a device running the Android wallet available during translation to understand the context of the text you are translating. Note that any placeholders in the source text segment must also appear in the target language, similar to the instructions above for Dash Core Wallet.
ar: كل محتوى اللغة من :ref:`محفظة داش في الأندرويد <dash-android-wallet>` متاحة للترجمة في هذا المشروع. يرجى استخدام جهاز يعمل على محفظة الأندرويد متاحًا أثناء الترجمة لفهم سياق النص الذي تترجمه. لاحظ أن أي عنصر نائب في جزء النص المصدر يجب أن يظهر أيضًا في اللغة الهدف ، على غرار الإرشادات الواردة أعلاه لمحفظة داش كور.
es: Todo el contenido del lenguaje de la :ref:`Billetera Dash Android <dash-android-wallet>` están disponibles para traducción en este proyecto. Ten a tu disposición un dispositivo con la billetera Android disponible durante la traducción para comprender el contexto del texto que está traduciendo. Ten en cuenta que los marcadores de posición en el segmento de texto de origen también deben aparecer en el idioma de destino, de forma similar a las instrucciones anteriores para la billetera Dash Core.
fr: Tout le contenu texte du :ref:`portefeuille logiciel Dash pour Android <dash-ios-wallet>` est disponible pour traduction dans ce projet. Veuillez disposer d'un appareil Android pour lancer le portefeuille Android pendant la traduction, et comprendre le contexte du texte que vous traduisez. Veuillez noter que tous les espaces réservés apparaissant dans le texte source doivent aussi apparaître dans le texte cible, de la même manière que dans les instructions ci-dessus relatives au portefeuille logiciel Dash Core.
it: Tutti i contenuti di lingua da: ref: `Dash Android Wallet <dash-android-wallet>` sono disponibili per la traduzione in questo progetto. Tieni a disposizione un dispositivo che esegue il portafoglio Android durante la traduzione per comprendere il contesto del testo che stai traducendo. Tieni presente che tutti i segnaposto nel segmento di testo di origine devono apparire anche nella lingua di destinazione, in modo simile alle istruzioni per Dash Core Wallet.
ru: Все содержимое :ref:`Dash Android Wallet <dash-android-wallet>` доступно для перевода в этом проекте. Расположите рядом устройство с работающим Android кошельком, чтобы понимать контекст переводимого. Имейте в виду, что все местозаполнители в исходном тексте должны быть и в переведённом тексте, точно так же, как в инструкциях для кошелька Dash Core, которые находятся выше.

source: Dash Videos
ar: فيديوهات داش
es: Videos de Dash
fr: Vidéos Dash
it: Video Dash
ru: Видеоматериалы Dash

source: This section primarily contains language content from Amanda B. Johnson's popular `Dash School <https://www.youtube.com/watch?v=e7UwwcCK j4Y&list=PLiFMZOlhgsYKKOUOVjQjESCXfR1cCYCod>`_ video series. Please translate with the videos open in YouTube to properly understand the context of the source text. Once your translation is complete, please send an email to leon.white@dash.org or @strophy on `Discord <http://dashchat.org>`_ to request inclusion of the subtitles on YouTube.
ar: يحتوي هذا القسم في المقام الأول على محتوى اللغة من شعبية أماندا جونسون `مدرسة داش <https://www.youtube.com/watch?v=e7UwwcCK j4Y&list=PLiFMZOlhgsYKKOUOVjQjESCXfR1cCYCod>`_ سلسلة الفيديو. الرجاء الترجمة باستخدام مقاطع الفيديو المفتوحة في يوتوب لفهم سياق النص المصدر بشكل صحيح. بمجرد اكتمال الترجمة الخاصة بك ، يرجى إرسال بريد إلكتروني إلى leon.white@dash.org أو strophy on `Discord <http://dashchat.org>`_ لطلب تضمين الترجمات المصاحبة على يوتوب.
es: Esta sección contiene principalmente contenido de la popular serie de videos `Dash School de Amanda B. Johnson <https://www.youtube.com/watch?v=e7UwwcCK j4Y&list=PLiFMZOlhgsYKKOUOVjQjESCXfR1cCYCod>`_. Por favor traduce con los videos abiertos en YouTube para comprender correctamente el contexto del texto fuente. Una vez que tu traducción esté completa, envía un correo electrónico a leon.white@dash.org o @strophy en `Discord <http://dashchat.org>`_ para solicitar la inclusión de los subtítulos en YouTube.
fr: Cette section contient surtout le texte des vidéos populaires `Dash School <https://www.youtube.com/watch?v=e7UwwcCK j4Y&list=PLiFMZOlhgsYKKOUOVjQjESCXfR1cCYCod>`_ d'Amanda B. Johnson. Veuillez traduire les vidéos en les ouvrant en parallèle sur YouTube pour comprendre le contexte du texte traduit. Une fois la traduction terminée, veuillez envoyer un message à leon.white@dash.org ou @strophy sur `Discord <http://dashchat.org>`_ pour demander leur inclusion en sous-titres sur YouTube.
it: Questa sezione contiene principalmente contenuti provenienti dalla popolare serie di video `Dash School <https://www.youtube.com/watch?v=e7UwwcCK j4Y & list = PLiFMZOlhgsYKKOUOVjQjESCXfR1cCYCod>` _ di Amanda B. Johnson. Si prega di tradurre con i video aperti su YouTube per comprendere correttamente il contesto del testo di origine. Una volta completata la traduzione, invia un'e-mail a leon.white@dash.org o @strophy su `Discord <http://dashchat.org>` _ per richiedere l'inclusione dei sottotitoli su YouTube.
ru: В этом разделе в основном находятся материалы от Аманды Джонсон и её популярной `Школы Dash <https://www.youtube.com/watch?v=e7UwwcCK j4Y&list=PLiFMZOlhgsYKKOUOVjQjESCXfR1cCYCod>`_ Мы рекомендуем переводить при включённом на YouTube видео для полного понимания контекста источника. Чтобы ваши субтитры включили в ролик на YouTube, то по окончанию перевода, отправьте его на leon.white@dash.org или @strophy в `Discord <http://dashchat.org>`_.

source: Dash Website
ar: موقع داش
es: Sitio web de Dash
fr: Site web Dash
it: Sito Dash
ru: Сайт Dash

source: The Dash website at https://www.dash.org is available for translation in Transifex. Please have the website open while you translate to correctly understand the context of the source text. Once your translation is complete, please send an email to leon.white@dash.org or @strophy on `Discord <http://dashchat.org>`_ to request a build of your translation onto the website.
ar: يتوفر موقع داش على العنوان https://www.dash.org للترجمة في Transifex. يرجى فتح موقع الويب أثناء عملية الترجمة لفهم سياق النص المصدر بشكل صحيح. بمجرد اكتمال الترجمة الخاصة بك ، الرجاء إرسال بريد إلكتروني إلى leon.white@dash.org أو strophy on `Discord <http://dashchat.org>`_ لطلب بناء ترجمتك على الموقع.
es: El sitio web de Dash en https://www.dash.org está disponible para su traducción en Transifex. Por favor ten abierto el sitio web mientras traduces para comprender correctamente el contexto del texto fuente. Una vez que completes tu traducción, envía un correo electrónico a leon.white@dash.org o @strophy en `Discord <http://dashchat.org>`_ para solicitar una compilación de tu traducción en el sitio web.
fr: Le site web Dash à l'adresse https://www.dash.org est proposé à la traduction sur Transifex. Veuillez avoir le site ouvert en parallèle de votre traduction, pour comprendre le contexte du texte que vous traduisez. Une fois la traduction terminée, veuillez envoyer un message à leon.white@dash.org ou @strophy sur `Discord <http://dashchat.org>`_ pour demander l'intégration de votre traduction sur le site.
it: Il sito Web di Dash all'indirizzo https://www.dash.org è disponibile per la traduzione in Transifex. Tieni aperto il sito web durante la traduzione per comprendere correttamente il contesto del testo di origine. Una volta completata la traduzione, invia un'e-mail a leon.white@dash.org o @strophy su `Discord <http://dashchat.org>` _ per richiedere una build della tua traduzione sul sito web.
ru: Сайт Dash вы можете найти по адресу https://www.dash.org, его можно переводить в Transifex. Для понимания контекста переводимого, во время перевода держите сайт открытым. Когда вы переведёте сайт, то, для того, чтобы ваш перевод был в него встроен, отправьте письмо на leon.white@dash.org или @strophy в `Discord <http://dashchat.org>`_.

source: **Target:** ``&Beenden``
ar: **الهذف:** ``&Beenden``
es: **Objetivo:** ``&Beenden``
fr: **Cible :** ``&Quitter``

source: **Target:** ``Wechselgeld von %1 (%2)``
ar: **الهدف:** ``Wechselgeld von٪ 1 (٪ 2)``
es: **Objetivo:** ``Wechselgeld von %1 (%2)``
fr: **Cible :** ``Changer de %1 (%2)``

source: Dash Docs
ar: وتائق داش
es: Documentos Dash
ru: Документы Dash

source: Dash Graphics
ar: تصاميم داش
es: Gráficos de Dash
fr: Ressources graphiques Dash
ru: Графические материалы Dash
