Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/features.po
Languages: ru

source: Features
ru: Особенности

source: Whitepaper
ru: Техническая концепция

source: A whitepaper is a document often issued with the release of a new cryptocurrency to explain its Unique Value Proposition and describe details of how it will function. The Dash Whitepaper is frequently updated, but this page also provides links to the original version and translations.
ru: Техническая концепция - документ часто сопутствующий или преваряющий выпуск новых криптотокенов для объяснения их уникальных особенностей и детального описания принципов работы. Техническая концепция Дэш часто обновляется, но на этой странице можно найти также ссылки на изначальную версию и переводы.

source: `Dash Roadmap <https://github.com/dashpay/dash-roadmap>`_
ru: `План-концепция Дэш <https://github.com/dashpay/dash-roadmap>`_

source: `Latest whitepaper and official translations <https://github.com/dashpay/dash/wiki/Whitepaper>`_
ru: `Последний вариант технической концепции и официальные переводы <https://github.com/dashpay/dash/wiki/Whitepaper>`_

source: `Original Darkcoin whitepaper (PDF) <https://github.com/dashpay/docs/raw/master/pdf/Dash%20Whitepaper%20-%20Darkcoin.pdf>`_
ru: `Оригинальная техническая концепция Darkcoin (PDF) <https://github.com/dashpay/docs/raw/master/pdf/Dash%20Whitepaper%20-%20Darkcoin.pdf>`_

source: `InstantSend whitepaper (PDF) <https://github.com/dashpay/docs/raw/master/pdf/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_
ru: `Техническая концепция InstantSend (PDF) <https://github.com/dashpay/docs/raw/master/pdf/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_

source: Specifications
ru: Спецификации

source: Release date: 11PM EST, 18th January 2014 / No premine
ru: Дата выхода: 23-00 EST, 18.01.2014 / Без предварительной добычи

source: X11 hashing algorithm: 11 rounds of scientific hashing functions (blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo)
ru: Хэширующий алгоритм X11: 11 стадий хэширования (blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo)

source: Block reward is controlled by: 2222222/(((Difficulty+2600)/9)^2). Minimum base subsidy 5 Dash. Maximum 25 Dash.
ru: Формула награды за блок: 2222222/(((Сложность+2600)/9)^2). Минимальная базовая ставка 5 дэш. Максимум 25 дэш.

source: CPU/GPU/ASIC mining
ru: CPU/GPU/ASIC майнинг

source: Block generation: 2.5 minutes
ru: Время генерации блока: 2,5 минуты.

source: Difficulty Retargets using Dark Gravity Wave - Improved Kimoto Gravity Well - Exponential Moving Average weighted adjustment.
ru: Сложность переопределяется с помощью Dark Gravity Wave - улучшенного алгоритма Kimoto Gravity Well - приближение с помощью взвешенного экспоненциального скользящего среднего.

source: 7.14% decrease in the number of coins generated per year
ru: Уменьшение количества вновь добываемых монет на 7,14% в год.

source: Total coins: :ref:`between 17.74M and 18.92M <emission-rate>`
ru: Всего монет: :ref:`от 17.74 млн. до 18.92 млн. <emission-rate>`

source: Decentralized Masternode Network
ru: Децентрализованная сеть мастернод

source: Superior Transaction Anonymity using PrivateSend
ru: Превосходная анонимность за счёт PrivateSend

source: Two-tier network using masternodes to form the second tier
ru: Двухуровневая сеть: мастерноды в качестве верхнего яруса

source: Instant transactions (InstantSend) made possible by the masternode network
ru: Мгновенные транзакции (InstanSend), возможные благодаря использованию мастернод

source: Decentralized Governance By Blockchain allows masternode owners to vote on budget proposals and decisions that affect Dash. Budget proposals fund Dash development and come directly from block rewards, i.e. Dash development is self-funded by its own blockchain.
ru: Децентрализованное управление на блокчейне позволяет владельцам мастернод голосовать за бюджетные предложения и решения, влияющие на Дэш. Бюджетные предложения финансируют развитие Дэш, средства поступают непосредственно из награды за блок, т.е. развитие Дэш самофинансируется из его собственного блокчейна.

source: Emission Rate
ru: Темп эмиссии

source: Cryptocurrencies such as Dash and Bitcoin are created through a cryptographically difficult process known as mining. Mining involves repeatedly solving :ref:`hash algorithms <x11-hash-algorithm>` until a valid solution for the current :ref:`mining difficulty <dark-gravity-wave>` is discovered. Once discovered, the miner is permitted to create new units of the currency. This is known as the block reward. To ensure that the currency is not subject to endless inflation, the block reward is reduced at regular intervals. Graphing this data results in a curve showing total coins in circulation, known as the coin emission rate.
ru: Криптовалюты, такие как Дэш и Биткойн создаются через криптографически сложный процесс, известный как майнинг. Майнинг включает повторяющееся исполнение :ref:`хэширующего алгоритма <x11-hash-algorithm>` до тех пор, пока не будет найдено решение, удовлетворяющее текущей :ref:`сложности майнинга <dark-gravity-wave>`. Найдя такое решение, майнер может создать новые единицы криптовалюты. Эти новые единицы называются наградой за блок. Для того, чтобы валюта не подвергалась бесконечной инфляции, награда за блок регулярно уменьшается. Представив эти данные на кривой, показывающей общее количество монет в обращении, мы получим темп эмиссии.

source: While Dash is based on Bitcoin, it significantly modifies the coin emission rate to offer a smoother reduction in coin emission over time. While Bitcoin reduces the coin emission rate by 50% every 4 years, Dash reduces the emission by one-fourteenth (approx. 7.14%) every 210240 blocks (approx. 383.25 days). It can be seen that reducing the block reward by a smaller amount each year offers a smoother transition to a fee-based economy than Bitcoin.
ru: Хотя Дэш основан на коде Биткойна, его темп эмиссии значительно изменён в сторону большей плавности постепенного уменьшения награды за блок. Если в Биткойне темп эмисии уменьшается в два раза каждые четыре года, Дэш уменьшает эмиссию примерно на одну четурнадцатую (около 7,14%) каждые 210240 блоков (приблизительно 383,25 дней). Такой подход обеспечивает более плавный переход к экономике основанной на комиссии, чем в Биткойне.

source: X11 Hash Algorithm
ru: Хэширующий алгоритм X11
