Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/index.po
Languages: ar, it, ko, ru, vi

source: The Dash Documentation offers information and guides on Dash, the open source peer-to-peer cryptocurrency with a strong focus on the payments industry.
ar: تقدم وثائق داش المعلومات والأدلة على داش ، وهي عبارة عن عملة مفتوحة من نظير إلى نظير ، مع تركيز قوي على صناعة المدفوعات.
it: La documentazione di Dash offre informazioni e guide su Dash, la criptovaluta peer-to-peer open source specializzata nell'industria dei pagamenti.
ko: Dash 설명서는 결제 업계에 중점을 둔 공개 소스 피어-투-피어 암호화폐인 Dash에 대한 정보와 가이드라인을 제공합니다.
ru: Документация Dash содержит информацию и руководства по Dash, децентрализованной криптовалюте с открытым исходным кодом, особое внимание в которой уделяется индустрии платежей.
vi: Tài liệu Dash cung cấp những thông tin và hướng dẫn về Dash, một loại tiền số ngang hàng mã nguồn mở tập trung chủ yếu vào lĩnh vực thanh toán.

source: dash, cryptocurrency, blockchain, documentation, guide, masternodes, mining, wallets, merchants, governance, instantsend, coinjoin, x11, instant, private, secure, digital cash
ru: dash, криптовалюта, блокчейн, документация, руководство, мастерноды, майнинг, кошельки, продавцы, сервисы, управление, instantsend, privatesend, coinjoin, x11, мгновенность, приватность, безопасность, цифровая наличность

source: Dash Documentation
ar: وثائق داش
it: Documentazione di Dash
ko: Dash 설명서
ru: Документация Dash
vi: Tài liệu về Dash

source: Dash aims to be the most user-friendly and scalable payments-focused cryptocurrency in the world. The Dash network features :ref:`instant transaction confirmation <instantsend>`, double spend protection, optional :ref:`privacy <coinjoin>` equal to that of physical cash, a :ref:`self-governing, self-funding model <decentralized-governance>` driven by :ref:`incentivized full nodes <masternode-network>` and a `clear roadmap <https://www.dash.org/roadmap/>`_ for on-chain scaling to up to 400MB blocks using custom-developed open source hardware. While Dash is based on Bitcoin and compatible with many key components of the Bitcoin ecosystem, its two-tier network structure offers significant improvements in transaction speed, privacy and governance. This section of the documentation describes these and many more key features that set Dash apart in the blockchain economy.
it: Dash mira a essere la criptovaluta focalizzata sui pagamenti più user-friendly e scalabile al mondo. La rete Dash offre :ref:`conferma istantanea della transazione<instantsend>`, protezione dalla doppia spesa, :ref:`privacy<coinjoin>` opzionale uguale a quella del contante fisico, un :ref:`modello di autogoverno e autofinanziamento<decentralized-governance>` guidato da :ref: `nodi completi incentivati<masternode-network>` e una `roadmap chiara <https://www.dash.org/roadmap/>`_ per la scalabilità on-chain fino a blocchi da 400 MB utilizzando hardware open source sviluppato su misura. Sebbene Dash sia basato su Bitcoin e compatibile con molti componenti chiave dell’ecosistema Bitcoin, la sua struttura di rete a due livelli offre miglioramenti significativi in termini di velocità delle transazioni, privacy e governance. Questa sezione della documentazione descrive queste e molte altre caratteristiche chiave che distinguono Dash nell'economia blockchain.
ru: Миссия Dash - быть самой масштабируемой и дружелюбной к пользователю криптовалютой в мире. Уникальные особенности Dash: :ref:`мгновенное подтверждение транзакции <instantsend>`, защита от двойной траты, :ref:`опциональная приватность <coinjoin>` не хуже чем у бумажных денег, :ref:`децентрализованное самоуправление и самофинансирование <decentralized-governance>` на основе :ref:`самоокупаемых полных нод <masternode-network>` и `прозрачный план-концепция <https://www.dash.org/ru/roadmap/>`__ масштабов операций на блокчейне вплоть до блоков размером в 400MB с применением специального оборудования с открытой архитектурой. Dash основан на том же коде, что и Биткойн, поэтому он легко совместим с ключевыми компонентами биткойн-экосистемы, но, вместе с тем, его двухуровневая сетевая структура может предложить гораздо большую скорость транзакций, приватность и управляемость сети. Этот раздел документации описывает эти и многие другие ключевые отличительные особенности Dash в криптоэкономике.

source: Check out the `official Dash website <https://www.dash.org/>`__ to learn how `individuals <https://www.dash.org/individuals/>`__ and `businesses <https://www.dash.org/businesses/>`__ can use Dash. The videos, links and documentation collected here can help you get started. New users may be interested in getting started with an appropriate :ref:`wallet <wallets>`, learning about :ref:`how to buy Dash <how-to-buy>` and :ref:`where to spend Dash <earning-spending>`, learning about :ref:`safety <safety>` or joining one of the many :ref:`Dash community sites <information>`.
it: Consulta il `sito web ufficiale di Dash <https://www.dash.org/>`__ per scoprire come gli `individui <https://www.dash.org/individuals/>`__ e le `aziende <https://www.dash.org/businesses/>`__ possono utilizzare Dash. I video, i collegamenti e la documentazione raccolti qui possono aiutarti a iniziare. I nuovi utenti potrebbero essere interessati a iniziare con un :ref:`wallet <wallets> ` appropriato, a conoscere :ref:`come acquistare Dash <how-to-buy>` e :ref:`dove spendere Dash <earning-spending>`, a conoscere la :ref:`sicurezza <safety>` o ad iscriversi uno dei tanti :ref:`siti della community Dash <information>`.
ru: Посетите официальный сайт Dash <https://www.dash.org/>`__, чтобы узнать, как частные лица <https://www.dash.org/individuals/>`__ и предприятия <https://www.dash.org/businesses/>`__ могут использовать Dash. Собранные здесь видеоролики, ссылки и документация помогут вам начать работу. Новым пользователям может быть интересно начать работу с подходящим :ref:`кошельком <wallets>`, узнать о :ref:`как купить Dash <how-to-buy>` и :ref:`куда потратить Dash <earning-spending>`, узнать о :ref:`безопасности <safety>` или присоединиться к одному из многочисленных :ref:`сайтов сообщества Dash <information>`.

source: 👤 User Docs
it: 👤 User Doc
ru: 👤 Документация для пользователей

source: Learn what Dash is and how it works. Topics include how to obtain and store Dash, the governance system, and masternode setup.
it: Scopri cos'è Dash e come funziona. Gli argomenti includono come ottenere e archiviare Dash, il sistema di governance e la configurazione del masternode.
ru: Узнайте, что такое Dash и как она работает. Среди тем - получение и хранение Dash, система управления и настройка мастернод.

source: :ref:`Click to begin <user-index>`
it: :ref:`Fai clic per iniziare <user-index>`
ru: :ref:`Нажмите, чтобы начать <user-index>`

source: ⚙ Core Docs
it: ⚙ Core Doc
ru: ⚙ Документация Core

source: Find technical details about the Dash Core blockchain, along with protocol and API reference material.
it: Trova i dettagli tecnici sulla blockchain Dash Core, insieme al materiale di riferimento sul protocollo e sull'API.
ru: Найти технические подробности о блокчейне Dash Core, а также справочные материалы по протоколам и API.

source: :ref:`Click to begin <core:core-index>`
it: :ref:`Fai clic per iniziare <core:core-index>`
ru: :ref:`Нажмите, чтобы начать <core:core-index>`

source: 🚀 Platform Docs
it: 🚀 Platform Doc
ru: 🚀 Документация платформы

source: Start working with Dash Platform and discover how you can use its powerful capabilities to power your Web3 project.
it: Inizia a lavorare con Dash Platform e scopri come utilizzare le sue potenti funzionalità per potenziare il tuo progetto Web3.
ru: Начните работать с платформой Dash Platform и узнайте, как можно использовать ее мощные возможности для реализации Web3-проекта.

source: :ref:`Click to begin <platform:platform-index>`
it: :ref:`Fai clic per iniziare <platform:platform-index>`
ru: :ref:`Нажмите, чтобы начать <platform:platform-index>`

source: First Steps
ar: أول خطوة
ko: 첫단계
vi: Những bước đầu tiên

source: Users
ar: المستخدمين
ko: 사용자
vi: Người dùng

source: Merchants
ar: التجار
ko: 판매자
vi: Người bán hàng

source: Network
ar: الشبكة
ko: 네트워크
vi: Mạng

source: dash, cryptocurrency, blockchain, documentation, guide, masternodes, mining, wallets, merchants, governance, instantsend, privatesend, x11, instant, private, secure, digital cash
ar: داش، العملة الرقمية، بلوكشين، وثائق، دليل، متسترنود، التعدين، محافظ، تجار، حوكمة، الإرسال الفوري، الإرسال المخفي، x11، فورية، خاصة، آمنة، نقود رقمية
ko: 대시, 암호화폐, 블록체인, 설명서, 가이드, 마스터노드, 마이닝, 지갑, 상인, 거버넌스, 인스턴트샌드, 프라이빗샌드, x11, 인스턴트, 개인, 보안, 디지털 캐시
vi: dash, tiền điện tử, tiền kỹ thuật số, blockchain, tài liệu, hướng dẫn, masternodes, đào coin, phần mềm ví, thương nhân, quản trị, instantsend, privatesend, x11, tức thời, riêng tư, bảo mật, digital cash, tiền mặt số

source: Dash is an open source peer-to-peer cryptocurrency with a strong focus on the payments industry. Dash offers a form of money that is portable, inexpensive, divisible and fast. It can be spent securely both online and in person with only minimal transaction fees. Based on the Bitcoin project, Dash aims to be the most user-friendly and scalable payments system in the world. In addition to Bitcoin's feature set, Dash currently also offers instant transactions (:ref:`instantsend`), private transactions (:ref:`privatesend`) and operates a self-governing and self-funding model that enables the Dash network to pay individuals and businesses for work that adds value to the network. This :ref:`decentralized governance and budgeting system <governance>` makes it one of the first ever successful decentralized autonomous organizations (DAO).
ar: داش عبارة عن شفرة مفتوحة المصدر من نظير إلى نظير مع تركيز قوي على صناعة المدفوعات. تقدم داش نوعًا من النقود المحمولة وغير المكلفة والقسمة والسريعة. يمكن أن يتم إنفاقها بشكل آمن سواء عبر الإنترنت أو شخصياً مع الحد الأدنى فقط من رسوم المعاملات. على أساس مشروع البيتكوين ، يهدف داش ليكون نظام المدفوعات الأكثر سهولة وقابلية للتطوير في العالم. بالإضافة إلى مجموعة ميزات البيتكوين ، تقدم داش حاليًا معاملات فورية (:ref:`instantsend`) ، معاملات خاصة (:ref:`privatesend`) وتدير نموذجًا ذاتيًا وتمويلاً ذاتيًا يمكّن شبكة داش من الدفع الأفراد والشركات للعمل الذي يضيف قيمة إلى الشبكة. هذا :ref:`نظام الحكم والميزنة اللامركزي <governance>` يجعلها واحدة من أول (المنظمات المستقلة اللامركزية) الناجحة.
ko: Dash는 지불수단의 용도로 특화된 오픈 소스 P2P 암호화폐입니다. Dash는 휴대가 간편하고 저렴하며, 분배 가능한 빠른 형태의 통화를 제공합니다. 최소한의 거래 수수료로 온오프라인으로 안전한 지출이 가능합니다. Bitcoin 프로젝트를 기반으로 Dash는 세계에서 가장 사용자 친화적이고 확장 가능한 지불 시스템을 목표로 합니다. Dash는 Bitcoin의 기능 세트 외에도 직접 거래 (:ref:`instantsend`) 와 프라이빗 거래(:ref:`privatesend`) 를 제공하며, 자체 거버닝, 자체 펀딩으로 개인과 기업이 네트워크에 가치를 더하는 작업을 할 수 있습니다. 이 :ref:`분산형 거버넌스 및 예산시스템 <governance>` 은 최초의 성공적인 분산형 자율조직(DAO, Decentralized Autonomous Organizations) 중 하나가 되었습니다.
vi: Dash là loại tiền điện tử mã nguồn mở ngang hàng tập trung mạnh mẽ trong lĩnh vực thanh toán điện tử. Dash cung cấp một dạng tiền có thể dễ dàng mang đi, chi phí rẻ, có thể phân tách và rất nhanh. Nó có thể chi tiêu cả trên online lẫn dùng trực tiếp giữa các cá nhân với mức phí giao dịch cực nhỏ. Phát triển dựa trên dự án Bitcoin, Dash nhắm đến việc trở thành hệ thống thanh toán thân thiện với người sử dụng và có khả năng mở rộng tốt nhất trên thế giới. Thêm vào những tính năng của Bitcoin, Dash hiện cung cấp khả năng giao dịch tức thời (:ref:`instantsend`), giao dịch riêng tư (:ref:`privatesend`) và vận hành một mô hình tự quản trị và tự cấp vốn, nó cho phép mạng lưới của Dash chi trả cho những cá nhân và doanh nghiệp làm việc và tạo thêm giá trị cho mạng lưới. :ref:`Hệ quản trị và ngân sách phi tập trung <governance>` này làm cho Dash trở thành một Tổ chức Tự quản Phi tập trung (DAO) đầu tiên trên thế giới.

source: If you are new to cryptocurrencies, the most important change to understand is that transactions occur directly between two parties without any central authority to facilitate the transaction. This also means that you are responsible for your own security - there is no bank or credit card company to reverse a transaction if your funds are stolen or lost. In this sense, it is similar to cash or gold, but cryptocurrency can be spent locally and internationally with equal ease, if you are confident you are sending funds to the right destination. For these reasons, the Dash documentation has a strong focus on safety and understanding the concepts and features that drive the Dash ecosystem. The videos, links and documentation below can help you get started, or use the table of contents on the left to find a specific topic of interest.
ar: إذا كنت جديدا على العملة الرقمية فإن التغيير الأكثر أهمية لفهم هو أن المعاملات تحدث مباشرة بين طرفين دون أي سلطة مركزية لتسهيل الصفقة. وهذا يعني أيضا أنك مسؤول عن الأمن الخاص بك - لا يوجد بنك أو شركة بطاقة الائتمان لعكس الصفقة إذا سرقت أموالك أو فقدت. في هذا المعنى، فإنه يشبه النقدية أو الذهب، ولكن العملة الرقمية مكن أن تنفق محليا ودوليا على قدم المساواة مع سهولة، إذا كنت واثقا من أنك ترسل الأموال إلى الوجهة الصحيحة. لهذه الأسباب، ووثائق داش لديها تركيز قوي على السلامة وفهم المفاهيم والميزات التي تدفع النظام البيئي داش. يمكن أن تساعدك مقاطع الفيديو والروابط والوثائق أدناه في البدء، أو استخدام جدول المحتويات على اليمين للعثور على موضوع معين محل اهتمام.
ko: 암호화폐를 처음 사용하는 경우, 기존 은행 시스템과 비교 이해시 가장 중요한 변화 포인트는 거래를 촉진하기 위해 중앙 권한이 없는 두 당사자간에 직접적 거래가 발생한다는 것입니다. 이는 반대로 안전성에 스스로의 책임이 있다는 것을 의미합니다. 자금을 도난 당하거나 분실했을 경우 당신의 거래를 대신 취소해 줄 은행이나 신용 카드 회사는 없습니다. 이러한 의미에서 암호화폐는 현금이나 금과 유사하지만, 올바른 목적지에 자금을 보내는지 확신하는 경우 쉽고 동등하게 국내외에서 사용할 수 있습니다. 이러한 이유로 이 Dash 설명서에서는 Dash의 생태계를 주도하는 개념과 기능에 대한 안전성과 이해에 중점을 둡니다. 아래 영상과 웹페이지, 문서 등은 Dash에 대해 한층 더 쉽게 이해할 수 있게 도움이 되리라 확신합니다.
vi: Nếu bạn mới biết đến tiền điện tử, điều thay đổi quan trọng nhất cần phải hiểu đó là các giao dịch của tiền số là đi trực tiếp giữa các bên thanh toán mà không cần phải qua một cấp thẩm quyền trung tâm nào xét duyệt. Điều đó cũng có nghĩa là bạn phải có trách nhiệm về sự an toàn về tiền của mình - không có ngân hàng hoặc công ty thẻ tín dụng nào giúp bạn đảo ngược lại những giao dịch nếu tiền của bạn bị đánh cắp hoặc bị mất. Điều này cũng giống như với tiền mặt hoặc vàng, nhưng với tiền điện tử thì nó có thể chi tiêu trực tiếp hoặc cũng có thể qua mạng toàn cầu, nếu bạn tự tin thì bạn có thể chuyển tiền đến đúng nơi cần đến. Chính vì những lý do này mà Tài Liệu về Dash sẽ tập trung nhiều về tính an toàn và giúp bạn hiểu những khái niệm và những tính năng tạo nên động lực của hệ sinh thái Dash. Những video, những đường link và các tài liệu dưới đây sẽ giúp bạn bắt đầu, hoặc sử dụng bảng mục lục ở bên trái để tìm những chủ đề cụ thể mà bạn quan tâm.

source: Contents
ar: جدول المحتويات
ko: 컨텐츠
vi: Mục lục
