Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/copay/getting-started.po
Languages: fr, ru

source: Getting started with sending and receiving Dash using the Dash Copay wallet
fr: Commencer à envoyer et recevoir des dashs avec le portefeuille logiciel Dash Copay
ru: Как отправлять и получать Dash на кошелёк Dash Copay

source: dash, mobile, wallet, copay, multisig, ios, android, installation, send, receive, addresses, getting started
fr: dash, mobile, portefeuille logiciel, copay, multi-signature, ios, android, installation, envoi, réception, adresses, démarrage
ru: dash, мобильный, кошелёк, copay, multisig, ios, android, установка, отправить, получить, адреса, начало работы

source: Getting Started
fr: Démarrage
ru: Начало работы

source: This documentation describes how to use the most common features of the Dash Copay wallet. Since the functionality is similar across all supported platforms (Android, iOS, Windows, macOS, Linux), the instructions and screenshots will reference the Android software, highlighting differences between the platforms where necessary.
fr: Cette documentation explique comment utiliser les fonctions les plus courantes du portefeuille logiciel Dash Copay. Comme les fonctionnalités sont similaires sur toutes les plateformes compatibles (Android, iOS, Windows, macOS, Linux), les instructions et captures d'écran seront issus de la version Android, avec mention des différences entre plateformes si nécessaire.
ru: В этом документе описывается, как пользоваться самыми распространёнными функциями кошелька Dash Copay. Поскольку на всех поддерживаемых платформах (Android, iOS, Windows, macOS, Linux) функционал кошелька похож, инструкции и скриншоты сделаны по версии для Android, а различия в работе на разных платформах освещены там, где это необходимо.

source: The easiest way to install the Dash Copay for Android is from the Google Play Store.
fr: La façon la plus simple d'installer le portefeuille Dash Copay pour Android est d'utiliser le Play Store de Google.
ru: Самый простой способ установить кошелёк Dash Copay для Android - через Google Play Store.

source: Dash Copay for iOS is available through Apple TestFlight. To join the list of testers, send an email to elizabeth.robuck@dash.org with your Apple Account ID. For other platforms, or to view and compile the source code yourself, please see the instructions on `GitHub <https://github.com/dashevo/dash-copay>`__.
fr: Dash Copay pour iOS est disponible via Apple TestFlight. Pour rejoindre la liste de testeurs, envoyez un message à elizabeth.robuck@dash.org en précisant votre identifiant Apple ID. Pour les autres plateformes, ou pour voir et compiler vous-même le code source, veuillez consulter les instructions sur `GitHub <https://github.com/dashevo/dash-copay>`__.
ru: Dash Copay для iOS доступен на Apple TestFlight. Чтобы присоединиться к списку тестирующих, отправьте запрос на адрес elizabeth.robuck@dash.org, указав в нём свой Apple Account ID. Инструкции для других платформ, а также инструкции по компилированию из исходного кода, смотрите на `GitHub <https://github.com/dashevo/dash-copay>`__.

source: Installation
ru: Установка

source: When you first start your Dash Copay Wallet, you will be prompted to choose between creating a new wallet or restoring an existing wallet from backup. Choose **Get Started** to create a new wallet, unless you have existing funds stored in another wallet using a recovery phrase. When prompted, enter and confirm a spending password to encrypt your wallet keys. You will need this password every time you want to send Dash from your wallet. At this point, you will be offered a chance to back up your wallet using a recovery phrase. It is highly recommended to do this immediately by tapping the **Backup wallet** button. Acknowledge the warnings, enter your password and write down the displayed recovery phrase on paper. Do not take a screenshot, since your device will likely make a copy on cloud storage, which is not necessarily under your personal control. Confirm the recovery phrase and terms of use. Your Dash Copay wallet is now ready to go!
fr: Au premier démarrage de votre portefeuille logiciel Dash Copay, il vous sera demandé si vous souhaitez créer un nouveau portefeuille ou restaurer un portefeuille déjà existant depuis une sauvegarde. Choisissez **Démarrer** pour créer un nouveau portefeuille, à moins que vous n'ayez déjà des fonds dans un autre portefeuille dont vous connaissez la phrase de récupération. Quand cela vous est demandé, saisissez et confirmez un mot de passe pour chiffrer les clés de votre portefeuille. Vous aurez besoin de ce mot de passe chaque fois que vous souhaiterez dépenser des dashs depuis votre portefeuille. À cette étape, il vous sera proposé de sauvegarder votre portefeuille avec une phrase de récupération. Il est chaudement recommandé de le faire sans attendre, en touchant le bouton **Sauvegarder le portefeuille**. Acceptez les avertissements, saisissez votre mot de passe et écrivez sur papier la phrase de récupération qui vous est affichée. Ne prenez pas de capture d'écran de votre phrase de récupération ! Les captures d'écran sont automatiquement sauvegardées dans des services de stockage dans le nuage, et vous ne savez pas qui pourra bien les consulter. Confirmez la phrase de récupération et acceptez les conditions d'utilisation. Votre portefeuille logiciel Dash Copay est prêt à être utilisé !
ru: Когда вы впервые запускаете кошелёк Dash Copay, вам предложат выбор - создать новый кошелёк или восстановить существующий кошелёк из бэкапа. Если у вас нет другого кошелька с хранящимися на нём средствами и кодовой фразы для восстановления, выберите **Начать**, чтобы создать новый кошелёк. Когда потребуется, введите и подтвердите пароль для расходов, чтобы зашифровать ключи вашего кошелька. Вам нужно будет вводить этот пароль каждый раз, когда вы захотите потратить Dash с этого кошелька. После этого вам предложат сделать бэкап вашего кошелька с помощью кодовой фразы. Настоятельно рекомендуется последовать совету и сделать бэкап, нажав кнопку **Бэкап кошелька**. Ознакомьтесь с предупреждениями, введите пароль и запишите фразу с экрана на бумажный носитель. Не делайте скриншот, поскольку ваше устройство скорее всего отправит копию картинки в облачное хранилище, которое, возможно, не находится под вашим личным контролем. Подтвердите кодовую фразу и условия использования. Теперь ваш кошелёк Dash Copay готов к использованию!

source: *Creating a new wallet and generating the recovery phrase in Dash Copay wallet*
fr: *Création d'un nouveau portefeuille et génération d'une phrase de récupération dans le portefeuille logiciel Dash Copay*
ru: *Создание нового кошелька и кодовой фразы в кошельке Dash Copay*

source: If you want to restore an existing Dash Copay wallet, simply tap **Restore from backup** and enter the 12 word recovery phrase. File/text backups are also supported.
fr: Si vous souhaitez restaurer un portefeuille logiciel Dash Copay existant, touchez simplement **Restaurer depuis une sauvegarde** et saisissez les 12 mots de la phrase de sauvegarde. Les sauvegardes par fichier ou texte sont également récupérables.
ru: Если вы хотите восстановить уже существующий кошелёк Dash Copay, просто нажмите **Восстановить из бэкапа** и введите кодовую фразу из 12 слов. Также поддерживаются файловые и текстовые бэкапы.

source: Receiving
fr: Recevoir des fonds
ru: Получение

source: Simply tap the **Receive** icon at the bottom of the screen to receive Dash. The wallet will generate and display a QR code for the other device to scan, or you can tap the displayed address to copy it to the clipboard so you can paste it in another app. If you have multiple wallets, you can see the name of the wallet at the bottom of the screen, and tap it to switch between wallets. The receiving address will change and you will receive a notification when you receive the transfer.
fr: Touchez simplement l'icône **Recevoir** en bas de l'écran pour recevoir des dashs. Le portefeuille générera et affichera un QR-code pour qu'il soit scanné par l'autre appareil, ou bien vous pouvez simplement toucher l'adresse affichée pour la copier dans le presse-papiers puis la coller dans une autre application. Si vous avez plusieurs portefeuilles, vous pouvez voir le nom du portefeuille en bas de l'écran, et le toucher pour basculer entre portefeuilles. L'adresse de réception changera et vous recevrez une notification à réception des fonds.
ru: Чтобы получить Dash, просто нажмите на иконку **Получить** внизу экрана. Кошелёк сгенерирует и покажет QR код, который можно отсканировать другим устройством, или можно тапнуть на высветившийся адрес, чтобы сохранить его в буфер обмена и вставить в другом приложении. Если у вас несколько кошельков, внизу экрана отображается имя кошелька. Чтобы переключиться между кошельками, нажмите на него. Адрес получателя изменится, а вы получите уведомление, когда придёт транзакция.

source: *Receiving dash and viewing your balance in Dash Copay wallet*
fr: *Réception de dashs et consultation du solde dans le portefeuille logiciel Dash Copay**
ru: *Получение dash и просмотр баланса в кошельке Dash Copay*

source: Sending
fr: Envoyer
ru: Отправка

source: Depending on how your payee has provided their receiving address to you, you can send Dash by tapping either the **Scan** icon to use the device camera to scan a QR code, or the **Send** icon to paste a copied address or select an address from your Dash Copay address book. Once you have entered the address, it may be possible or necessary to enter the amount of Dash to be sent or an optional label for the recipient, and to decide if you want to send with InstantSend on or off (off by default). If you have multiple wallets, you must also choose which wallet you will use to send the funds. Once the transaction is complete, you will see a payment confirmation screen.
fr: Selon la façon dont votre destinataire vous a fourni son adresse de réception, vous pouvez lui envoyer des dashs en touchant soit l'icône **Scanner** pour utiliser la caméra de l'appareil et scanner un QR-code, soit l'icône **Envoyer** pour coller une adresse copiée ou choisir une adresse depuis votre carnet d'adresses Dash Copay. Une fois l'adresse indiquée, il est possible ou nécessaire d'indiquer le montant de dashs à envoyer ou une mention facultative pour le destinataire, et de décider si vous voulez ou non un envoi InstantSend (par défaut, c'est oui). Si vous avez plusieurs portefeuilles, vous devez aussi choisir depuis quel portefeuille envoyer les fonds. Une fois la transaction terminée, un écran de confirmation de paiement vous sera affiché.
ru: В зависимости от того, в каком виде вы получили адрес от получателя платежа, можно отправить Dash двумя способами - тапнув на иконку **Сканировать**, чтобы задействовать камеру устройства и отсканировать QR код, либо на иконку **Отправить**, чтобы вставить туда скопированный ранее адрес или выбрать адрес из адресной книги Dash Copay. После того, как вы ввели адрес, будет возможно или необходимо ввести количество отправляемого Dash и - по желанию - примечание для получателя, а также решить, хотите ли вы использовать и включить для этой транзакции InstantSend (по умолчанию - выключен). Если у вас несколько кошельков, вы также можете выбрать, каким кошельком воспользоваться для отправления средств. После того, как транзакция завершится, вы увидите экран с подтверждением платежа.

source: *Sending Dash from Dash Copay wallet*
fr: *Envoi de dashs depuis le portefeuille logiciel Dash Copay*
ru: *Отправление Dash с помощью кошелька Dash Copay*

source: Viewing transactions and balances
fr: Affichage des transactions et des soldes
ru: Просмотр транзакций и балансов

source: Your recent transactions appear on the **Home** screen. You can tap any transaction to view more details or enter a **Memo** to help you remember the purpose of the transaction. Tap **View on blockchain** to open the Insight blockchain explorer to view full transaction details. All the wallets you have created and their respective balances appear below the recent transactions on the **Home** screen. You can tap any wallet to view the balance and transaction history associated with that wallet only.
fr: Vos transactions récentes apparaissent sur l'écran d'**Accueil**. Vous pouvez toucher une transaction pour afficher plus de détails ou taper un **Pense-bête** pour vous aider à vous souvenir de son objet. Touchez **Voir dans la blockchain** pour ouvrir l'explorateur de blockchain Insight et voir tous les détails de la transaction. Tous les portefeuilles que vous avez créés et leurs soldes respectifs apparaissent sous les transactions récentes sur l'écran d'**Accueil**. Vous pouvez toucher un portefeuille pour voir son solde propre et son historique de transactions.
ru: Ваши недавние транзакции отображаются на **Домашнем** экране. Чтобы увидеть подробности транзакции, можно на неё тапнуть или ввести **Мемо**, чтобы при необходимости вспомнить её назначение. Нажмите на **Посмотреть в блокчейне**, чтобы открыть блокчейн эксплорер Insight и посмотреть все детали транзакции. Все созданные вами кошельки и соответствующие им балансы отображаются под недавними транзакциями на **Домашнем** экране. Чтобы посмотреть баланс и историю транзакций отдельного кошелька, тапните на этот кошелёк.

source: *Home screen, transaction details and wallet details in Dash Copay wallet*
fr: *Écran d'accueil, détails de transaction et détails de portefeuille dans le portefeuille logiciel Dash Copay*
ru: **Домашний экран, детали транзакции и кошелька в Dash Copay*
