Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/copay/shared-wallets.po
Languages: fr, ru

source: Setting up shared multi-signature wallets using Dash Copay
fr: Configuration de portefeuilles partagés multi-signature avec le portefeuille logiciel Dash Copay
ru: Настройка совместных кошельков с мультиподписями, используя Dash Copay

source: dash, mobile, wallet, copay, multisig, ios, android, shared wallet
fr: dash, mobile, portefeuille logiciel, copay, multi-signature, ios, android, portefeuille partagé
ru: dash, мобильный, кошелёк, copay, мультиподпись, ios, android, совместный кошелёк

source: Shared Wallets
fr: Portefeuilles partagés
ru: Совместные кошельки

source: Normal transactions in Dash only need to be approved by the person sending the funds. The Dash Copay wallet supports multisig, short for multisignature, meaning that it is possible to require more than one key to approve a transaction. This can be used like a joint checking account, or in situations where majority approval from a board is required to create a transaction. This documentation describes how to set up and use shared wallets.
fr: Les transactions Dash normales n'ont besoin d'être approuvées que par une seule personne, celle qui envoie les fonds. Le portefeuille logiciel Dash Copay est compatible avec la multi-signature, ce qui signifie qu'on peut exiger plus d'une clé pour approuver la transaction. Cela peut être utilisé comme un compte joint, ou dans des situations où l'approbation majoritaire d'une équipe est nécessaire pour créer une transaction. Cette documentation décrit comment configurer et utiliser des portefeuilles partagés.
ru: Для обычной транзакции в Dash достаточно подтверждения от того, кто отправляет средства. Кошелёк Dash Copay поддерживает мультиподпись, это означает, что для подтерждения транзакции может понадобиться более, чем один ключ. Подобная система может использоваться как объединённый кошелёк или в ситуациях, когда для создания транзакции необходимо одобрение большинства. Данная документация описывает как настроить и использовать совместные кошельки.

source: Before you create a shared wallet, think about how many people should have access to it, and how many of those people will be required to authorise a transaction. Is it just one or two? Or a majority, or even everyone? Shared wallets allow you to specify a total number of copayers and a required number of signatures to create a transaction. These are often referred to as M-of-N transactions, where for example 2-of-3 signatures are required to transact. In practice, this is used to share responsibility for the funds between several people. It is not possible require a certain person, such as the manager, to be one of the copayers (although adding a password only the manager knows can have the same effect). Shared wallets are inherently risky because if more than the minimum required number of people involved lose access to their keys, the funds will be inaccessible forever. Make sure everyone understands the risks and responsibilities of shared wallets before committing significant funds.
fr: Avant de créer un portefeuille partagé, prévoyez combien de gens y auront accès, et combien de ces gens seront requis pour autoriser une transaction. Une seule personne ou deux ? Ou bien une majorité ? Ou même tout le monde ? Les portefeuilles partagés vous permettent d'indiquer un nombre total de co-payeurs et un nombre requis de signatures pour créer une transaction. Ces transactions sont souvent appelées "transactions M sur N", où par exemple 2 signatures sur 3 sont requises pour effectuer la transaction. En pratique, cela est utilisé pour partager la responsabilité des fonds entre plusieurs personnes. Il n'est pas possible de rendre obligatoire qu'une certaine personne, par exemple le directeur, soit un des co-payeurs (même si ajouter un mot de passe que seul le directeur connaît peut avoir le même effet). Les portefeuilles partagés sont de nature risquée parce que, si jamais plus que le nombre requis de personnes perdent leurs clés, les fonds seront pour toujours inaccessibles. Assurez-vous que tout le monde comprenne les risques et les responsabilités des portefeuilles partagés avant d'y déposer des fonds d'un montant significatif.
ru: Перед созданием совместного кошелька, определитесь, сколько людей должно иметь к нему доступ и скольких людей, из имеющих доступ, достаточно для одобрения транзакции. Это будет один всего один или два человека? А может нужно большинство? Или вообще все? Совместные кошельки позволяют указать общее число совместных владельцев и число подписей, необходимых для создания транзакции. Часто их насываюти М-из-N транзакциями, где, например, 2-из-3 подписей необходимы для её проведения. На практике, это используется для разделения ответственности за хранимые средства между несколькими людьми. Невозможно иметь управляющего в числе совладельцев кошелька (тем не менее, установка пароля, который знает только управляющий, даст такой же эффект). По своей природе, совместные кошельки несут в себе риски, так как, при наличии условия минимального числа людей, подтверждающих транкакции, утеря ключа этим количеством людей приведет к потере доступа к средствам навсегда. Убедитесь, что все осознают риски и ответственность владения совместным кошельком, прежде чем переводить туда существенные средства.

source: Creating a shared wallet
fr: Création d'un portefeuille partagé
ru: Создание совместного кошелька

source: Funds and addresses in shared wallets are managed separately from your personal wallets, so you will need to create a new wallet and then add copayers before you can begin creating transactions. From the **Home** screen, click the + button at the top right to add a new wallet. Select **Create shared wallet** and enter a name for the wallet, your own name, the total number of copayers and the required number of signatures for a transaction. Tap the **Create m-of-n wallet** button to create the wallet. The wallet will appear with your other wallets, listed as **Incomplete** until the copayers have joined.
fr: Les fonds et les adresses des portefeuilles partagés sont gérés séparément de vos portefeuilles individuels, vous aurez donc à créer un nouveau portefeuille puis à y ajouter des co-payeurs avant de pouvoir créer des transactions. Sur l'écran d'**Accueil**, cliquez sur le bouton "+" en haut à droite pour ajouter un nouveau portefeuille. Choisissez **Créer un portefeuille partagé** et saisissez un nom pour ce portefeuille, votre propre nom, le nombre total de co-payeurs et le nombre requis de signatures pour une transaction. Touchez le bouton **Créer portefeuille m sur n** pour créer le portefeuille. Le portefeuille apparaîtra parmi vos autres portefeuilles, avec la mention **Incomplet** jusqu'à ce que les autres co-payeurs vous aient rejoint.
ru: Средства и адреса в совместном кошельке управляются отдельно от вашего личного кошелька, поэтому, прежде чем начать выполнять транзакции, необходимо создать новый кошелёк, а потом добавить совладельцев. В экране **Home** нажмите кнопку +, находящуюся в правом верхнем углу и добавьте новый кошелёк. Нажмите **Create shared wallet** и введите название кошелька, ваше собственное имя, общее число совладельцев и необходимое число подписей для транзакции. Нажмите кнопку **Create m-of-n wallet** для создания кошелька. Кошелёк появится в списке среди уже имеющихся как **Incomplete** и будет иметь этот статус, пока не присоединятся другие совладельцы.

source: *Creating a 2-of-3 shared wallet in Dash Copay*
fr: *Création d'un portefeuille partagé "2 sur 3" dans le portefeuille logiciel Dash Copay*
ru: *Создание совместного кошелька типа 2-of-3 в Dash Copay*

source: Tap the incomplete shared wallet when you are ready to add users. A QR code will be displayed. Have your copayers scan the code or share it to them by email or instant message by tapping the **Share invitation** button. Once everyone has scanned the code and entered their name, the wallet is ready for use. Simply tap the wallet to display addresses for receiving funds, but note that the addresses begin with 7 instead of X to indicated they are multisig addresses. It is possible to receive Dash to a shared wallet in exactly the same way as a normal wallet. Only sending Dash requires participation from the copayers.
fr: Touchez le portefeuille partagé incomplet quand vous êtes prêt à y ajouter des utilisateurs. Un QR-code sera affiché. Faites scanner le code pour vos co-payeurs, ou bien envoyez-le-leur par e-mail ou message instantané en touchant le bouton **Partager une invitation**. Une fois que tout le monde a scanné le code et saisi son nom, le portefeuille est prêt à l'emploi. Touchez simplement le portefeuille pour afficher les adresses de réception des fonds, mais veuillez noter que les adresses commencent par "7" plutôt que "X" pour indiquer qu'il s'agit d'adresses multi-signature. Il est possible de recevoir des dashs dans un portefeuille partagé de la même façon que dans un portefeuille normal. Seul dépenser des dashs demande l'accord des co-payeurs.
ru: Нажмите на совместный кошелёк со статусом incomplete, когда будете готовы добавить пользователей. Будет показан QR-код. Совладельцы должны отсканировать код или отправьте им код по электронной почте, так же можно отправить мгновенное сообщение, нажав кнопку **Share invitation**. Как только все отсканируют код и введут имена, кошелёк будет готов к использованию. Для отображения адресов получения средств просто нажмите на кошелёк. Обратите внимание, что адресы начинаются с 7, а не с Х, это является признаком кошелька с мультиподписями. Получение Dash работает точно также, как и в обычном кошельке. Участие совладельцев необходимо только при отправке средств.

source: *Adding copayers to a 2-of-3 shared wallet in Dash Copay*
fr: *Ajout de co-payeurs à un portefeuille partagé "2 sur 3" dans le portefeuille logiciel Dash Copay*
ru: *Добавление совладельцев в совместный кошелёк 2-из-3 в Dash Copay*
