Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/eight-steps.po
Languages: fr, it, pt, ru, vi

source: How to prepare and submit a successful proposal for the Dash treasury system
fr: Comment préparer et soumettre avec succès une proposition budgétaire au système du Trésor Dash
it: Come preparare e presentare una proposta di successo per il sistema di tesoreria Dash
pt: Como preparar e apresentar uma proposta de sucesso para o sistema de tesouraria Dash
ru: Как подготовить и успешно подать предложение для Бюджетной системы Dash
vi: Làm thế nào để chuẩn bị và đăng một đề xuất thành công trên hệ thống ngân quỹ của Dash

source: dash, treasury, proposal, recommendations, communication, escrow
fr: dash, trésor, proposition, recommandations, communication, séquestre
it: dash, tesoreria, proposta, raccomandazioni, comunicazione, deposito di garanzia
pt: dash, terouraria, propostas, recomendações, comunidação, escrow
ru: dash, Бюджет, предложение, рекомендации, коммуникация, эскроу
vi: Dash, ngân quỹ, đề xuất, gợi ý, truyền thông, uỷ thác

source: 8 Steps to a Successful Proposal
fr: 8 étapes pour réussir votre proposition budgétaire
it: 8 passaggi per una proposta di successo
pt: 8 etapas para uma proposta bem sucedida
ru: 8 шагов для подачи успешного предложения
vi: 8 Bước để lập một Đề xuất thành công

source: Proposals in the Dash governance system are subject to voting by masternodes. So, like any voting, you need to convince the voters that your proposal should pass. Here are some key points to consider in every proposal:
fr: Les propositions, dans le système de gouvernance Dash, sont soumises au vote des masternodes. Donc, comme dans n'importe quel scrutin, vous devez convaincre les électeurs que votre proposition mérite d'être adoptée. Voici quelques points clés à considérer pour chaque proposition :
it: Le proposte nel sistema di governance di Dash sono soggette al voto dei masternode. Quindi, come ogni votazione, devi convincere gli elettori che la tua proposta dovrebbe passare. Ecco alcuni punti chiave da considerare in ogni proposta:
pt: As propostas no sistema de governança estão sujeitas a votação pelos masternodes. Então, como qualquer votação, você precisa convencer os eleitores de que sua proposta deve ser aprovada. Aqui estão alguns pontos importantes a serem considerados em todas as propostas:
ru: Бюджетные предложения это часть системы управления Dash и они являются предметом голосования Мастернод. Поэтому, как и при любом другом голосовании, вам необходимо убедить голосующих в том, что именно ваше предложение достойно получения финансирования. Вот несколько ключевых моментов, о которых стоит помнить при подаче любого бюджетного предложения:
vi: Những đề xuất trong hệ thống quản trị của Dash là đối tượng để bỏ phiếu bởi các masternode. Như vậy, cũng giống như các cuộc bỏ phiếu khác, bạn cần phải thuyết phục những cử tri thông qua đề xuất của bạn. Sau đây là một số điểm mà mỗi đề xuất cần quan tâm:

source: Keep your proposal clear
fr: Faites une proposition claire
it: Mantieni chiara la tua proposta
pt: Mantenha sua proposta clara
ru: Сделайте ваше предложение понятным
vi: Giữ cho đề xuất được rõ ràng

source: Your proposal should have a clear title, followed by a short and simple description of the objectives. Explain early in your proposal exactly how it will benefit the Dash network, how much Dash you are requesting, how you arrived at this value, and finally who you are and how you plan to do the work. Masternodes should be able to immediately get an idea of what you are proposing from the first few lines of your proposal.
fr: Votre proposition devrait avoir un titre clair, suivi par une description courte et simple de ses objectifs. Expliquez d'emblée en quoi votre proposition bénéficiera au réseau Dash, combien de dashs vous sollicitez, comment vous avez déterminé ce montant, et, enfin, qui vous êtes et comment vous comptez accomplir le travail. Les masternodes devraient avoir immédiatement une idée de ce que vous proposez, dès les premières lignes de votre proposition.
it: La tua proposta dovrebbe avere un titolo chiaro, seguito da una breve e semplice descrizione degli obiettivi. Spiega all'inizio della tua proposta esattamente come questa darà beneficio alla rete Dash, quanti Dash richiedi, come sei arrivato a questo valore e infine chi sei e come prevedi di fare il lavoro. I masternode dovrebbero essere in grado di avere immediatamente, già dalle prime righe della tua proposta, un'idea di ciò che stai proponendo .
pt: Sua proposta deve ter um título claro, seguido por uma descrição curta e objetivos simples. Explicar no início da sua proposta exatamente como isso beneficiará a rede do Dash, quanto Dash você está solicitando, como chegou a esse valor e, finalmente, quem você é e como planeja fazer o trabalho. Os Masternodes deve ser capaz de ter uma idéia do que você está propondo desde as primeiras linhas da sua proposta.
ru: У вашего предложения должно быть понятное название, за которым следует короткое и простое описание целей предложения. Постарайтесь сразу объяснить, какую пользу от него получит сеть Dash, сколько DASH на его реализацию вы просите, почему вы решили, что сумма должна быть именно такой и, наконец, кто вы и как вы планируете выполнять намеченную работу. Необходимо, чтобы Мастерноды могли сразу, с первых нескольких строк, понять суть вашего предложения.
vi: Đề xuất của bạn nên có một tiêu đề rõ ràng, theo sau là một đoạn ngắn và đơn giản mô tả mục đích. Hãy giải thích chính xác về đề xuất của bạn mang lại lợi ích như thế nào với mạng lưới của Dash ngay trong phần đầu để người đọc đỡ mất công, sau đó nói rõ bạn cần bao nhiêu Dash, cách bạn đạt được giá trị này, và cuối cùng là bạn là ai và bạn dự định thực hiện nó như thế nào. Sao cho các chủ masternode nhanh chóng hiểu được ý tưởng mà bạn muốn đề xuất từ một vài dòng đầu trong đề xuất của bạn.

source: Run a pre-proposal discussion
fr: Ouvrez un débat de pré-proposition
it: Avvia una discussione pre-proposta
pt: Executar uma discussão de pré-proposta
ru: Перед подачей предложения создайте предварительное обсуждение
vi: Mở một phiên thảo luận trước khi đề xuất

source: Get feedback from the community before you post your proposal to the blockchain. A discussion period of around two weeks will help you find out if someone has proposed something similar in the past, and whether it succeeded or failed. There are `pre-proposal channels on the forum <https://www.dash.org/forum/topic/pre-budget-proposal- discussions.93/>`__ and `Dash Discord <http://staydashy.com>`__, and `Reddit <https://www.reddit.com/r/dashpay>`__ also attracts a lot of views - consider the discussion on these channels to be the research phase of your proposal. Later, you can post a link to the forum discussion when your proposal goes live to show you are including community feedback in your work.
fr: Évaluez le sentiment de la communauté avant même de soumettre votre proposition sur la blockchain. Une période de discussion d'environ deux semaines vous aidera à savoir si quelqu'un a déjà proposé quelque chose de similaire dans le passé, et s'il a réussi ou échoué. Il existe des `canaux de discussion de pré-proposition sur le forum <https://www.dash.org/forum/topic/pre-budget-proposal- discussions.93/>`__ , sur `Dash Discord <http://staydashy.com>`__, et `Reddit <https://www.reddit.com/r/dashpay>`__ attire également beaucoup de regards — considérez le débat sur ces canaux comme la phase de recherche de votre proposition. Plus tard, vous pourrez publier un lien du forum de discussion, quand votre proposition sera effective et que vous voudrez montrer que vous avez tenu compte des retours de la communauté dans votre projet.
it: Ottieni feedback dalla community prima di pubblicare la tua proposta sulla blockchain. Un periodo di discussione di circa due settimane ti aiuterà a scoprire se qualcuno ha proposto qualcosa di simile in passato e se ha avuto successo o meno. Ci sono `canali pre-proposal sul forum <https://www.dash.org/forum/topic/pre-budget-proposal- discussions.93/>`__ e `Dash Discord <http://staydashy.com >`__ e `Reddit <https://www.reddit.com/r/dashpay>`__ attirano molte visualizzazioni: considera la discussione su questi canali come la fase di ricerca della tua proposta. Successivamente, puoi pubblicare un collegamento alla discussione del forum quando la tua proposta viene pubblicata per dimostrare che stai includendo il feedback della community nel tuo lavoro.
ru: Прежде чем разместить свое предложение в блокчейне, получите обратную связь от сообщества. Период обсуждения в течение примерно двух недель поможет вам узнать, предлагал ли кто-то нечто подобное в прошлом, и было ли это предложение успешным или неудачным. Существуют каналы `предложения` на форуме <https://www.dash.org/forum/topic/pre-budget-proposal- discussions.93/>`__ и `Dash Discord <http://staydashy.com>`__, а `Reddit <https://www.reddit.com/r/dashpay>`__ также привлекает большое количество просмотров - рассматривайте обсуждение на этих каналах как этап исследования вашего предложения. Позже вы можете опубликовать ссылку на обсуждение на форуме, когда ваше предложение станет реальным, чтобы показать, что вы учитываете мнение сообщества в своей работе.

source: Manage your identity and reputation
fr: Gérez votre identité et votre réputation
it: Gestisci la tua identità e reputazione
pt: Gerenciar sua identidade e reputação
ru: Дайте понять, кто вы есть и создайте себе репутацию
vi: Quản lý nhận dạng và danh tính của bạn

source: The Dash community is one of the network's strongest features, and newcomers are always welcome. However, because of the way proposals work, there needs to be reasonable trust that the work promised in the proposal will be completed if it passes. If you are new, consider starting with a smaller proposal first to prove your ability to deliver on time and budget. Attaching your real name or `Keybase <https://keybase.io>`_ identity to a proposal also helps build trust. If you are a making a large proposal, get a team together and nominate (or hire) one person to serve as community liaison, since posting from multiple accounts can be confusing.
fr: La communauté Dash est un des aspects les plus solides du réseau, et les nouveaux venus sont toujours bienvenus. Cependant, en raison de la manière dont fonctionnent les propositions, il doit y avoir une certaine confiance que le travail promis dans la proposition sera bel et bien réalisé si la proposition est adoptée. Si vous êtes nouveau, il est conseillé de commencer par une petite proposition, afin de prouver votre capacité à la réaliser à temps et avec un budget donné. Communiquer votre vrai nom ou votre identité `Keybase <https://keybase.io>`_ dans votre proposition aide également à bâtir la confiance. Si vous soumettez une proposition plus ambitieuse, formez une équipe et désignez (ou recrutez) une personne qui servira de porte-parole envers la communauté, car communiquer depuis de nombreux comptes peut être difficile à suivre.
it: La community di Dash è una delle sfaccettature più forti della rete ed i nuovi arrivati sono sempre i benvenuti. Tuttavia, a causa del modo in cui funzionano le proposte, deve esserci una ragionevole fiducia che il lavoro promesso nella proposta sarà completato una volta approvato. Se sei nuovo, considera di iniziare prima con una proposta più piccola per dimostrare la tua capacità di concludere in tempo e budget. Anche allegare il tuo vero nome o identità `Keybase <https://keybase.io>` _ ad una proposta aiuta anche a creare fiducia. Se stai facendo una proposta di grandi dimensioni, riunisci un team e nomina (o assumi) una persona che serva da collegamento con la comunità, poiché pubblicare da più account può creare confusione.
pt: A comunidade Dash é um dos recursos mais fortes da rede e os novatos são sempre bem-vindos. No entanto, devido ao modo como as propostas funcionam, é necessário que haja confiança razoável de que o trabalho prometido na proposta será concluído se for aprovado. Se você é novo, considere começar com uma proposta menor primeiro para provar sua capacidade de entregar dentro do prazo e do orçamento. Anexando seu nome real ou `Keybase <https://keybase.io>`_ Identidade para uma proposta também ajuda a construir confiança. Se você estiver fazendo uma grande proposta, junte uma equipe e nomeie (ou contrate) uma pessoa para atuar como contato com a comunidade, já que a postagem de várias contas pode ser confusa.
ru: Сообщество Dash является одной из самых сильных сторон этой сети и новые участники в нём всегда приветствуются. Тем не менее, система подачи предложений такова, что требуется уверенность в заверешении работы по реализации предложения, если оно пройдёт голосование. Если вы новичёк, то начните с простых предложений, чтобы доказать, что вы способны показать результат, уложившись в отведённый срок и бюджет. Если вы укажете своё реальное имя или идентификатор `Keybase <https://keybase.io>`_, это тоже поможет повысить степень доверия к вам. Если вы готовите крупное бюджетне предложение, то создайте команду и выдвините (или наймите) одного человека, который бы представлял вашу группу, поскольку посты, опубликованные с разных профилей могут создавать путаницу.
vi: Cộng đồng Dash là một trong những tính năng mạnh mẽ nhất của mạng lưới, và những người mới luôn được chào đón. Tuy nhiên, do cách đề xuất hoạt động, nên cần có sự tin tưởng nào đó rằng công việc đã hứa trong đề xuất sẽ được hoàn thành nếu nó được thông qua. Bởi vậy nếu bạn là người mới, hãy cân nhắc việc bắt đầu bằng những đề xuất nhỏ trước để chứng minh khả năng hoàn thành đề xuất của bạn một cách đúng thời gian và phù hợp ngân sách. Hãy đính kèm tên thật của bạn hoặc thông tin của bạn trên `Keybase <https://keybase.io>`_ với đề xuất cũng sẽ giúp bạn xây dựng được lòng tin. Nếu bạn muốn đưa ra đề xuất lớn, hãy tập hợp mọt nhóm và chỉ định (hoặc thuê) một người có nhiệm vụ liên lạc với cộng đồng, vì việc đăng thông tin bằng nhiều tài khoản khác nhau có thể gây nhầm lẫn.

source: Run an enthusiastic campaign for your proposal
fr: Organisez une campagne vivante et animée pour votre proposition
it: Lancia una campagna entusiasta per la tua proposta
pt: Faça uma campanha entusiasmada para sua proposta
ru: Создайте увлечённую кампанию для продвижения вашего предложения
vi: Chạy chiến dịch quảng bá để thu nhận sự ủng hộ cho đề xuất của bạn

source: Proposals with a video or website have a far greater chance of succeeding! Uploading a video gives your proposal a human touch and a chance to convey your enthusiasm in a way that isn't always possible in text. Post your video to the `forum <https://www.dash.org/forum/topic/pre-budget-proposal- discussions.93/>`_ and `DashCentral <https://www.dashcentral.org/budget>`_, become a regular on Discord or run a webinar to explain the proposal and answer questions. Put some work in before you ask for funding to demonstrate your involvement with Dash - but don't be annoying and spam many channels asking for votes.
fr: Les propositions comportant une vidéo ou un site web ont une bien meilleure chance de réussite ! Proposer une vidéo donne à votre proposition une "touche humaine" et une chance de partager votre enthousiasme d'une façon pas toujours atteignable avec du texte seul. Publiez votre vidéo sur le `forum <https://www.dash.org/forum/topic/pre-budget-proposal- discussions.93/>`_ et sur `DashCentral <https://www.dashcentral.org/budget>`_, devenez un membre régulier sur Discord ou organisez un séminaire web pour expliquer votre proposition et répondre aux questions. Accomplissez un certain travail avant de solliciter un financement, afin de démontrer votre engagement dans Dash — mais ne soyez pas envahissant et ne spammez pas de nombreux canaux de communication en demandant des votes.
it: Le proposte con un video o un sito web hanno molte più possibilità di successo! Caricare un video dà alla tua proposta un tocco umano e la possibilità di trasmettere il tuo entusiasmo in un modo che non è sempre possibile nel testo. Pubblica il tuo video sul `forum <https://www.dash.org/forum/topic/pre-budget-proposal- discussions.93/>`_ e su `DashCentral <https://www.dashcentral.org/budget >`_, diventa un utente abituale di Discord o organizza un webinar per spiegare la proposta e rispondere alle domande. Impegnati un po' prima di chiedere finanziamenti per dimostrare il tuo coinvolgimento con Dash, ma non essere fastidioso e non spammare molti canali chiedendo voti.
ru: Предложения с видеороликом или веб-сайтом имеют гораздо больше шансов на успех! Загрузка видеоролика придает вашему предложению человеческий облик и дает возможность передать свой энтузиазм так, как это не всегда возможно в тексте. Разместите свое видео на `форуме <https://www.dash.org/forum/topic/pre-budget-proposal- discussions.93/>`_ и `DashCentral <https://www.dashcentral.org/budget>`_, станьте постоянным участником Discord или проведите вебинар, на котором расскажите о своем предложении и ответьте на вопросы. Прежде чем просить финансирование, проделайте определенную работу, чтобы продемонстрировать свою причастность к Dash, но не будьте назойливы и не спамьте многочисленные каналы с просьбами о голосовании.

source: Demonstrate your commitment to the network
fr: Manifestez votre engagement pour le réseau
it: Dimostra il tuo impegno per la rete
pt: Demonstrar seu compromisso com a rede
ru: Продемонстрируйте свою приверженность сети
vi: Thể hiệu sự cam kết của bạn với mạng lưới

source: If you are asking for significant funding to start up or expand a for-profit business built on Dash, you need to explain why and for how long this funding is required, and what you are offering in return. It can be very helpful to show you have skin in the game by matching the contribution provided in Dash with funds from your own business or investors. Equity or exclusivity agreements can be reached with `Dash Core Group, Inc. <bradley.zastrow@dash.org>`_, but must be clarified in writing before the proposal is posted.
fr: Si vous sollicitez un investissement important dans le but de démarrer ou d'étendre une activité à but lucratif fondée sur Dash, vous aurez à expliquer pourquoi et pour combien de temps le financement est nécessaire, et ce que vous offrirez en retour. Il peut être très utile de montrer que vous avez un engagement personnel, par exemple en complétant à part égale les fonds Dash sollicités avec vos propres fonds issus de vos activités ou de vos investisseurs. Des accords d'équité ou d'exclusivité peuvent être conclus avec l'équipe `Dash Core Group, Inc. <bradley.zastrow@dash.org>`_, mais ils doivent être couchés sur papier avant que la proposition ne soit soumise au réseau.
it: Se stai chiedendo finanziamenti significativi per avviare o espandere un'attività a scopo di lucro basata su Dash, devi spiegare perché e per quanto tempo è richiesto questo finanziamento e cosa offri in cambio. Può essere molto utile mostrare che c'è dedizione nel progetto abbinando il contributo fornito in Dash con i fondi della tua azienda o dei tuoi investitori. Gli accordi di partecipazione o esclusività possono essere raggiunti con `Dash Core Group, Inc. <bradley.zastrow@dash.org>` _, ma devono essere chiariti per iscritto prima che la proposta venga pubblicata.
pt: Se você está pedindo financiamento significativo para iniciar ou expandir um negócio com fins lucrativos baseado em Dash, é necessário explicar por que e por quanto tempo esse financiamento é necessário e o que você está oferecendo em troca. Pode ser muito útil mostrar que você tem interesse no jogo combinando a contribuição fornecida no Dash com fundos de sua própria empresa ou investidores. Acordos de capital próprio ou de exclusividade podem ser alcançados com `Dash Core Group, Inc. <bradley.zastrow@dash.org>`_, mas deve ser esclarecido por escrito antes que a proposta seja publicada.
ru: Если вам требуются значительные инвестиции для запуска или расширения коммерческого бизнеса, построенного на Dash, вам нужно объяснить, почему и на какой срок потребуется финансирование на это и что вы предлагаете взамен. Может оказаться очень полезным продемонстрировать, что у вас есть собственные интересы в этом деле, сопоставляя вклад, предоставленный в Dash со средствами вашего собственного бизнеса или инвесторов. Соглашения об эксклюзивности могут быть заключены при помощи `Dash Core Group, Inc. <bradley.zastrow@dash.org> `_, но должны быть уточнены в письменной форме до публикации предложения.
vi: Nếu bạn yêu cầu cho một sự đầu tư lớn để bắt đầu hoặc mở rộng một doanh nghiệp dựa trên Dash, bạn cần phải giải thích tại sao và cần cấp vốn trong bao lâu, và bạn sẽ mang lại điều gì để đổi lại sự cấp vốn đó. Sẽ rất tốt nếu bạn thể hiện rằng bạn sẵn sàng chấp nhận rủi ro về tài chính khi tham gia bằng việc đóng vốn đối ứng của bạn hoặc của các nhà đầu tư của bạn cùng với ngân sách được cấp bởi Dash. Các thỏa thuận về quyền sở hữu hoặc độc quyền có thể đạt được với `Dash Core Group, Inc. <bradley.zastrow@dash.org>`_, nhưng phải được làm rõ bằng văn bản trước khi đề xuất được đăng.

source: Post your proposal early and make yourself available for questions
fr: Soumettez votre proposition le plus tôt possible, et restez disponible pour les questions
it: Pubblica la tua proposta in anticipo e renditi disponibile per le domande
pt: Publique sua proposta com antecedência e fique à disposição para perguntas
ru: Опубликуйте своё предложение заранее и будьте доступны для ответов на вопросы
vi: Đăng đề xuất sớm và sẵn sàng trả lời các câu hỏi
