Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/eight-steps.po
Languages: fr, it, pt, ru, vi

source: The voting window closes 1662 blocks (or just under 3 days) before the superblock. To give the masternode operators enough time to consider, discuss and vote on your proposal, you must post it well in advance of the voting deadline - it's better to wait for the next superblock than to rush! Most masternodes will see your proposal for the first time once it appears on the blockchain or when you claim it on DashCentral. The first few hours of discussion between masternode owners typically bring up a lot of questions and can be critical to influence opinion and voting, so make yourself available during this time.
fr: Le scrutin se clôt 1662 blocs (c'est-à-dire moins de trois jours) avant le "superbloc". Pour donner aux opérateurs de masternode assez de temps pour étudier, discuter et voter sur votre proposition, vous devez la soumettre bien en avance par rapport à la date limite du vote — il est préférable d'attendre le prochain "superbloc" plutôt que de se précipiter ! La plupart des masternodes découvriront votre proposition une fois qu'elle apparaîtra sur la blockchain ou sur DashCentral. Les toutes premières heures de discussion avec les opérateurs de masternode sont typiquement l'occasion de beaucoup de questions posées, et peuvent être déterminantes sur l'opinion et le vote, il faut donc que vous soyez disponible durant cette période.
it: La finestra di votazione chiude 1662 blocchi (o poco meno di 3 giorni) prima del superblocco. Per dare agli operatori del masternode abbastanza tempo per considerare, discutere e votare la tua proposta, devi pubblicarla con largo anticipo rispetto alla scadenza del voto: è meglio aspettare il prossimo superblocco che affrettarsi! La maggior parte dei masternode vedrà la tua proposta per la prima volta una volta che appare sulla blockchain o quando la rivendichi su DashCentral. Le prime ore di discussione tra i proprietari di masternode in genere sollevano molte domande e possono essere fondamentali per influenzare l'opinione e il voto, quindi renditi disponibile durante questo periodo.
pt: A janela de votação fecha 1662 blocos (ou pouco menos de 3 dias) antes do superbloco. Para dar aos operadores de masternode tempo suficiente para considerar, discutir e votar em sua proposta, você deve publicá-la bem antes do prazo de votação - é melhor esperar pelo próximo superbloco do que correr! A maioria dos masternodes verá sua proposta pela primeira vez, uma vez que apareça no blockchain ou quando você a reivindicar no DashCentral. As primeiras horas de discussão entre os proprietários de masternodes normalmente trazem muitas perguntas e podem ser críticas para influenciar a opinião e a votação, portanto, fique disponível durante esse período.
ru: Окно голосования закрывается через 1662 блока (или чуть менее, чем через 3 дня) перед суперблоком. Чтобы дать операторам Мастернод достаточно времени для рассмотрения, обсуждения и голосования по вашему предложению, опубликовать его стоит задолго до крайнего срока голосования - лучше не спешить и подождать следующего суперблока! Большинство Мастернод впервые увидит ваше предложение, как только оно появится на блокчейне или когда вы заявите об этом на DashCentral. Первые несколько часов обсуждения между владельцами Мастернод обычно вызывают множество вопросов и могут иметь решающее значение для влияния на мнение и голосование, поэтому следует быть на связи в это период.
vi: Phiên bỏ phiếu sẽ đóng trong vòng 1662 block (hoặc gần 3 ngày) trước siêu khối. Để cho những người vận hành masternode có đủ thời gian cân nhắc, thảo luận và bỏ phiếu cho đề xuất của bạn, bạn cần phải đăng nó trước khi đến thời hạn chót - có lẽ sẽ tốt hơn là đợi đến kỳ sau thay vì phải làm một cách vội vã! Hầu hết các masternode sẽ thấy đề xuất của bạn đầu tiên một khi nó xuất hiện trên blockchain hoặc khi bạn đăng trên DashCentral. Trong vài giờ đầu thảo luận với các chủ masternode thường sẽ có rất nhiều câu hỏi và nó có ý nghĩa rất quan trọng đối với những quan điểm và bỏ việc phiếu, bởi vậy hãy chuẩn bị và dành thời gian cho giai đoạn này.

source: Keep the community updated when your proposal passes
fr: Continuez à informer la communauté une fois que votre proposition a été adoptée
it: Mantieni aggiornata la community quando la tua proposta viene approvata
pt: Mantenha a comunidade atualizada quando sua proposta passar
ru: Держите сообщество в курсе последних новостей о работе над вашим предложением после прохождения этапа голосования
vi: Thường xuyên cập nhật tình hình cho cộng đồng khi đề xuất được thông qua

source: Your proposal should include details of how you plan to keep the community and network informed of your work. Meet your commitments and post regular reports so your output is clear, and make yourself available on social channels to answer questions. Remember, your ability to pass future proposals depends on your demonstrated ability to deliver and communicate.
fr: Votre proposition doit inclure des détails concernant la manière dont vous comptez garder la communauté et le réseau informés de votre travail. Honorez vos engagements et publiez des rapports réguliers pour que votre travail soit transparent, et soyez disponible sur les canaux de communication pour répondre aux questions. Souvenez-vous que votre capacité à faire adopter des propositions futures dépend de votre capacité passée à respecter vos engagements et à communiquer.
it: La tua proposta dovrebbe includere dettagli su come intendi mantenere la comunità e la rete informate del tuo lavoro. Rispetta i tuoi impegni e pubblica rapporti regolari in modo che i tuoi risultati siano chiari e renditi disponibile sui canali social per rispondere alle domande. Ricorda, la tua capacità di passare proposte future dipende dalla tua capacità dimostrata di fornire e comunicare.
pt: Sua proposta deve incluir detalhes de como você planeja manter a comunidade e a rede informadas sobre seu trabalho. Cumpra seus compromissos e publique relatórios regulares para que sua saída seja clara e fique disponível nos canais sociais para responder a perguntas. Lembre-se de que sua capacidade de transmitir propostas futuras depende da sua capacidade demonstrada de fornecer e se comunicar.
ru: Ваше предложение должно содержать сведения о том, как вы планируете информировать сообщество и сеть о своей работе. Выполняйте свои обязательства и публикуйте регулярные отчёты, чтобы результаты вашей работы были понятными и будьте доступны на социальных каналах для ответов на вопросы. Помните, что ваша способность продвигать будущие предложения зависит от продемонстрированного вами умения доносить информацию и общаться.
vi: Đề xuất của bạn nên bao gồm chi tiết về việc bạn lập kế hoạch ra sao để giữ cho cộng đồng và mạng lưới được cập nhật về những thông tin làm việc của bạn. Nên giữ cam kết và thường xuyên đăng báo cáo và sẵn sàng trên các kênh trực tuyến để trả lời các câu hỏi của cộng đồng. Nên nhớ rằng, những đề xuất của bạn trong tương lai có được chấp thuận hay không tuỳ thuộc vào khả năng bạn giữ cam kết và khả năng giao tiếp với cộng đồng.

source: Consider arrangements for large requests
fr: Envisagez des accords spécifiques pour les sollicitations importantes
it: Considera accordi per richieste di grandi dimensioni
pt: Considere providências para pedidos grandes
ru: Рассмотрите механизмы для крупных финансовых запросов
vi: Hãy cân nhắc những sắp xếp cho những yêu cầu lớn

source: If you are requesting a significant amount of funding, there is an understandable concern that you will deliver on your promises to the network. Reach out to the `Dash Investment Foundation <https://www.dashinvests.org/>`_ in advance for advice on escrow or providing equity, and make the conditions public and part of the proposal. If your proposal is so large that uses a significant percentage of the budget, there is a risk that approving your proposal will bump smaller proposals out of the budget. Consider breaking your proposal into smaller monthly payments instead.
fr: Si vous sollicitez un financement d'un montant significatif, il y aura un doute compréhensible que vous puissiez tenir vos promesses envers le réseau. Veuillez contacter la `Dash Investment Foundation <https://www.dashinvests.org/>`_ à l'avance, pour obtenir des conseils sur le séquestre, et rendez publiques les conditions du séquestre dans le cadre de la proposition. Si votre proposition est tellement grande qu'elle utilisera une part significative du budget, il y a un risque que faire passer votre proposition fera sortir du budget d'autres propositions plus modestes. Envisagez de fractionner votre proposition en paiements mensuels plus petits.
it: Se stai richiedendo una quantità significativa di finanziamenti, è comprensibile la preoccupazione che tu non mantenga le promesse fatte alla rete. Rivolgiti in anticipo alla `Dash Investment Foundation <https://www.dashinvests.org/>`_ per consigli sul deposito a garanzia o sulla fornitura di capitale e rendi pubbliche le condizioni come parte della proposta. Se la tua proposta è così grande da utilizzare una percentuale significativa del budget, c'è il rischio che l'approvazione della tua proposta faccia uscire dal budget le proposte più piccole. Considera invece la possibilità di suddividere la tua proposta in pagamenti mensili più piccoli.
ru: Если вы запрашиваете значительный объем финансирования, то вполне понятна обеспокоенность тем, что вы выполните свои обещания перед сетью. Заранее обратитесь в инвестиционный фонд `Dash Investment Foundation <https://www.dashinvests.org/>`_ за советом по поводу условного депонирования или предоставления собственного капитала, огласите условия и сделайте их частью предложения. Если ваше предложение настолько велико, что использует значительный процент бюджета, существует риск, что одобрение вашего предложения приведет к вытеснению из бюджета более мелких предложений. Рассмотрите возможность разбить предложение на более мелкие ежемесячные платежи.

source: See :ref:`this documentation <using-governance>` for specific instructions on how to create a proposal when you are ready. Good luck!
fr: Veuillez consulter :ref:`cette documentation <using-governance>` pour des instructions spécifiques sur la création d'une proposition, dès que vous serez prêt. Bonne chance !
it: Vedere: ref: `questa documentazione <using-governance>` per istruzioni specifiche su come creare una proposta quando si è pronti. In bocca al lupo!
pt: Veja :ref:`está documentação <using-governance>` para instruções específicas sobre como criar uma proposta quando estiver pronto. Boa sorte!
ru: О специалных указаниях, как создать предложение, когда вы уже готовы к этому, вы можете почитать по ссылке: :ref:`документация <using-governance>` . Удачи!
vi: Hãy xem :ref:`tài liệu này <using-governance>` để có hướng dẫn cụ thể về việc làm thế nào để tạo một đề xuất khi bạn đã sẵn sàng. Chúc may mắn!

source: For an example of good reporting, reputation management and use of a video to request funding in a pre-proposal, see this video from Amanda B. Johnson's extremely popular **DASH: Detailed** proposal:
fr: Pour avoir un bon exemple de communication satisfaisante, de gestion de réputation et d'utilisation d'une vidéo pour solliciter un financement dans le cadre d'une pré-proposition, consultez cette vidéo de la proposition très populaire d'Amanda B. Johnson, **Dash Detailed** :
it: Per un esempio di buon report, gestione della reputazione e utilizzo di un video per richiedere finanziamenti in una proposta preliminare, guarda questo video di Amanda B. Johnson, **DASH: Detailed** proposal:
pt: Para um exemplo de boa reportagem, gerenciamento de reputação e uso de um vídeo para solicitar financiamento em uma pré-proposta, veja este vídeo da extremamente popular série de Amanda B. Johnson. **DASH: Detailed** proposal:
ru: В качестве хорошего примера отчётности, управления репутацией и использования видеороликов для запроса финансирования в предварительном предложении посмотрите это видео из чрезвычайно популярного предложения **Подробности о Dash** Аманды Б. Джонсон:
vi: Ví dụ về một báo cáo tốt, quản lý danh tiếng và sử dụng một video để xin cấp kinh phí trong một tiền đề xuất, hãy xem video đề xuất rất nổi tiếng có tên **DASH: Detailed** từ Amada B. Johnson

source: A few additional points:
fr: Quelques aspects supplémentaires :
it: Alcuni punti aggiuntivi:
pt: Alguns pontos adicionais:
ru: Немного дополнительной информации:
vi: Một vài điểm bổ sung:

source: It is currently not possible to change the payment address after the proposal is posted to the blockchain.
it: Al momento non è possibile modificare l'indirizzo di pagamento dopo che la proposta è stata pubblicata sulla blockchain.
ru: В настоящее время изменить платежный адрес после размещения предложения в блокчейне невозможно.

source: To avoid accusations of favouritism and inside trading, Dash Core cannot promote your proposal for you. If your proposal is an integration, reach out to the business development team in advance. Once your product is live, it may be possible to announce it from Dash Core channels.
fr: Pour éviter les accusations de favoritisme ou de délit d'initié, l'équipe Dash Core ne peut pas promouvoir votre proposition à votre place. Si votre proposition est une intégration, contactez l'équipe de développement commercial à l'avance. Une fois votre produit fonctionnel, il est possible de l'annoncer en utilisant les canaux de Dash Core.
it: Per evitare accuse di favoritismo e trading interno, Dash Core non può promuovere la tua proposta per te. Se la tua proposta è un'integrazione, contatta in anticipo il team di sviluppo aziendale. Una volta che il prodotto è attivo, potrebbe essere possibile annunciarlo dai canali Dash Core.
pt: Para evitar acusações de favoritismo e negociação interna, a Dash Core não pode promover sua proposta para você. Se a sua proposta é uma integração, entre em contato com a equipe de desenvolvimento de negócios com antecedência. Uma vez que seu produto estiver ativo, pode ser possível anunciar isso dos canais do Dash Core.
ru: Чтобы избежать обвинений в фаворитизме и внутренней торговле, команда Dash Core не занимается продвижением чьих-либо предложений. Если ваше предложение является интеграцией, заранее свяжитесь с командой развития бизнеса. Как только ваш продукт станет жизнеспособным, о нём можно будет объявить на каналах Dash Core.
vi: Để tránh bị cáo buộc là thiên vị và giao dịch tay trong, Dash Core không thể quảng bá cho những đề xuất của bạn. Nếu đề xuất của bạn là một giải pháp tích hợp, hãy liên hệ với nhóm phát triển thị trường trước. Một khi sản phẩm của bạn được chạy, nó có thể được công bố trên các kênh của Dash Core.

source: If your proposal is for news, promotion or marketing, make sure you synchronise your efforts with major existing organisations such as Dash Force News or marketing firms contracted by Dash Core.
fr: Si votre proposition concerne les actualités, la promotion ou le marketing, assurez-vous de synchroniser votre travail avec les organisations importantes déjà existantes, telles que Dash Force News ou les entreprises de marketing sous contrat avec Dash Core.
it: Se la tua proposta è per notizie, promozione o marketing, assicurati di sincronizzare i tuoi sforzi con le principali organizzazioni esistenti come Dash Force News o società di marketing contrattate da Dash Core.
pt: Se a sua proposta é para notícias, promoção ou marketing, certifique-se de sincronizar seus esforços com as principais organizações existentes, como o Dash Force News ou empresas de marketing contratadas pelo Dash Core.
ru: Если ваше предложение связано с новостями, продвижением или маркетингом, убедитесь, что работа над ним синхронизирована с такими крупными существующими организациями, как Dash Force News или маркетинговыми фирмами, нанятыми Dash Core.
vi: Nếu đề xuất của bạn là về tin tức, quảng bá, hay marketing, hãy chắc chắn rằng bạn đồng bộ những nỗ lực của mình với những tổ chức lớn trên mạng lưới Dash như Dash News hoặc các hãng tiếp thị được ký hợp đồng với Dash Core.

source: You are responsible for your own planning to hedge against price volatility. If your proposal involves significant payments to third parties in fiat currency, reach out to the `Dash Investment Foundation <https://www.dashinvests.org/>`_ in advance for advice on escrow, price maintenance, converting currencies and hedging against volatility.
fr: La protection contre la volatilité du cours Dash est de votre responsabilité. Si votre proposition implique des paiements significatifs à des tierces parties en monnaie fiduciaire, veuillez contacter la `Dash Investment Foundation <https://www.dashinvests.org/>`_ à l'avance, pour des conseils sur le séquestre, la gestion du cours, la conversion entre monnaies ou la protection contre la volatilité.
it: Sei responsabile della tua pianificazione per proteggerti dalla volatilità dei prezzi. Se la tua proposta prevede pagamenti significativi a terzi in valuta fiat, contatta in anticipo la `Dash Investment Foundation <https://www.dashinvests.org/>`_ per consigli su deposito a garanzia, mantenimento dei prezzi, conversione di valute e copertura contro volatilità.
ru: Вы несете ответственность за собственное планирование хеджирования от волатильности цен. Если ваше предложение предполагает значительные платежи третьим лицам в фиатной валюте, заранее обратитесь в `Dash Investment Foundation <https://www.dashinvests.org/>`_ за консультацией по вопросам эскроу, поддержания цен, конвертации валют и хеджирования от волатильности.

source: For the same reason, it is not recommended to request funding for period of longer than three months. Masternodes don't want to see and vote on the same proposal without updates several months in a row, and price volatility makes it a risky proposition both to the network and yourself.
fr: Pour la même raison, il n'est pas recommandé de solliciter un financement pour une période supérieure à trois mois. Les masternodes ne voudront pas voir et voter sur la même proposition plusieurs mois de suite s'il n'y a pas de communication suivie, et la volatilité du cours en fera une proposition risquée à la fois pour le réseau et pour vous.
it: Per lo stesso motivo, si sconsiglia di richiedere finanziamenti per periodi superiori a tre mesi. I masternode non vogliono vedere e votare la stessa proposta senza aggiornamenti per diversi mesi consecutivi e la volatilità dei prezzi rendono la situazione rischiosa sia per la rete che per te stesso.
pt: Pela mesma razão, não é recomendado solicitar financiamento por período superior a três meses. Os Masternodes não quer ver e votar na mesma proposta sem atualizações por vários meses seguidos, e a volatilidade dos preços faz dela uma proposta arriscada para a rede e para você mesmo.
ru: По этой же причине не рекомендуется запрашивать финансирование на срок более трёх месяцев. Мастерноды не хотят видеть и голосовать за одно и то же предложение без публикации новостей по нему несколько месяцев подряд, а ценовая волатильность делает его рискованным предложением как для сети, так и для вас самих.
vi: Vì lý do tương tự, không nên yêu cầu tài trợ trong thời gian dài hơn ba tháng. Masternode không muốn nhìn thấy và bỏ phiếu trên cùng một đề xuất mà không cập nhật vài tháng liên tiếp, và sự biến động giá làm cho nó trở thành một đề rủi ro cả cho mạng lưới và cho bản thân bạn.

source: Before entering your budget proposal on the blockchain, check how many proposals already exist for the current budget cycle. If it is likely to become very crowded or if some proposals are requesting a significant portion of the budget, voting is likely to be very competitive with weaker projects being forced out of the budget, even if they collect sufficient votes to pass the 10% threshold. See :ref:`here <understanding-governance>` for more details.
fr: Avant de soumettre votre proposition budgétaire à la blockchain, vérifiez le nombre de propositions déjà existantes pour le cycle budgétaire courant. S'il est vraisemblable que le budget soit très sollicité, ou si certaines propositions sollicitent une part significative du budget mensuel, le scrutin sera sans doute très concurrentiel et les projets les plus faibles seront rejetés, même s'ils réunissent assez de votes pour passer le seuil des 10%. Voir :ref:`ici <understanding-governance>` pour plus de détails.
it: Prima di inserire il budget delle tua proposta sulla blockchain, controlla quante proposte esistono già per il ciclo di budget corrente. Se è probabile che diventi molto affollato o se alcune proposte richiedono una parte significativa del budget, è probabile che la votazione sia molto competitiva con i progetti più deboli che vengono costretti a uscire dal budget, anche se raccolgono voti sufficienti per superare la soglia del 10% . Vedi: ref: `qui <understanding-governance>` per maggiori dettagli.
pt: Antes de inserir sua proposta de orçamento no blockchain, verifique quantas propostas já existem para o atual ciclo orçamentário. Se é provável que fique muito lotado ou se algumas propostas estão solicitando uma parcela significativa do orçamento, o voto provavelmente será muito competitivo, com projetos mais fracos sendo forçados a sair do orçamento, mesmo que eles colham votos suficientes para ultrapassar o limite de 10%. . Veja :ref:`aqui <understanding-governance>` para mais detalhes.
ru: Прежде чем публиковать бюджетное предложение на блокчейне, проверьте, сколько предложений для текущего бюджетного цикла уже существует на данный момент. Если бюджетный цикл окажется переполненным или если некоторые предложения потребуют значительной части бюджета, голосование, вероятно, будет проходить в атмосфере конкурентной борьбы по отношению к более слабым проектам, которые будут вытеснены из бюджета, даже если наберут достаточное количество голосов для прохождения 10-процентного порога. Для дополнительных сведений см. сслыку :ref:`здесь <understanding-governance>`.
vi: Trước khi nhập đề xuất ngân sách của bạn lên blockchain, hãy kiểm tra xem có bao nhiêu đề xuất đã đang tồn tại cho chu kỳ ngân sách hiện tại. Nếu nó có vẻ rất đông rồi hoặc có một vài đề xuất yêu cầu một phần lớn ngân sách, thì việc thắng được trở nên rất cạnh tranh và những dự án yếu hơn sẽ bị đẩy khỏi ngân sách, thậm chí nó có thu thập được đủ lượng bỏ phiếu ủng hộ vượt ngưỡng 10%. Hãy xem :ref:`ở đây <understanding-governance>` để biết thêm chi tiết.
