Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/understanding.po
Languages: ar, de, es, it, ru, vi

source: Once passed, proposals are able to report back to the network on the `Dash Forum <https://www.dash.org/forum/topic/approved-proposals- updates-news.140/>`__ or via published public channels and social media. Since it is possible to create proposals that pay out over several months, it is also possible to revoke funding from a project by changing the vote if development or spending of already allocated funds is unsatisfactory. This encourages proposal owners to work honestly and diligently to win the trust and approval of the network. Ongoing discussion and gradual improvement over time results in a close bond between the network and those working for the network in supporting roles.
it: Una volta approvate, le proposal possono essere riportate alla rete sul `Dash Forum <https://www.dash.org/forum/topic/approved-proposals- updates-news.140/>`__ o tramite canali pubblici pubblicati e social media. Poiché è possibile creare proposal che fruttano in più mesi, è anche possibile revocare il finanziamento ad un progetto modificando la votazione se lo sviluppo o la spesa dei fondi già stanziati risulta insoddisfacente. Ciò incoraggia i proprietari delle proposal a lavorare onestamente e diligentemente per conquistare la fiducia e l'approvazione della rete. Il confronto continuo e il miglioramento graduale nel tempo si traducono in uno stretto legame tra la rete e coloro che lavorano per la rete in ruoli di supporto.
ru: После подачи предложения информация об этом распростаняется в сети через `Dash Forum <https://www.dash.org/forum/topic/approved-proposals- updates-news.140/>`__ либо через публичные каналы и социальные сети. Поскольку есть возможность создавать предложения, которые оплачиваются в течение нескольких месяцев, также есть возможность и отменять финансирование проекта, изменив результат голосования, если развитие или расход уже выделенных средств неудовлетворительны. Это побуждает владельцев предложений работать честно и усердно, чтобы завоевать доверие и одобрение сети. Постоянное обсуждение и постепенное улучшение с течением времени приводит к тесной взаимосвязи между сетью и теми, кто работает в ней на вспомогательных ролях.

source: Voting on proposals is updated in real time via P2P messages and stored by Dash in cache files, so current winning proposals and the total allocation of the available budget are always open and visible to everyone. `Dash Central <https://www.dashcentral.org/budget/>`__ is a popular site used for to view progress on proposal voting.
it: La votazione delle proposal viene aggiornata in tempo reale tramite messaggi P2P e archiviata da Dash nei file di cache, quindi le attuali proposte vincitrici e l'allocazione totale del budget disponibile sono sempre aperte e visibili a tutti. `Dash Central <https://www.dashcentral.org/budget/>`__ è un sito popolare utilizzato per visualizzare i progressi nella votazione delle proposte.
ru: Голосование по предложениям обновляется в режиме реального времени посредством P2P-сообщений и сохраняется системой Dash в кеш-файлах, поэтому текущие предложения-лидеры и общее распределение имеющегося Бюджета всегда открыты и видны всем. Популярным сайтом, на котором можно отслеживать прогресс голосования по предложениям является `Dash Central <https://www.dashcentral.org/budget/>`__.

source: Monitoring budget allocation on Dash Central
it: Monitoraggio dell'allocazione del budget su Dash Central
ru: Мониторинг распределения бюджета на Dash Central

source: Finally, `Dash Watch <https://dashwatch.org>`__ (which was itself funded through a budget proposal) exists to monitor the ability of blockchain contractors to deliver on their promises with respect to delivery dates and the total amounts of budget allocated over multiple voting periods. A team of dedicated staff routinely interact with proposal owners to track progress of the various projects and provide reports to voting masternodes in a single location. While providing data on the performance of your proposal to Dash Watch is optional, many masternode owners take advantage of the data they make available to make their voting decisions. The Dash Watch team may be contacted at team@dashwatch.org email address or through their `website <https://dashwatch.org>`__.
it: Infine, `Dash Watch <https://dashwatch.org>`__ (a sua volta finanziato tramite una proposta di budget) esiste per monitorare la capacità degli appaltatori blockchain di mantenere le loro promesse rispetto alle date di consegna e agli importi totali del budget ripartiti su più periodi di votazione. Un team di personale dedicato interagisce regolarmente con i proprietari delle proposal per monitorare i progressi dei vari progetti e fornire report ai masternode votanti in un'unica posizione. Sebbene fornire dati sulla performance della tua proposal a Dash Watch sia facoltativo, molti proprietari di masternode sfruttano i dati che mettono a disposizione per prendere le loro decisioni di voto. Il team di Dash Watch può essere contattato all'indirizzo email team@dashwatch.org o tramite il loro `sito web <https://dashwatch.org>`__.
ru: Наконец, для мониторинга способности блокчейн-подрядчиков выполнять свои обещания в отношении сроков поставки и общей суммы бюджета, выделенной на несколько периодов голосования, существует программа `Dash Watch <https://dashwatch.org>`__ (которая сама финансировалась за счет бюджетного предложения). Команда специальных сотрудников регулярно взаимодействует с владельцами предложений, отслеживая ход выполнения различных проектов и предоставляя отчеты голосующим мастернодам в едином месте. Хотя предоставление данных о результатах работы вашего предложения в Dash Watch не является обязательным, многие владельцы мастернод используют полученные данные для принятия решений о голосовании. С командой Dash Watch можно связаться по адресу электронной почты team@dashwatch.org или через их веб-сайт <https://dashwatch.org>`__.

source: Proposal monitoring on Dash Watch
ar: مراقبة الاقتراح على مشاهدة داش
de: Proposal-Beobachtung durch Dash Watch
es: Monitoreo de propuestas en Dash Watch
it: Monitoraggio delle proposte su Dash Watch
ru: Мониторинг предложений на Dash Watch
vi: Theo dõi Đề xuất trên Dash Watch

source: Budget allocation
ar: تخصيص الميزانية
de: Budget-Verteilung
es: Asignación de presupuesto
it: Assegnazione di budget
ru: Распределение бюджета
vi: Cấp phát ngân sách

source: The total budget of the network can be calculated by taking 20% of the block subsidy over the period of time between two superblocks, which occur every 16616 blocks or approximately 30.29 days. A voting cutoff occurs 1662 blocks before the superblock, and the final votes are tallied at this point. A proposal must satisfy the condition ``(YES votes - NO votes) > (Total Number of Masternodes / 10)`` in order to be considered passing. Then, in the superblock, the winning proposals are awarded in the order of the margin by which they are passing until either the entire budget is allocated or no more passing proposals exist. This allows for completely trustless and decentralized allocation of the budget.
it: Il budget totale della rete può essere calcolato prendendo il 20% del sussidio del blocco per il periodo di tempo tra due superblocchi, che si verificano ogni 16616 blocchi o circa 30,29 giorni. Un limite di votazione avviene 1662 blocchi prima del superblocco e i voti finali vengono conteggiati a questo punto. Una proposta deve soddisfare la condizione ``(voti SI - voti NO) > (Numero totale di Masternode / 10)`` per essere considerata superata. Quindi, nel superblocco, le proposte vincitrici vengono assegnate in base al margine con cui passano finché non viene assegnato l'intero budget o non esistono più proposte passanti. Ciò consente un’allocazione del budget completamente senza fiducia e decentralizzata.
ru: Общий бюджет сети можно рассчитать, взяв 20% вознаграждения за период времени между двумя суперблоками, которые генерируются каждые 16616 блоков или приблизительно каждые 30,29 дней. Голосование прекращается за 1662 блока перед суперблоком, и в этот момент подсчитываются окончательные голоса. Предложение должно удовлетворять условию ``(Голоса ЗА - Голоса Против) > (Общее количество мастернод / 10)``, тогда оно считается прошедшим голосование. Затем, в суперблоке лидирующим предложениям в порядке величины разницы присуждается финансирование, оно присуждается такому количеству предложений, на которое хватает суммы общего выделенного бюджета или, если хватает, то всем предложениям, прошедшим голосование. Это создаёт полностью доверительный и децентрализованный характер выделения бюджета.

source: If a proposal has passed the voting threshold but insufficient funds remain to pay the full amount requested, it will not receive partial funding. Instead, any smaller proposals which have also passed the threshold that will fit in the budget will be funded, even if they have lower net approval than the larger proposal. Proposals requesting payment over multiple budget periods will remain in the treasury system for the duration of their validity, even if they do not pass the voting threshold, and even if insufficient budget is available for funding as described above. Any unallocated budget is simply never created in the superblock, reducing unnecessary inflation.
ar: إذا اجتاز الاقتراح حد التصويت ولكن لا تزال هناك أموال غير كافية لدفع كامل المبلغ المطلوب ، فلن يحصل على تمويل جزئي. وبدلاً من ذلك ، سيتم تمويل أي مقترحات أصغر حجمًا تجاوزت الحد الأقصى الذي سيتم تطبيقه في الميزانية ، حتى لو كانت الموافقة الصافية أقل من المقترحات الأكبر. ستظل المقترحات التي تطلب الدفع على فترات ميزانية متعددة في نظام الخزانة طوال مدة صلاحيتها ، حتى لو لم تتجاوز الحد الأدنى للتصويت ، وحتى إذا كانت الميزانية غير كافية متاحة للتمويل كما هو موضح أعلاه. ببساطة لا يتم إنشاء أي ميزانية غير مخصصة في superblock ، مما يقلل من التضخم غير الضروري.
de: Wenn ein Proposal die nötigen Stimmen erhalten hat, aber nicht mehr genug Finanzierungsmittel im Budget enthalten sind, dann findet keine teilweise Auszahlung statt. Stattdessen wird, sofern vorhanden, ein kleineres Proposal ausbezahlt, welches ebenfalls die nötigen Stimmen, aber in diesem Fall weniger als das andere, erhalten hat. Ein Proposal, welches mehrere Zahlungen beantragt hat, wird weiterhin im Budget angezeigt werden, selbst wenn es nicht die notwendige Anzahl an Stimmen erhalten hat oder, wie oben beschrieben, nicht genügend Finanzierungsmittel vorhanden waren. Teile des Budgets, die nicht zur Auszahlung bestimmt wurden, werden nicht im Superblock enthalten sein, wodurch sie niemals erschaffen und damit auch nicht als Inflation angesehen werden.
es: Si una propuesta pasa el umbral de votación pero quedan fondos insuficientes para pagar la cantidad total requerida, no recibirá financiamiento parcial. En lugar de esto, se financiarán las propuestas más pequeñas que también hayan pasado el umbral que se ajusten en el presupuesto, incluso si tienen menos aprobación de la red que la propuesta grande. Las propuestas que soliciten el pago durante múltiples períodos de presupuesto permanecerán en el sistema de tesorería durante su período de validez, incluso si no pasan el umbral de votación, e incluso si no hay suficiente presupuesto disponible para la financiación como se describe anteriormente. Cualquier presupuesto sin asignar simplemente nunca se creara en el superbloque, reduciendo la inflación innecesaria.
it: Se una proposal ha superato la soglia di voto ma rimangono fondi insufficienti per pagare l'intero importo richiesto, non riceverà un finanziamento parziale. Verranno invece finanziate tutte le proposal più piccole che avranno superato la soglia che rientrerà nel budget, anche se avranno un consenso netto inferiore rispetto alla proposal più grande. Le proposal che richiedono il pagamento su più periodi di bilancio rimarranno nel sistema di tesoreria per tutta la durata della loro validità, anche se non superano la soglia di voto, e anche se il budget disponibile per il finanziamento come sopra descritto non è sufficiente. Qualsiasi budget non assegnato semplicemente non viene mai creato nel superblocco, riducendo così un’inflazione non necessaria.
ru: Если предложение прошло порог голосования, но для оплаты всей запрашиваемой суммы нет достаточного количества средств, частичного финансирования оно не получит. Вместо этого любые более мелкие предложения, которые также прошли порог и вписались в существующий бюджет, будут финансироваться, даже если они имеют меньшее количество голосов "за", чем более крупное предложение. Предложения, запрашивающие оплату на несколько бюджетных периодов, будут оставаться в системе Бюджета в течение срока их действия, даже если они не прошли порог голосования и даже если для их финансирования недостаточно средств, как описано выше. Любой нераспределённый бюджет просто никогда не будет создан в суперблоке, что снижает ненужную инфляцию.
vi: Nếu một đề xuất vượt qua được yêu cầu về số lượng phiếu ủng hộ nhưng không đủ lượng ngân sách còn lại cho yêu cầu đề xuất, nó sẽ không nhận được một phần ngân sách mà đã đề xuất. Thay vào đó, bất kỳ những đề xuất nhỏ hơn mà cũng vượt qua ngưỡng bỏ phiếu mà phù hợp với lượng ngân sách còn lại sẽ được cấp vốn, thậm chí chúng được lượng phiếu ủng hộ ít hơn. Những đề xuất yêu cầu việc cấp vốn theo nhiều giai đoạn của các kỳ thanh toán vẫn sẽ tiếp tục tồn tại trên hệ thống ngân sách trong khoảng thời gian mà nó còn hiệu lực thậm chí nó chưa vượt qua ngưỡng ủng hộ đủ để được cấp vốn, và thậm chí khi ngân sách không còn đủ để cấp vốn như đã được mô tả ở trên. Bất kỳ một nguồn ngân sách còn dư khi không có đủ đề suất sẽ không được tạo ra trong các siêu khối để giảm bớt sự lạm phát không cần thiết.

source: Due to the decentralized nature of the masternode system, it is sometimes necessary to form funded organisations, such as committees or companies, to be responsible for some project or task. These are submitted in the same way, but the committee itself receives the funds. Another alternative is to place trusted escrow services between the budget allocation event and the actual submitter of the proposal to ensure that work is paid for in stages, as it is delivered. Some oversight over blockchain contractors is sometimes needed. Each budgeted item requires either a team manager or a committee responsible for implementation of the work. Periodically, this manager is expected to report on budget expenditure and completed work to show the value created from the allocated funds. This allows repeat proposal submitters to build up a reputation and gain trust from the community. Proposals which do not provide regular reports and cannot answer questions about their budget allocation will soon be defunded if it is part of a regular monthly proposal cycle. The result is a kind of self-policing system.
ar: بسبب الطبيعة اللامركزية لنظام ماسترنود ، من الضروري في بعض الأحيان تشكيل منظمات ممولة ، مثل اللجان أو الشركات ، لتكون مسؤولة عن بعض المشاريع أو المهام. يتم تقديمها بنفس الطريقة ، ولكن اللجنة نفسها تتلقى الأموال. وهناك بديل آخر هو وضع خدمات الضمان الموثوقة بين حدث تخصيص الميزانية والمقدم الفعلي للاقتراح لضمان دفع ثمن العمل على مراحل ، كما يتم تسليمه. في بعض الأحيان هناك حاجة إلى بعض الرقابة على المقاولين بلوكشين. يتطلب كل بند من بنود الميزانية إما مدير فريق أو لجنة مسؤولة عن تنفيذ العمل. وبشكل دوري ، من المتوقع أن يقدم هذا المدير تقارير عن نفقات الميزانية والعمل المنجز لإظهار القيمة التي تم إنشاؤها من الأموال المخصصة. يسمح هذا لمقدمي اقتراح التكرار ببناء سمعة واكتساب ثقة من المجتمع. سيتم قريبا إلغاء المقترحات التي لا تقدم تقارير منتظمة ولا يمكنها الإجابة عن الأسئلة المتعلقة بتخصيص ميزانيتها إذا كانت جزءًا من دورة عروض شهرية منتظمة. والنتيجة هي نوع من نظام ضبط النفس
de: Aufgrund der dezentralisierten Natur des Masternode-Systems ist es manchmal notwendig Organisationen zu finanzieren, wie etwa Komitees oder Unternehmen, die die Verantwortung für ein Projekt oder eine Aufgabe übernehmen. Diese Organisationen gehen dabei genauso vor, wie Individuen, erhalten die Finanzierung jedoch als Organisation. Eine andere Alternative ist es, vertrauenswürdige Treuhänder anzustellen, welche als Mittelsmänner zwischen dem Budget und dem Projekt stehen, damit sichergestellt wird, dass eine Auszahlung nur stattfindet, wenn bestimmte Meilensteine erreicht wurden. Ein gewisses Maß an Kontrolle ist in bestimmten Situationen notwendig. Jedes Projekt muss entweder von einem Team-Manager oder einem Komitee verwaltet werden, welches die Verantwortung für das Projekt übernimmt. Dieser Manager muss in regelmäßigen Abständen über den Erfolg und die Ausgaben des Projektes Rechenschaft ablegen. Hierdurch können wiederholte Proposal-Ersteller einen Ruf in der Community aufbauen und deren Vertrauen gewinnen. Ein Proposal, welches keine regelmäßigen Updates liefert und keine Antworten auf Fragen gibt, werden in der Regel nicht mehr weiter durch den nächsten Budget-Zyklus finanziert. Das Resultat ist hierbei ein selbst-regulierendes System.
es: Debido a la naturaleza descentralizada del sistema de masternodes, a veces es necesario formar organizaciones financiadas, como comités o empresas, para que sean responsables de algún proyecto o tarea. Estos se envían de la misma manera, pero el comité en sí recibe los fondos. Otra alternativa es colocar servicios confiables de custodia entre el evento de asignación de presupuesto y el remitente real de la propuesta para garantizar que el trabajo se pague por etapas, a medida que se entregue. A veces se necesita cierta supervisión sobre los contratistas de la cadena de bloques. Cada elemento presupuestado requiere un gerente de equipo o un comité responsable de la implementación del trabajo. Periódicamente, se espera que este gerente informe sobre el gasto del presupuesto y el trabajo completado para mostrar el valor creado a partir de los fondos asignados. Esto permite que los remitentes de propuestas repetidas creen una reputación y ganen confianza en la comunidad. Las propuestas que no brindan informes regulares y no pueden responder preguntas sobre su asignación presupuestaria pronto se desfinanciarán si forman parte de un ciclo mensual regular de propuestas. El resultado es una especie de sistema de autocontrol.
it: A causa della natura decentralizzata del sistema masternode, a volte è necessario formare organizzazioni finanziate, come comitati o aziende, che siano responsabili di alcuni progetti o compiti. Questi vengono presentati allo stesso modo, ma il comitato stesso riceve i fondi. Un’altra alternativa è quella di collocare servizi di deposito fiduciario tra l’evento di allocazione del budget e l’effettivo presentatore della proposal per garantire che il lavoro venga pagato in più fasi, man mano che viene consegnato. A volte è necessaria una certa supervisione sugli appaltatori blockchain. Ciascuna voce di bilancio richiede un team manager o un comitato responsabile dell'attuazione del lavoro. Periodicamente, questo manager dovrebbe riferire sulle spese di bilancio e sul lavoro completato per mostrare il valore creato dai fondi stanziati. Ciò consente a chi presenta ripetutamente proposal di costruirsi una reputazione e ottenere la fiducia della comunità. Le proposal che non forniscono rapporti regolari e non possono rispondere a domande sulla loro allocazione del budget verranno presto definanziate se fanno parte di un normale ciclo di proposal mensili. Il risultato è una sorta di sistema di autocontrollo.
ru: Из-за децентрализованного характера системы мастернод иногда необходимо создавать финансируемые организации, такие как комитеты или компании, которые были бы ответственны за выполнение какого-либо проекта или задачи. Предложения в таком случае подаются таким же образом, но средства будет получать сам комитет. Другой альтернативой является размещение доверенных услуг условного депонирования между событием распределения бюджета и фактическим автором предложения для гарантии, что работа будет оплачиваться поэтапно, по мере демонстрации результатов. Некоторый надзор над исполнителями блокчейна иногда необходим. Для каждого элемента, предусмотренного в бюджете, требуется либо менеджер команды, либо комитет, ответственный за выполнение работы. Ожидается, что периодически такой менеджер будет сообщать о расходах бюджета и завершённой работе, которая бы показала стоимость, созданную из выделенных средств. Это позволяет представителям, ранее уже размещавшим предложения создавать репутацию и зарабатывать доверие со стороны сообщества. Предложения, авторы которых не предоставляют регулярных отчётов и не отвечают на вопросы о расходах бюджетного финансирования, в скором времени удаляются, если они являются частью регулярного ежемесячного цикла предложений. В результате получаем своего рода систему самоконтроля.
vi: Do tính chất phi tập trung của hệ thống masternode, đôi khi cần thiết để hình thành các tổ chức được tài trợ, chẳng hạn như ủy ban hoặc công ty, để có trách nhiệm đối với một số dự án hoặc nhiệm vụ. Chúng được đệ trình theo cách tương tự, nhưng bản thân ủy ban đó sẽ nhận được tiền. Một lựa chọn khác là sử dụng các dịch vụ ủy thác đáng tin cậy ở giữa sự kiện cấp phát ngân sách và người thực tế gửi đề xuất để đảm bảo rằng công việc được thanh toán theo các giai đoạn, mỗi khi nó được hoàn thành. Một số giám sát trên các nhà thầu blockchain đôi khi là cần thiết. Mỗi mục ngân sách yêu cầu một người quản lý nhóm hoặc một ủy ban chịu trách nhiệm triển khai công việc. Định kỳ, người quản lý này dự kiến ​​sẽ báo cáo về chi tiêu ngân sách và tiến độ hoàn thành công việc để thể hiện giá trị được tạo ra từ nguồn ngân sách được cấp phát. Điều này giúp những người đề xuất nhiều lần xây dựng danh tiếng và giành được lòng tin trong cộng đồng. Các đề xuất không cung cấp các báo cáo thường xuyên và không thể trả lời các câu hỏi về việc phân bổ ngân sách sẽ sớm bị ngừng cấp vốn nếu nó là một phần của một đề xuất có chu kỳ giải ngân hàng tháng. Kết quả đây là một loại hệ thống tự lập chính sách.

source: Scaling and future uses
ar: التحجيم والاستخدامات المستقبلية
de: Skalierung und zukünftige Nutzungsmöglichkeiten
es: Escalamiento y usos futuros
it: Scalabilità e usi futuri
ru: Масштабирование сети и её использование в будущем
vi: Khả năng mở rộng và việc sử dụng trong tương lai
