Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/understanding.po
Languages: ar, de, es, it, ru, vi

source: This is a 100% decentralized system powered by the masternodes, where budgets are set and paid directly from the blockchain. The blockchain hires core developers in this way and introduces a new concept of paid blockchain contractors, where people work for and are directly compensated by the network, through the decentralized votes of all masternode operators. One advantage of this model is it can survive early adopters. If early masternode operators sell their coins, the new owner can set up a masternode and with it acquire the right to vote on the budgets and projects. This guarantees there is a working system of maintenance as people come and go, making the network capable of sustaining itself on its own without depending on specific actors.
ar: هذا هو نظام لامركزي 100 ٪ مدعوم من ماسترنود ، حيث يتم تعيين الميزانيات ودفعها مباشرة من بلوكشين. يستغل بلوكشين المطورين الأساسيين بهذه الطريقة ويقدم مفهومًا جديدًا لمقاولي بلوكشين المدفوعين ، حيث يعمل الناس من أجلهم ويتم تعويضهم مباشرة من خلال الشبكة ، من خلال الأصوات اللامركزية لجميع مشغلي ماسترنود. ميزة واحدة من هذا النموذج هو أنه يمكن البقاء على قيد الحياة الأوائل. إذا كان مشغلي ماسترنود في وقت مبكر يبيعون عملاتهم ، يمكن للمالك الجديد إنشاء رمز رئيسي ومع حصوله على حق التصويت على الميزانيات والمشاريع. وهذا يضمن وجود نظام عمل للصيانة أثناء تواجد الناس ويذهبون ، مما يجعل الشبكة قادرة على الحفاظ على نفسها بمفردها دون الاعتماد على جهات محددة.
de: Hierbei handelt es sich um ein zu 100% dezentralisiertes System, das von den Masternodes gesteuert wird und in dem die Budgets aufgestellt und direkt über die Blockchain ausbezahlt werden. Die Blockchain stellt auf diese Weise die Core-Entwickler an und bringt damit ein neuartiges Modell bezahlter Blockchain-Mitarbeiter hervor, bei dem Menschen für das Netzwerk arbeiten und durch die Stimmen aller Masternode-Betreiber direkt und dezentral vom Netzwerk vergütet werden. Ein weiterer Pluspunkt ist die Tatsache, dass dieses System auch den Interessensverlust der Early Adopters überleben kann. Verkaufen die frühen Masternode-Betreiber ihre Coins, kann der neue Eigentümer eine Masternode einrichten und sich damit das Recht verschaffen, an der Abstimmung teilzunehmen. Dadurch wird gewährleistet, dass ein funktionierendes Wartungssystem existiert, auch wenn die individuellen Menschen kommen und gehen, wodurch das Netzwerk im Stande ist, sich selbst zu erhalten, ohne von außenstehenden Interessensgruppen abhängig zu sein.
es: Este es un sistema 100% descentralizado impulsado por los masternodes, donde los presupuestos se establecen y se pagan directamente desde la cadena de bloques. La cadena de bloques contrata a los desarrolladores centrales de esta manera e introduce un nuevo concepto de contratistas pagados por cadena de bloques, donde las personas trabajan y son compensadas directamente por la red, a través de los votos descentralizados de todos los operadores de masternodes. Una ventaja de este modelo es que puede sobrevivir a los primeros usuarios. Si los primeros operadores de masternodes venden sus monedas, el nuevo propietario puede configurar un masternode y con ello adquirir el derecho de votar sobre los presupuestos y proyectos. Esto garantiza que hay un sistema de mantenimiento que funciona a medida que las personas van y vienen, haciendo que la red sea capaz de mantenerse por sí misma sin depender de actores específicos.
it: Questo è un sistema, gestito masternodes, decentralizzato al 100% , dove i budget sono impostati e pagati direttamente dalla blockchain. La blockchain assume in questo modo gli sviluppatori core e introduce un nuovo concetto di appaltatori blockchain a pagamento, in cui le persone lavorano e sono direttamente retribuite dalla rete, attraverso i voti degli operatori dei masternode. Un vantaggio di questo modello è che può sopravvivere agli early adopter. Se i primi operatori di masternode vendono le loro monete, il nuovo proprietario può creare un masternode e con esso acquisire il diritto di vota sui budget e sui progetti. Ciò garantisce che vi sia un sistema preservazione man mano che le persone vanno e vengono, rendendo la rete capace di sostenersi autonomamente senza dipendere da attori specifici.
ru: Это 100%-ная децентрализованная система, работающая на мастернодах, где бюджеты устанавливаются и выплачиваются непосредственно из блокчейна. Таким образом блокчейн нанимает основных разработчиков и вводит новую концепцию оплачиваемых исполнителей блокчейна, в которой люди, выполняя работу, получают за это прямую компенсацию от сети за счёт децентрализованных голосов всех операторов мастернод. Одним из преимуществ этой модели является то, что она может пережить ранних последователей. Если операторы ранних мастернод продадут свои монеты, новый владелец может запустить мастерноду, и благодаря этому получить право голоса по бюджетам и проектам. Это гарантирует рабочую систему обслуживания и несмотря на то, что люди приходят и уходят, сеть сохраняет способность поддерживать себя самостоятельно, не попадая в зависимость от конкретных участников.
vi: Đây là một hệ thống phi tập trung 100% nhờ các masternode, nơi ngân sách được thiết lập và chi trả trực tiếp từ blockchain. Blockchain thuê đội ngũ lập trình viên cốt lõi cũng theo cách này và đưa ra một khái niệm mới về việc blockchain chi trả cho các nhà thầu, nơi những người làm việc cho và được chi trả thù lao trực tiếp bởi mạng lưới, thông qua việc bỏ phiếu phi tập trung của những người vận hành masternode. Nếu những người vận hành masternode ban đầu bán đi các coin của họ, thì những người chủ mới có thể sẽ thiết lập một masternode khác và cũng có được quyền bỏ phiếu với ngân sách và các dự án. Điều này đảm bảo cho hệ thống vận hành và duy trì dù cho có những người đến và đi, nó làm cho mạng lưới khả năng tự duy trì chính mình mà không phải phụ thuộc vào các nhân tố cụ thể nào.

source: Budgets and masternode voting
ar: الميزانيات والتصويت ماسترنود
de: Budget- und Masternode-Abstimmungen
es: Presupuestos y votación de masternodes
it: Budget e votazione dei masternode
ru: Бюджеты и голосование Мастернод
vi: Ngân sách và việc bỏ phiếu của Masternode

source: The system works as a decentralized voting mechanism set up in the rules governing the blockchain, where budgets for specific projects are proposed, then the masternodes as a whole vote on them. Each project, if it passes, is added to the total budget and paid directly from the blockchain to the person doing the work. This allows Dash to hire core developers and pay them directly after approval of the work in a decentralized fashion.
ar: يعمل النظام كآلية تصويت لا مركزية منصوص عليها في القواعد التي تحكم عمل بلوكشين ، حيث يتم اقتراح ميزانيات لمشاريع محددة ، ثم يتم التصويت عليها بالكامل. يتم إضافة كل مشروع ، إذا تم تمريره ، إلى الميزانية الإجمالية ويتم دفعه مباشرة من بلوكشين إلى الشخص الذي يقوم بهذا العمل. وهذا يسمح لشركة داش بتعيين مطورين أساسيين ودفعهم مباشرة بعد الموافقة على العمل بطريقة لامركزية.
de: Das System funktioniert als dezentraler Abstimmungsmechanismus, dessen Regeln das Verhalten der Blockchain bestimmen und der das Budget für bestimmte Projekte zuteilt, über die die Masternode zuvor abstimmen konnten. Jedes Projekt, dem zugestimmt wurde, wird an das Gesamtbudget angehangen und von der Blockchain aus an die Person ausbezahlt, die das Projekt eingebracht hat. Hierdurch kann Dash seine Kernentwickler anstellen und direkt bezahlen, nachdem ihre Arbeit dezentral abgesegnet wurde.
es: El sistema funciona como un mecanismo de votación descentralizado establecido en las reglas que rigen la cadena de bloques, donde se proponen presupuestos para proyectos específicos, luego los masternodes como un todo votan sobre ellos. Cada proyecto, si pasa, se agrega al presupuesto total y se paga directamente desde la cadena de bloques a la persona que hace el trabajo. Esto permite a Dash contratar desarrolladores centrales y pagarles directamente después de la aprobación del trabajo de forma descentralizada.
it: Il sistema funziona come meccanismo di voto decentralizzato integrato nelle regole che governano la blockchain, dove vengono proposti i budget per progetti specifici, quindi i masternodes nel loro complesso votano su di essi. Ogni progetto, se passa, viene aggiunto al budget totale e pagato direttamente dalla blockchain alla persona che fa il lavoro. Ciò consente a Dash di assumere gli sviluppatori core e di pagarli direttamente dopo l'approvazione in modo decentralizzato del lavoro proposto .
ru: Система работает как децентрализованный механизм голосования, созданный по правилам, регулируемым блокчейном, где предлагаются бюджеты для конкретных проектов, а затем мастерноды по ним голосуют. Каждый проект, прошедший этап голосования, добавляется к общему бюджету и выплачивается непосредственно из блокчейна человеку, выполняющему работу. Это позволяет Dash нанимать основных разработчиков и оплачивать их работу непосредственно после одобрения их проектов децентрализованным способом.
vi: Hệ thống hoạt động như một cơ chế bỏ phiếu phi tập trung đã thiết lập nên những chuẩn mực cho quản trị blockchain, nơi mà các ngân sách cho những dự and được đề xuất lên và rồi các masternode sẽ bỏ phiếu cho nó. Mỗi dự án, nếu được phê duyệt sẽ được đưa vào trong ngân sách và sau đó sẽ được chi trả trực tiếp từ blockchain đến những người làm việc cho dự án. Điều này cho phép Dash có thể thuê đội ngũ những lập trình viên nòng cốt và chi trả trực tiếp cho họ sau khi công việc được phê duyệt theo một cách thức phi tập trung.

source: A masternode votes on a proposal (technically a governance object on the blockchain) using the example command “masternode vote yes”, “masternode vote no” or “masternode vote abstain”. The votes then propagate across the network, and are tallied according to instructions followed by the network itself. Budgets under discussion and voting progress can be viewed using the example command “masternode budget show”.
ar: صوت ماسترنود على اقتراح (من الناحية الفنية كائن حكم على بلوكشين) باستخدام مثال أمر "التصويت نعم ماسترنود" أو "ماسترنود التصويت لا" أو "التصويت ماسترنود الامتناع عن التصويت". ثم تنتشر الأصوات عبر الشبكة ، ويتم حسابها وفقًا للتعليمات التي تتبعها الشبكة نفسها. يمكن الاطلاع على الميزانيات قيد المناقشة وتقدم التصويت باستخدام مثال أمر "عرض ميزانية ماسترنود".
de: Eine Masternode stimmt über ein Proposal (technisch gesprochen handelt es sich hierbei um ein Governance-Objekt auf der Blockchain) ab, indem es die Befehle “masternode vote yes”, “masternode vote no” und “masternode vote abstain” verwendet. Die Stimmen werden im Netzwerk bekannt gegeben und nach den Regeln des Netzwerks gesammelt. Das Budget, welches diskutiert und zugeteilt wird, kann über den Befehl “masternode budget show” eingesehen werden.
es: Un masternode vota sobre una propuesta (técnicamente un objeto de gobierno en la cadena de bloques) usando el comando de ejemplo "masternode vota si", "masternode vota no" o "masternode vote abstenerse". Luego, los votos se propagan a través de la red y se contabilizan según las instrucciones seguidas por la red en sí. Los presupuestos en discusión y el progreso de votación se pueden ver usando el comando de ejemplo "show de presupuesto de masternode".
it: Un masternode vota su una proposta (tecnicamente un oggetto di governance sulla blockchain) usando il comando "masternode vote yes", "masternode vote no" o "masternode vote abstain". I voti si propagano attraverso la rete, e vengono conteggiati secondo le istruzioni seguite dalla rete stessa. I budget in discussione e l'avanzamento del voto possono essere visualizzati utilizzando il comando "masternode budget show".
ru: Мастерноды голосуют за предложение (технически это объект управления на блокчейне), используя такие команды как “masternode vote yes”, “masternode vote no” или “masternode vote abstain”, то есть "за", "против", "воздерживаюсь". Результаты голосования выкладываются в сети и подсчитываются в соответствии с инструкциями, которым следует сама сеть. Обсуждаемые бюджеты и ход голосования можно просмотреть, используя, например, команду “masternode budget show”.
vi: Một masternode sẽ bỏ phiếu cho một đề xuất (về mặt kỹ thuật đó là một đối tượng quản trị trên blockchain) sẽ sử dụng một lệnh ví dụ như "masternode vote yes", “masternode vote no” hay “masternode vote abstain”. Sau đó việc bỏ phiếu đó sẽ lan truyền trên toàn mạng, và sau đó sẽ được kiểm phiếu theo thuật toán và mạng lưới sẽ kiểm soát. Chúng ta có thể xem lại đề xuất về ngân sách cũng như tiến trình bỏ phiếu bằng câu lệnh đại loại như "masternode budget show”.

source: A well defined decentralized system of governance allows a cryptocurrency network to endure and survive its original creators. In this way, later generations of masternode operators have a clear way to support the system as defined by the protocol itself, applying wisdom of the crowd techniques and the bond of trust established by the masternode collateral to create a decentralized management system. This creates incredible value within the currency, allowing us to be more agile and compete with other payment systems, such as Bitcoin and credit cards, on a global scale.
ar: يسمح نظام الحوكمة اللامركزي المحدد بشكل جيد لشبكة العملات الرقمية بأن تتحمل وتحافظ على منشئيها الأصليين. بهذه الطريقة ، لدى الأجيال اللاحقة من مشغلي ماسترنود طريقة واضحة لدعم النظام كما هو محدد في البروتوكول نفسه ، وتطبيق الحكمة من تقنيات الحشد وروابط الثقة التي وضعتها ضمانات ماسترنود لإنشاء نظام إدارة لامركزي. وهذا يخلق قيمة لا تصدق داخل العملة ، مما يتيح لنا أن نكون أكثر مرونة وننافس أنظمة الدفع الأخرى ، مثل بيتكوين وبطاقات الائتمان ، على نطاق عالمي.
de: Ein explizit definiertes dezentralisiertes System der Entscheidungsfindung erlaubt es einem Kryptowährungs-Netzwerk die Generation der eigenen Schöpfer zu überdauern und zu überleben. Spätere Generationen an Masternode-Betreibern können das System auf eine Weise unterstützen, die vom Protokoll vorgegeben wurde, wobei ihre Mehrheitsentscheidungen aufgrund ihrer Masternode-Sicherheitszahlungen (Collateral) ein vertrauenswürdiges dezentralisiertes Verwaltungssystem konstituieren. Dies ist von besonderer Bedeutung für eine Währung, da sie schneller agieren und somit besser und globaler mit anderen Zahlungsmethoden, wie etwa Bitcoin und Kreditkarten, konkurrieren kann.
es: Un sistema de gobierno descentralizado bien definido permite que una red de criptomonedas perdure y sobreviva a sus creadores originales. De esta forma, las generaciones posteriores de operadores de masternodes tienen una manera clara de soportar el sistema tal como lo define el protocolo, aplicando la sabiduría de las técnicas de agrupación y el vínculo de confianza establecido por la garantía de los masternodes para crear un sistema de gestión descentralizado. Esto crea un valor increíble dentro de la moneda, lo que nos permite ser más ágiles y competir con otros sistemas de pago, como Bitcoin y tarjetas de crédito, a escala global.
it: Un sistema decentralizzato di governance ben definito consente a una rete di criptovaluta di sopravvivere ai suoi creatori originali. In questo modo, le generazioni successive di operatori masternode hanno un modo chiaro per supportare il sistema come definito dal protocollo stesso, applicando la saggezza delle tecniche di crowd e il vincolo di fiducia stabilito dal collaterale dei masternode per creare un sistema di gestione decentralizzato. Questo crea un incredibile valore all'interno della valuta, permettendoci di essere più agili e di competere con altri sistemi di pagamento, come Bitcoin o carte di credito, su scala globale.
ru: Чётко определённая децентрализованная система управления позволяет криптовалютной сети быть выносливой и пережить своих изначальных создателей. Таким образом, у более поздних поколений операторов мастернод есть конкретный способ поддержки системы, как это и определено в протоколе, с помощью применения методов мудрости толпы и доверительных связей, устанавливаемых залогом мастерноды для создания децентрализованной системы управления. Это создаёт невероятную ценность внутри валюты, что позволяет ей быть более гибкой и конкурировать с другими платёжными системами, такими как Биткойн и кредитные карты в глобальном масштабе.
vi: Một hệ thống quản trị phi tập trung được xác định rõ ràng cho phép một loại tiền số có thể tồn tại cùng với những người sáng tạo ban đầu của nó. Theo cách này, những thế hệ chủ masternode về sau có một đường lối rõ ràng để hỗ trợ hệ thống cũng giống như đã được xác định trước bởi chính giao thức của nó, áp dụng kỹ thuật trí tuệ đám đông và những ràng buộc về niềm tin được thiết lập thông qua khoản đặt cọc cho masternode để tạo nên một hệ thống quản trị phi tập trung. Điều này tạo nên những giá trị phi thường bên trong nội tại của đồng tiền, nó cho phép chúng ta trở nên linh hoạt hơn và cạch tranh hơn với những hệ thống thanh toán hiện có, như Bitcoin và các loại thẻ tín dụng, trên quy mô toàn cầu.

source: As the system has developed, a strong team of productive contractors paid from blockchain rewards has arisen and become established. This includes the core development team, escrow providers, news and reporting staff, experimental development labs, partnerships with universities, hiring of marketing and PR firms and integrations with third party exchanges and payment platforms. The market recognizes the value of the stability of the network as a whole, and that the possibility of reliable and sufficient funding results in faster and more coherent implementation of the Dash roadmap and core Dash services.
ar: مع تطور النظام ، نشأ فريق قوي من المقاولين المنتجين الذين يدفعون من المكافآت المجمعة ويصبحون راسخين. ويشمل ذلك فريق التطوير الأساسي ، ومقدمي الضمان ، وموظفي الأخبار والإبلاغ ، ومختبرات التطوير التجريبية ، والشراكات مع الجامعات ، واستئجار شركات التسويق والعلاقات العامة ، والتكامل مع برامج التبادل ومنصات الدفع لجهات خارجية. يدرك السوق قيمة استقرار الشبكة ككل ، وأن إمكانية الحصول على تمويل موثوق وكافٍ تؤدي إلى تنفيذ أسرع وأكثر تماسكًا لخارطة طريق داش و داش الأساسية.
de: Während sich das System weiterentwickelt hat, stieg die Zahl der produktiven Vertragsnehmer, die direkt aus den Rewards der Blockchain bezahlt wurden. Diese Gruppe beinhaltet Core-Entwickler, Treuhandverwalter, Journalisten, experimentelle Entwicklungslabore, Partner-Universitäten, Marketing- und PR-Firmen und Integrationspartner an den Börsen und Zahlungsplattformen. Der Markt erkennt somit die Stabilität des Netzwerks als Ganzem und die Möglichkeiten, welche zuverlässige und problemlose Zahlungen mit sich bringen, da diese schnellere und kohärente Implementierungen der Dash-Roadmap und der Dash-Kernleistungen möglich machen.
es: A medida que el sistema fue desarrolló, surgió y se estableció un sólido equipo de contratistas productivos pagados con recompensas de la cadena de bloques. Esto incluye el equipo de desarrollo central, proveedores de fideicomiso, personal de noticias e informes, laboratorios de desarrollo experimental, asociaciones con universidades, contratación de firmas de marketing y relaciones públicas e integraciones con casa de cambio de terceros y plataformas de pago. El mercado reconoce el valor de la estabilidad de la red como un todo, y que la posibilidad de una financiación confiable y suficiente da como resultado una implementación más rápida y más coherente del plan de trabajo de Dash y los servicios centrales de Dash.
it: Con lo sviluppo del sistema, è sorto e si è affermata una forte squadra di contractor pagati con i rewards della blockchain. Ciò include il team di sviluppo principale, i fornitori di servizi di deposito a garanzia, lo staff per le news e il reporting, i laboratori di sviluppo sperimentale, le partnership con università, l'assunzione di aziende di marketing e PR e integrazioni con piattaforme di pagamento e piattaforme di terzi. Il mercato riconosce il valore della stabilità della rete nel suo insieme e la possibilità di finanziamenti affidabili e sufficienti porta a un'attuazione più rapida e più coerente della tabella di marcia di Dash e dei servizi di base di Dash.
ru: По мере развития системы сформировалась и установилась сильная команда производительных исполнителей, которым выплачиваются вознаграждения из блокчейна. Она включает в себя основную команду разработчиков, провайдеров целевых депозитных счетов, персонал по новостям и отчётности, экспериментальные лаборатории разработки, партнёрские отношения с университетами, наём маркетинговых и PR-фирм и интеграцию со сторонними биржами и платёжными платформами. Рынок признаёт ценность стабильности сети в целом, а также тот факт, что надёжное и достаточное финансирование приводит к ускоренному и согласованному внедрению дорожной карты Dash и основных услуг Dash.
vi: Khi hệ thống đã được phát triển, một đội các nhà thầu có năng lực được trả lương từ phần thưởng khói đã được thiết lập và phát triển. Trong đó bao gồm nhóm phát triển chính, các nhà cung cấp dịch vụ ký quỹ, các nhóm truyền thông, các phòng thí nghiệm phát triển, hợp tác với các trường đại học, thuê các hãng truyền thông và marketing và tích hợp với các sàn giao dịch và các hệ thống thanh toán. Thị trường đang nhận ra giá trị của sự ổn định của mạng lưới một cách tổng thể, và có lẽ nhờ nguồn cấp vốn ổn định và đầy đủ đã giúp cho quá trình thực hiện được nhanh chóng hơn và kết dính hơn với lộ trình của Dash với các dịch vụ cốt lõi.

source: Reward schedule
ar: جدول المكافآت
de: Reward-Auszahlungsplan
es: Esquema de recompensas
it: Programma dei reward
ru: График вознаграждений
vi: Cơ cấu phần thưởng

source: To guarantee long term sustainability of the blockchain, the network keeps a portion of the block subsidy back as new blocks are created, with the masternode operators tasked to act as stewards and invest in the maintenance and expansion of the network by voting. This results in faster development and promotion, creating a virtuous cycle that benefits all actors, including miners, masternode operators, investors and users. More importantly, this gives the blockchain itself a self- preservation mechanism that is beyond the control of any individual.
it: Per garantire la sostenibilità a lungo termine della blockchain, la rete trattiene una parte del sussidio del blocco quando vengono creati nuovi blocchi, con gli operatori masternode incaricati di agire come steward e investire nella manutenzione e nell'espansione della rete attraverso il voto. Ciò si traduce in uno sviluppo e una promozione più rapidi, creando un ciclo virtuoso a vantaggio di tutti gli attori, inclusi miner, operatori di masternode, investitori e utenti. Ancora più importante, ciò conferisce alla blockchain stessa un meccanismo di autoconservazione che va oltre il controllo di qualsiasi individuo.
ru: С целью гарантии долгосрочной устойчивости блокчейна, сеть сохраняет часть вознаграждений за блоки при создании новых блоков, при этом операторы мастернод должны выполнять обязанности стюардов и совершать инвестиции в обслуживание и расширение сети путём голосования. Это приводит к ускоренному развитию и продвижению по службе, создавая благотворный цикл, который приносит пользу всем действующим лицам, включая майнеров, операторов мастернод, инвесторов и пользователей. И что ещё более важно, это приводит к тому, что блокчейн сам по себе является механизмом самосохранения, который не поддается контролю извне.

source: Mining and Masternode Reward
it: Mining e Masternode Reward
ru: Награда майнеров и мастернод

source: Decentralized Governance Budget
ar: موازنة الحوكمة اللامركزية
de: Dezentralisiertes Governance Budget
es: Presupuesto de governanza descentralizada
it: Budget della governance decentralizzata
ru: Бюджет децентрализованной системы управления
vi: Cơ chế quản trị ngân sách phi tập trung
