Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/understanding.po
Languages: ar, de, es, it, ru, vi

source: As the number of blockchain contractors increases, a point is reached where masternode operators cannot be realistically expected to evaluate the volume of proposals. At this point funding organizations can be created to act as contractors for the distribution of funds to many smaller decentralized projects, according to current needs. Dash Core Group, Inc. is one example of such an organization.
ar: مع زيادة عدد مقاولي بلوكشين ، يتم الوصول إلى نقطة لا يمكن فيها توقع مشغلي ماسترنود بشكل واقعي لتقييم حجم المقترحات. في هذه المرحلة ، يمكن إنشاء منظمات للتمويل كمتعاقدين لتوزيع الأموال على العديد من المشاريع اللامركزية الأصغر ، وفقًا للاحتياجات الحالية. تعتبر، مجموعة داش كور. مثالاً على مثل هذه المنظمة.
de: Wenn sich die Zahl der Vertragsnehmer der Blockchain erhöht, kann von den Betreibern der Masternodes nicht erwartet werden, dass sie weiterhin jedes Projekt einzeln im Blick behalten können. Aus diesem Grund können Organisationen geschaffen werden, welche die Aufsicht für mehrere dezentralisierte kleinere Projekte und Individuen übernehmen. Dash Core Group, Inc. ist ein Beispiel für eine derartige Organisation.
es: A medida que aumenta el número de contratistas de la cadena de bloques, se llega a un punto en el que no se puede esperar de manera realista que los operadores de los masternodes evalúen el volumen total de las propuestas. En este punto, se pueden crear organizaciones de financiamiento para actuar como contratistas para la distribución de fondos a muchos proyectos descentralizados más pequeños, de acuerdo con las necesidades actuales. Dash Core Group, Inc. es un ejemplo de dicha organización.
it: Con l’aumento del numero di contraenti blockchain, si raggiunge un punto in cui non ci si può realisticamente aspettare che gli operatori masternode valutino il volume delle proposte. A questo punto si possono creare organizzazioni di finanziamento che agiscano come appaltatori per la distribuzione dei fondi a molti progetti decentralizzati più piccoli, in base alle esigenze attuali. Dash Core Group, Inc. è un esempio di tale organizzazione.
ru: По мере увеличения числа исполнителей блокчейна наступает момент, когда операторы мастернод больше не могут реально оценивать объемы предложений. В таком случае можно создавать финансирующие организации, которые бы выступали в качестве подрядчиков для распределения средств во многих небольших децентрализованных проектах в соответствии с текущими потребностями. Одним из примеров такой организации является Dash Core Group, Inc.
vi: Khi mà số lượng nhà thầu cho blockchain tăng lên, đến khi đạt một mức mà các nhà vận hành masternode không thể mong đợi thực tế có thể đánh giá được hết số lượng đề xuất. Tại điểm đó các tổ chức cấp vốn có thể được tạo ra như là những nhà thầu để phân phối lại nguồn vốn cho các dự án phi tập trung nhỏ hơn, theo nhu cầu hiện tại. Dash Core Group, Inc. là một ví dụ của một tổ chức như vậy.

source: The existence of the decentralized budget system puts the power of determining where Dash goes in the future in the hands of the masternode network itself. All core development and several peripheral developers are already funded from the budget, and other projects not even conceivable at this time will likely arise in the future. This decouples the survival and value of the blockchain from the current userbase and developers, making Dash the first blockchain designed to outlive its original users, a self sustainable decentralized cryptocurrency network that can still operate cohesively and bring added value services to end users in a consistent way.
ar: إن وجود نظام الموازنة اللامركزية يضع قوة تحديد أين تذهب داش في المستقبل في أيدي شبكة ماسترنود نفسها. لقد تم بالفعل تمويل كل التطوير الأساسي والعديد من المطورين المحيطيين من الميزانية ، ومن المحتمل أن تنشأ مشاريع أخرى في المستقبل لا يمكن حتى تصوّرها في هذا الوقت. هذا يفصل بقاء وقيمة بلوكشين من userbase الحالي والمطورين ، مما يجعل داش أول بلوكشين مصممة لتعمر من المستخدمين الأصليين ، شبكة العملات الرقمية مستقلة ذاتية اللامركزية التي لا يزال بإمكانها العمل بشكل متجانس وتقديم خدمات ذات قيمة إضافية للمستخدمين النهائيين بشكل متناسق الطريقة.
de: Die Existenz des dezentralisierten Budget-Systems legt die Bestimmungsgewalt über die Zukunft der Blockchain in die Hand der Masternodes selbst. Alle Core-Entwickler und viele sekundäre Entwickler werden bereits durch das Budget finanziert und weitere Projekte, die heute vielleicht noch nicht einmal vorstellbar sind, werden in Zukunft hinzukommen. Dies entkoppelt das Überleben der Blockchain von der momentanen Nutzerschaft, wodurch Dash die erste Blockchain ist, die dafür geschaffen wurde, ihre eigenen Urheber zu überdauern. Dash stellt ein Kryptowährungs-Netzwerk dar, das sich selbst erhalten kann, weiterhin verlässlich arbeiten wird und den Endverbrauchern konsistent zur Seite stehen möchte.
es: La existencia del sistema de presupuesto descentralizado pone el poder de determinar dónde irá Dash en el futuro en manos de la propia red de masternodes. Todos los desarrolladores centrales y varios desarrolladores periféricos ya están financiados con el presupuesto, y es probable que en el futuro surjan otros proyectos no concebibles en este momento. Esto desacopla la supervivencia y el valor de la cadena de bloques de la base de usuarios y desarrolladores actuales, convirtiendo a Dash en la primera cadena de bloques diseñada para sobrevivir a sus usuarios originales, una red de criptomonedas descentralizada autosostenible que aún puede operar cohesivamente y brindar servicios de valor agregado a los usuarios finales de forma consistente.
it: L’esistenza del sistema di budget decentralizzato mette il potere di determinare dove andrà Dash in futuro nelle mani della stessa rete masternode. Tutto lo sviluppo principale e diversi sviluppatori periferici sono già finanziati dal budget, ed è probabile che in futuro nasceranno altri progetti nemmeno concepibili in questo momento. Ciò disaccoppia la sopravvivenza e il valore della blockchain dall'attuale base di utenti e sviluppatori, rendendo Dash la prima blockchain progettata per sopravvivere ai suoi utenti originali, una rete di criptovaluta decentralizzata autosostenibile che può ancora operare in modo coeso e portare servizi a valore aggiunto agli utenti finali in modo coerente. modo.
ru: Существование децентрализованной бюджетной системы даёт возможность определить будущее направление развития Dash, которое находится в руках его же сети мастернод. Все основные разработки и несколько периферийных разработчиков уже финансируются из бюджета, а другие проекты, которые пока даже не мыслимы в настоящее время, скорее всего, возникнут в будущем. Это отделяет существование и ценность блокчейна от текущей пользовательской базы и разработчиков, делая Dash первым блокчейном, предназначенным для того, чтобы пережить своих первоначальных пользователей, самодостаточной децентрализованной криптовалютной сетью, которая может работать стабильно и слаженно и предоставлять конечным пользователям дополнительные высокотехнологичные услуги на постоянной основе.
vi: Nhờ có hệ thống ngân sách phi tập trung nó đã đặt để sức mạnh của sự quyết tâm đưa Dash tiến vào tương lai trong tay bản thân của mạng lưới các masternode. Tất cả sự phát triển cốt lõi và nhiều lập trình viên phát triển các giải pháp ngoại vi đã được cấp vốn từ ngân sách này, và những dự án khác thậm chí hiện tại còn chưa được biết đến cũng sẽ được tài trợ để phát triển trong tương lai. Điều này giải thích sự tồn tại và giá trị của blockchain từ những người dùng hiện tại và ác lập trình viên, đang tạo ra Dash là một blockchain đầu tiên được thiết kế để tồn tại vượt quá những người dùng ban đầu của nó, một mạng lưới tiền số có cơ chế tự bảo tồn phi tập mà nó có thể tiếp tục hoạt động một cách kết dính đem lại những dịch vụ giá trị gia tăng cho người dùng theo một cách rất nhất quán.

source: Conclusion
ar: استنتاج
de: Zusammenfassung
es: Conclusión
it: Conclusione
ru: Вывод
vi: Kết luận

source: Every masternode operator establishes a bond of trust and a social contract with the network in which she is bound to contribute to the development and maintenance of the ecosystem she benefits from. Under this model, a portion of the funds that the operator is bound to receive are in a sense allocated in custody, not in ownership, and are held in escrow by the network to be executed by the operators for the benefit of the ecosystem. Everyone contributes equally and proportionately to the benefits they are receiving and the risks they are taking, there are no privileges and no loopholes. This is complemented by the full node voting mechanism that allows for a distributed group to vote on a continuous basis on practical matters without the need to forfeit their right to decide to others, every few years, like with traditional governments or cooperative corporations.
ar: تنشئ كل شركة مشغّل ماسترنود رابطة ثقة وعقدًا اجتماعيًا مع الشبكة التي تلتزم فيها بالمساهمة في تطوير وصيانة النظام البيئي الذي تستفيد منه. وبموجب هذا النموذج ، فإن جزءًا من الأموال التي يتعين على المشغِّل أن يتلقاها ، يتم تخصيصه في الحجز ، وليس في الملكية ، ويحتفظ به في الشبكة من قبل الشبكة لكي ينفذه المشغلون لصالح النظام الإيكولوجي. الجميع يساهم بالتساوي وبالتناسب مع الفوائد التي يتلقونها والمخاطر التي يتعرضون لها ، لا توجد امتيازات ولا ثغرات. يتم استكمال ذلك من خلال آلية تصويت العقدة الكاملة التي تسمح للمجموعة الموزعة بالتصويت بشكل مستمر على الأمور العملية دون الحاجة إلى التنازل عن حقها في اتخاذ القرار للآخرين ، كل بضع سنوات ، كما هو الحال مع الحكومات التقليدية أو الشركات التعاونية
de: Jeder Masternode-Betreiber knüpft ein Band des Vertrauens und schließt einen gesellschaftlichen Vertrag mit dem Netzwerk, durch den er dazu angehalten wird zum Wohle des Netzwerks und dessen Weiterentwicklung beizutragen, da er von diesem profitiert. Durch dieses Modell wird ein Teil dessen, was der Betreiber sonst erhalten würde, in Treuhand überführt, wobei das Netzwerk den Treuhänder darstellt und dieser so handelt, wie das Netzwerk der Masternode-Betreiber es ihm aufträgt. Jeder beteiligt sich in gleichem Maße und anteilig an den Vorteilen, die so gewonnen werden, und den Risiken, die hierdurch eingegangen werden. Hierbei gibt es keine Privilegien und keine Schlupflöcher. Dieses System wird dadurch abgerundet, dass es einen FullNode-Abstimmungsmechanismus gibt, der einer dezentralisierten Gruppe erlaubt direkte Entscheidungen zu treffen, ohne die Stimmen dabei, wie bei einem Staat oder einem Unternehmen an einen Repräsentanten abzugeben, der alle paar Jahre gewählt wird.
es: Cada operador de masternode establece un vínculo de confianza y un contrato social con la red en el que está obligado a contribuir al desarrollo y mantenimiento del ecosistema del que se beneficia. Bajo este modelo, una porción de los fondos que el operador está obligado a recibir, en cierto sentido, se asignan bajo custodia, no en propiedad, y son mantenidos en custodia por la red para ser ejecutados por los operadores en beneficio del ecosistema. Todos contribuyen de manera equitativa y proporcional a los beneficios que están recibiendo y los riesgos que están asumiendo, no hay privilegios ni lagunas. Esto se complementa con el mecanismo completo de votación de nodos que permite a un grupo distribuido votar continuamente sobre asuntos prácticos sin la necesidad de perder su derecho a decidir por los demás, cada ciertos años, como con los gobiernos tradicionales o las corporaciones cooperativas.
it: Ogni operatore masternode instaura con la rete un legame di fiducia e un contratto sociale in cui è tenuto a contribuire allo sviluppo e al mantenimento dell’ecosistema di cui beneficia. Secondo questo modello, una parte dei fondi che l’operatore è tenuto a ricevere sono in un certo senso allocati in custodia, non in proprietà, e sono tenuti in deposito a garanzia dalla rete per essere eseguiti dagli operatori a beneficio dell’ecosistema. Tutti contribuiscono in modo equo e proporzionale ai benefici che ricevono e ai rischi che corrono, non ci sono privilegi né scappatoie. A ciò si aggiunge il meccanismo di voto a nodo completo che consente a un gruppo distribuito di votare su base continuativa su questioni pratiche senza la necessità di rinunciare al proprio diritto di decidere a favore di altri, ogni pochi anni, come con i governi tradizionali o le società cooperative.
ru: Каждый оператор мастерноды устанавливает доверительную связь и заключает социальный контракт с сетью, в развитие которой он обязан вносить свой вклад и поддерживать экосистему, которую эта сеть использует. Согласно этой модели часть средств, которая обязательна к получению оператором, в определённом смысле распределяется “под стражей”, и не находится в собственности, а удерживается в депонировании сетью, которой руководят операторы в интересах экосистемы. Для получения выгоды все вкладываются и принимают риски пропорционально и в равной степени, нет никаких привилегий и лазеек. В дополнение существуют полные узлы механизма голосования, который позволяет распределённой группе голосовать на постоянной основе по практическим вопросам без необходимости каждые несколько лет отказываться в пользу других от своего права голоса, как это происходит например в случае с традиционными правительствами или кооперативными корпорациями.
vi: Mỗi người vận hành masternode thiết lập một liên kết tin tưởng và hợp đồng xã hội với mạng lưới mà ở đó anh ta ràng buộc mình vào sự tham gia đóng góp cho sự duy trì và phát triển của hệ sinh thái mà anh ta được hưởng lợi từ đó. Theo mô hình này, một phần của số tiền mà người vận hành bị ràng buộc nhận được theo nghĩa được phân bổ trong quyền chăm sóc, không thuộc quyền sở hữu và được giữ ký quỹ bởi mạng lưới để những người vận hành thực hiện vì lợi ích của hệ sinh thái. Mọi người đều đóng góp như nhau và tương xứng với những lợi ích và những rủi mà họ nhận, không có đặc quyền và không có sơ hở. Điều này được bổ sung bởi cơ chế bỏ phiếu của full node cho phép nhóm phân tán bình chọn một cách liên tục trên các vấn đề thực tế mà không cần phải tước quyền quyết định của những người khác, cứ vài năm một lần, như với các chính phủ truyền thống hoặc các tập đoàn.

source: We envision a future in which this model of transparent, unbreakable and verifiable contribution to the common good, in combination with continuous participation of the crowd through active voting, is utilized to manage organizations that are owned or operated jointly by its members, who share the benefits and responsibilities of those collectives, like governments, cooperative corporations, unions, DAOs, cryptocurrencies, etc. We call this model decentralized governance by blockchain.
ar: إننا نتصور مستقبلا يستخدم فيه هذا النموذج من المساهمة الشفافة وغير القابلة للكسر والقابلة للتحقق في الصالح العام ، بالاشتراك مع المشاركة المستمرة للحشد من خلال التصويت النشط ، لإدارة المنظمات التي يملكها أو يشترك فيها الأعضاء بشكل مشترك. فوائد هذه المسؤوليات ومسؤولياتها ، مثل الحكومات ، والشركات التعاونية ، والنقابات ، و DAOs ، و العملات الرقمية ، إلخ. نحن نسمي هذا النموذج الحوكمة اللامركزية من خلال بلوكشين.
de: Wir stellen uns eine Zukunft vor, in der dieses Modell des transparenten, sicheren und verifizierbaren Beitrags zum Allgemeinwohl, in Zusammenarbeit mit der Wählerschaft, die sich aktiv daran beteiligt, dazu verwendet werden kann eine Organisation zu verwalten, die ihren Mitgliedern gehört, welche Anteil an den Vorteilen und Risiken des Systems haben. Hierbei spielt es keine Rolle, ob diese Organisation ein Staat, ein Unternehmen, eine Gewerkschaft, eine DAO, eine Kryptowährung oder etwas anderes ist. Wir nennen dieses Modell "Dezentralisierte Entscheidungsfindung durch die Blockchain".
es: Visualizamos un futuro en el que este modelo de contribución transparente, irrompible y verificable al bien común, en combinación con la participación continua de la multitud a través del voto activo, se utiliza para gestionar organizaciones que son propiedad u operadas conjuntamente por sus miembros, que comparten el beneficios y responsabilidades de esos colectivos, como gobiernos, corporaciones cooperativas, sindicatos, DAOs, criptomonedas, etc. Llamamos a este modelo governanza descentralizado por cadena de bloques.
it: Immaginiamo un futuro in cui questo modello di contributo trasparente, indistruttibile e verificabile al bene comune, in combinazione con la partecipazione continua della folla attraverso il voto attivo, venga utilizzato per gestire organizzazioni possedute o gestite congiuntamente dai suoi membri, che condividono gli stessi benefici e responsabilità di questi collettivi, come governi, società cooperative, sindacati, DAO, criptovalute, ecc. Chiamiamo questo modello governance decentralizzata tramite blockchain.
ru: Мы представляем себе будущее, в котором эта модель прозрачного, непреложного и поддающегося проверке вклада в общее благо в сочетании с постоянным участием пользователей посредством активного голосования используется для управления организациями, которые принадлежат или управляются совместно своими участниками, каждый из которых разделяет преимущества и ответственность таких коллективов, как правительства, кооперативные корпорации, объединения, ДАО, криптововалюты и т. д. Мы называем эту модель “децентрализованное управление с помощью блокчейна”.
vi: Chúng tôi hình dung một tương lai trong đó mô hình minh bạch, không thể phá vỡ và ai cũng có thể xác minh được sẽ đóng góp cho lợi ích chung, kết hợp với sự tham gia liên tục của cộng đồng thông qua bỏ phiếu tích cực. Nó sẽ được sử dụng để quản lý các tổ chức được sở hữu hoặc điều hành bởi các thành viên cùng chia sẻ lợi ích và trách nhiệm trong sự tập hợp đó. Nó cũng giống như các chính phủ, các tập đoàn hợp tác, công đoàn, DAO, tiền điện tử, v.v. Chúng tôi gọi mô hình này là quản trị phi tập trung bởi blockchain.
