Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/understanding.po
Languages: ar, de, es, it, ru, vi

source: Discussion of theory and motivation behind the Dash governance system and treasury
ar: مناقشة النظرية والدافع وراء نظام إدارة داش والخزانة
de: Theorie und Motivation hinter dem Dash Governance System und der Treasury diskutiert
es: Discusión de teoría y motivación detrás del sistema de gobernanza y tesorería de Dash
it: Discussione della teoria e della motivazione alla base del sistema di governance e della tesoreria di Dash
ru: Обсуждение теории и стимулирования системы управления Dash и Бюджетной системы
vi: Trình bày về lý thuyết và động lực đằng sau của hệ quản trị và ngân quỹ Dash

source: dash, dao, governance, funding, voting, blockchain, development, block reward, treasury, budget
it: dash, dao, governance, finanziamenti, votazione, blockchain, sviluppi, block reward, tesoreria, budget
ru: dash, ДАО, управление, финансирование, голосование, блокчейн, развитие, разработка, награда за блок, бюджет

source: Understanding Dash Governance
ar: فهم إدارة داش
de: Dash Governance verstehen
es: Entendiendo la governanza de Dash
it: Comprendere la governance di Dash
ru: Как работает система управления Dash
vi: Tìm hiểu về Cơ chế quản trị của Dash

source: One of the greatest challenges of building a cryptocurrency platform is ensuring you create a decentralized system of governance to manage, fund, maintain and expand the project. This key element has been absent in every major currency to date, so the natural response is to create a not-for-profit foundation that is tasked with maintaining the core protocol and promoting the coin, but is not really connected to the coin holders in any meaningful way. This approach has a few issues that have been made evident from the experience of older crypto currency platforms.
ar: إن أحد أكبر التحديات في بناء نظام أساسي لتداول العملات الأجنبية هو ضمان إنشاء نظام حكم لامركزي لإدارة وتمويل وصيانة وتوسيع المشروع. كان هذا العنصر الأساسي غائباً في كل عملة رئيسية حتى الآن ، لذا فإن الاستجابة الطبيعية هي إنشاء مؤسسة غير ربحية مكلفة بالمحافظة على البروتوكول الأساسي وترويج العملة ، ولكنها ليست مرتبطة حقاً بحاملي العملة في أي وسيلة ذات مغزى. يحتوي هذا الأسلوب على عدد قليل من المشكلات التي تم توضيحها من خلال تجربة منصات العملات الأجنبية القديمة.
de: Eine der größten Schwierigkeiten, wenn es darum geht, eine Kryptowährungsplattform zu entwickeln, ist das Schaffen eines dezentralen Entscheidungsfindungssystems, welches das Projekt verwaltet, finanziert, erhält und erweitert. Dieses Schlüsselelement wurde von vielen Kryptowährungen vernachlässigt und sehr viele Projekte haben gemeinnützige Stiftungen gegründet, die sich um das Erhalten des Codes und das Erweitern der Reichweite bemühen, doch diese Vorgehensweise ist in ihrem Wesen nicht mit den Eigentümern der Währung verbunden. Dieser Ansatz bringt Schwierigkeiten mit sich, die sich durch die Geschichte älterer Kryptowährungsplattformen bereits deutlich gezeigt haben.
es: Uno de los mayores desafíos de la construcción de una plataforma de criptomonedas es garantizar que se cree un sistema descentralizado de gobierno para administrar, financiar, mantener y expandir el proyecto. Este elemento clave ha estado ausente en todas las monedas importantes hasta la fecha, por lo que la respuesta natural es crear una fundación sin fines de lucro que tiene la tarea de mantener el protocolo central y promover la moneda, pero que no está realmente conectada a los tenedores de las monedas de ninguna forma significativa. Este enfoque tiene algunos problemas que se han evidenciado a partir de la experiencia de las plataformas de criptomonedas antiguas.
it: Una delle maggiori sfide nella creazione di una piattaforma di criptovaluta è quella di creare un sistema decentralizzato di governance per gestire, finanziare, mantenere ed espandere il progetto. Fino ad oggi questo elemento chiave è stato assente in tutte le principali valute, quindi la risposta naturale è quella di creare una fondazione senza scopo di lucro che ha il compito di mantenere il protocollo principale e promuovere la moneta, ma non è collegata ai possessori di monete in modo significativo Questo approccio ha alcuni problemi che sono stati resi evidenti dall'esperienza delle vecchie piattaforme di criètomonete.
ru: Одной из главных проблем построения криптовалютной платформы является создание децентрализованной системы управления для управления, финансирования, поддержки и расширения проекта. На данный момент этот ключевой элемент отсутствует во всех основных валютах, поэтому естественной реакцией является создание некоммерческого фонда, которому было бы поручено поддерживать основной протокол и продвигать валюту, но при этом не быть связанным каким бы то ни было значимым образом с держателями монет. Этот подход имеет несколько проблем, которые стали очевидны благодаря опыту более старых криптовалютных платформ.
vi: Một trong những thách thức lớn nhất trong việc tạo nên một nền tảng tiền kỹ thuật số là đảm bảo việc tạo ra một hệ thống quản trị phi tập trung để quản lý, cấp vốn, duy trì, và mở rộng dự án. Những thành phần cốt yếu này đã bị bỏ sót trong tất cả các loại tiền điện tử lớn cho đến ngày nay, và như vậy thì kết quả tất yếu của nó là tạo ra một nền tảng phi lợi nhuận và nhiệm vụ chỉ để duy trì những giao thức cốt lõi và quảng bá cho đồng tiền đó, nhưng nó không thực sực kết nối với những người nắm giữ tiền theo bất kỳ cách có ý nghĩa nào. Cách tiếp cận này có một số vấn đề mà đã thể hiện rõ ràng từ kinh nghiệm của những nền tảng tiền điện tử trước đây.

source: Current crypto foundations are not related to the currency itself by any mechanism that is included in the protocol and are not designed to outlive early adopters when they lose interest. The foundation then struggles to maintain funding until it implodes and core development of the protocol is left scrambling for funding or depending on charity that can’t be counted on and does not allow for proper budgeting and planning. Donations are also unfair to donors because there are always free riders that benefit from the effort done by others without contributing. Other projects have financed themselves by premining coins or running prelaunch sales, which is not a great solution either because control of the funds is centralized and at that stage it is impossible to quantify the future needs of the project.
ar: لا ترتبط أسس التشفير الحالية بالعملة نفسها من خلال أي آلية يتم تضمينها في البروتوكول ولا يتم تصميمها لتبقى في طليعة الأوائل عندما يفقدون الاهتمام. بعد ذلك ، تكافح المؤسسة للحفاظ على التمويل إلى أن ينفجر ، ويترك التطوير الأساسي للبروتوكول يتدافع للحصول على التمويل أو اعتمادًا على الأعمال الخيرية التي لا يمكن الاعتماد عليها ولا تسمح بالميزنة والتخطيط الملائمين. كما أن التبرعات غير عادلة للمانحين لأن هناك دائماً راكبين حرين يستفيدون من الجهود التي يقوم بها الآخرون دون المساهمة. وقد مولت مشاريع أخرى نفسها عن طريق تقويض عملات معدنية أو إدارة المبيعات قبل البيع ، وهو ليس حلاً عظيماً ، إما لأن السيطرة على الأموال مركزية وفي هذه المرحلة من المستحيل تحديد الاحتياجات المستقبلية للمشروع.
de: In ihrer momentanen Existenzform sind Kryptowährungsstiftungen jedoch durch keinen Mechanismus auf Protokollebene mit der Kryptowährung selbst verbunden und sie können die Aufmerksamkeit der Früheinsteiger nur selten langfristig binden. Dies führt dazu, dass es den Stiftungen meistens an Geld fehlt, bis sie ganz untergehen und das Core-Entwicklerteam der Währung ganz von wohltätigen Spendern abhängig wird, deren Gaben unregelmäßig und nicht immer einplanbar sind. Spenden sind zudem ein unfairer Mechanismus gegenüber den Spendern, da es immer jene gibt, die von den Spenden profitieren, ohne selbst zu ihnen beizutragen. Andere Projekte finanzieren sich durch zuvor erschaffene Coins oder Vorverkäufe, die auch nur bedingt als Lösung betrachtet werden können, da sie zentralisiert sind und die zukünftigen Bedürfnisse nur ungenügend abwägen können.
es: Las cripto fundaciones actuales no están relacionadas con la moneda en sí por ningún mecanismo que esté incluido en el protocolo y no están diseñadas para sobrevivir cuando los primeros usuarios pierden interés. Luego, la fundación se esfuerza por mantener los fondos hasta que implosiona y el núcleo del desarrollo del protocolo se queda luchando por financiación o dependiendo de una organización benéfica con la que no se puede contar y que no permite un presupuesto y planificación adecuadas. Las donaciones también son injustas para los donantes porque siempre hay usuarios gratuitos que se benefician del esfuerzo realizado por otros sin contribuir. Otros proyectos se han financiado así mismos preminando monedas o ejecutando ventas previas al lanzamiento, lo que tampoco es una gran solución porque el control de los fondos está centralizado y en esa etapa es imposible cuantificar las necesidades futuras del proyecto.
it: Le attuali Fondazioni che sostengono le singole crypto non sono correlate alla valuta stessa da alcun meccanismo incluso nel protocollo e non sono organizzate per sopravvivere agli early adopter quando perdono interesse. La Fondazione quindi lotta per mantenere i finanziamenti fino a quando non implode e lo sviluppo del protocollo viene lasciato a dipendere della beneficenza di finanziatori su cui non si può sempre contare e che non consente un adeguato budgeting e una adeguata pianificazione. Le donazioni sono anche ingiuste per i donatori, perché ci sono sempre persone che beneficiano dello sforzo fatto da altri senza contribuire. Altri progetti si sono finanziati pre-minando le monete o eseguendo vendite di pre-lancio, il che non è una grande soluzione perché il controllo dei fondi è centralizzato e in quella fase è impossibile quantificare le esigenze future del progetto.
ru: Существующие криптовалютные фонды не связаны с самой валютой какими-либо механизмами, включенными в протокол, и не предназначены для того, чтобы пережить ранних последователей, если они утратят интерес к валюте. Такие фонды пытаются поддерживать финансирование валюты до тех пор, пока не схлопнутся, или пока не удастся добиться, чтобы на финансирование была направлена основная разработка протокола или финансируют проект в зависимости от благотворительных пожертвований, на которые нельзя рассчитывать, и которые не позволяет надлежащим образом вести бюджет и планирование. Что касается пожертвований, то это ещё и несправедливо по отношению к жертвователям, потому что всегда есть халявщики, которые извлекают выгоду из усилий, предпринятых другими, ничего при этом не вкладывая. Другие криптовалютгые проекты финансировали себя сами с помощью премайна монет или проведения предварительных продаж перед запуском, что также не является хорошим решением, потому что управление фондами централизованно, и на этом этапе невозможно количественно оценить будущие потребности проекта.
vi: Các nền tảng tiền điện tử hiện tại không liên quan đến chính tiền tệ theo bất kỳ cơ chế nào được đưa vào trong giao thức và không được thiết kế để sống lâu hơn những người dùng đầu tiên khi họ mất hứng thú. Nền tảng sau đó phải vật lộn để duy trì nguồn tài trợ cho đến khi nó bùng nổ và phát triển cốt lõi của giao thức bị xáo trộn để được tài trợ hoặc phụ thuộc vào các nguồn từ thiện không đáng tin cậy và không cho phép có được ngân sách và kế hoạch phù hợp. Các khoản quyên góp cũng không công bằng với các nhà tài trợ vì luôn có những người tận dụng miễn phí được hưởng lợi từ những nỗ lực của những người khác mà không đóng góp gì. Các dự án khác đã phải lấy nguồn tài chính bằng việc đào coin trước hoặc chạy các chiến dịch bán coin trước khi công bố, đó không phải là một giải pháp tuyệt vời bởi vì việc kiểm soát quỹ bị tập trung và ở giai đoạn đó không thể định lượng được nhu cầu trong tương lai của dự án.

source: Through the network of full nodes and the collateral requirement, Dash already has a decentralized network of masternode operators that are heavily invested in the future of the currency, and that as a group can act as stewards of the core protocol development and promotion. We propose a decentralized management system based on the masternode voting mechanism. Masternode operators are not the only ones interested in the success of Dash, but they are the most stable ones because, unlike miners, they can’t reuse their asset for any other purpose or coin.
ar: من خلال شبكة العقد الكاملة ومتطلبات الضمانات ، لدى داش بالفعل شبكة لامركزية من مشغلي ماسترنود تستثمر بكثافة في مستقبل العملة ، والتي يمكن أن تعمل كمجموعة من المشرفين على تطوير البروتوكول الأساسي والترقية. نقترح نظام إدارة لامركزي يعتمد على آلية التصويت على ماسترنود. مشغلي ماسترنود ليسوا وحدهم المهتمين بنجاح داش ، لكنهم الأكثر استقرارًا لأنهم ، على عكس عمال المناجم ، لا يمكنهم إعادة استخدام أصولهم لأي غرض أو عملة أخرى.
de: Durch das Netzwerk aus Fullnodes und die hinterlegten Sicherheiten, verfügt Dash bereits über ein dezentrales Netzwerk aus Masternode-Betreibern, die ein hohes Interesse an der Zukunft der Währung haben und die deswegen die Entwicklung des Protokolls überwachen und vorantreiben können. Unser vorgeschlagenes dezentralisiertes Verwaltungssystem basiert auf dem Masternode-Abstimmungsmechanismus. Die Betreiber der Masternodes sind nicht die einzigen, die ein Interesse am Erfolg von Dash haben, doch bei ihnen besteht die höchste Sicherheit, da sie, anders als die Miner, ihre Guthaben nicht für einen anderen Zweck oder Coin gebrauchen können.
es: A través de la red de nodos completos y el requisito de garantía, Dash ya cuenta con una red descentralizada de operadores de masternodes que están fuertemente invertidos en el futuro de la moneda, y que como grupo pueden actuar como administradores del desarrollo y promoción del protocolo central. Nosotros proponemos un sistema de gestión descentralizado basado en el mecanismo de votación de los masternodes. Los operadores de masternodes no son los únicos interesados en el éxito de Dash, pero son los más estables porque, a diferencia de los mineros, no pueden reutilizar sus activos para ningún otro propósito o moneda.
it: Attraverso la rete dei full node e il requisito del collaterale, Dash ha già una rete decentralizzata di operatori di masternode che sono pesantemente coinvolti nel futuro della valuta e che come gruppo può agire per amministrare lo sviluppo e la promozione del protocollo core. Proponiamo un sistema di gestione decentralizzato basato sul voto dei masternode. Gli operatori dei Masternode non sono gli unici interessati al successo di Dash, ma sono i più coinvolti perché, a differenza dei minatori, non possono riutilizzare i propri asset per nessun altro scopo o moneta.
ru: Благодаря сети полных узлов и требованию обеспечения, у Dash уже есть децентрализованная сеть операторов мастернод, которые прилично вложились в будущее валюты, и которые, являясь группой, могут выступать распорядителями разработки и продвижения основного протокола. Мы предлагаем децентрализованную систему управления, основанную на механизме голосования мастернод. Операторы мастернод не единственные, кто заинтересован в успехе Dash, но они самые стабильные в сети, потому что, в отличие от майнеров, они не могут повторно использовать свои активы для каких-либо других целей или в пользу какой-либо другой валюты.
vi: Thông qua mạng lưới của các full node và được yêu cầu đặt cọc, Dash đã có một mạng lưới phi tập trung các nhà vận hành mạng mà đã đầu tư đáng kể vào tương lai của loại tiền điện tử này, và nhóm người này có thể hành xử như những người quản lý việc phát triển giao thức lõi và quảng bá. Chúng tôi đề xuất một hệ quản trị phi tập trung dựa trên cơ chế bỏ phiếu của các masternode. Những người vận hành masternode không chỉ là những người quan tâm đến sự thành công của Dash, nhưng họ cũng là những người ổn định nhất bởi vì, không giống như người đào coin, họ không thể sử dụng lại tài sản của họ cho những mục đích hoặc đồng coin nào khác.

source: In the budget system, a portion of the block subsidy is held in escrow by the network itself, in the name of the operators, to be executed in the development and expansion of the ecosystem according to the vote of the masternodes in different budget proposals. These funds are directed to supporting development and promotion of the coin. Masternode operators vote on specific budgets and projects to be funded, thus defining the direction the coin is taking. This is done in a completely transparent way through a public portal where new initiatives are proposed and masternodes can vote on them. Functioning like a decentralized Kickstarter or Lighthouse, the budget can be used for anything that creates value within the ecosystem.
it: Nel sistema di bilancio, una parte del sussidio del blocco è tenuta in garanzia dalla rete stessa, a nome degli operatori, per essere eseguita nello sviluppo e nell'espansione dell'ecosistema secondo il voto dei masternode nelle diverse proposte di bilancio. Questi fondi sono diretti a sostenere lo sviluppo e la promozione della moneta. Gli operatori di Masternode votano su budget e progetti specifici da finanziare, definendo così la direzione che sta prendendo la moneta. Ciò avviene in modo del tutto trasparente attraverso un portale pubblico dove vengono proposte nuove iniziative e i masternodes possono votarle. Funzionando come un Kickstarter o un Lighthouse decentralizzato, il budget può essere utilizzato per tutto ciò che crea valore all'interno dell'ecosistema.
ru: В бюджетной системе часть вознаграждения за блок удерживается в депонировании самой сетью, в интересах операторов и должна быть задействована при разработке и расширении экосистемы в соответствии с голосованием мастернод в различных бюджетных предложениях. Эти средства направлены на поддержку развития и на продвижение валюты. Операторы мастернод голосуют по конкретным бюджетам и проектам, которые будут финансироваться, таким образом определяя направление развития для валюты. Это делается совершенно прозрачным способом через общественный портал, на котором предлагаются новые инициативы, в отношении которых мастерноды могут голосовать. Функционируя как децентрализованный Kickstarter или Lighthouse, бюджет может использоваться для всего, что принесёт ценность для экосистемы.
