Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/understanding.po
Languages: ar, de, es, it, ru, vi

source: Masternodes and miners split 80% of the mining subsidy per the distribution found :ref:`here <block-reward-reallocation>`, at the time it is created. The remaining 20% is disbursed monthly by the masternode operators once the results of their votes are tallied, creating the first self-sustaining decentralized cryptocurrency platform organized as a Decentralized Autonomous Organization (DAO). The masternode operators establish a social contract with the network they benefit from and are bound to act as caretakers, dedicating their time, due diligence work and a portion of the network rewards to furthering the ecosystem. This has a ripple effect that benefits all parties involved - especially the end users.
it: Masternode e miner si dividono l'80% del sussidio del mining in base alla distribuzione trovata :ref:`qui <block-reward-reallocation>`, al momento della creazione. Il restante 20% viene erogato mensilmente dagli operatori masternode una volta conteggiati i risultati dei loro voti, creando la prima piattaforma di criptovaluta decentralizzata autosufficiente organizzata come Organizzazione Autonoma Decentralizzata (DAO). Gli operatori masternode stabiliscono un contratto sociale con la rete di cui beneficiano e sono tenuti ad agire come custodi, dedicando il loro tempo, il lavoro di due diligence e una parte dei premi della rete alla promozione dell'ecosistema. Ciò ha un effetto a catena che va a vantaggio di tutte le parti coinvolte, in particolare degli utenti finali.
ru: Мастерноды и майнеры делят между собой 80% вознаграждения за майнинг в соответствии с распределением, найденным :ref:`тут <block-reward-reallocation>`, в момент его создания. Оставшиеся 20% ежемесячно распределяются операторами мастернод после подведения итогов голосования. Таким образом, создается первая самоподдерживающаяся децентрализованная криптовалютная платформа, организованная как децентрализованная автономная организация (DAO). Операторы мастернод заключают социальный контракт с сетью, от которой они получают выгоду, и обязуются действовать как смотрители, посвящая свое время, добросовестную работу и часть сетевого вознаграждения развитию экосистемы. Это приводит к эффекту пульсации, от которого выигрывают все стороны, особенно конечные пользователи.

source: The value generated by work done implementing proposals is expected to be greater than allocating 100% of rewards to mining because the network has needs beyond only cryptographically securing the blockchain. The expected result is greater net benefit not only for proposal winners, but also masternode operators, miners and normal users. In fact, the introduction of the decentralized governance budget itself was decided by a masternode vote, making the first distributed decision the actual creation of the system, similar to establishing a constitution.
ar: من المتوقع أن تكون القيمة الناتجة عن مقترحات التنفيذ المنفذة أكبر من تخصيص 100٪ من المكافآت إلى التعدين لأن الشبكة تحتاج إلى ما هو أكثر من مجرد تأمين crychain مشفرة. والنتيجة المتوقعة هي فائدة صافية أكبر ليس فقط للفائزين بالمقترحات ، ولكن أيضاً لمشغلي ماسترنود وعمال المناجم والمستخدمين العاديين. في الواقع ، تم تحديد اعتماد ميزانية الحكم اللامركزية نفسها من خلال التصويت على الدستور ، مما جعل القرار الأول الموزع هو الإنشاء الفعلي للنظام ، على غرار إنشاء الدستور.
de: Das Netzwerk sieht in der Zustimmung zu einem Proposal einen höheren Wert, als in der Verteilung von 100% der Block-Rewards an Miner, da das Netzwerk noch weitere Bedürfnisse hat, als die kryptographische Sicherung der Blockchain. Das Ergebnis eines erfolgreichen Proposals dient nicht nur dem Proposal-Steller, sondern auch den Betreibern der Masternodes, den Minern und den normalen Nutzern. Dies wird auch dadurch deutlich, dass die Schaffung eines dezentralisierten Budgets selbst durch eine Masternode-Abstimmung beschlossen wurde, wodurch, wie etwa bei der Schaffung einer Verfassung, die erste Entscheidung des Netzwerks die Schaffung des Systems selber war.
es: Se espera que el valor generado por el trabajo realizado en la implementación de propuestas sea mayor que la asignación del 100% de las recompensas a la minería porque la red tiene necesidades más allá de solo asegurar criptográficamente la cadena de bloques. El resultado esperado es un mayor beneficio neto no solo para los ganadores de propuestas, sino también para los operadores de masternodes, mineros y usuarios normales. De hecho, la introducción del presupuesto de la gobernanza descentralizada en sí fue decidida por voto de masternodes, convirtiendo la primera decisión distribuida en la creación real del sistema, similar al establecimiento de una constitución.
it: Il valore generato dal lavoro svolto per l'implementazione delle proposte dovrebbe essere maggiore dell'assegnazione del 100% delle ricompense al mining perché la rete ha esigenze che vanno oltre la semplice protezione crittografica della blockchain. Il risultato atteso è un maggiore vantaggio netto non solo per i vincitori della proposta, ma anche per gli operatori di masternode, i miner e gli utenti normali. In effetti, l'introduzione dello stesso budget di governance decentralizzata è stata decisa da un voto masternode, rendendo la prima decisione distribuita l'effettiva creazione del sistema, simile alla costituzione di una costituzione.
ru: Ожидается, что ценность, полученная в результате выполненных работ по реализации предложений, будет больше, чем выделение только на майнинг 100% наград, так как у сети, кроме криптографического обеспечения блокчейна, есть и другие потребности. Ожидаемый результат - большая чистая прибыль не только для победителей конкурса, но и для операторов мастернод, майнеров и обычных пользователей. Фактически, введение самого децентрализованно управляемого бюджета было решено голосованием Мастернод и таким образом было принято первое распределённое решение о фактическом создании системы, подобное созданию конституции.
vi: Những giá trị được sinh ra bởi việc thực hiện xong công việc trong các đề xuất được cho là lớn hơn 100% phần thưởng được cấp phát cho việc đào coin bởi vì mạng lưới cần vượt quá nhu cầu đảm bảo an toàn về mặt mật mã học cho blockchain. Kết quả mong đợi là lớn hơn lợi ích không chỉ cho những người có đề xuất được cấp vôn, nhưng cho cả những người vận hành masternode, những thợ mỏ và cả những người dùng bình thường. Thực ra, bản thân việc áp dụng cơ chế quản trị phi tập trung cũng là quyết định bởi việc bỏ phiếu của các masternode, nó đã tạo nên một quyết định phân tán đầu tiên cho sự sáng tạo của hệ thống, nó cũng tương tự như một bản hiến pháp.

source: This approach of distributing the normal block subsidy in a way that considers all critical elements a cryptocurrency needs for its long term viability, e.g. mining, full nodes, development and promotion, is revolutionary as it is done without changing the emission or creating any additional inflation for investors. The network simply distributes the available resources in a way that is of greater net benefit to all parties.
it: Questo approccio di distribuzione del normale sussidio in blocco in modo da considerare tutti gli elementi critici di cui una criptovaluta ha bisogno per la sua vitalità a lungo termine, ad es. l’estrazione del mining, i nodi completi, lo sviluppo e la promozione, sono rivoluzionari poiché vengono realizzati senza modificare le emissioni o creare ulteriore inflazione per gli investitori. La rete distribuisce semplicemente le risorse disponibili in un modo che offra maggiori benefici netti a tutte le parti.
ru: Такой подход распределения нормальной блочной награды способом, который учитывает все критические элементы, требующиеся криптовалюте для её долговременной жизнеспособности, такие как майнинг, полные узлы, разработка и продвижение, является революционным, поскольку это делается без изменения эмиссии или создания дополнительной инфляции для инвесторов. Сеть просто распределяет имеющиеся ресурсы таким образом, чтобы обеспечить наибольшую чистую выгоду для всех сторон.

source: Contractors and proposals
ar: المقاولون والاقتراحات
de: Vertragsnehmer und Proposal
es: Contratistas y propuestas
it: Appaltatori e proposte
ru: Предложения и их исполнители
vi: Nhà thầu và các đề xuất

source: Contractors of the blockchain can be developers, outreach professionals, team leaders, attorneys or even people appointed to do specific tasks. Proposals generally begin life as simple `pre-proposal forum posts <https://www.dash.org/forum/topic/pre-budget-proposal-discussions.93/>`_ on the Dash Forum, where feedback and suggestions are solicited from the general community. Once the proposal owner decides they have a reasonable chance of passing their proposal, it is created as a governance object on the blockchain. A fee of 1 DASH is associated with this action to prevent spam and ensure only serious proposals make it to this stage. Several tools exist to allow masternode operators to comfortably review and vote on proposals. The net total of yes votes must exceed 10% of the total masternode count at the time votes are tallied in order to pass. If there are more passing proposals than the available block subsidy can provide for, the proposals with the most yes votes will pass first, creating a cut-off point for less popular proposals. The same process is then repeated every month, and the total amount of Dash available for proposals decreases by approximately 7.14% per year, together with the overall block subsidy.
it: I contraenti della blockchain possono essere sviluppatori, professionisti di sensibilizzazione, team leader, avvocati o anche persone incaricate di svolgere compiti specifici. Le proposte generalmente iniziano la loro vita come semplici `post del forum pre-proposta <https://www.dash.org/forum/topic/pre-budget-proposal-discussions.93/>`_ sul forum Dash, dove feedback e suggerimenti sono sollecitato dalla comunità generale. Una volta che il proprietario della proposta decide di avere una ragionevole possibilità di approvare la propria proposta, questa viene creata come oggetto di governance sulla blockchain. A questa azione è associata una commissione di 1 DASH per prevenire lo spam e garantire che solo proposte serie arrivino a questa fase. Esistono diversi strumenti per consentire agli operatori masternode di rivedere e votare comodamente le proposte. Per poter passare, il totale netto dei voti sì deve superare il 10% del conteggio totale del masternode al momento del conteggio dei voti. Se ci sono più proposte approvate di quelle che il sussidio in blocco disponibile può fornire, le proposte con il maggior numero di voti favorevoli passeranno per prime, creando un punto limite per le proposte meno popolari. Lo stesso processo viene poi ripetuto ogni mese e l'importo totale di Dash disponibile per le proposte diminuisce di circa il 7,14% all'anno, insieme al sussidio complessivo del blocco.
ru: Исполнителями блокчейна могут быть разработчики, маркетологи-профессионалы, руководители команд, адвокаты или даже люди, назначенные для выполнения конкретных задач. Предложения обычно начинаются с публикации `постов с предварительными предложениямии <https://www.dash.org/forum/topic/pre-budget-proposal-discussions.93/>`_ на форуме Dash, на котором можно прочесть отзывы и предложения от основного сообщества. Как только владелец предложения решает, что у него есть хорошие шансы для публикации свого предложения, оно создаётся как объект управления на блокчейне. Плата в размере 1 DASH, связанная с этим действием, предусмотрена для предотвращения спама и обеспечивает выход на этот этап только серьёзных предложений. Существует несколько инструментов, позволяющих операторам мастернод комфортно просматривать и голосовать по предложениям. Чтобы предложение прошло - общее количество голосов "за" должно превышать 10% от общего количества существующих мастернод во время подсчёта голосов. Если предложений, прошедших голосование больше, чем может обеспечить доступный блочный бюджет, то сначала пройдут предложения с большим количеством голосов “за”, создав таким образом точку отсечения для менее популярных предложений. Тот же процесс повторяется каждый месяц, а общая сумма DASH, доступная для предложений, уменьшается примерно на 7,14% в год вместе с общей премией за блок.

source: The following video by Tao of Satoshi includes advice for proposal owners entering proposals during periods of high competition for the available budget funds:
ar: يتضمن مقطع الفيديو التالي الذي نشره Tao of Satoshi نصيحة لمالكي الاقتراح الذين يدخلون المقترحات أثناء فترات المنافسة العالية لأموال الميزانية المتاحة:
de: Das folgende Video von Tao of Satoshi beinhaltet Ratschläge für Proposal-Ersteller, die ihr Proposal zu einer Zeit erstellen wollen, zu der bereits sehr viele andere Teams Interesse an einer Finanzierung geäußert haben:
es: El siguiente video de Tao de Satoshi incluye consejos para los propietarios de propuestas que ingresan propuestas durante períodos de gran competencia para los fondos de presupuesto disponibles:
it: Il seguente video di Tao di Satoshi include consigli per i proprietari di proposte che inseriscono proposte durante periodi di alta competizione per i fondi di bilancio disponibili:
ru: Следующее видео Tao of Satoshi включает в себя рекомендации для владельцев предложений, которые вносят предложения в периоды высокой конкуренции за имеющиеся бюджетные средства:
vi: Video của Tao of Satoshi sau đây chứa đựng những lười khuyên cho những người muốn đưa ra đề xuất trong những thời điểm mà có sự cạnh tranh cao trong việc xin cấp vốn:

source: Proposal websites
ar: مواقع الإقتراحات
de: Proposal-Seite
es: Sitios web de propuestas
it: Siti web delle proposte
ru: Сайты с предложениями
vi: Những trang web đề xuất

source: The community has gathered around `DashCentral <https://www.dashcentral.org>`__ as a website to facilitate discussion and voting on proposals formally entered on the Dash blockchain. Other websites like `Dash Ninja <https://www.dashninja.pl>`__ are available to monitor progress over time and gather more detailed statistics. `Dash Masternode Tool <https://github.com/Bertrand256/dash-masternode-tool/releases>`__ also allows for voting without the need to share masternode private keys with a third party service.
it: La comunità si è riunita attorno a `DashCentral <https://www.dashcentral.org>`__ come sito web per facilitare la discussione e il voto sulle proposal formalmente inserite nella blockchain di Dash. Altri siti web come `Dash Ninja <https://www.dashninja.pl>`__ sono disponibili per monitorare i progressi nel tempo e raccogliere statistiche più dettagliate. `Dash Masternode Tool <https://github.com/Bertrand256/dash-masternode-tool/releases>`__ consente inoltre di votare senza la necessità di condividere le chiavi private masternode con un servizio di terze parti.
ru: Сообщество собирается на веб-сайте `DashCentral <https://www.dashcentral.org>`__, этот сайт был выбран для проведения обсуждений и голосования по предложениям, официально введённым в блокчейн Dash. Другие веб-сайты, такие как `Dash Ninja <https://www.dashninja.pl>`__ и доступны для мониторинга прогресса с течением времени и сбора более подробной статистики. `Dash Masternode Tool <https://github.com/Bertrand256/dash-masternode-tool/releases>`__ также позволяет голосовать без необходимости делиться секретными ключами мастернод с помощью стороннего сервиса.

source: A typical view of proposal discussion and voting on Dash Central
ar: وجهة نظر نموذجية لمناقشات الاقتراح والتصويت على داش سنترال
de: Typische Proposal-Diskussion und -Abstimmung auf Dash Central
es: Una vista típica de la discusión de propuestas y votación en Dash Central
it: Una visualizzazione tipica della discussione delle proposte e della votazione su Dash Central
ru: Типичный обзор обсуждения предложений и голосования на Dash Central
vi: Một cái nhìn cơ bản về những thảo luận của đề xuất và việc bỏ phiếu trên Dash Central

source: Each proposal includes a description of the proposal goals, details of what work will be done and a breakdown of the requested budget. Many proposals also link to their own website or the pre-proposal discussion, or include a video to validate the identity and sincerity of the proposal owner. Discussion on Dash Central occurs below this information, and masternode owners have the option to verify their ownership of a masternode and ability to cast a vote by signing a message from the masternode collateral address. Masternodes can vote at any time, and also change their vote at any time until the cutoff block is mined and voting stops. This occurs 1662 blocks prior to the superblock. After voting stops, the blockchain executes a decentralized tally and validates all votes. Once consensus is reached, the results are broadcast and the budget is allocated soon after in a superblock.
ar: ويتضمن كل مقترح وصفاً لأهداف الاقتراح ، وتفاصيل العمل الذي سيتم إنجازه وتفصيل الميزانية المطلوبة. ترتبط العديد من المقترحات أيضًا بموقع الويب الخاص بها أو مناقشة ما قبل الاقتراح ، أو تتضمن مقطع فيديو للتحقق من صحة وصدق مالك العرض. تحدث مناقشة حول داش سنترال أسفل هذه المعلومات ، وأصحاب المالكوند لهم خيار التحقق من ملكيتهم لرمز مادي والقدرة على الإدلاء بصوتهم من خلال التوقيع على رسالة من عنوان الضمير الرئيسي. يمكن ماسترن التصويت في أي وقت ، وكذلك تغيير تصويتهم في أي وقت حتى يتم استخراج كتلة القطع وتوقف التصويت. يحدث هذا 1662 كتل قبل superblock. بعد توقف التصويت ، يقوم الكتلان بتنفيذ حصيلة لامركزية ويثبت جميع الأصوات. بمجرد التوصل إلى توافق الآراء ، يتم بث النتائج ويتم تخصيص الميزانية بعد فترة وجيزة في superblock.
de: Jedes Proposal beinhaltet eine detaillierte Beschreibung der Ziele, der vorgesehenen Schritte und des angefragten Budgets. Viele Proposal beinhalten zudem einen Link zur eigenen Webseite oder Pre-Proposal-Diskussion sowie ein Video, in dem das Team sich vorstellt und seine Identität bestätigt. Die Diskussionen auf Dash Central finden unter diesen Informationen statt und die Masternodes können hier ebenfalls abstimmen, indem sie eine signierte Nachricht von der Masternode-Adresse aus schicken. Für Masternodes besteht jederzeit die Möglichkeit abzustimmen, bis der letzte Block gemined und die Wahlperiode beendet wurde. Dies geschieht 1662 Blöcke vor dem Superblock. Nachdem die Wahlperiode beendet wurde, werden alle Stimmen von der Blockchain überprüft und bestätigt. Sobald sich ein Konsens gebildet hat wird das offizielle Budget festgesetzt und im nächsten Superblock ausbezahlt.
es: Cada propuesta incluye una descripción de los objetivos de la propuesta, detalles de qué trabajo se realizará y un desglose del presupuesto solicitado. Muchas propuestas también se vinculan a su propio sitio web o al debate previo a la propuesta, o incluyen un video para validar la identidad y la sinceridad del propietario de la propuesta. La discusión sobre Dash Central ocurre debajo de esta información, y los dueños de los masternodes tienen la opción de verificar su propiedad de un masternodse y la capacidad de emitir un voto firmando un mensaje desde la dirección de garantía del masternode. Los masternodes pueden votar en cualquier momento, y también pueden cambiar su voto en cualquier momento hasta que se mine el bloque de corte y se detenga la votación. Esto ocurre 1662 bloques antes del superbloque. Después de que la votación se detiene, la cadena de bloques ejecuta una cuenta descentralizada y valida todos los votos. Una vez que se alcanza el consenso, los resultados se emiten y el presupuesto se asigna poco después en un superbloque.
it: Ogni proposta include una descrizione degli obiettivi della proposta, i dettagli del lavoro che verrà svolto e una ripartizione del budget richiesto. Molte proposte si collegano anche al proprio sito web o alla discussione pre-proposta, o includono un video per convalidare l'identità e la sincerità del proprietario della proposta. La discussione su Dash Central avviene sotto queste informazioni ed i proprietari di masternode hanno la possibilità di verificare la loro proprietà di un masternode e la possibilità di esprimere un voto firmando un messaggio dall'indirizzo collaterale del masternode. I Masternode possono votare in qualsiasi momento e anche modificare il proprio voto in qualsiasi momento fino a quando il blocco di cutoff non viene estratto e la votazione si interrompe. Ciò si verifica in 1662 blocchi prima del superblocco. Dopo l'interruzione della votazione, la blockchain esegue un conteggio decentralizzato e convalida tutti i voti. Una volta raggiunto il consenso, i risultati vengono trasmessi e il budget viene assegnato subito dopo in un superblocco.
ru: Каждое предложение включает описание целей заявки, подробную информацию о том, как будет выполняться работа и как будет разбит запрашиваемый бюджет. Многие предложения также ссылаются на собственный веб-сайт или на предварительную дискуссию или добавляют видео для подтверждения личности и честности владельца заявки. Дискуссия о Dash Central расположена за этой информацией ниже, а владельцы мастернод имеют возможность проверить факт владения мастернодой и возможность голосования, подписав сообщение с залогового адреса мастерноды. Мастерноды могут голосовать в любое время, а также менять свой голос в любое время, пока не будет добыт “отсекающий” блок и голосование не прекратится. Такой блок добывается за 1662 блока до генерации суперблока. После остановки голосования блокчейн выполняет децентрализованный подсчёт и проверяет все голоса. После достижения консенсуса результаты транслируются в сеть, а вскоре после генерации суперблока выделяется бюджет.
vi: Mỗi đề xuất cần có một mô tả cho mục tiêu của đề xuất, và chi tiết về cách thức mà công việc sẽ được thực hiện và một bản chi tiết ngân sách được sử dụng ra sao. Rất nhiều đề xuất có liên kết đến trang web hoặc đến trang thảo luận tiền đề xuất, hoặc có chứa một video để xác thực danh tính và tính đáng tin của chủ đề xuất. Những thảo luận trên Dash Central sẽ xuất hiện ở phần dưới của phần thông tin, và các chủ masternode có tùy chọn để xác minh quyền sở hữu của mình đối với masternode và khả năng bỏ phiếu bằng cách ký một thông điệp từ địa chỉ có ký quỹ masternode. Masternodes có thể bỏ phiếu bất cứ lúc nào, và cũng có thể thay đổi phiếu bầu của họ bất cứ lúc nào cho đến thời điểm chốt cuối cùng và việc bỏ phiếu dừng lại. Điều này xảy ra 1662 khối trước khi siêu khối xuất hiện. Sau khi việc bỏ phiếu dừng lại, blockchain thực hiện một kiểm phiếu và xác thực tất cả các phiếu bầu. Một khi đạt được sự đồng thuận, kết quả được phát tán và ngân sách được phân bổ ngay sau đó trong một siêu khối.

source: Proposal details and voting buttons on Dash Central
ar: تفاصيل الاقتراحات وأزرار التصويت في داش سنترال
de: Proposal-Details und Abstimmungsknöpfe auf Dash Central
es: Detalles de propuesta y botones de votación en Dash Central
it: Dettagli della proposta e pulsanti di votazione su Dash Central
ru: Детали предложений и кнопки голосования на Dash Central
vi: Chi tiết về đề xuất và những nút bỏ phiếu trên Dash Central
