Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/using.po
Languages: it, ru

source: DashCentral also includes a tool to create budget proposals, or claim existing proposals so you can add a description on DashCentral and begin discussion with the community. The steps to be taken are almost identical to the procedure described above, and documentation is available `here <https://www.dashcentral.org/about/contact>`_.
it: DashCentral include anche uno strumento per creare proposal di budget o rivendicare proposal esistenti in modo da poter aggiungere una descrizione su DashCentral e iniziare la discussione con la community. I passaggi da eseguire sono quasi identici alla procedura sopra descritta e la documentazione è disponibile `qui <https://www.dashcentral.org/about/contact>`_.
ru: На DashCentral тоже имеется инструментарий для создания бюджетных предложений или работы с уже созданными предложениями, вы можете создать его описание на DashCentral и начать обсуждение с сообществом. Необходимые шаги почти одинаковы с описанными выше. Документация доступна `здесь <https://www.dashcentral.org/about/contact>`_.

source: Creating a proposal using the wallet console follows the same process as using the Dash budget proposal generator, but it requires several additional steps to manually construct the proposal governance object.
it: La creazione di una proposal utilizzando la console del wallet segue lo stesso processo dell'utilizzo del generatore di proposte di budget Dash, ma richiede diversi passaggi aggiuntivi per costruire manualmente l'oggetto di governance della proposal.
ru: Создание предложения с помощью консоли кошелька происходит так же, как и при использовании генератора бюджетных предложений Dash, но при этом требуется несколько дополнительных шагов для ручного создания объекта управления предложением.

source: Assemble the proposal data
it: Raccogliere i dati della proposal
ru: Сбор данных по предложению

source: To prepare a proposal, put the proposal details such as name and payout address into a JSON object similar to the example shown below.
it: Per preparare una proposal, inserisci i dettagli come nome e indirizzo di pagamento in un oggetto JSON simile all'esempio mostrato di seguito.
ru: Чтобы подготовить предложение, поместите данные о предложении, такие как имя и адрес выплаты, в объект JSON, подобный приведенному ниже примеру.

source: Set the ``type`` field to ``1`` for all proposals.
it: Imposta il campo ``tipo`` su ``1`` per tutte le proposal.
ru: Установите поле ``тип`` в значение ``1`` для всех предложений.

source: The ``start_epoch`` and ``end_epoch`` fields are Unix epoch timestamps indicating the time range in which the proposal can receive payments. Typically you will set the ``start_epoch`` to approximately halfway between the superblock where payment is first desired and the preceding one. Set ``end_epoch`` to approximately 2 weeks after the superblock where the final payment is desired. You can use a site like https://www.epochconverter.com/ to convert the start and end dates to the epoch values for these fields.
it: I campi ``start_epoch`` e ``end_epoch`` sono timestamp dell'epoca Unix che indicano l'intervallo di tempo in cui la proposal può ricevere i pagamenti. Tipicamente si imposterà ``start_epoch`` approssimativamente a metà strada tra il superblocco in cui si desidera effettuare il pagamento per primo e quello precedente. Imposta ``end_epoch`` a circa 2 settimane dopo il superblocco in cui si desidera il pagamento finale. Puoi utilizzare un sito come https://www.epochconverter.com/ per convertire le date di inizio e fine nei valori epoch per questi campi.
ru: Поля ``start_epoch`` и ``end_epoch`` представляют собой временные метки Unix epoch, указывающие на диапазон времени, в котором заявка может получать платежи. Обычно значение ``start_epoch`` устанавливается примерно на полпути между суперблоком, в котором впервые требуется произвести платеж, и предыдущим. Задайте ``end_epoch`` примерно через 2 недели после суперблока, в котором желателен последний платеж. Для преобразования начальной и конечной дат в значения эпох для этих полей можно воспользоваться сайтом типа https://www.epochconverter.com/.

source: Serialize the proposal data
it: Serializzare i dati della proposal
ru: Сериализация данных предложения

source: The proposal information must be serialized to hex before it can be submitted to the network. Remove all spaces from the JSON object::
it: Le informazioni sulla proposal devono essere serializzate in formato esadecimale prima di poter essere inviate alla rete. Rimuovi tutti gli spazi dall'oggetto JSON::
ru: Перед отправкой в сеть информация о предложении должна быть сериализована в шестнадцатеричный формат. Удалите все пробелы из объекта JSON::

source: Convert the resulting JSON to its hex equivalent. Sites like https://codebeautify.org/string-hex-converter provide an easy way to do this::
it: Converti il JSON risultante nel suo equivalente esadecimale. Siti come https://codebeautify.org/string-hex-converter forniscono un modo semplice per farlo::
ru: Преобразуйте полученный JSON в его HEX эквивалент. Сайты типа https://codebeautify.org/string-hex-converter предоставляют простой способ сделать это::

source: Prepare the collateral transaction
it: Preparare il collaterale per la transazione
ru: Подготовка транзакции с обеспечением

source: Finally, open your Dash Core wallet console and use the ``gobject prepare`` command to complete the proposal preparation and submit the collateral transaction. See the :ref:`Core developer documentation <core:api-rpc-dash-gobject-prepare>` for additional details.
it: Infine, apri la console del tuo wallet Dash Core e utilizza il comando "gobject prepare" per completare la preparazione della proposal e inviare la transazione del collaterale. Consulta la :ref:`Documentazione principale per gli sviluppatori <core:api-rpc-dash-gobject-prepare>` per ulteriori dettagli.
ru: Наконец, откройте консоль кошелька Dash Core и с помощью команды ``gobject prepare`` завершите подготовку предложения и отправьте транзакцию с обеспечением. Дополнительные сведения см. в :ref:`Документация разработчика Core<core:api-rpc-dash-gobject-prepare>`.

source: Running this command will create a transaction spending 1 DASH from the wallet as collateral for the proposal being created. Only run this command once you have verified all the proposal information. The transaction is not reversible once sent.
it: L'esecuzione di questo comando creerà una transazione che spenderà 1 DASH dal wallet come garanzia per la proposta creata. Esegui questo comando solo dopo aver verificato tutte le informazioni sulla proposal. La transazione non è reversibile una volta inviata.
ru: Выполнение этой команды приведет к созданию транзакции, расходующей 1 DASH из кошелька в качестве обеспечения создаваемого предложения. Выполняйте эту команду только после проверки всей информации о предложении. После отправки транзакция не обратима.

source: ``parent-hash`` - set to ``0``
it: ``parent-hash`` - impostato su ``0``
ru: ``parent-hash`` - установить на ``0``

source: ``revision`` - set to ``1``
it: ``revision`` - impostato su ``1``
ru: ``revision`` - установить на ``1``

source: ``time`` - set to the current Unix epoch time (does not have to be precise)
it: ``time`` - imposta l'ora dell'epoca Unix corrente (non deve essere precisa)
ru: ``time`` - установить на текущее UNIX время эпохи (но не обязательно точно)

source: ``data-hex`` - set to the hex string from the previous step
it: ``data-hex`` - impostato sulla stringa esadecimale del passaggio precedente
ru: ``data-hex`` - устанавливается в HEX строку из предыдущего шага

source: Example command::
it: Comando di esempio::
ru: Пример команды::

source: The command will execute and respond with a transaction ID for the collateral payment::
it: Il comando verrà eseguito e risponderà con un ID transazione per il pagamento collaterale::
ru: Команда будет выполнена и в ответ получит идентификатор транзакции для обеспечения::

source: Submit the proposal
it: Invia la proposal
ru: Отправить предложение

source: Once the transaction has six confirmations, use the ``gobject submit`` command to submit the prepared governance object to the network for voting. See the :ref:`Core developer documentation <core:api-rpc-dash-gobject-submit>` for additional details.
it: Una volta che la transazione ha ricevuto sei conferme, utilizzare il comando "gobject send" per inviare l'oggetto di governance preparato alla rete per la votazione. Consulta la :ref:`Documentazione principale per gli sviluppatori <core:api-rpc-dash-gobject-submit>` per ulteriori dettagli.
ru: Когда транзакция получит шесть подтверждений, используйте команду ``gobject submit`` для отправки подготовленного объекта управления в сеть для голосования. Дополнительные сведения см. в :ref:`Документация разработчика Core <core:api-rpc-dash-gobject-submit>`.

source: ``parent-hash`` - use the same value as in the ``gobject prepare`` command
it: ``parent-hash`` - utilizza lo stesso valore del comando ``gobject prepare``
ru: ``parent-hash`` - использовать то же значение, что и в команде ``gobject prepare``.

source: ``revision`` - use the same value as in the ``gobject prepare`` command
it: ``revision`` - utilizza lo stesso valore del comando ``gobject prepare``
ru: ``revision`` - использовать то же значение, что и в команде ``gobject prepare``.

source: ``time`` - use the same value as in the ``gobject prepare`` command
it: ``time`` - utilizza lo stesso valore del comando ``gobject prepare``
ru: ``time`` - используется то же значение, что и в команде ``gobject prepare``.

source: ``data-hex`` - use the same value as in the ``gobject prepare`` command
it: ``data-hex`` - utilizza lo stesso valore del comando ``gobject prepare``
ru: ``data-hex`` - использовать то же значение, что и в команде ``gobject prepare``.

source: ``fee-txid`` - the transaction ID returned by the ``gobject prepare`` command in the previous step
it: ``fee-txid`` - l'ID della transazione restituito dal comando ``gobject prepare`` nel passaggio precedente
ru: ``fee-txid`` - идентификатор транзакции, полученный командой ``gobject prepare`` на предыдущем шаге

source: The command will execute and respond with a transaction ID for the proposal which can be used to track voting on the proposal::
it: Il comando verrà eseguito e risponderà con un ID transazione per la proposal che può essere utilizzato per tenere traccia del voto sulla proposta::
ru: Команда выполнится и выдаст в ответ идентификатор транзакции для предложения, который может быть использован для отслеживания голосования по данному предложению::

source: Voting on proposals
it: Votazione sulle proposal
ru: Голосование по предложениям

source: **You must vote at least three days before the superblock is created or your vote will not be counted. The exact deadline is 1662 blocks before the superblock.**
it: **Devi votare almeno tre giorni prima della creazione del superblocco altrimenti il tuo voto non verrà conteggiato. La scadenza esatta è 1662 blocchi prima del superblocco.**

source: Voting on DAO proposals is an important part of operating a masternode. Since masternodes are heavily invested in Dash, they are expected to critically appraise proposals each month and vote in a manner they perceive to be consistent with the best interests of the network. Each masternode may vote once on each proposal, and the vote can be changed at any time before the voting deadline. The following sites and tools are available to view and manage proposals and voting:
it: Votare le proposal nella DAO è una parte importante del funzionamento di un masternode. Poiché i masternode investono pesantemente in Dash, ci si aspetta che valutino criticamente le proposal ogni mese e votino in un modo che ritengono coerente con i migliori interessi della rete. Ogni masternode può votare una volta su ciascuna proposal e il voto può essere modificato in qualsiasi momento prima della scadenza della votazione. Per visualizzare e gestire proposal e votazioni sono disponibili i seguenti siti e strumenti:
ru: Голосование по предложениям Dash DAO является важной частью управления мастернодой. Поскольку владельцы мастернод вложили в сеть Dash большие средства, то ожидается, что они каждый месяц критически оценивают предложения и голосуют в соответствии со своим представлением о пользе для сети. Каждая мастернода может проголосовать за предложение лишь единожды, но может изменить свой голос до конца голосования. Доступны следующие сайты и инструменты для просмотра и организации предложений и голосования:

source: For information on how to create a proposal, see :ref:`here <creating-proposals>`.
it: Per informazioni su come creare una proposal, vedere :ref:`qui <creating-proposals>`.
ru: Для информации о том, как создать предложение посмотрите :ref:`here <creating-proposals>`.

source: Many masternode operators store their password-protected masternode private key on `DashCentral <https://www.dashcentral.org>`__ to enable simple voting with a user-friendly interface. The popularity of this site has made it a common place for discussion of the proposals after they are submitted to the governance system. To vote from the DashCentral web interface, first add your masternode private key to your account according to the instructions here. Note that the masternode private key is not the same as the private key controlling the 1000 DASH collateral, so there is no risk of losing your collateral. A separate password is required to unlock the masternode private key for voting, so the risk of the site operator voting in your name is minimal.
it: Molti operatori masternode memorizzano la propria chiave privata masternode protetta da password su `DashCentral <https://www.dashcentral.org>`__ per consentire una votazione semplice con un'interfaccia user-friendly. La popolarità di questo sito lo ha reso un luogo comune per la discussione delle proposal dopo che sono state sottoposte al sistema di governance. Per votare dall'interfaccia web di DashCentral, aggiungi prima la chiave privata masternode al tuo account seguendo le istruzioni qui. Tieni presente che la chiave privata del masternode non è la stessa chiave privata che controlla la garanzia 1000 DASH, quindi non c'è rischio di perdere la garanzia. È necessaria una password separata per sbloccare la chiave privata masternode per votare, quindi il rischio che l'operatore del sito voti a tuo nome è minimo.
ru: Для упрощённого процесса голосования с удобным интефейсом многие операторы мастернод хранят свои защищенные паролем приватные ключи на `DashCentral <https://www.dashcentral.org>`__. Популярность этого сайта сделала его привычным местом для обсуждения предложений после подачи их в систему управления. Для голосования через веб-интерфейс DashCentral, сначала добавьте в ваш профиль приватный ключ мастерноды по инструкции, предложенной здесь. Обратите внимание, что приватный ключ мастерноды не является ключем, который контролирует 1000 DASH, поэтому риска утери вашей суммы, обеспечивающей мастерноду нет. Для разблокирования приватного ключа к голосованию мастерноды необходим отдельный пароль, таким образом риск того, что за вас проголосует оператор сайта минимален.

source: When you are ready to vote, go to the `budget proposals page <https://www.dashcentral.org/budget>`_. Simply click to view the proposals, then click either **Vote YES**, **Vote ABSTAIN** or **Vote NO**.
it: Quando sei pronto per votare, vai alla `pagina delle proposal di budget <https://www.dashcentral.org/budget>`_. È sufficiente fare clic per visualizzare le proposal, quindi fare clic su **Vota SÌ**, **Vota ASTENITI** o **Vota NO**.
ru: Когда вы будете готовы проголосовать, проследуйте на `страницу бюджетных предложений <https://www.dashcentral.org/budget>`_. На предложения можно нажимать для просмотра, далее следует нажать **Vote YES**, **Vote ABSTAIN** или **Vote NO**.

source: Voting interface on DashCentral
it: Interfaccia di voto su DashCentral
ru: Интерфейс голосований на DashCentral

source: If you started your masternode from a hardware wallet using `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, you can also use the tool to cast votes. Click **Tools > Proposals** and wait for the list of proposals to load. You can easily see the voting status of each proposal, and selecting a proposal shows details on the **Details** tab in the lower half of the window. Switch to the **Vote** tab to **Vote Yes**, **Vote No** or **Vote Abstain** directly from DMT.
it: Se hai avviato il tuo masternode da un wallet hardware utilizzando `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, puoi anche utilizzare lo strumento per esprimere voti. Fai clic su **Strumenti > Proposal** e attendi il caricamento dell'elenco delle proposal. Puoi vedere facilmente lo stato della votazione di ciascuna proposal e selezionandone una vengono visualizzati i dettagli nella scheda **Dettagli** nella metà inferiore della finestra. Passa alla scheda **Vota** per **Votare Sì**, **Vota No** o **Vota Astenersi** direttamente da DMT.
ru: Если вы запустили мастерноду из физического кошелька, используя `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, то с помощью этого инструмента тоже можно проводить голосование. Нажмите **Tools > Proposals** и дождитесь, пока загрузится список предложений. Статус голосования по каждому предложению виден сразу, а выбор предложения покажет подробности во вкладке **Details** в нижней части окна. Чтобы проголосовать напрямую из DMT, перейдите во вкладку **Vote**, чтобы **Vote Yes**, **Vote No** или **Vote Abstain**.

source: Voting interface in DMT
it: Interfaccia di voto in DMT
ru: Интерфейс голосования в DMT

source: Dash Core wallet or masternode
it: Dash Core wallet o masternode
ru: Кошелёк Dash Core или мастернода

source: If you started your masternode using the Dash Core Wallet (not recommended), you can vote manually from **Window > Console**, or directly from your masternode via SSH using ``dash-cli``. First click on the proposal you want to vote on at either `DashCentral <https://www.dashcentral.org/budget>`__ or `Dash Ninja <https://www.dashninja.pl/governance.html>`__. You will see a command for manual voting below the proposal description. Copy and paste the command and modify it as necessary. As an example, take this proposal from `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ (or `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). The voting code for Dash Core Wallet is as follows::
it: Se hai avviato il tuo masternode utilizzando Dash Core Wallet (non consigliato), puoi votare manualmente da **Finestra > Console** o direttamente dal tuo masternode tramite SSH utilizzando ``dash-cli``. Per prima cosa fai clic sulla proposal che desideri votare su `DashCentral <https://www.dashcentral.org/budget>`__ o `Dash Ninja <https://www.dashninja.pl/governance.html>`__ . Vedrai un comando per la votazione manuale sotto la descrizione della proposal. Copia e incolla il comando e modificalo se necessario. Ad esempio, prendi questa proposal da `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ (o `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). Il codice di voto per Dash Core Wallet è il seguente::
ru: Если вы запустили свой мастернод с помощью кошелька Dash Core Wallet (не рекомендуется), вы можете проголосовать вручную из **Window > Console** или непосредственно с вашего мастернода через SSH с помощью ``dash-cli``. Сначала щелкните на предложении, за которое вы хотите проголосовать, на сайте `DashCentral <https://www.dashcentral.org/budget>`__ или `Dash Ninja <https://www.dashninja.pl/governance.html>`__. Под описанием предложения вы увидите команду для ручного голосования. Скопируйте и вставьте эту команду, изменив ее при необходимости. В качестве примера можно привести предложение от `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ (или `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). Код голосования для кошелька Dash Core Wallet выглядит следующим образом::

source: Note that to vote from your masternode directly, you need to prefix the command with ``dash-cli``, which is usually found in the ``.dashcore`` folder. The command should be similar to the following::
it: Tieni presente che per votare direttamente dal tuo masternode, devi anteporre al comando ``dash-cli``, che di solito si trova nella cartella ``.dashcore``. Il comando dovrebbe essere simile al seguente::
ru: Обратите внимание, что для голосования напрямую из мастерноды, перед командой будет необходим префикс ``dash-cli``, его легко можно найти в попке ``.dashcore``. Команда должна быть похожа на следующую::

source: Note this command will trigger a vote from all masternodes configured in ``dash.conf``. If you have multiple masternodes each with its own .conf file, or if you want to vote with only some of your masternodes, you must change the command from ``vote-many`` to ``vote``. If your vote was successful, you should see a confirmation message reading **Voted successfully**.
it: Nota che questo comando attiverà un voto da tutti i masternode configurati in ``dash.conf``. Se hai più masternode ciascuno con il proprio file .conf, o se vuoi votare solo con alcuni dei tuoi masternode, devi cambiare il comando da ``vote-many`` a ``vote``. Se il tuo voto ha avuto successo, dovresti vedere un messaggio di conferma con la scritta **Votato con successo**.
ru: Обратите внимание, что эта команда активирует голос всех мастернод, сконфигурированных в ``dash.conf``. Если у вас несколько мастернод и у каждой есть свой .conf файл, или если вы хотите проголосовать лишь некоторыми из ваших мастернод, то необходимо изменить команду с ``vote-many`` на ``vote``. Если ваш голос успешно прошёл, то появится подтверждающее сообщение **Voted successfully**.

source: Voting from the debug console in Dash Core Wallet
it: Votazione dalla console di debug in Dash Core Wallet
ru: Голосование через консоль отладки в кошельке Dash Core

source: You can also view a list of proposals in JSON format from the console to copy and paste the proposal hash for voting as follows::
it: Puoi anche visualizzare un elenco delle proposal in formato JSON dalla console per copiare e incollare l'hash della proposal per votare come segue:
ru: Список предложений так же доступен в формате JSON из консоли, для голосования туда можно скопировать и вставить хэш предложения следющим образом::

source: Delegating votes
it: Delegare i voti
ru: Делегирование права голоса
