Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/using.po
Languages: it, ru

source: Masternodes feature a key designated only for voting, which makes it possible to delegate your vote to a representative. Simply enter a Dash address provided by the delegate when :ref:`registering your masternode <masternode-setup>`, or :ref:`update <dip3-update-registrar>` your masternode registration to delegate the vote of a running masternode. The wallet controlling the private key to this address will then cast votes on behalf of this masternode owner simply by following the :ref:`Dash Core voting procedure <dash-core-voting>` described above. No further configuration is required.
it: I Masternode sono dotati di una chiave destinata esclusivamente al voto, che consente di delegare il proprio voto a un rappresentante. Inserisci semplicemente un indirizzo Dash fornito dal delegato quando :ref:`registra il tuo masternode <masternode-setup>`, o :ref:`aggiorna <dip3-update-registrar>` la registrazione del tuo masternode per delegare il voto di un masternode in esecuzione. Il wallet che controlla la chiave privata di questo indirizzo voterà quindi per conto del proprietario di questo masternode semplicemente seguendo la :ref:`procedura di voto Dash Core<dash-core-voting>` descritta sopra. Non è necessaria alcuna ulteriore configurazione.
ru: Мастерноды имеют ключ, предназначенный только для голосования, что позволяет делегировать свой голос представителю. Для делегирования голоса работающего мастернода достаточно ввести Dash-адрес, указанный делегатом при :ref:`регистрации мастернода <masternode-setup>` или :ref:`обновлении регистрации мастернода <dip3-update-registrar>`. Кошелек, контролирующий приватный ключ этого адреса, будет голосовать от имени владельца этого мастернода, просто следуя описанной выше процедуре голосования :ref:`Dash Core <dash-core-voting>`. Никакой дополнительной настройки не требуется.

source: Dash Budget Proposal Generator
ru: Создатель бюджетных предложений Dash

source: DashCentral Proposal Generator
ru: Создатель бюджетных предложений DashCentral

source: Dash Core Wallet Console
ru: Консоль кошелька Dash Core

source: `Dash Ninja - Governance <https://www.dashninja.pl/governance.html>`__
ru: `Dash Ninja - Управление <https://www.dashninja.pl/governance.html>`__

source: `Dash Masternode Tool - Proposals <https://github.com/Bertrand256/dash-masternode-tool/releases>`__
ru: `Dash Masternode Tool - Предложения <https://github.com/Bertrand256/dash-masternode-tool/releases>`__
