Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/governance/using.po
Languages: it, ru

source: Practical guide to using the Dash DAO governance system and treasury
it: Guida pratica all'utilizzo del sistema di governance e tesoreria Dash DAO
ru: Практическое руководство по использованию системы управления Dash DAO и Бюджетной системы

source: dash, dao, governance, funding, voting, proposals, masternodes
it: dash, dao, governance, fondi, voti, proposal, masternodes
ru: dash, dao, управление, финансирование, голосование, предложения, мастерноды

source: Using Dash Governance
it: Utilizzo di Dash Governance
ru: Использование Управления Dash

source: Dash's Decentralized Autonomous Organization (DAO) is a novel voting and funding platform. This documentation introduces and details the theory and practice to use the system.
it: L'Organizzazione Autonoma Decentralizzata (DAO) di Dash è una nuova piattaforma di voto e finanziamento. Questa documentazione introduce e descrive in dettaglio la teoria e la pratica per utilizzare il sistema.
ru: Децентрализованная автономная организация (DAO) Dash - это новая платформа для голосования и финансирования. В данной документации представлены и подробно описаны теория и практика использования этой системы.

source: Understanding the process
it: Capire il processo
ru: Понимание процесса

source: Introduction
it: Introduzione
ru: Введение

source: DAO consists of three components: Proposals, Votes, and Budgets
it: La DAO è costituita da tre componenti: proposal, voti e budget
ru: DAO состоит из трех компонентов: Предложения, Голосования и Бюджеты

source: Anyone can submit a proposal for a small fee
it: Chiunque può presentare una proposta pagando una piccola imposta
ru: Каждый может выдвинуть предложение, заплатив небольшую комиссию

source: Each valid masternode can vote for, against or abstain on proposals
it: Ogni masternode convalidato può votare pro, contro o astenersi sulle proposte
ru: Каждая активная мастернода может отдать свой голос за или против предложения, или же воздержаться

source: Approved proposals become budgets
it: Le proposte approvate divengono budget
ru: Одобренные предложения приобретают статус бюджетов

source: Budgets are paid directly from the blockchain to the proposal owner
it: I budget vengono versati dalla blockchain direttamente al proprietario della proposta
ru: Бюджеты выплачиваются владельцу предложения непосредственно из блокчейна

source: Proposals
it: Proposte
ru: Предложения

source: Proposals are a request to receive funds
it: Le proposte sono un richiesta per ricevere finanziamenti
ru: Предложения это запросы на получение средств

source: Proposals can be submitted by anyone for a fee of 1 Dash. The proposal fee is irreversibly destroyed on submission.
it: Le proposal possono essere presentate da chiunque per una commissione di 1 Dash. La tariffa della proposal viene distrutta irreversibilmente al momento della presentazione.
ru: Каждый может подать предложение, заплатив комиссию в 1 DASH. В момент подачи эта комиссия необратимо сжигается.

source: Proposals cannot be altered once submitted
it: Le proposte non possono essere modificate una volta presentate
ru: Поданное предложение не подлежит изменению

source: Votes
it: Voti
ru: Голосования

source: Votes are cast using the registered voting address
it: I voti vengono espressi utilizzando l'indirizzo di voto registrato
ru: Голосование происходит через зарегистрированный адрес для голосования

source: The voting address can be delegated to a third party
it: L'indirizzo di voto può essere delegato a terzi
ru: Адрес для голосования можно передать третьему лицу

source: Votes can be changed at any time
it: I voti possono essere modificati in qualsiasi momento
ru: Мастерноды могут изменить свой голос в любое время

source: Votes are counted every 16616 blocks (approx. 30.29 days)
it: I voti vengono conteggiati ogni 16616 blocchi (circa 30,29 giorni)
ru: Голоса подсчитываются каждые 16616 блоков (примерно 30.29 дней)

source: Budgets
it: Budget
ru: Бюджеты

source: Budgets are proposals which receive a net total of yes votes equal to or greater than 10% of the total possible votes (for example over 448 out of 4480)
it: I budget sono proposte che ricevono un totale netto di voti favorevoli pari o superiore al 10% del totale dei voti possibili (ad esempio oltre 448 su 4480)
ru: Бюджеты это предложения, которые получили общее число голосов "за" большее либо равное 10% всех возможных голосов (например 448 из 4480)

source: Budgets can be nullified at any time if vote totals (cast or re-cast) fall below the approval threshold
it: I budget possono essere annullati in qualsiasi momento se i totali dei voti (espressi o ripetuti) scendono al di sotto della soglia di approvazione
ru: Бюджеты могут быть обнулены в любое время, если общее число голосов "за" (поданных изначально или изменённых в последствии) упадёт за пределы, установленные для статуса "одобренного" предложения

source: Budgets are processed (paid) in order of yes minus no votes. More popular budgets get payment priority.
it: I budget vengono elaborati (pagati) in ordine di voti sì meno no. I budget più popolari ottengono la priorità di pagamento.
ru: Бюджеты обрабатываются (выплачиваются) в зависимости от разницы между голосами "за" и "против". Более популярные бюджеты получают приоритетную выплату.

source: Approximately 6176 dash (in 2018) are available for each budget cycle, decreasing by 7.14% every 210240 blocks (approx. 383.25 days).
it: Per ogni ciclo di budget sono disponibili circa 6176 dash (nel 2018), con una diminuzione del 7,14% ogni 210240 blocchi (circa 383,25 giorni).
ru: Приблизительно 6176 DASH (в 2018 г) доступно в каждом бюджетном цикле, но эта сумма будет уменьшаться на 7,14% каждые 210240 блоков (примерно 383,25 дня).

source: Object structure
it: Struttura dell'oggetto
ru: Структура предмета

source: The following information is required to create a proposal:
it: Le seguenti informazioni sono necessarie per creare una proposta:
ru: Для создания предложения необходима следующая информация:

source: proposal-name: a unique label, 20 characters or less
it: nome-proposta: un'etichetta univoca, 20 caratteri o meno
ru: proposal-name: название должно быть уникальным, менее 20 символов

source: url: a proposer-created webpage or forum post containing detailed proposal information
it: url: una pagina web creata dal proponente o un post del forum contenente informazioni dettagliate sulla proposta
ru: url: веб-страница, созданная для предложения или пост на форуме, имеющий в себе подробную информацию о предложении

source: payment-count: how many cycles the proposal is requesting payment
it: payment-count: in quanti cicli la proposta richiede il pagamento
ru: payment-count: на протяжении скольких циклов это предложение запрашивает выплаты

source: block-start: the requested start of proposal payments
it: block-start: l'inizio richiesto dei pagamenti della proposal
ru: block-start: время начала выплат по предложению

source: dash-address: the address to receive proposal payments
it: dash-address: l'indirizzo al quale ricevere i pagamenti della proposal
ru: dash-address: адрес для получения выплат по предложению

source: monthly-payment-dash: the requested payment amount
it: dash-pagamento-mensile: l'importo del pagamento richiesto
ru: monthly-payment-dash: сумма, запрашиваемая в месяц

source: Persistence
it: Persistenza
ru: Продолжительность

source: Proposals become active one day after submission
it: Le proposal diventano attive un giorno dopo l'invio
ru: Предложения получают статус активных через один день после подачи

source: Proposals will remain visible on the network until they are either disapproved or the proposal's last payment-cycle is reached
it: Le proposal rimarranno visibili sulla rete finché non verranno disapprovate o finché non verrà raggiunto l'ultimo ciclo di pagamento della proposal
ru: Предложения будут видимы в сети до тех пор пока не потеряют поддержку или не будет достигнут последний цикл выплат

source: Approval occurs when yes votes minus no votes equals 10% or more of the total available votes.
it: L'approvazione avviene quando i voti sì meno i voti no equivalgono al 10% o più del totale dei voti disponibili.
ru: Одобрение предложения происходит, когда разница между голосами "да" и "нет" равна или более 10% от всех доступных голосов.

source: Disapproval occurs when no votes minus yes votes equals 10% or more of the total available votes.
it: La disapprovazione si verifica quando i voti negativi meno i voti positivi equivalgono al 10% o più del totale dei voti disponibili.
ru: Отклонение происходит, когда разница между голосами "нет" и "да" равна или более 10% от всех доступных голосов.

source: The total available votes is the count of online and responding masternodes and can be seen by running the command ``masternode count`` in the Dash Core wallet debug window. A graph of the total masternode count can be found `here <http://178.254.23.111/~pub/masternode_count.png>`__
it: Il totale dei voti disponibili corrisponde al conteggio dei masternode online e di risposta e può essere visualizzato eseguendo il comando "masternode count" nella finestra di debug del portafoglio Dash Core. Un grafico del conteggio totale dei masternode può essere trovato `qui <http://178.254.23.111/~pub/masternode_count.png>`__
ru: Общее число доступных голосов считается по количеству работающих в сети и отвечающих на запросы мастернод. Это число можно увидеть, запустив команду "masternode count" в окне отладки кошелька Dash Core. Гафик общего числа мастернод можно найти `здесь <http://178.254.23.111/~pub/masternode_count.png>`__

source: Templates
it: Modelli
ru: Заготовки

source: The following two Microsoft Word templates are available from Dash Core Group to help facilitate standardized proposal submission and updates. Usage is recommended, but not required.
it: I due modelli Microsoft Word seguenti sono disponibili presso Dash Core Group per facilitare l'invio e gli aggiornamenti di proposal standardizzate. L'utilizzo è consigliato, ma non obbligatorio.
ru: Для стандартизации процесса подачи и обновления бюджетных предложений Dash Core Group подготовила два шаблона Microsoft Word. Их использование рекомендовано, но не обязательно.

source: `Project Proposal Template <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v2.0.docx>`_
it: `Modello di proposal di un progetto <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v2.0.docx>`_
ru: `Шаблон проекта предложения <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v2.0.docx>`_

source: `Project Status Update Template <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v2.0.docx>`_
it: `Modello di aggiornamento dello stato del progetto <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v2.0.docx>`_
ru: `Шаблон новостей хода проекта <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v2.0.docx>`_

source: Budget cycles
it: Budget del ciclo
ru: Бюджетные циклы

source: When preparing a proposal, be aware of when the next cycle will occur and plan accordingly. It is recommended to choose your proposal payment start block at least one cycle in the future to allow time for discussion and gathering support and votes. Note that votes will no longer be tallied 1662 blocks (approximately 3 days) prior to the superblock.
it: Quando prepari una proposal, tieni presente quando si verificherà il ciclo successivo e pianifica di conseguenza. Si consiglia di scegliere di bloccare l'inizio del pagamento della proposal almeno un ciclo nel futuro per concedere tempo alla discussione e raccogliere supporto e voti. Tieni presente che i voti non verranno più conteggiati 1662 blocchi (circa 3 giorni) prima del superblocco.
ru: При подготовке предложения, осведомитесь, когда начнётся следующий цикл и действуйте в нужное время. Рекомендуется выбирать блок начала выплат по предложению как минимум через один цикл вперёд, для предоставления времени на обсуждение, набор поддержки и голосование. Обратите внимание, что голоса перестанут подсчитываться за 1662 блока (примерно 3 дня) перед суперблоком.

source: Block height
it: Altezza del blocco

source: Approximate date
it: Data approssimativa

source: Thu Jan 30 02:38:52 UTC 2020
it: Gio 30 gennaio 02:38:52 UTC 2020

source: Sat Feb 29 09:43:54 UTC 2020
it: Sab 29 febbraio 09:43:54 UTC 2020

source: Mon Mar 30 16:48:56 UTC 2020
it: Lun 30 marzo 16:48:56 UTC 2020

source: Wed Apr 29 23:53:58 UTC 2020
it: Mer 29 aprile 23:53:58 UTC 2020

source: Sat May 30 06:59:00 UTC 2020
it: Sab 30 maggio 06:59:00 UTC 2020

source: Mon Jun 29 14:04:02 UTC 2020
it: Lun 29 giugno 14:04:02 UTC 2020

source: Wed Jul 29 21:09:04 UTC 2020
it: Mer 29 luglio 21:09:04 UTC 2020

source: Sat Aug 29 04:14:06 UTC 2020
it: Sab 29 agosto 04:14:06 UTC 2020

source: Mon Sep 28 11:19:08 UTC 2020
it: Lun 28 settembre 11:19:08 UTC 2020

source: Wed Oct 28 18:24:10 UTC 2020
it: Mer 28 ottobre 18:24:10 UTC 2020

source: Sat Nov 28 01:29:12 UTC 2020
it: Sab 28 novembre 01:29:12 UTC 2020

source: Mon Dec 28 08:34:14 UTC 2020
it: Lun 28 dicembre 08:34:14 UTC 2020

source: You can view the source code for this calculation at this `GitHub gist <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_
it: Puoi visualizzare il codice sorgente per questo calcolo in questo `GitHub gist <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_
ru: Вы можете посмотреть исходный код подсчётов на `GitHub gist <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_

source: Creating proposals
it: Creazione di proposal
ru: Создание предложений

source: Once you have prepared the text of your proposal and set up a website or forum post, it is time to submit your proposal to the blockchain for voting. While all tasks involved with creating a budget proposal can be executed from the Dash Core wallet console, several tools providing a user interface have been developed to simplify this procedure.
it: Dopo aver preparato il testo della tua proposal e impostato un sito web o un post sul forum, è il momento di inviarla alla blockchain per la votazione. Sebbene tutte le attività coinvolte nella creazione di una proposal di budget possano essere eseguite dalla console del wallet Dash Core, sono stati sviluppati diversi strumenti che forniscono un'interfaccia utente per semplificare questa procedura.
ru: Как только вы подготовите текст вашего предложения и создадите веб-сайт или пост на форуме, то наступит время подачи вашего предложения в блокчейн для голосования. Все действия по созданию бюджетного предложения могут быть выполнены из консоли кошелька Dash Core, но для облегчения процедуры были разработаны несколько инструментов с пользовательским интерфейсом.

source: The `Dash Budget Proposal Generator <https://proposal.dash.org>`__ supports creating budget proposals on both mainnet and testnet. In the first step, you must enter a short, clear and unique name for the proposal as it will appear on the blockchain. Proposal names are limited to 40 characters. You can then provide a link to the forum or DashCentral where your proposal is described in more detail (use a `URL shortening service <https://bitly.com>`_ if necessary), as well as select the amount of payment you are requesting, how often the payment should occur, and the superblock date on which you are requesting payment. This allows you to control in which budget period your proposal will appear, and gives you enough time to build support for your proposal by familiarising voters with your project. Note that the payment amount is fixed and cannot be modified after it has been submitted to the blockchain.
it: Il `Dash Budget Proposal Generator <https://proposal.dash.org>`__ supporta la creazione di proposal di budget sia su mainnet che su testnet. Nel primo passaggio, devi inserire un nome breve, chiaro e univoco per la proposal così come apparirà sulla blockchain. I nomi sono limitati a 40 caratteri. Puoi quindi fornire un collegamento al forum o a DashCentral in cui la tua proposal è descritta in modo più dettagliato (utilizza un `servizio di abbreviazione URL <https://bitly.com>`_ se necessario), nonché selezionare l'importo del pagamento che stai richiedendo, la frequenza con cui dovrebbe avvenire e la data del superblocco in cui richiedi il pagamento. Ciò ti consente di controllare in quale periodo di budget apparirà la tua proposal e ti dà tempo sufficiente per creare sostegno familiarizzando gli elettori con il tuo progetto. Tieni presente che l'importo del pagamento è fisso e non può essere modificato dopo essere stato inviato alla blockchain.
ru: `Создатель бюджетных предложений Dash <https://proposal.dash.org>`__ поддерживает создание предложений как в основной, так и в тестовой сети. В первом шаге от вас потребуется ввести короткое, ясное, уникальное название предложения, под которым оно появится в блокчейне. Название предложения ограничено 40 символами. Далее вы можете предоставить ссылку на форум или DashCentral, где ваше предложение обсуждается в подробностях (используйте `службу укорочения url <https://bitly.com>`_ при необходимости), после чего выбрать запрашиваемую сумму, частоту выплат и дату суперблока, с которого вы хотите получить выплаты. Это позволит вам контролировать, в каком бюджетном периоде появится ваше предложение и даст вам достаточно времени для получения поддержки через ознакомление голосующих с вашим проектом. Обратите внимание, что величина выплаты зафиксирована и не может быть изменена после подачи в блокчейн.

source: Steps 1 & 2: Creating your proposal and preparing the command
it: Passaggi 1 e 2: creazione della proposal e preparazione del comando
ru: Шаги 1 и 2: Создание вашего предложения и подготовка команд

source: Next, the proposal generator will provide you with a command to run from the console of your Dash Core wallet to prepare your budget proposal governance object. Running this command will cost you 1 DASH, which will be "burnt" or permanently removed from circulation. This one-time fee protects the governance system from becoming overwhelmed by spam, poorly thought out proposals or users not acting in good faith. A small transaction fee is charged as well, so make sure slightly more than 5 DASH is available in your wallet. Many budget proposals request reimbursement of the 1 DASH fee.
it: Successivamente, il generatore di proposal ti fornirà un comando da eseguire dalla console del tuo wallet Dash Core per preparare l'oggetto di governance della proposal di budget. L'esecuzione di questo comando ti costerà 1 DASH, che verrà "bruciato", rimosso definitivamente dalla circolazione. Questa tariffa una tantum protegge il sistema di governance dall'essere sopraffatto dallo spam, da proposal mal concepite o da utenti che non agiscono in buona fede. Viene addebitata anche una piccola commissione di transazione, quindi assicurati che nel tuo wallet siano disponibili poco più di 5 DASH. Molte proposal di budget richiedono il rimborso della tariffa 1 DASH.
ru: Далее, создатель предложений выдаст вам команду, которую необходимо запустить в консоли вашего кошелька Dash Core для подготовки объекта вашего бюджетного предложения. Запуск этой команды будет стоить вам 1 DASH, которые "сожгутся", это означает, что они будут навсегда удалены из денежной массы. Такая единоразовая плата защищет систему управления от "спама" из предложений, плохо продуманных предложений или пользователей, действующих из недобросовестных побуждений. Так же будет взята небольшая комиссия за транзакцию, поэтому проследите, чтобы в кошельке было чуть более 1 DASH. Многие бюджетные предложения запрашивают возмещение потраченных 1 DASH.

source: First unlock your wallet by clicking **Settings > Unlock wallet**, then open the console by clicking **Window > Console** and paste the generated command. The transaction ID will appear. Copy and paste this into the proposal generator response window. As soon as you do this, the system will show a progress bar as it waits for 6 confirmations as follows:
it: Per prima cosa sblocca il tuo wallet facendo clic su **Impostazioni > Sblocca wallet**, quindi apri la console facendo clic su **Finestra > Console** e incolla il comando generato. Verrà visualizzato l'ID della transazione. Copialo e incollalo nella finestra di risposta del generatore di proposal. Non appena lo fai, il sistema mostrerà una barra di avanzamento mentre attende 6 conferme come segue:
ru: В первую очередь разблокируйте кошелёк, нажав **Settings > Unlock wallet**, далее откройте консоль, нажав на **Window > console** и скопируйте сгенерированную команду. Появится ID транзакции. Скопируйте и вставьте его в окно ответа создателя предложений. Как только вы это сделаете, то система покажет полоску прогресса с ожиданием 6 необходимых подтверждений:

source: Step 3: Creating the proposal transaction and waiting for 6 confirmations of the transaction ID
it: Passaggio 3: creazione della transazione di proposal e attesa di 6 conferme dell'ID della transazione
ru: Шаг 3: Создание транзакции предложения и ожидание 6 подтверждений ID транзакции

source: Once 6 block confirmations exist, another command will appear to submit the prepared governance object to the network for voting. Copy and paste this command, and your governance object ID will appear as follows:
it: Una volta che esistono 6 conferme di blocco, apparirà un altro comando per inviare l'oggetto di governance preparato alla rete per la votazione. Copia e incolla questo comando e l'ID dell'oggetto di governance verrà visualizzato come segue:
ru: Когда выйдет подтверждение 6-го блока, появится ещё одна команда для подачи подготовленного объекта управления в сеть на голосование. Скопируйте и вставьте эту команду и появится ваш ID управления:

source: Step 4: Submitting the governance object to the network
it: Passaggio 4: invio dell'oggetto di governance alla rete
ru: Шаг4: Подача объекта управления в сеть

source: You can use this ID to track voting on the proposal until the budget closes and you receive your payout. You can also submit the ID to DashCentral to claim your proposal and enable simplified voting for masternodes using DashCentral voting services.
it: Puoi utilizzare questo ID per tenere traccia del voto sulla proposal fino alla chiusura del budget e alla ricezione del pagamento. Puoi anche inviare l'ID a DashCentral per rivendicarla e abilitare la votazione semplificata per i masternode utilizzando i servizi di voto di DashCentral.
ru: Вы можете использовать этот ID, чтобы следить за процессом голосования до тех пор, пока не закроется бюджет и вам не поступит выплата. Дополнительно, вы можете отправить ID в DashCentral, чтобы подтвердить себя как владельца предложения и использовать там упрощённый процесс голосоввания мастернод.
