Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/android/advanced-functions.po
Languages: fr, it

source: Set up address book, exchange rates, sweep paper wallets and change settings in the Dash Android wallet.
fr: Configurer un carnet d'adresses, taux de conversion, récupérations de portefeuille papier et modification de réglages dans le portefeuille logiciel Dash pour Android.
it: Imposta la rubrica, i tassi di cambio, pulisci i paper wallet e modifica le impostazioni nel wallet Dash Android.

source: dash, mobile, wallet, android, address book, paper, exchange rates
fr: dash, mobile, portefeuille, android, carnet d'adresses, papier, taux de conversion
it: dash, mobile, wallet, android, rubrica, paper, tassi di cambio

source: Advanced functions
fr: Fonctions avancées
it: Funzioni avanzate

source: Address book
fr: Carnet d'adresses
it: Rubrica

source: Your Android wallet allows you to manage frequently used addresses by adding a label to help you identify the owner. You can also label your own addresses in the wallet in order to keep track of regular incoming payments. You can access the address book by tapping the **Menu button**, then **Address book**. This will display a screen where you can swipe left and right between your own addresses and the addresses to which you frequently send Dash, such as family members for example. Tap the **More options** button to **Paste from clipboard** or to **Scan address** from a QR code, or tap an existing address to **Send Dash** or **Edit** the label.
fr: Votre portefeuille Android vous permet de gérer les adresses souvent utilisées en leur attribuant une étiquette, utile pour identifier leur propriétaire. Vous pouvez aussi étiqueter vos propres adresses dans le portefeuille, afin de garder trace des paiements entrants récurrents. Vous pouvez accéder au carnet d'adresses en touchant le **bouton Menu** puis **Carnet d'adresses**. Cela affichera un écran où vous pouvez balayer à gauche ou à droite entre vos propres adresses et celles auxquelles vous envoyez fréquemment des dashs, telles que par exemple celles des membres de votre famille. Touchez le bouton **Plus d'options** pour **Coller depuis le presse-papiers** ou pour **Scanner une adresse** depuis un QR-code, ou bien touchez une adresse déjà existante pour **Envoyer des dashs** ou **Modifier** l'étiquette.
it: Il tuo wallet Android ti consente di gestire gli indirizzi utilizzati di frequente aggiungendo un'etichetta per aiutarti a identificare il proprietario. Puoi anche etichettare i tuoi indirizzi nel portafoglio per tenere traccia dei pagamenti regolari in entrata. Puoi accedere alla rubrica toccando il **pulsante Menu**, quindi **Rubrica**. Verrà visualizzata una schermata in cui puoi scorrere verso sinistra e destra tra i tuoi indirizzi e gli indirizzi a cui invii frequentemente Dash, ad esempio i membri della famiglia. Tocca il pulsante **Altre opzioni** per **Incollare dagli appunti** o per **Scansionare l'indirizzo** da un QR code oppure tocca un indirizzo esistente per **Invia Dash** o **Modifica** l'etichetta .

source: *Accessing the address book and adding an address*
fr: *Accès au carnet d'adresses et ajout d'une adresse*
it: *Accesso alla rubrica e aggiunta di un indirizzo*

source: You can also add labels directly from the main transaction history screen by tapping the **More options** button for the transaction (three vertical dots) and selecting either **Add label to your address**, **Edit label of your address**, **Add sending address** or **Edit label of sending address**.
fr: Vous pouvez également ajouter directement des étiquettes depuis l'écran principal de l'historique de transactions, en touchant le bouton **Plus d'options** de la transaction (trois points verticaux) et en choisissant soit **Ajouter une étiquette à votre adresse**, **Modifier l'étiquette de votre adresse**, **Ajouter une adresse d'envoi** ou **Modifier l'étiquette de l'adresse d'envoi**.
it: Puoi anche aggiungere etichette direttamente dalla schermata principale della cronologia delle transazioni toccando il pulsante **Altre opzioni** per la transazione (tre punti verticali) e selezionando **Aggiungi etichetta al tuo indirizzo**, **Modifica etichetta del tuo indirizzo **, **Aggiungi indirizzo mittente** o **Modifica etichetta indirizzo mittente**.

source: *Adding and editing address labels in transaction view*
fr: *Ajout et modification d'étiquettes d'adresse dans l'écran de transactions*
it: *Aggiunta e modifica delle etichette degli indirizzi nella visualizzazione delle transazioni*

source: Exchange rates
fr: Taux de conversion
it: Tassi di cambio

source: Dash Wallet for Android allows you to display the equivalent value of your Dash balance and in transactions by selecting a default fiat currency. To select a default currency, tap the **Menu button**, then **Exchange rates**. Find your preferred fiat currency, then tap the **More options** button for that currency and select **Set as default**. The exchange rate for this currency will appear when sending Dash, and you can also tap in the fiat currency field to enter the value in the fiat currency directly, instead of in Dash.
fr: Le portefeuille logiciel Dash pour Android vous permet d'afficher la valeur convertie de votre solde Dash et de vos transactions, en choisissant une monnaie fiduciaire par défaut. Pour choisir une monnaie par défaut, touchez le **bouton Menu** puis **Taux de conversion**. Trouvez votre monnaie fiduciaire préférée, puis touchez le bouton **Plus d'options** pour cette monnaie et choisissez **Choisir par défaut**. Le taux de conversion de cette monnaie apparaîtra à l'envoi de dashs, et vous pouvez également toucher le champ de la monnaie fiduciaire pour saisir directement une valeur en monnaie fiduciaire plutôt qu'en dashs.
it: Dash Wallet per Android ti consente di visualizzare il valore equivalente del tuo saldo Dash e nelle transazioni selezionando una valuta fiat predefinita. Per selezionare una valuta predefinita, tocca il **pulsante Menu**, quindi **Tassi di cambio**. Trova la tua valuta fiat preferita, quindi tocca il pulsante **Altre opzioni** per quella valuta e seleziona **Imposta come predefinito**. Il tasso di cambio per questa valuta verrà visualizzato durante l'invio di Dash e puoi anche toccare il campo della valuta fiat per inserire direttamente il valore nella valuta fiat, anziché in Dash.

source: *Selecting a fiat exchange rate and creating a transaction denominated in USD*
fr: *Choix d'un taux de conversion fiduciaire et création d'une transaction libellée en dollars américains*
it: *Selezione di un tasso di cambio fiat e creazione di una transazione denominata in USD*

source: Masternode keys
it: Chiavi masternode

source: Certain masternode keys may be generated and stored in Dash Wallet. To access these keys, tap the **Menu button** and select **Tools**. Tap **Masternode Keys** and enter your PIN to open the Masternode Keys screen. From here, tap on any of the listed key types to view existing keys or generate new ones. The screen will show all used keys and the first unused one. To generate additional keys, tap the **+** button.
it: Alcune chiavi masternode possono essere generate e archiviate in Dash Wallet. Per accedere a questi tasti, tocca il **pulsante Menu** e seleziona **Strumenti**. Tocca **Chiavi Masternode** e inserisci il tuo PIN per aprire la schermata Chiavi Masternode. Da qui, tocca uno qualsiasi dei tipi di chiave elencati per visualizzare le chiavi esistenti o generarne di nuove. Lo schermo mostrerà tutte le chiavi utilizzate e la prima non utilizzata. Per generare chiavi aggiuntive, tocca il pulsante **++**.

source: *Viewing and generating masternode keys*
it: *Visualizzazione e generazione delle chiavi masternode*

source: Sweep paper wallet
fr: Récupération de portefeuille papier
it: Pulisci paper wallet

source: Sweeping a paper wallet is a method of transferring the value stored on an address you may have received as a paper wallet or from an ATM into your own wallet. You must have access to the private key for an address to use this function. In this process, all Dash stored on the address will be sent to a new address that has been deterministically generated from your wallet seed. The private keys you sweep do not become a part of your wallet.
fr: Récupérer un portefeuille papier consiste à transférer dans votre propre portefeuille les fonds stockés à une adresse donnée, que vous avez par exemple reçu sous forme de portefeuille papier ou d'un distributeur automatique. Vous devez avoir accès à la clé privée de cette adresse pour utiliser cette fonction. Dans cette procédure, tous les dashs stockés à l'adresse en question seront envoyés à une nouvelle adresse qui a été générée de manière déterministe à partir de la "graine" de votre portefeuille. Les clés privées que vous récupérez ne sont pas intégrées à celles de votre portefeuille.
it: Lo pulizia di un paper wallet è un metodo per trasferire il valore memorizzato su un indirizzo che potresti aver ricevuto come paper wallet o da un ATM nel tuo portafoglio. È necessario disporre dell'accesso alla chiave privata per un indirizzo per utilizzare questa funzione. In questo processo, tutti i Dash archiviati sull'indirizzo verranno inviati a un nuovo indirizzo che è stato generato in modo deterministico dal seme del wallet. Le chiavi private che elimini non diventano parte del tuo wallet.

source: To sweep a paper wallet, tap the **Menu button** and select **Sweep paper wallet**. Tap the **Scan** button and scan the QR code from your paper wallet. Once the private key has been identified, tap **Sweep** to create the transaction moving the Dash into your own wallet. Once this transaction is confirmed, the paper is worthless and should be destroyed.
fr: Pour récupérer un portefeuille papier, touchez le **bouton Menu** et choisissez **Récupérer portefeuille papier**. Touchez le bouton **Scanner** et scannez le QR-code sur votre portefeuille papier. Une fois que la clé privée a été reconnue, touchez **Récupérer** pour générer la transaction déplaçant les dashs dans votre propre portefeuille. Une fois cette transaction confirmée, le papier devient sans valeur et il est conseillé de le détruire.
it: Per pulire un paper wallet, tocca il **pulsante Menu** e seleziona **Spazza paper wallet**. Tocca il pulsante **Scansiona** e scansiona il QR code dal tuo paper wallet. Una volta identificata la chiave privata, tocca **pulisci** per creare la transazione spostando il Dash nel tuo wallet. Una volta che questa transazione è confermata, il paper è senza valore e dovrebbe essere distrutta.

source: *Sweeping a paper wallet with 0.10 DASH into the Android Wallet*
fr: *Récupération dans le portefeuille logiciel Android d'un portefeuille papier contenant 0,10 dash*
it: *Pulizia di un paper wallet con 0.10 DASH nel wallet Android*

source: Network monitor
fr: Surveillance réseau
it: Monitor di rete

source: The Dash Android Wallet is a light wallet and functions in SPV mode, meaning it does not download a full copy of the blockchain. The network monitor allows you to view details about the full nodes to which you are connected. You can also swipe left to view blocks as they are created on the blockchain.
fr: Le portefeuille logiciel Dash pour Android est un portefeuille dit "léger" qui fonctionne en mode SPV, ce qui signifie qu'il ne télécharge pas une copie intégrale de la blockchain. La surveillance réseau vous permet d'accéder aux détails relatifs aux nœuds complets auxquels vous êtes connecté. Vous pouvez aussi balayer à gauche pour afficher les blocs au fur et à mesure de leur création sur la blockchain.
it: Il Dash Android Wallet è un wallet leggero e funziona in modalità SPV, il che significa che non scarica una copia completa della blockchain. Il monitor di rete ti consente di visualizzare i dettagli sui nodi completi a cui sei connesso. Puoi anche scorrere verso sinistra per visualizzare i blocchi mentre vengono creati sulla blockchain.

source: *Viewing peers and blocks to monitor network activity*
fr: *Affichage des paires et des blocs dans le suivi de l'activité réseau*
it: *Visualizzazione di peers e blocchi per monitorare l'attività di rete*

source: Settings
fr: Réglages
it: Impostazioni

source: *The Settings menu in Dash Android Wallet*
fr: *Menu Réglages dans le portefeuille logiciel Dash pour Android*
it: *Il menu Impostazioni nel Dash Android Wallet*

source: The settings menu contains a range of options to control the behavior of the Dash Android Wallet. To access the settings, tap the **Menu button**, then **Settings**. You can then choose between **Settings**, **Diagnostics** and **About**, which displays wallet version, copyright, license and source code information.
fr: Le menu des réglages contient une série d'options contrôlant le comportement du portefeuille logiciel Dash pour Android. Pour accéder aux réglages, touchez le **bouton Menu** puis **Réglages**. Vous pouvez alors choisir entre **Réglages**, **Diagnostics** et **À propos** qui affiche la version du portefeuille, le copyright, la licence et l'information sur le code source.
it: Il menu delle impostazioni contiene una serie di opzioni per controllare il comportamento del Dash Android Wallet. Per accedere alle impostazioni, tocca il **pulsante Menu**, quindi **Impostazioni**. Puoi quindi scegliere tra **Impostazioni**, **Diagnostica** e **Informazioni**, che visualizza la versione del portafoglio, il copyright, la licenza e le informazioni sul codice sorgente.

source: Denomination and precision
fr: Libellé et précision
it: Denominazione e precisione

source: Select the number of decimal places to show for DASH denominations, or switch to mDASH or µDASH denominations
fr: Choisissez le nombre de décimales à afficher pour les montants libellés en DASH, ou basculez vers des libellés en mDASH ou µDASH
it: Seleziona il numero di cifre decimali da mostrare per le denominazioni DASH o passa alle denominazioni mDASH o µDASH

source: Own name
fr: Votre nom
it: Proprio nome

source: Enter a short name to be included in your QR codes when displaying to other users for scanning. The short name will then appear as a label in their wallet to verify the recipient and simplify address management.
fr: Saisissez un nom court qui sera inclus dans vos QR-codes tels qu'affichés aux autres pour être scannés. Le nom court apparaîtra alors comme étiquette dans leur portefeuille, afin de vérifier le destinataire et simplifier la gestion des adresses.
it: Inserisci un nome breve da includere nei tuoi QR code quando li mostri ad altri utenti per la scansione. Il nome breve apparirà quindi come etichetta nel loro portafoglio per verificare il destinatario e semplificare la gestione degli indirizzi.

source: Auto-close send coins dialog
fr: Fermeture automatique du dialogue d'envoi de fonds
it: Chiudi automaticamente la finestra di dialogo per l'invio di monete

source: Specify whether or not to close the send dialog once a payment is complete.
fr: Choisissez si le dialogue d'envoi doit être fermé ou non lorsque le paiement est terminé.
it: Specifica se chiudere o meno la finestra di dialogo di invio una volta completato il pagamento.

source: Connectivity indicator
fr: Indicateur de connexion
it: Indicatore di connettività

source: Enables display of an indicator in the Android notification area to be able to quickly verify connectivity.
fr: Permet d'afficher un indicateur dans la zone de notification d'Android, pour vérifier rapidement la connexion au réseau Dash.
it: Abilita la visualizzazione di un indicatore nell'area di notifica di Android per poter verificare rapidamente la connettività.

source: Enter the IP address or hostname of a single peer to connect to.
fr: Saisissez l'adresse IP ou le nom d'hôte d'un pair unique auquel se connecter.
it: Immettere l'indirizzo IP o il nome host di un singolo peer a cui connettersi.

source: Skip regular peer discovery
fr: Sauter la découverte normale de pairs
it: Salta la normale scoperta tra peer

source: Enabling this option prevents automatic peer discovery and forces connection to the one specified trusted peer only.
fr: Activer cette option empêche la découverte automatique de pairs et force la connexion au pair de confiance indiqué, et à lui seul.
it: L'abilitazione di questa opzione impedisce il rilevamento automatico dei peer e forza la connessione solo a un peer attendibile specificato.

source: Allows you to select which block explorer you want to use for functions linking to a block explorer.
fr: Permet de choisir quel explorateur de blocs vous souhaitez utiliser pour les fonctions renvoyant à un explorateur de blocs.
it: Ti permette di selezionare quale block explorer vuoi utilizzare per le funzioni che si collegano a un block explorer.

source: Data usage
fr: Utilisation de données
it: Utilizzo dei dati

source: Links to the Android **Data usage** function to view and/or restrict data usage for the app.
fr: Renvoie à la fonction Android **Utilisation de données** pour consulter ou restreindre l'utilisation de données de l'application.
it: Collegamenti alla funzione **Utilizzo dati** di Android per visualizzare e/o limitare l'utilizzo dei dati per l'app.

source: Balance reminder
fr: Rappel de solde
it: Promemoria saldo

source: Enables an Android system notification to remind you of any unspent Dash if you don't open the app in that time.
fr: Active une notification système Android pour vous rappeler vos dashs non dépensés, en cas de non-ouverture de l'application.
it: Abilita una notifica di sistema Android per ricordarti di eventuali Dash non spesi se non apri l'app in quel momento.

source: Enable InstantSend
fr: Activer InstantSend
it: Abilita InstantSend

source: Enables functionality to use InstantSend to send and receive Dash.
fr: Active la fonctionnalité InstantSend pour l'envoi et la réception de dashs.
it: Abilita la funzionalità per utilizzare InstantSend per inviare e ricevere Dash.

source: Enable Lite Mode
fr: Activer le mode léger
it: Abilita Lite Mode

source: Enabling lite mode reduces bandwidth usage.
fr: Activer le mode léger réduit l'utilisation de bande passante.
it: L'attivazione della modalità Lite riduce l'utilizzo della larghezza di banda.

source: Show disclaimer
fr: Afficher l'avertissement
it: Mostra disclaimer

source: Enables or disables various disclaimers and warning messages in the app.
fr: Active ou désactive divers avertissements et messages dans l'application.
it: Abilita o disabilita vari disclaimer e messaggi di avviso nell'app.

source: BIP70 for scan-to-pay
fr: BIP70 pour scanner-pour-payer
it: BIP70 per scan-to-pay

source: Enables use of the `BIP70 payment protocol <https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki>`_ to add further verification and security features when scanning QR codes.
fr: Active l'utilisation du `protocole de paiement BIP70 <https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki>`_ pour ajouter des vérifications supplémentaires et des fonctions de sécurité pour le scan de QR-codes.
it: Abilita l'uso del `protocollo di pagamento BIP70 <https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki>`_ per aggiungere ulteriori funzionalità di verifica e sicurezza durante la scansione dei QR code.

source: Look up wallet names
fr: Consulter les noms de portefeuille
it: Cerca i nomi dei wallet

source: Enables use of `DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_Syst em_Security_Extensions>`_ to attempt to identify a wallet name when creating transactions.
fr: Active l'utilisation de `DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_Syst em_Security_Extensions>`_ pour tenter d'identifier un nom de portefeuille à la création de transactions.
it: Abilita l'uso di `DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_Syst em_Security_Extensions>`_ per tentare di identificare un nome del wallet durante la creazione di transazioni.

source: Diagnostics
it: Diagnostica

source: Report issue
fr: Signaler les problèmes
it: Segnala problema

source: Allows you to gather a range of information related to your wallet in order to send a bug report to developers for troubleshooting.
fr: Permet de réunir certaines informations techniques relatives à votre portefeuille logiciel, afin d'envoyer un rapport de bugs aux développeurs pour leur correction.
it: Ti consente di raccogliere una serie di informazioni relative al tuo wallet per inviare una segnalazione di bug agli sviluppatori per la risoluzione dei problemi.

source: Show xpub
fr: Afficher xpub
it: Mostra xpub

source: Displays the extended public key for the seed used to generate addresses in your wallet. Providing your xpub to a third party will allow them to view your entire transaction history, but not make new transactions.
fr: Affiche la clé publique étendue de la "graine" utilisée pour générer les adresses de votre portefeuille. Fournir votre xpub à une tierce personne lui permettra de visualiser votre historique entier de transactions, mais pas de créer de nouvelles transactions.
it: Visualizza la chiave pubblica estesa per il seed utilizzato per generare gli indirizzi nel tuo wallet. Fornire il tuo xpub a terzi consentirà loro di visualizzare l'intera cronologia delle tue transazioni, ma non di effettuare nuove transazioni.

source: Resets data stored on your device relating to the blockchain. This data will need to be collected again from full nodes, similar to when setting up a new wallet. This process may take some time.
fr: Réinitialise sur votre appareil les données relatives à la blockchain. Ces données devront être récupérées à nouveau par connexion à des nœuds complets, tout comme à l'installation d'un nouveau portefeuille. Ce processus peut prendre un certain temps.
it: Reimposta i dati memorizzati sul tuo dispositivo relativi alla blockchain. Questi dati dovranno essere raccolti nuovamente dai nodi completi, in modo simile a quando si imposta un nuovo wallet. Questo processo potrebbe richiedere del tempo.

source: Trusted peer
fr: Pair de confiance

source: Block explorer
fr: Explorateur de blocs

source: Reset block chain
fr: Réinitialiser la blockchain
