Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/advanced.po
Languages: it, ru

source: Masternodes, multisig, sweeping paper wallets, cold storage and command line in the Dash Electrum wallet.
it: Masternode, multisig, paper wallet, cold storage e riga di comando nel wallet Dash Electrum.
ru: Мастерноды, мультиподпись, бумажные кошельки, холодное хранение и командная строка в кошельке Dash Electrum.

source: dash, wallet, electrum, masternode, multisig, paper, cold storage, command line
it: dash, wallet, electrum, masternode, multisig, paper, cold storage, linea di comando
ru: dash, кошелёк, electrum, мастернода, multisig, бумажный, холодное хранение, командная строка

source: Advanced functions
it: Funzioni avanzate
ru: Продвинутые функции

source: Dash Electrum is based on `Electrum <https://electrum.org>`_, a Bitcoin wallet. Most functions are identical, which means it is not necessary to reproduce the entirety of the Electrum documentation here. The following sections describe some frequently used advanced functions. For further details on other advanced functions in Electrum for both Bitcoin and Dash, please click the links below.
it: Dash Electrum è basato su `Electrum <https://electrum.org>`_, un portafoglio Bitcoin. La maggior parte delle funzioni sono identiche, il che significa che non è necessario riprodurre qui l'intera documentazione di Electrum. Le sezioni seguenti descrivono alcune funzioni avanzate utilizzate di frequente. Per ulteriori dettagli su altre funzioni avanzate di Electrum sia per Bitcoin che per Dash, fai clic sui collegamenti seguenti.
ru: В основе Dash Electrum лежит `Electrum <https://electrum.org>`_, Биткойн-кошелёк. Многие функции похожи, а значит, нет нужды приводить здесь всю документацию по Electrum. В этом разделе описываются некоторые часто используемые продвинутые функции. Чтобы узнать больше об остальных продвинутых функциях Electrum у Биткойн и Dash, нажмите на ссылку ниже.

source: `Electrum documentation <https://docs.electrum.org>`_
it: `Electrum documentazione <https://docs.electrum.org>`_
ru: `Документация Electrum <https://docs.electrum.org>`_

source: `Electrum seed version system <https://docs.electrum.org/en/latest/seedphrase.html>`_
it: `Seed di Electrum versioni di sistema <https://docs.electrum.org/en/latest/seedphrase.html>`_
ru: `Версия Electrum с мнемонической фразой <http://docs.electrum.org/en/latest/seedphrase.html>`_

source: `Electrum protocol specification <https://docs.electrum.org/en/latest/protocol.html>`_
it: `Specifica del protocollo Electrum <https://docs.electrum.org/en/latest/protocol.html>`_
ru: `Спецификация протокола Electrum <https://docs.electrum.org/en/latest/protocol.html>`_

source: `Serialization of unsigned or partially signed transactions <https://docs.electrum.org/en/latest/transactions.html>`_
it: `Serializzazione di transazioni non firmate o parzialmente firmate <https://docs.electrum.org/en/latest/transactions.html>`_
ru: `Сериализация неподписанных или частично подписанных транзакций <https://docs.electrum.org/en/latest/transactions.html>`_

source: `Simple Payment Verification <https://docs.electrum.org/en/latest/spv.html>`_
it: `Verifica semplice dei pagamenti <https://docs.electrum.org/en/latest/spv.html>`_
ru: `Верификация простых платежей <https://docs.electrum.org/en/latest/spv.html>`_

source: `The Python Console <https://docs.electrum.org/en/latest/console.html>`_
it: `Console di Python <https://docs.electrum.org/en/latest/console.html>`_
ru: `Консоль на Python <https://docs.electrum.org/en/latest/console.html>`_

source: `Using Electrum Through Tor <https://docs.electrum.org/en/latest/tor.html>`_
it: `Utilizzo di Electrum tramite Tor <https://docs.electrum.org/en/latest/tor.html>`_
ru: `Как работать с Electrum через Tor <https://docs.electrum.org/en/latest/tor.html>`_

source: PrivateSend
ru: Функция PrivateSend

source: :ref:`PrivateSend <coinjoin>` offers users enhanced privacy when creating transactions by splitting the user's balance into a number of predefined denominations in advance of spending. This process is known as CoinJoin. PrivateSend is available in Dash Electrum versions 3.3.8.3 and higher, with support for hardware wallets added in 3.3.8.7.
it: :ref:`PrivateSend ` offre agli utenti una maggiore privacy durante la creazione di transazioni suddividendo il saldo dell'utente in un numero di denominazioni predefinite prima della spesa. Questo processo è noto come CoinJoin. PrivateSend è disponibile nelle versioni Dash Electrum 3.3.8.3 e successive, con il supporto per i portafogli hardware aggiunto nella 3.3.8.7.
ru: :ref:`PrivateSend <coinjoin>` предлагает пользователям повышенную конфиденциальность при совершении транзакций за счет разделения баланса пользователя на несколько заранее определенных номиналов перед расходованием средств. Этот процесс известен как CoinJoin. PrivateSend доступен в Dash Electrum версий 3.3.8.3 и выше, а поддержка аппаратных кошельков добавлена в 3.3.8.7.

source: Processing and sending
it: Elaborazione e invio
ru: Обработка и отправка

source: To start PrivateSend processing in Dash Electrum, select **Wallet > PrivateSend** or click the **PS** icon in the lower right corner of the main window. The following window appears:
it: Per avviare l'elaborazione di PrivateSend in Dash Electrum, seleziona **Wallet > PrivateSend** o fai clic sull'icona **PS** nell'angolo in basso a destra della finestra principale. Viene visualizzata la seguente finestra:
ru: Чтобы запустить обработку PrivateSend в Dash Electrum, выберите **Кошелек > PrivateSend** или щелкните на значке **PS** в правом нижнем углу главного окна. Откроется следующее окно:

source: PrivateSend dialog in Dash Electrum
it: Finestra di dialogo PrivateSend in Dash Electrum
ru: Диалоговое окно PrivateSend в Dash Electrum

source: Enter the **Amount of Dash to keep anonymized** and the number of **PrivateSend rounds to use**. Then click **Enable PrivateSend**, followed by **Start Mixing**. The process will begin, and the **Mixing Progress** bar shows the completion progress. Additional information on the process is available on the **Info** and **Log** tabs.
it: Inserisci la **Quantità di Dash da mantenere anonimo** e il numero di **Round di PrivateSend da utilizzare**. Quindi fai clic su **Abilita PrivateSend**, seguito da **Avvia mixaggio**. Il processo avrà inizio e la barra **Avanzamento del mixaggio** mostrerà l'avanzamento del completamento. Ulteriori informazioni sul processo sono disponibili nelle schede **Informazioni** e **Registro**.
ru: Введите **Сумму Dash для сохранения приватности** и количество **Раундов PrivateSend для использования**. Затем нажмите кнопку **Enable PrivateSend**, а затем **Start Mixing**. Процесс начнется, и на панели **Прогресс смешивания** будет показан ход его завершения. Дополнительная информация о процессе доступна на вкладках **Info** и **Log**.

source: When processing is complete, simply check the **PrivateSend** checkbox on the **Send** tab before sending your transaction. Dash Electrum will only use Dash processed according to your specifications for the transaction.
it: Una volta completata l'elaborazione, seleziona semplicemente la casella di controllo **PrivateSend** nella scheda **Invia** prima di inviare la transazione. Dash Electrum utilizzerà solo Dash elaborato in base alle tue specifiche per la transazione.
ru: После завершения обработки просто установите флажок **PrivateSend** на вкладке **Send** перед отправкой транзакции. Dash Electrum будет использовать для транзакции только Dash, обработанный в соответствии с вашими условиями.

source: Hardware Wallets
it: Hardware Wallet
ru: Физические кошельки

source: You can use hardware wallets with Dash Electrum. Under Linux, it may be necessary to first install dependencies and udev rules as follows::
it: Puoi utilizzare i wallet hardware con Dash Electrum. Sotto Linux, potrebbe essere necessario installare prima le dipendenze e le regole udev come segue:
ru: С Dash Electrum можно использовать аппаратные кошельки. В Linux может потребоваться предварительная установка зависимостей и правил udev следующим образом::

source: PrivateSend processing is also supported. Starting PrivateSend processing in Dash Electrum with a hardware wallet will generate a new HD wallet and mnemonic for the PrivateSend keystore. A transaction from the hardware wallet to an address in this keystore will be created, and processing will begin. You can then spend the processed Dash, or send it back to your hardware wallet.
it: È supportata anche l'elaborazione PrivateSend. L'avvio dell'elaborazione di PrivateSend in Dash Electrum con un wallet hardware genererà un nuovo wallet HD e un mnemonico per il keystore PrivateSend. Verrà creata una transazione dal wallet hardware a un indirizzo in questo archivio di chiavi e inizierà l'elaborazione. Puoi quindi spendere il Dash elaborato o rispedirlo al tuo wallet hardware.
ru: Также поддерживается обработка PrivateSend. При запуске обработки PrivateSend в Dash Electrum с аппаратным кошельком будет создан новый HD-кошелек и мнемоника для хранилища ключей PrivateSend. Будет создана транзакция из аппаратного кошелька на адрес в этом хранилище, и начнется обработка. Затем обработанные Dash можно потратить или отправить обратно на аппаратный кошелек.

source: Masternodes
ru: Мастерноды

source: Dash Electrum supports masternode creation through the **DIP3** tab.
it: Dash Electrum supporta la creazione di masternode tramite la scheda **DIP3**.
ru: Dash Electrum поддерживает создание masternode через вкладку **DIP3**.

source: The DIP3 tab can be enabled via the **View > Show DIP3** menu. This tab displays the status of your masternode(s) and also allows viewing a list of all registered masternodes on the network.
it: La scheda DIP3 può essere abilitata tramite il menu **Visualizza > Mostra DIP3**. Questa scheda mostra lo stato dei tuoi masternodi e consente anche di visualizzare un elenco di tutti i masternodi registrati sulla rete.
ru: Вкладка DIP3 может быть включена через меню **View > Show DIP3**. На этой вкладке отображается статус вашей мастерноды (нод), а также можно просмотреть список всех зарегистрированных мастернод в сети.

source: The tab displays the following data about each masternode you have set up:
it: La scheda mostra i seguenti dati su ciascun masternode che hai impostato:
ru: На вкладке отображаются следующие данные о каждом настроенной мастерноде:

source: The alias (name) of the masternode.
it: L'alias (nome) del masternode.
ru: Название (имя) мастерноды.

source: The state of the masternode (e.g. whether it has been activated).
it: Lo stato del masternode (ad esempio se è stato attivato).
ru: Статус мастерноды (например, была ли она активирована).

source: The keys
it: Le chiavi
ru: Ключи

source: The Provider Registration transaction hash of the masternode.
it: L'hash della transazione di registrazione del provider del masternode.
ru: Хэш транзакции регистрации провайдера для мастерноды.

source: The IP address and port that your masternode can be reached at.
it: L'indirizzo IP e la porta a cui è raggiungibile il tuo masternode.
ru: IP адрес и порт, через который можно получить доступ к мастерноде.

source: DIP3 tab with masternode information
it: Scheda DIP3 con informazioni sul masternode
ru: Вкладка DIP3 с информацией о мастерноде

source: Masternode setup
it: Configurazione del masternode
ru: Настройки мастерноды

source: To setup a masternode, navigate to the DIP3 tab and click the **Add/Import** button.
it: Per impostare un masternode, vai alla scheda DIP3 e fai clic sul pulsante **Aggiungi/Importa**.
ru: Для настройки мастерноды перейдите на вкладку DIP3 и нажмите кнопку **Add/Import**.

source: If combined with Electrum's :ref:`multisig features <electrum-multisig>` the masternode collateral can be stored in a multisig wallet for increased security flexibility. See `this page <https://github.com/dashpay/docs/blob/master/wallets/electrum/dip3_p2sh_howto.md>`_ for the Dash Electrum documentation demonstrating how to configure a masternode using a multisig collateral.
it: Se combinato con le :ref:`funzionalità multisig <electrum-multisig>` di Electrum, il collaterale masternode può essere archiviato in un wallet multisig per una maggiore flessibilità di sicurezza. Vedi `questa pagina <https://github.com/dashpay/docs/blob/master/wallets/electrum/dip3_p2sh_howto.md>`_ per la documentazione di Dash Electrum che dimostra come configurare un masternode utilizzando un collaterale multisig.
ru: В сочетании с функциями Electrum :ref:`multisig features <electrum-multisig>` залог мастернод может храниться в кошельке multisig, что повышает гибкость системы безопасности. См. `эту страницу <https://github.com/dashpay/docs/blob/master/wallets/electrum/dip3_p2sh_howto.md>`_ для документации Dash Electrum, демонстрирующей, как настроить мастернод с использованием мультисигового обеспечения.

source: **Always exercise caution when using multisig accounts and verify that each mnemonic is backed up appropriately.**
it: **Prestare sempre attenzione quando si utilizzano account multisig e verificare che venga eseguito il backup appropriato di ogni mnemonico.**
ru: **Всегда проявляйте осторожность при использовании аккаунтов с мультиподписью и проверяйте, чтобы каждый мнемоник был соответствующим образом сохранен.**

source: Add or import masternode
it: Aggiungi o importa masternode
ru: Добавить или импортировать мастерноду

source: Electrum supports creating/registering new masternodes as well as importing and registering legacy masternodes via a ``masternode.conf`` file. At this point very few legacy masternodes are present, so only the **Create and register DIP3 Masternode** option will be covered in detail.
it: Electrum supporta la creazione/registrazione di nuovi masternode nonché l'importazione e la registrazione di masternode legacy tramite un file ``masternode.conf``. A questo punto sono presenti pochissimi masternode legacy, quindi solo l'opzione **Crea e registra DIP3 Masternode** verrà trattata in dettaglio.
ru: Electrum поддерживает создание/регистрацию новых мастернод, а также импорт и регистрацию старых мастернод с помощью файла ``masternode.conf``. На данный момент существует очень мало старых мастернод, поэтому подробно будет рассмотрена только опция **Создание и регистрация мастернод DIP3**.

source: There are two supported ownership types: owner-only and owner/operator. The primary difference during setup is whether or not the operator BLS private key is stored in Electrum. The following steps show the creation of a self-hosted masternode so both ownership type checkboxes are selected. Click **Next** to continue.
it: Sono disponibili due tipi di proprietà supportati: solo proprietario e proprietario/operatore. La differenza principale durante la configurazione è se la chiave privata BLS dell'operatore è archiviata o meno in Electrum. I passaggi seguenti mostrano la creazione di un masternode self-hosted in modo che entrambe le caselle di controllo del tipo di proprietà siano selezionate. Fare clic su **Avanti** per continuare.
ru: Поддерживаются два типа владения: только владелец и владелец/оператор. Основное различие при настройке заключается в том, хранится ли закрытый ключ BLS оператора в Electrum. В следующих шагах показано создание мастерноды, размещаемого на собственном хостинге, для которого установлены оба флажка типа владения. Для продолжения нажмите **Next**.

source: Select operation type and ownership properties
it: Seleziona il tipo di operazione e le proprietà dei proprietari
ru: Выберите тип операции и свойства владения

source: To start a masternode, you must have a 1000 DASH plus a small amount for fees available in your wallet. Leave **Create collateral as ProRegTx output** checked and click **Next**.
it: Per avviare un masternode, devi avere 1000 DASH più una piccola somma per le commissioni disponibili nel tuo wallet. Lascia selezionato **Crea materiale collaterale come output ProRegTx** e fai clic su **Avanti**.
ru: Для запуска мастерноды необходимо иметь на кошельке 1000 DASH плюс небольшую сумму для оплаты. Оставьте галочку **Создать обеспечение как вывод ProRegTx** и нажмите **Следующее**.

source: Select collateral output for masternode
it: Seleziona l'output collaterale per masternode
ru: Выберите выход обеспечения для мастерноды

source: Certain information about your masternode is required. The IP address and port that your masternode uses must be supplied. Click **Next** after entering them (the port will be set to the default mainnet port of 9999 automatically).
it: Sono necessarie alcune informazioni sul tuo masternode. È necessario fornire l'indirizzo IP e la porta utilizzati dal masternode. Fare clic su **Avanti** dopo averli inseriti (la porta verrà impostata automaticamente sulla porta mainnet predefinita 9999).
ru: Необходимо предоставить определенную информацию о вашем мастерноде. Необходимо указать IP-адрес и порт, используемые вашим мастернодом. После их ввода нажмите кнопку **Next** (порт будет автоматически установлен на стандартный порт основной сети 9999).

source: Enter masternode IP address and port
it: Inserisci l'indirizzo IP e la porta del masternode
ru: Введите IP-адрес и порт мастерноды

source: Each masternode requires three addresses: owner, voting, and payout. Electrum will automatically select addresses from your wallet. Click **Next** to continue.
it: Ogni masternode richiede tre indirizzi: proprietario, voto e pagamento. Electrum selezionerà automaticamente gli indirizzi dal tuo portafoglio. Fare clic su **Avanti** per continuare.
ru: Для каждой мастерноды требуется три адреса: владельца, голосования и выплат. Electrum автоматически выберет адреса из вашего кошелька. Нажмите **Next**, чтобы продолжить.

source: Select masternode owner, voting, and payout addresses
it: Seleziona il proprietario del masternode, gli indirizzi di voto e di pagamento
ru: Выбор владельца мастерноды, также как и адрес для голосования и выплат

source: A masternode requires a BLS "operator" key as described in `DIP3 <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_. If you manage your own masternode, both Dash Electrum and your masternode must know the operator private key. Your masternode will use the private key to sign messages, and the Dash network will know that you authorized it to do so.
it: Un masternode richiede una chiave "operatore" BLS come descritto in `DIP3 <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_. Se gestisci il tuo masternode, sia Dash Electrum che il tuo masternode devono conoscere la chiave privata dell'operatore. Il tuo masternode utilizzerà la chiave privata per firmare i messaggi e la rete Dash saprà che l'hai autorizzata a farlo.
ru: Для работы мастерноды требуется BLS ключ "оператора", как описано в `DIP3 <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_. Если вы управляете своей собственной мастернодой, то и Dash Electrum, и ваша мастернода должны знать закрытый ключ оператора. Ваша мастернода будет использовать закрытый ключ для подписи сообщений, а сеть Dash будет знать, что вы дали ей на это право.

source: Electrum will generate the required BLS private/public key pair and provide you with the line that must be copied to the masternode for proper masternode configuration. Click **Next** after copying this line to your masternode's ``dash.conf`` file.
it: Electrum genererà la coppia di chiavi pubblica/privata BLS richiesta e ti fornirà la linea che deve essere copiata nel masternode per una corretta configurazione del masternode. Fai clic su **Avanti** dopo aver copiato questa riga nel file ``dash.conf`` del tuo masternode.
ru: Electrum сгенерирует необходимую пару ключей BLS и предоставит строку, которую необходимо скопировать в мастерноду для правильной настройки. Нажмите **Next** после копирования этой строки в файл ``dash.conf`` вашего мастернода.

source: BLS key setup
it: Configurazione della chiave BLS
ru: Настройка BLS ключей

source: All parameters are now configured. This screen shows the configuration details and allows you to save the information. Make sure the **Make ProRegTx after saving Masternode data** box is checked, then click **Save**. The **Send** tab will open and be populated with the info necessary to register the masternode.
it: Tutti i parametri sono ora configurati. Questa schermata mostra i dettagli della configurazione e consente di salvare le informazioni. Assicurati che la casella **Crea ProRegTx dopo aver salvato i dati Masternode** sia selezionata, quindi fai clic su **Salva**. La scheda **Invia** si aprirà e verrà popolata con le informazioni necessarie per registrare il masternode.
ru: Теперь все параметры сконфигурированы. На этом экране отображаются подробности конфигурации и появляется возможность сохранить информацию. Убедитесь, что флажок **Make ProRegTx after saving masterнод data** установлен, и нажмите кнопку **Save**. Откроется вкладка **Отправить**, на которой будет размещена информация, необходимая для регистрации мастернода.

source: Examine parameters and save masternode
it: Esamina i parametri e salva il masternode
ru: Проверить параметры и сохранить мастерноду

source: Registering your masternode
it: Registrazione del tuo masternode
ru: Регистрация вашей мастерноды

source: Since the ProRegTx information required to register the masternode was filled out by the previous step, just Click **Pay...** to complete the registration.
it: Poiché le informazioni ProRegTx richieste per registrare il masternode sono state compilate nel passaggio precedente, è sufficiente fare clic su **Paga...** per completare la registrazione.
ru: Поскольку информация ProRegTx, необходима для регистрации мастерноды, была заполнена на предыдущем шаге, просто нажмите **Pay...** для завершения регистрации.

source: To complete registration of any previously setup masternode, go to the **DIP3** tab, select the unregistered masternode from the list of **Wallet MNs**, and click **Register**.
it: Per completare la registrazione di qualsiasi masternode precedentemente configurato, vai alla scheda **DIP3**, seleziona il masternode non registrato dall'elenco dei **Wallet MN** e fai clic su **Registra**.
ru: Чтобы завершить регистрацию ранее настроенной мастерноды, перейдите на вкладку **DIP3**, выберите незарегистрированную мастерноду из списка **MN кошелька** и нажмите кнопку **Регистрация**.

source: Send tab with ProRegTx prepared
it: Scheda Invia con ProRegTx preparato
ru: Отправить вкладку с подготовленным ProRegTx

source: Enter your password and click **Send** to broadcast the registration transaction.
it: Inserisci la tua password e fai clic su **Invia** per trasmettere la transazione di registrazione.
ru: Введите пароль и нажмите кнопку **Отправить** для трансляции операции регистрации.

source: Confirm ProRegTx Transaction
it: Conferma la transazione ProRegTx
ru: Подтверждение транзакции ProRegTx

source: The transaction hash will be displayed once the transaction has been sent successfully. This ProRegTx hash is used by the network to uniquely identify the masternode. Click **OK** to close the screen.
it: L'hash della transazione verrà visualizzato una volta che la transazione è stata inviata con successo. Questo hash ProRegTx viene utilizzato dalla rete per identificare in modo univoco il masternode. Fare clic su **OK** per chiudere la schermata.
ru: После успешной отправки транзакции будет отображен ее хэш. Этот хэш ProRegTx используется сетью для уникальной идентификации мастерноды. Нажмите **OK**, чтобы закрыть экран.

source: Transaction sent screen showing transaction hash
it: Schermata Transazione inviata che mostra l'hash della transazione
ru: Экран отправки транзакции с отображением хэша транзакции
