Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/advanced.po
Languages: it, ru

source: Prior to the ProRegTx being confirmed the new masternode will appear as unregistered on the DIP3 tab.
it: Prima che il ProRegTx venga confermato, il nuovo masternode apparirà come non registrato nella scheda DIP3.
ru: До подтверждения ProRegTx новая мастернода будет отображаться как незарегистрированная на вкладке DIP3.

source: DIP3 tab showing unregistered masternode
it: Scheda DIP3 che mostra il masternode non registrato
ru: На вкладке DIP3 отображается незарегистрированная мастернода

source: Once the ProRegTx has been confirmed, the new masternode will appear as registered on the DIP3 tab.
it: Una volta confermato il ProRegTx, il nuovo masternode apparirà come registrato nella scheda DIP3.
ru: После подтверждения ProRegTx новая мастернода будет отображаться как зарегистрированная на вкладке DIP3.

source: DIP3 tab showing registered masternode
it: Scheda DIP3 che mostra il masternode registrato
ru: На вкладке DIP3 отображается зарегистрированная мастернода

source: Updating masternode registration
it: Aggiornamento della registrazione del masternode
ru: Информация по регистрации мастерноды

source: To update masternode registration information, navigate to the DIP3 tab and click the **Update Registrar** button.
it: Per aggiornare le informazioni di registrazione del masternode, vai alla scheda DIP3 e fai clic sul pulsante **Aggiorna registrar**.
ru: Для обновления регистрационной информации о мастерноде перейдите на вкладку DIP3 и нажмите кнопку **Update Registrar**.

source: Update Registrar
it: Aggiorna Registrazione
ru: Обновить Registrar

source: The masternode owner may update the voting and payout addresses at any time. Addresses from the current wallet can be selected from the drop down menu or addresses from a different wallet (e.g. a hardware wallet) can be pasted into either field. Click **Next** to continue.
it: Il proprietario del masternode può aggiornare gli indirizzi di voto e di pagamento in qualsiasi momento. Gli indirizzi del wallet corrente possono essere selezionati dal menu a discesa oppure gli indirizzi di un wallet diverso (ad esempio un wallet hardware) possono essere incollati in uno dei due campi. Fare clic su **Avanti** per continuare.
ru: Владелец мастерноды может в любое время обновить адреса голосования и выплат. Адреса из текущего кошелька можно выбрать из выпадающего меню или вставить в любое поле адреса из другого кошелька (например, аппаратного). Для продолжения работы нажмите кнопку **Next**.

source: Update masternode voting and/or payout address
it: Aggiorna l'indirizzo di voto e/o pagamento del masternode
ru: Обновление адреса голосования и/или выплат мастерноды

source: The masternode owner may also update the operator BLS key at any time. Click **Next** to continue.
it: Il proprietario del masternode può inoltre aggiornare la chiave BLS dell'operatore in qualsiasi momento. Fare clic su **Avanti** per continuare.
ru: Владелец мастерноды также может в любое время обновить BLS-ключ оператора. Для продолжения нажмите кнопку **Next**.

source: Any time the the operator private key is changed it must be copied into the ``dash.conf`` file on the masternode. Electrum will provide a notification with instructions when this is required.
it: Ogni volta che la chiave privata dell'operatore viene modificata, deve essere copiata nel file ``dash.conf`` sul masternode. Electrum fornirà una notifica con le istruzioni quando ciò sarà richiesto.
ru: При каждом изменении приватного ключа оператора он должен быть скопирован в файл ``dash.conf`` на мастерноде. Electrum предоставит уведомление с инструкциями, когда это потребуется.

source: Update operator BLS key
it: Aggiorna la chiave BLS dell'operatore
ru: Обновление BLS ключа оператора

source: All parameters are now configured. This screen shows the updated configuration details. Click **Prepare ProUpRegTx** to continue. The **Send** tab will open and be populated with the info necessary to update the masternode.
it: Tutti i parametri sono ora configurati. Questa schermata mostra i dettagli di configurazione aggiornati. Fare clic su **Prepara ProUpRegTx** per continuare. La scheda **Invia** si aprirà e verrà popolata con le informazioni necessarie per aggiornare il masternode.
ru: Теперь все параметры сконфигурированы. На этом экране показаны обновленные данные конфигурации. Для продолжения нажмите **Подготовить ProUpRegTx**. Откроется вкладка **Отправить**, на которой будет размещена информация, необходимая для обновления мастерноды.

source: Examine parameters and update masternode
it: Esaminare i parametri e aggiornare il masternode
ru: Проверить параметры и обновить мастерноду

source: The ProUpRegTx information required to update the masternode registration was filled out by the previous step so just Click **Pay...** to complete the update.
it: Le informazioni ProUpRegTx richieste per aggiornare la registrazione del masternode sono state inserite nel passaggio precedente, quindi è sufficiente fare clic su **Paga...** per completare l'aggiornamento.
ru: Информация ProUpRegTx, необходимая для обновления данных регистрации мастерноды, была заполнена на предыдущем шаге, поэтому просто нажмите **Pay...** для завершения обновления.

source: Send tab with ProUpRegTx prepared
it: Scheda Invia con ProUpRegTx preparato
ru: Вкладка отправки с с подготовленным ProUpRegTx

source: Enter your password and click **Send** to broadcast the update transaction.
it: Inserisci la tua password e fai clic su **Invia** per trasmettere la transazione di aggiornamento.
ru: Введите пароль и нажмите кнопку **Отправить** для трансляции транзакции обновления.

source: Confirm ProUpRegTx Transaction
it: Conferma la transazione ProUpRegTx
ru: Подтверждение транзакции ProUpRegTx

source: The transaction hash will be displayed once the transaction has been sent successfully. Click **OK** to close the screen.
it: L'hash della transazione verrà visualizzato una volta che la transazione è stata inviata con successo. Fare clic su **OK** per chiudere la schermata.
ru: После успешной отправки транзакции на экране появится хэш транзакции. Нажмите **OK**, чтобы закрыть экран.

source: Updating masternode service parameters
it: Aggiornamento dei parametri del servizio masternode
ru: Обновление сервисных параметров мастерноды

source: The masternode service may need to be updated to:
it: Potrebbe essere necessario aggiornare il servizio masternode per:
ru: Возможно, потребуется обновить сервис мастерноды:

source: Change the IP address, port, or operator payout address of a masternode
it: Modifica l'indirizzo IP, la porta o l'indirizzo di pagamento dell'operatore di un masternode
ru: Изменение IP-адреса, порта или адреса выплат оператора мастерноды

source: Revive a masternode that was Proof of Service (PoSe) banned
it: Ripristinare un masternode che era stato vietato Proof of Service (PoSe).
ru: Восстановить мастерноду, которая была заблокирована по Proof of Service (PoSe)

source: To update masternode service information, navigate to the DIP3 tab and click the **Update Service** button.
it: Per aggiornare le informazioni sul servizio masternode, vai alla scheda DIP3 e fai clic sul pulsante **Aggiorna servizio**.
ru: Для обновления служебной информации мастерноды перейдите на вкладку DIP3 и нажмите кнопку **Update Service**.

source: Update Service
it: Servizio di aggiornamento
ru: Обновление сервиса

source: The masternode operator may update the IP address and port at any time. Update the IP address and click **Next** to continue.
it: L'operatore del masternode può aggiornare l'indirizzo IP e la porta in qualsiasi momento. Aggiorna l'indirizzo IP e fai clic su **Avanti** per continuare.
ru: Оператор мастерноды может в любое время обновить IP-адрес и порт. Обновите IP-адрес и нажмите **Next** для продолжения.

source: Update masternode IP address
it: Aggiorna l'indirizzo IP del masternode
ru: Обновление IP-адреса мастерноды

source: All parameters are now configured. This screen shows the updated configuration details. Click **Prepare ProUpServTx** to continue. The **Send** tab will open and be populated with the info necessary to update the masternode.
it: Tutti i parametri sono ora configurati. Questa schermata mostra i dettagli di configurazione aggiornati. Fare clic su **Prepara ProUpServTx** per continuare. La scheda **Invia** si aprirà e verrà popolata con le informazioni necessarie per aggiornare il masternode.
ru: Теперь все параметры сконфигурированы. На этом экране отображаются обновленные сведения о конфигурации. Для продолжения нажмите **Подготовить ProUpServTx**. Откроется вкладка **Send**, на которой будет размещена информация, необходимая для обновления мастерноды.

source: Examine parameters and update masternode service
it: Esaminare i parametri e aggiornare il servizio masternode
ru: Изучение параметров и обновление службы мастерноды

source: The ProUpServTx information required to update the masternode was filled out by the previous step so just Click **Pay...** to complete the update.
it: Le informazioni ProUpServTx richieste per aggiornare il masternode sono state compilate nel passaggio precedente, quindi è sufficiente fare clic su **Paga...** per completare l'aggiornamento.
ru: Информация о ProUpServTx, необходимая для обновления мастерноды, была заполнена на предыдущем шаге, поэтому просто нажмите **Pay...** для завершения обновления.

source: Send tab with ProUpServTx prepared
it: Scheda Invia con ProUpServTx preparato
ru: Вкладка отправки с с подготовленным ProUpServTx

source: Confirm ProUpServTx Transaction
it: Conferma la transazione ProUpServTx
ru: Подтверждение транзакции ProUpServTx

source: Multisig wallets
ru: Кошельки с мультиподписью

source: This tutorial shows how to create a 2 of 2 multisig wallet. A 2 of 2 multisig consists of 2 separate wallets (usually on separate machines and potentially controlled by separate people) that have to be used in conjunction in order to access the funds. Both wallets have the same set of addresses.
it: Questo tutorial mostra come creare un wallet multisig 2 su 2. Un multisig 2 su 2 è costituito da 2 wallet separati (solitamente su macchine separate e potenzialmente controllati da persone separate) che devono essere utilizzati insieme per accedere ai fondi. Entrambi i wallet hanno lo stesso set di indirizzi.
ru: В этой инструкции рассказывается, как создать кошелёк с мультиподписью 2 из 2. Такой кошелёк состоит из двух отдельных кошельков (обычно на разных машинах и контролируемых разными людьми), которые должны работать в связке, чтобы дать доступ к средствам. У этих кошельков одинаковый набор адресов.

source: A common use-case for this is if you want to collaboratively control funds: maybe you and your friend run a company together and certain funds should only be spendable if you both agree.
it: Un caso d'uso comune per questo è se desideri controllare i fondi in modo collaborativo: forse tu e il tuo amico gestite un'azienda insieme e determinati fondi dovrebbero essere spendibili solo se entrambi siete d'accordo.
ru: Обычно такой кошелёк используется, когда вы хотите контролировать средства совместно с кем-то: возможно, вы управляете компанией вместе с вашим другом и уверены, что средства должны тратиться только в том случае, если вы оба с этим согласны.

source: Another one is security: one of the wallets can be on your main machine, while the other one is on a offline machine. That way you make it very hard for an attacker or malware to steal your coins.
it: Un altro è la sicurezza: uno dei wallet può trovarsi sul tuo computer principale, mentre l’altro su un computer offline. In questo modo rendi molto difficile per un utente malintenzionato o un malware rubare le tue monete.
ru: Ещё один вариант использования - безопасность. Один из кошельков может располагаться на вашем главном компьютере, а другой на машине, находящейся оффлайн. Таким образом вы сильно затрудните жизнь хакеру или вредоносному ПО, которые попытаются украсть ваши монеты.

source: Create a pair of 2-of-2 wallets
it: Crea una coppia di wallet 2 di 2
ru: Создание пары кошельков 2-из-2х

source: Each cosigner needs to do this: In the menu select **File > New**, then select **Multi-signature wallet**. On the next screen, select 2 of 2.
it: Ciascun cofirmatario deve eseguire questa operazione: nel menu selezionare **File > Nuovo**, quindi selezionare **Wallet multifirma**. Nella schermata successiva, seleziona 2 di 2.
ru: Каждый из участников должен сделать следующее: в меню выбрать **Файл > Новый**, а затем **Кошелёк с мультподписью**. На следующем экране надо выбрать 2 из 2.

source: Selecting x of y signatures for a multi-signature wallet
it: Selezione di x firme su y per un portafoglio multisig
ru: Выбор x из y подписей для кошелька с мультиподписью

source: After generating and confirming your recovery seed, you will be shown the xpub address for this wallet.
it: Dopo aver generato e confermato il tuo seed di ripristino, ti verrà mostrato l'indirizzo xpub per questo wallet.
ru: После создания и подтверждения мнемонической фразы, вы увидите xpub адрес для этого кошелька.

source: xpub key of the first wallet
it: chiave xpub del primo wallet
ru: xpub ключ первого кошелька

source: After generating a seed (keep it safely!) you will need to provide the master public key of the other wallet. Of course when you create the other wallet, you put the master public key of the first wallet.
it: Dopo aver generato un seed (conservalo al sicuro!) dovrai fornire la chiave pubblica principale dell'altro wallet. Ovviamente quando crei l'altro wallet, inserisci la chiave pubblica principale del primo wallet.
ru: После создания мнемонической фразы (не забудьте сохранить её в безопасном месте!) нужно будет ввести публичный мастер ключ другого кошелька. Соответственно, при создании второго кошелька, туда нужно будет ввести публичный мастер ключ первого кошелька.

source: Entering xpub from the second wallet in the first wallet
it: Entrando in xpub dal secondo wallet nel primo wallet
ru: Ввод xpub из второго кошелька в первый кошелёк

source: You will need to do this in parallel for the two wallets. Note that you can press cancel during this step, and reopen the file later.
it: Dovrai farlo in parallelo per i due wallet. Tieni presente che puoi premere Annulla durante questo passaggio e riaprire il file in un secondo momento.
ru: Всё это нужно будет делать параллельно для двух кошельков. Обратите внимание, что на этом шаге вы можете нажать Отмена и вернуться к этому файлу позже.

source: Receiving
it: Ricezione
ru: Получение

source: Check that both wallets generate the same set of Addresses. You can now send to these **Addresses** (note they start with a “7”) with any wallet that can send to P2SH Addresses.
it: Verifica che entrambi i wallet generino lo stesso set di indirizzi. Ora puoi inviare a questi **Indirizzi** (nota che iniziano con un "7") con qualsiasi wallet in grado di inviare a indirizzi P2SH.
ru: Проверьте, генерируют ли кошельки один и тот же набор Адресов. Теперь вы можете отправлять средства на эти **Адреса** (обратите внимание, что все они начинаются с "7") с любого кошелька, который работает с P2SH адресами.

source: Sending
it: Invio
ru: Отправка

source: To spend coins from a 2-of-2 wallet, two cosigners need to sign a transaction collaboratively. To accomplish this, create a transaction using one of the wallets (by filling out the form on the **Send** tab). After signing, a window is shown with the transaction details.
it: Per spendere monete da un wallet 2 su 2, due cofirmatari devono firmare una transazione in modo collaborativo. Per fare ciò, crea una transazione utilizzando uno dei wallet (compilando il modulo nella scheda **Invia**). Dopo aver firmato, viene visualizzata una finestra con i dettagli della transazione.
ru: Чтобы потратить моменты из 2-из-2 кошелька, оба подписывающих лица должны вместе подписать транзакцию. Для этого, создайте транзакцию в одном из этих кошельков (заполнив форму во вкладке **Отправить**). После подписания появится окно с деталями транзакции.

source: Partially signed 2-of-2 multisig transaction in Dash Electrum
it: Transazione multisig 2-su-2 parzialmente firmata in Dash Electrum
ru: Частично подписанная 2-из-2 транзакция в Dash Electrum

source: The transaction now has to be sent to the second wallet. Several options are available for this:
it: La transazione ora deve essere inviata al secondo wallet. A questo scopo sono disponibili diverse opzioni:
ru: Теперь эта транзакция отправляется во второй кошелёк. И тут возможны несколько вариантов:

source: You can transfer the file on a USB stick
it: Puoi trasferire il file su una chiavetta USB
ru: Вы можете поместить файл на USB-флешку

source: You can save the partially signed transaction to a file (using the **Save** button), transfer that to the machine where the second wallet is running (via USB stick, for example) and load it there (using **Tools > Load transaction > From file**)
it: È possibile salvare la transazione parzialmente firmata in un file (utilizzando il pulsante **Salva**), trasferirlo sulla macchina su cui è in esecuzione il secondo portafoglio (tramite chiavetta USB, ad esempio) e caricarlo lì (utilizzando **Strumenti > Carica transazione > Da file**)
ru: Вы можете сохранить частично подписанную транзакцию в файл (через кнопку **Сохранить**), перенести его на машину, где находится второй кошелёк (например, с помощью USB-флешки), и загрузить его туда (**Инструменты > Загрузить транзакцию > Из файла**)

source: You can use QR codes
it: Puoi utilizzare i codici QR
ru: Можно использовать QR код

source: A button showing a QR code icon is also available. Clicking this button will display a QR code containing the transaction, which can be scanned into the second wallet (**Tools > Load Transaction > From QR Code**)
it: È inoltre disponibile un pulsante che mostra l'icona di un codice QR. Facendo clic su questo pulsante verrà visualizzato un codice QR contenente la transazione, che può essere scansionato nel secondo wallet (**Strumenti > Carica transazione > Da codice QR**)
ru: Также есть кнопка, показывающая картинку с QR кодом. Если на неё нажать, отобразится QR код, содержащий транзакцию. Его можно отсканировать во втором кошельке (**Инструменты > Загрузить транзакцию > Из QR кода**)

source: With both of the above methods, you can now add the second signature to the transaction (using the **Sign** button). It will then be broadcast to the network.
it: Con entrambi i metodi sopra descritti, ora puoi aggiungere la seconda firma alla transazione (utilizzando il pulsante **Firma**). Verrà poi trasmesso in rete.
ru: После того, как вы перенесли транзакцию любым из вышеописанных методов, можете добавить к ней вторую подпись (кнопка **Подписать**). Затем она будет отправлена в сеть.

source: Fully signed 2-of-2 multisig transaction in Dash Electrum
it: Transazione multisig 2-su-2 completamente firmata in Dash Electrum
ru: Полностью подписанная транзакция с мультиподписью 2-из-2х в Dash Electrum

source: Sweep a paper wallet
it: Spazza un paper wallet
ru: Перемещение средств из бумажного кошелька

source: You may have received a paper wallet as a gift from another Dash user, or previously stored one in a safe deposit box. Funds are swept from a :ref:`paper wallet <paper-wallets>` into a live wallet by importing its `private key <https://bitzuma.com/posts/six-things-bitcoin-users-should-know-about-private-keys/>`_, which is a long sequence of characters starting with the number "7" or the capital letter "X". The example below displays a private key (WIF format).
it: Potresti aver ricevuto un wallet di carta come regalo da un altro utente Dash o averne precedentemente conservato uno in una cassetta di sicurezza. I fondi vengono spostati da un :ref:`paper wallet <paper-wallets>` in un wallet live importando la sua `chiave privata <https://bitzuma.com/posts/six-things-bitcoin-users-should-know-about-private-keys/>`_, che è una lunga sequenza di caratteri che inizia con il numero "7" o la lettera maiuscola "X". L'esempio seguente mostra una chiave privata (formato WIF).
ru: Возможно, вы получили бумажный кошелёк в подарок от другого пользователя Dash, или ранее хранили его в безопасном месте. Средства можно переместить из :ref:`бумажного кошелька<paper-wallets>` в электронный кошелёк через импорт его приватного ключа <https://bitzuma.com/posts/six-things-bitcoin-users-should-know-about-private-keys/>`_, который является длинной последовательностью символов и начинается с "7" или заглавной буквы "X". Ниже показан пример приватного ключа (в формате WIF).

source: Public address and associated private key produced by Dash Paper Wallet Generator
it: Indirizzo pubblico e chiave privata associata prodotti da Dash Paper Wallet Generator
ru: Публичный адрес и связанный с ним приватный ключ, созданный с помощью Генератора бумажных кошельков Dash

source: Funds from paper wallets are swept into an Dash Electrum Wallet by creating a transaction using the private key and sending it to a new address from your wallet. This is necessary because it is not possible to add new public or private keys to an existing deterministic series of addresses derived from a seed phrase.
it: I fondi dai paper wallet vengono trasferiti in un wallet Dash Electrum creando una transazione utilizzando la chiave privata e inviandola a un nuovo indirizzo dal tuo wallet. Ciò è necessario perché non è possibile aggiungere nuove chiavi pubbliche o private a una serie deterministica esistente di indirizzi derivati da una frase seme.
ru: Средства из бумажных кошельков можно перенести в кошелёк Dash Electrum, создав с помощью приватного ключа транзакцию и отправив её на новый адрес в вашем кошельке. Это необходимо, поскольку нельзя добавить новые публичные или приватные ключи к уже существующей определённой серии адресов, полученных из мнемонической фразы.

source: Begin by selecting the **Wallet** > **Private Keys** > **Sweep** menu item. The **Sweep private keys** dialog will appear, where you can paste your private key(s). An unused address controlled by your Dash Electrum wallet appears in the lower field, and can be changed by clicking the **Address** button. Once you have pasted your private key, click the **Sweep** button.
it: Inizia selezionando la voce di menu **Wallet** > **Chiavi private** > **Sweep**. Verrà visualizzata la finestra di dialogo **Sweep private keys**, in cui potrai incollare le tue chiavi private. Un indirizzo non utilizzato controllato dal tuo wallet Dash Electrum viene visualizzato nel campo inferiore e può essere modificato facendo clic sul pulsante **Indirizzo**. Dopo aver incollato la chiave privata, fai clic sul pulsante **Sweep**.
ru: Перейдите в меню **Кошелёк** > **Приватные ключи** > **Перевести**. Откроется диалог **Сканировать приватные ключи**, куда вы можете ввести ваш приватный ключ (ключи). В нижнем поле появится неиспользованный адрес, связанный с вашим кошельком Dash Electrum. Его можно изменить, нажав на кнопку **Адрес**. После того, как вы ввели приватный ключ, нажмите **Сканировать**.

source: Entering the private key
it: Immissione della chiave privata
ru: Ввод приватного ключа
