Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/advanced.po
Languages: it, ru

source: Dash Electrum then prepares a transaction using the private key you just imported to derive the public address for the transaction input and the address from your wallet as the output, and signs the message. Click **Broadcast** to enter the transaction on the blockchain. The balance will then appear in your wallet under the specified address. The address you swept is left with zero balance.
it: Dash Electrum prepara quindi una transazione utilizzando la chiave privata appena importata per ricavare l'indirizzo pubblico per l'input della transazione e l'indirizzo dal tuo wallet come output e firma il messaggio. Fai clic su **Trasmetti** per inserire la transazione sulla blockchain. Il saldo apparirà quindi nel tuo wallet sotto l'indirizzo specificato. L'indirizzo che hai spazzato rimane con saldo zero.
ru: Затем Dash Electrum подготовит транзакцию, используя введённый приватный ключ, чтобы получить публичный адрес для ввода транзакции, а адрес из вашего кошелька для вывода, и подпишет сообщение. Нажмите **Транслировать**, чтобы отправить транзакцию в блокчейн. После этого сумма появится в вашем кошельке под определённым адресом. А на том адресе, с которого вы взяли средства, сумма обнулится.

source: Broadcasting the sweep transaction
it: Trasmissione della transazione spazzolata
ru: Трансляция транзакции с бумажного кошелька

source: Cold storage
ru: Холодное хранение

source: This section shows how to create an offline wallet that holds your Dash and a watching-only online wallet that is used to view its history and to create transactions that have to be signed with the offline wallet before being broadcast on the online one.
it: Questa sezione mostra come creare un wallet offline che contenga il tuo Dash e un wallet online di sola visione utilizzato per visualizzarne la cronologia e per creare transazioni che devono essere firmate con il wallet offline prima di essere trasmesse su quello online.
ru: В этом разделе рассказывается, как создать оффлайн кошелёк, на котором будут храниться ваши Dash, и работающий в режиме просмотра онлайн кошелёк, который будет использоваться чтобы просматривать историю переводов и создавать транзакции на подпись для оффлайн-кошелька перед трансляцией их через онлайн кошелёк.

source: Create an offline wallet
it: Crea un wallet offline
ru: Создание оффлайн кошелька

source: Create a wallet on an offline machine, as per the usual process (**File > New**). After creating the wallet, go to **Wallet -> Master Public Keys**.
it: Crea un wallet su una macchina offline, come da procedura abituale (**File > Nuovo**). Dopo aver creato il wallet, vai su **Wallet -> Chiavi pubbliche principali**.
ru: Создайте кошёлек обычным способом, через меню (**Файл > Новый**). После создания кошелька, откройте **Кошелёк > Главные публичные ключи**.

source: Master Public Key of a new offline wallet
it: Chiave pubblica principale di un nuovo wallet offline
ru: Главный публичный ключ нового оффлайн кошелька

source: The Master Public Key of your wallet is the string shown in this popup window. Transfer that key to your online machine somehow.
it: La chiave pubblica principale del tuo wallet è la stringa mostrata in questa finestra popup. Trasferisci quella chiave sul tuo computer online in qualche modo.
ru: Главный публичный ключ вашего кошелька - это строка, которая отображается во всплывающем окне. Скопируйте этот ключ на вашу онлайн машину любым удобным способом.

source: Create a watching-only version of your wallet
it: Crea una versione del tuo wallet solo per la visione
ru: Создание кошелька с ограниченным функционалом

source: On your online machine, open Dash Electrum and select **File > New/Restore**. Enter a name for the wallet and select **Use public or private keys**. Paste your master public key in the box. Click **Next** to complete the creation of your wallet. When you’re done, you should see a popup informing you that you are opening a watching-only wallet.
it: Sul tuo computer online, apri Dash Electrum e seleziona **File > Nuovo/Ripristina**. Inserisci un nome per il wallet e seleziona **Utilizza chiavi pubbliche o private**. Incolla la tua chiave pubblica principale nella casella. Fai clic su **Avanti** per completare la creazione del tuo wallet. Quando hai finito, dovresti vedere un popup che ti informa che stai aprendo un wallet di sola visione.
ru: Откройте на вашей онлайн машине Dash Electrum и выберите **Файл > Новый / Восстановить**. Введите имя кошелька и выберите **Использовать публичные или приватные ключи**. Введите ваш главный публичный ключ в поле. Чтобы завершить создание кошелька, нажмите **Далее**. Когда всё будет готово, вы увидите всплывающее окно с информацией, что вы открываете кошелёк с ограниченным функционалом.

source: The transaction history of your cold wallet should then appear.
it: Dovrebbe quindi apparire la cronologia delle transazioni del tuo wallet freddo.
ru: Затем должна появиться история транзакций вашего холодного кошелька.

source: Create an unsigned transaction
it: Crea una transazione non firmata
ru: Создание неподписанной транзакции

source: Go to the **Send** tab on your online watching-only wallet, input the transaction data and click **Send**. A window will appear to inform you that a transaction fee will be added. Continue. In the window that appears up, click **Save** and save the transaction file somewhere on your computer. Close the window and transfer the transaction file to your offline machine (e.g. with a USB stick).
it: Vai alla scheda **Invia** sul tuo wallet per la sola visione online, inserisci i dati della transazione e fai clic su **Invia**. Apparirà una finestra per informarti che verrà aggiunta una commissione di transazione. Continua. Nella finestra visualizzata, fai clic su **Salva** e salva il file della transazione da qualche parte sul tuo computer. Chiudi la finestra e trasferisci il file della transazione sul tuo computer offline (ad esempio con una chiavetta USB).
ru: В онлайн-кошельке, работающем в ограниченном режиме, откройте вкладку **Отправить**, введите данные о транзакции и нажмите **Отправить**. Появится окно с уведомлением, что к сумме транзакции будет добавлена комиссия. Далее. В появившемся окне нажмите **Сохранить** и сохраните транзакцию в удобное место на вашем компьютере. Закройте окно и перенесите файл транзакции на оффлайн-машину (например, с помощью USB-флешки).

source: Sign your transaction
it: Firma la tua transazione
ru: Как подписать транзакцию

source: On your offline wallet, select **Tools > Load transaction -> From file** in the menu and select the transaction file created in the previous step. Click **Sign**. Once the transaction is signed, the Transaction ID appears in its designated field. Click **Save**, store the file somewhere on your computer, and transfer it back to your online machine.
it: Sul tuo wallet offline, seleziona **Strumenti > Carica transazione -> Da file** nel menu e seleziona il file di transazione creato nel passaggio precedente. Fai clic su **Firma**. Una volta firmata la transazione, l'ID della transazione appare nel campo designato. Fai clic su **Salva**, archivia il file da qualche parte sul tuo computer e trasferiscilo nuovamente sul tuo computer online.
ru: В меню оффлайн кошелька выберите **Инструменты > Загрузить транзакцию > Из файла** и выберите файл транзакции, который создали на предыдущем шаге. Нажмите **Подписать**. После подписания транзакции, в указанном поле появится ID транзакции. Нажмите **Сохранить**, сохраните файл в удобное место на вашем компьютере и перенесите его обратно на онлайн машину.

source: Broadcast your transaction
it: Trasmetti la tua transazione
ru: Трансляция вашей транзакции

source: On your online machine, select **Tools -> Load transaction -> From file** from the menu. Select the signed transaction file. In the window that opens up, click **Broadcast**. The transaction will be broadcast over the Dash network.
it: Sul tuo computer online, seleziona **Strumenti -> Carica transazione -> Da file** dal menu. Seleziona il file della transazione firmato. Nella finestra che si apre, fai clic su **Trasmetti**. La transazione verrà trasmessa sulla rete Dash.
ru: На онлайн машине, в меню кошелька выберите **Инструменты > Загрузить транзакцию > Из файла**. Выберите файл с подписанной транзакцией. В открывшемся окне нажмите **Транслировать**. Транзакция будет транслирована в сеть Dash.

source: Command line
it: Linea di comando
ru: Командная строка

source: Dash Electrum has a powerful command line available when running under Linux or macOS. This section will show you a few basic principles.
it: Dash Electrum dispone di una potente riga di comando disponibile quando si esegue su Linux o macOS. Questa sezione ti mostrerà alcuni principi di base.
ru: У Dash Electrum есть командная строка, доступная при работе с Linux или macOS. В этом разделе мы расскажем о нескольких базовых принципах работы с ней.

source: Using the inline help
it: Utilizzando la guida in linea
ru: Использование встроенного помощника

source: To see the list of Dash Electrum commands, type::
it: Per visualizzare l'elenco dei comandi Dash Electrum, digitare::
ru: Чтобы посмотреть список команда Dash Electrum, введите::

source: To see the documentation for a command, type::
it: Per visualizzare la documentazione di un comando, digitare::
ru: Чтобы посмотреть инструкции к команде, введите::

source: Magic words
it: Parole magiche
ru: Волшебные слова

source: The arguments passed to commands may be one of the following magic words: `! ? : -`.
it: Gli argomenti passati ai comandi possono essere una delle seguenti parole magiche: `! ? : -`.
ru: Аргументы, которые передаются командам, могут содержать следующие волшебные слова: `! ? : -`.

source: The exclamation mark `!` is a shortcut that means ‘the maximum amount available’. Note that the transaction fee will be computed and deducted from the amount. Example::
it: Il punto esclamativo `!` è una scorciatoia che significa "l'importo massimo disponibile". Tieni presente che la commissione di transazione verrà calcolata e detratta dall'importo. Esempio::
ru: Восклицательный знак `!` - это сокращение, означающее "максимально доступное количество". Обратите внимание, что комиссия за транзакцию будет рассчитана и вычтена из этой суммы. Например::

source: A question mark `?` means that you want the parameter to be prompted. Example::
it: Un punto interrogativo `?` significa che si desidera che il parametro venga richiesto. Esempio::
ru: Вопросительный знак `?` означает, что вы хотите запросить какой-либо параметр. Например::

source: Use a colon `:` if you want the prompted parameter to be hidden (not echoed in your terminal). Note that you will be prompted twice in this example, first for the private key, then for your wallet password::
it: Utilizza i due punti `:` se desideri che il parametro richiesto venga nascosto (non visualizzato nel terminale). Tieni presente che in questo esempio ti verrà richiesta due volte, prima la chiave privata, poi la password del tuo wallet::
ru: Если вы хотите спрятать запрошенный параметр (чтобы он не отображался в вашем терминале), используйте двоеточие `:`. Обратите внимание, что здесь у вас дважды запросят подтверждение - сначала через приватный ключ, затем через пароль от кошелька::

source: A parameter replaced by a dash `-` will be read from standard input (in a pipe)::
it: Un parametro sostituito da un trattino `-` verrà letto dallo standard input (in una pipe)::
ru: Параметр, заменённый на дефис `-` будет считан из стандартного ввода (in a pipe)::

source: Aliases
it: Alias
ru: Псевдонимы

source: You can use DNS aliases in place of bitcoin addresses, in most commands::
it: Puoi utilizzare gli alias DNS al posto degli indirizzi bitcoin, nella maggior parte dei comandi::
ru: Также, в большинстве команд вместо адресов биткойн можно пользоваться DNS псевдонимам::

source: Formatting outputs using jq
it: Formattazione degli output utilizzando jq
ru: Форматирование вывода с помощью jq

source: Command outputs are either simple strings or json structured data. A very useful utility is the ‘jq’ program. Install it with::
it: Gli output dei comandi sono stringhe semplici o dati strutturati JSON. Un'utilità molto utile è il programma "jq". Installalo con::
ru: Команды выводятся либо в простых строках, либо в структурированных данных json. Программа jq - очень полезная утилита. Установите её с помощью::

source: The following examples use it.
it: Gli esempi seguenti lo utilizzano.
ru: Она используется в следующем примере.

source: Sign and verify message
it: Firma e verifica il messaggio
ru: Подписание и верификация сообщения

source: We may use a variable to store the signature, and verify it::
it: Potremmo utilizzare una variabile per memorizzare la firma e verificarla::
ru: Мы можем использовать переменную, чтобы хранить подпись и верифицировать её::

source: And::
it: E::
ru: А также::

source: Show the values of your unspents
it: Mostra i valori delle tue spese non spese
ru: Отображение остатка

source: The `listunspent` command returns a list of dict objects, with various fields. Suppose we want to extract the `value` field of each record. This can be achieved with the jq command::
it: Il comando `listunspent` restituisce un elenco di oggetti dict, con vari campi. Supponiamo di voler estrarre il campo "valore" di ciascun record. Ciò può essere ottenuto con il comando jq::
ru: Команда `listunspent` выводит список dict объектов с различными полями. Допустим, мы хотим из каждой записи извлечь поле `value`, т. е. "количество". Этого можно добиться с помощью следующей jq команды::

source: Select only incoming transactions from history
it: Seleziona solo le transazioni in entrata dalla cronologia
ru: Как выбрать из истории только входящие транзакции

source: Incoming transactions have a positive ‘value’ field::
it: Le transazioni in entrata hanno un campo "valore" positivo::
ru: У входящих транзакций в поле ‘value’ позитивное значение::

source: Filter transactions by date
it: Filtra le transazioni per data
ru: Сортировка транзакций по дате

source: The following command selects transactions that were timestamped after a given date::
it: Il comando seguente seleziona le transazioni con timestamp successivo a una data specifica::
ru: Эти команды выбирают те транзакции, которые были проведены после выбранной даты::

source: Similarly, we may export transactions for a given time period::
it: Allo stesso modo, possiamo esportare transazioni per un determinato periodo di tempo:
ru: Таким же образом мы можем экспортировать транзакции за нужный период времени::

source: Encrypt and decrypt messages
it: Crittografare e decrittografare i messaggi
ru: Зашифровка и расшифровка сообщений

source: First we need the public key of a wallet address::
it: Per prima cosa abbiamo bisogno della chiave pubblica dell'indirizzo di un portafoglio::
ru: Для этого нам понадобится публичный ключ адреса кошелька::

source: Encrypt::
it: Crittografa::
ru: Зашифровка::

source: Decrypt::
it: Decifra::
ru: Расшифровка::

source: Note: this command will prompt for the encrypted message, then for the wallet password.
it: Nota: questo comando richiederà il messaggio crittografato, quindi la password del portafoglio.
ru: Обратите внимание: эта команда потребует ввести сначала зашифрованное сообщение, а затем пароль от кошелька.

source: Export private keys and sweep coins
it: Esporta chiavi private e spazza monete
ru: Экспорт приватных ключей и перемещение монет

source: The following command will export the private keys of all wallet addresses that hold some Dash::
it: Il comando seguente esporterà le chiavi private di tutti gli indirizzi dei wallet che contengono alcuni Dash::
ru: С помощью следующей команды можно экспортировать приватные ключи всех адресов кошелька, на которых есть какое-то количество Dash::

source: This will return a list of lists of private keys. In most cases, you want to get a simple list. This can be done by adding a jq filer, as follows::
it: Ciò restituirà un elenco di elenchi di chiavi private. Nella maggior parte dei casi, si desidera ottenere un elenco semplice. Questo può essere fatto aggiungendo un filer jq, come segue::
ru: Эта команда выведет список приватных ключей. В большинстве случаев, вам просто понадобится список. Это можно сделать с помощью jq фильтра::

source: Finally, let us use this list of private keys as input to the sweep command::
it: Infine, utilizziamo questo elenco di chiavi private come input per il comando sweep::
ru: И наконец, нам нужно использовать список приватных ключей, чтобы ввести команду на перевод средств::

source: Using cold storage with the command line
it: Utilizzo della cold storage con la riga di comando
ru: Использование холодного хранения с командной строкой

source: This section will show you how to sign a transaction with an offline Dash Electrum wallet using the command line.
it: Questa sezione ti mostrerà come firmare una transazione con un wallet Dash Electrum offline utilizzando la riga di comando.
ru: В этом разделе рассказывается, как подписать транзакцию в оффлайн кошельке Dash Electrum с помощью командной строки.

source: With your online (watching-only) wallet, create an unsigned transaction::
it: Con il tuo wallet online (solo visione), crea una transazione non firmata::
ru: Создайте неподписанную транзакцию с помощью онлайн-кошелька (с ограниченным функционалом)::

source: The unsigned transaction is stored in a file named ‘unsigned.txn’. Note that the –unsigned option is not needed if you use a watching-only wallet.
it: La transazione non firmata viene archiviata in un file denominato "unsigned.txn". Tieni presente che l'opzione –unsigned non è necessaria se utilizzi un wallet di sola visione.
ru: Неподписанная транзакция хранится в файле ‘unsigned.txn’. Обратите внимание, что вам не понадобится опция –unsigned, если вы пользуетесь кошельком с ограниченным функционалом.

source: You may view it using::
it: Puoi visualizzarlo utilizzando::
ru: Её можно посмотреть с помощью::

source: Sign the transaction
it: Firma la transazione
ru: Подписание транзакции

source: The serialization format of Dash Electrum contains the master public key needed and key derivation used by the offline wallet to sign the transaction. Thus we only need to pass the serialized transaction to the offline wallet::
it: Il formato di serializzazione di Dash Electrum contiene la chiave pubblica principale necessaria e la chiave di derivazione utilizzata dal portafoglio offline per firmare la transazione. Pertanto dobbiamo solo passare la transazione serializzata al wallet offline:
ru: Сериализация формата Dash Electrum содержит главный публичный ключ, а также ключ с наследованием, который используется офлайн кошельком для подписания транзакции. Таким образом, нам нужно только передать сериализованную транзакцию в офлайн кошелёк.

source: The command will ask for your password, and save the signed transaction in ‘signed.txn’.
it: Il comando richiederà la tua password e salverà la transazione firmata in "signed.txn".
ru: После команды потребуется ввести пароль, а также сохранить подписанную транзакцию в ‘signed.txn’.

source: Broadcast the transaction
it: Trasmetti la transazione
ru: Трансляция транзакции

source: Send your transaction to the Dash network, using broadcast::
it: Invia la tua transazione alla rete Dash, utilizzando broadcast::
ru: Отправьте вашу транзакцию в сеть Dash::

source: If successful, the command will return the ID of the transaction.
it: In caso di successo, il comando restituirà l'ID della transazione.
ru: Если всё прошло успешно, высветится ID транзакции.

source: How to accept Dash on a website using Dash Electrum
it: Come accettare Dash su un sito Web utilizzando Dash Electrum
ru: Как принимать Dash через вебсайт с помощью Dash Electrum

source: This tutorial will show you how to accept dash on a website with SSL signed payment requests. It is updated for Dash Electrum 2.6.
it: Questo tutorial ti mostrerà come accettare Dash su un sito Web con richieste di pagamento firmate SSL. È aggiornato per Dash Electrum 2.6.
ru: В этом уроке мы расскажем вам, как принимать Dash на вебсайте с подписанными SSL платёжными запросами. Урок обновлён для версии Dash Electrum 2.6.

source: Requirements
it: Requisiti
ru: Требования

source: A webserver serving static HTML
it: Un server web che serve HTML statico
ru: Веб-сервер, который поддерживает статичный HTML

source: A SSL certificate (signed by a CA)
it: Un certificato SSL (firmato da una CA)
ru: Сертификат SSL (подписанный CA)

source: Electrum version >= 2.6
it: Electrum versione >= 2.6
ru: Electrum версии 2.6 или выше

source: Create a wallet
it: Crea un wallet
ru: Создайте кошелёк

source: Create a wallet on your web server::
it: Crea un wallet sul tuo server web::
ru: Создайте кошелёк на вашем веб-сервере

source: You can also use a watching only wallet (restored from xpub), if you want to keep private keys off the server. Once your wallet is created, start Dash Electrum as a daemon::
it: Puoi anche utilizzare un wallet solo per la visione (ripristinato da xpub), se vuoi mantenere le chiavi private lontane dal server. Una volta creato il tuo wallet, avvia Dash Electrum come daemon::
ru: Если вы хотите, чтобы приватные ключи не хранились на сервере, можно использовать кошелёк с ограниченным функционалом (восстановленный через xpub). После создания кошелька, запустить Dash Electrum в фоновом режиме::

source: Add your SSL certificate to your configuration
it: Aggiungi il tuo certificato SSL alla tua configurazione
ru: Добавьте в настройки SSL сертификат

source: You should have a private key and a public certificate for your domain. Create a file that contains only the private key::
it: Dovresti avere una chiave privata e un certificato pubblico per il tuo dominio. Crea un file che contenga solo la chiave privata::
ru: Вам нужно отправить приватный ключ и публичный сертификат вашего домена. Создайте файл, в котором будет только приватный ключ::

source: Set the path to your the private key file with setconfig::
it: Imposta il percorso del file della chiave privata con setconfig::
ru: С помощью setconfig задайте путь к файлу с приватным ключом::

source: Create another file that contains your certificate and the list of certificates it depends on, up to the root CA. Your certificate must be at the top of the list, and the root CA at the end::
it: Crea un altro file che contenga il tuo certificato e l'elenco dei certificati da cui dipende, fino alla CA radice. Il tuo certificato deve essere in cima all'elenco e la CA radice alla fine:
ru: Создайте ещё один файл, в котором будет ваш сертификат и список сертификатов, с которыми он связан, в том числе корневой CA. Ваш сертификат должен находиться в начале списка, а корневой CA - в конце::

source: Set the `ssl_chain` path with setconfig::
it: Imposta il percorso `ssl_chain` con setconfig::
ru: Задайте путь `ssl_chain` с помощью setconfig::

source: Configure a requests directory
it: Configura una directory delle richieste
ru: Настройте директорию под запросы

source: This directory must be served by your webserver (eg Apache)::
it: Questa directory deve essere servita dal tuo server web (ad esempio Apache)::
ru: Эта директория должна поддерживаться вашим вебсайтом (например, Apache)::
