Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/advanced.po
Languages: it, ru

source: By default, Dash Electrum will display local URLs, starting with ‘file://‘ In order to display public URLs, we need to set another configuration variable, `url_rewrite`. For example::
it: Per impostazione predefinita, Dash Electrum visualizzerà gli URL locali, iniziando con "file://". Per visualizzare gli URL pubblici, dobbiamo impostare un'altra variabile di configurazione, "url_rewrite". Per esempio::
ru: По умолчанию, Dash Electrum будет отображать локальные URL, в том числе ‘file://‘. Чтобы отображались глобальные URL, нам нужно настроить ещё один параметр, `url_rewrite`. Например::

source: Create a signed payment request
it: Crea una richiesta di pagamento firmata
ru: Создайте подписанный запрос на оплату

source: This command returns a json object with two URLs:
it: Questo comando restituisce un oggetto json con due URL:
ru: Эта команда выводит json объект с двумя URL::

source: `request_url` is the URL of the signed BIP70 request.
it: "request_url" è l'URL della richiesta BIP70 firmata.
ru: `request_url` это URL подписанного реквеста BIP70.

source: `index_url` is the URL of a webpage displaying the request.
it: "index_url" è l'URL di una pagina Web che visualizza la richiesta.
ru: `index_url` это URL странички, которая отображает реквест.

source: Note that request_url and index_url use the domain name we defined in `url_rewrite`. You can view the current list of requests using the `listrequests` command.
it: Tieni presente che request_url e index_url utilizzano il nome di dominio che abbiamo definito in "url_rewrite". Puoi visualizzare l'elenco corrente delle richieste utilizzando il comando "listrequests".
ru: Обратите внимание, что request_url и index_url используют доменное имя, которые мы установили в `url_rewrite`. Список с текущими запросами можно посмотреть с помощью команды `listrequests`.

source: Open the payment request page in your browser
it: Apri la pagina di richiesta di pagamento nel tuo browser
ru: Откройте страничку с запросом оплаты в вашем браузере.

source: Let us open `index_url` in a web browser.
it: Apriamo "index_url" in un browser web.
ru: Давайте откроем `index_url` в браузере.

source: Payment request page in a web browser
it: Pagina di richiesta di pagamento in un browser web
ru: Страница запроса оплаты в веб-браузере

source: The page shows the payment request. You can open the dash: URI with a wallet, or scan the QR code. The bottom line displays the time remaining until the request expires.
it: La pagina mostra la richiesta di pagamento. Puoi aprire il dash: URI con un wallet o scansionare il codice QR. La riga inferiore visualizza il tempo rimanente fino alla scadenza della richiesta.
ru: На этой странице отображается запрос оплаты. Вы можете открыть dash: URI с помощью кошелька или просканировать QR код. Линия внизу показывает время, оставшееся до истечения срока действия запроса.

source: Wallet awaiting payment
it: Portafoglio in attesa di pagamento
ru: Кошелёк в ожидании платежа

source: This page can already be used to receive payments. However, it will not detect that a request has been paid; for that we need to configure websockets.
it: Questa pagina può già essere utilizzata per ricevere pagamenti. Tuttavia, non rileverà che una richiesta è stata pagata; per questo dobbiamo configurare i websocket.
ru: Эту страницу уже можно использовать для получения оплаты. Однако, она не сможет отследить, что запрос был оплачен; для этого нам надо настроить веб-сокеты.

source: Add web sockets support
it: Aggiungi il supporto per i socket Web
ru: Добавление поддержки веб-сокетов

source: Get SimpleWebSocketServer from here::
it: Ottieni SimpleWebSocketServer da qui::
ru: Скачать SimpleWebSocketServer можно здесь::

source: Set `websocket_server` and `websocket_port` in your config::
it: Imposta `websocket_server` e `websocket_port` nella tua configurazione::
ru: Установите `websocket_server` и `websocket_port` в ваши настройки::

source: And restart the daemon::
it: E riavvia il daemon::
ru: И перезапустите работающую службу::

source: Now, the page is fully interactive: it will update itself when the payment is received. Please notice that higher ports might be blocked on some client’s firewalls, so it is more safe for example to reverse proxy websockets transmission using standard 443 port on an additional subdomain.
it: Ora la pagina è completamente interattiva: si aggiornerà automaticamente una volta ricevuto il pagamento. Tieni presente che le porte più alte potrebbero essere bloccate sui firewall di alcuni client, quindi è più sicuro, ad esempio, invertire la trasmissione dei websocket proxy utilizzando la porta 443 standard su un sottodominio aggiuntivo.
ru: Теперь страничка полностью интерактивна: она будет обновляться после получения платежа. Пожалуйста, обратите внимание, что некоторые порты могут блокироваться фаерволами клиентов, поэтому было бы более безопасно, например, изменить прокси веб-сокетов, которые используют стандартный 443 порт на дополнительный под-домен.

source: JSONRPC interface
it: Interfaccia JSONRPC
ru: Интерфейс JSONRPC

source: Commands to the Dash Electrum daemon can be sent using JSONRPC. This is useful if you want to use Dash Electrum in a PHP script.
it: I comandi al daemon Dash Electrum possono essere inviati utilizzando JSONRPC. Ciò è utile se desideri utilizzare Dash Electrum in uno script PHP.
ru: С помощью JSONRPC можно отправлять команды службе Dash Electrum. Это может оказаться полезно, если вы хотите использовать Dash Electrum с PHP скриптом.

source: Note that the daemon uses a random port number by default. In order to use a stable port number, you need to set the `rpcport` configuration variable (and to restart the daemon)::
it: Tieni presente che il daemon utilizza un numero di porta casuale per impostazione predefinita. Per utilizzare un numero di porta stabile, è necessario impostare la variabile di configurazione `rpcport` (e riavviare il demone)::
ru: Обратите внимание, что по умолчанию служба использует случайный номер порта. Чтобы использовать постоянный номер порта, вам нужно настроить переменные в `rpcport` (а также перезапустить службу)::

source: With this setting, we can perform queries using curl or PHP. Example::
it: Con questa impostazione possiamo eseguire query utilizzando curl o PHP. Esempio::
ru: С этими настройками, мы можем выполнять запросы, используя curl или PHP. Например::

source: Query with named parameters::
it: Query con parametri denominati::
ru: Запрос с заданными параметрами::

source: Create a payment request::
it: Crea una richiesta di pagamento::
ru: Создание платёжного запроса::
