Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/faq.po
Languages: ar, es, fr, it, zh_cn

source: Your seed and private keys are encrypted using AES-256-CBC. The private keys are decrypted only briefly, when you need to sign a transaction; for this you need to enter your password. This is done in order to minimize the amount of time during which sensitive information is unencrypted in your computer's memory.
ar: يتم تشفير البذرة والمفاتيح الخاصة باستخدام AES-256-CBC. يتم فك تشفير المفاتيح الخاصة لفترة وجيزة فقط ، عندما تحتاج إلى توقيع صفقة ؛ لهذا تحتاج إلى إدخال كلمة المرور الخاصة بك. يتم ذلك لتقليل مقدار الوقت الذي تكون فيه المعلومات الحساسة غير مشفرة في ذاكرة الكمبيوتر.
es: Tu semilla y llaves privadas se encriptan utilizando AES-256-CBC. Las llaves privadas se desencriptan solo brevemente, cuando necesitas firmar una transacción; para esto debes ingresar tu contraseña. Esto se hace con el fin de minimizar la cantidad de tiempo durante el cual la información confidencial no está encriptada en la memoria de tu computadora.
fr: Votre graine et vos clés privées sont chiffrées avec AES-256-CBC. Les clés privées ne sont déchiffrées que brièvement, quand vous devez signer une transaction ; pour cela vous devez saisir votre mot de passe. Cela permet de réduire le temps durant lequel ces informations sensibles sont stockées déchiffrées dans la mémoire de votre ordinateur.
it: Il tuo seed e le tue chiavi private sono crittografate utilizzando AES-256-CBC. Le chiavi private vengono decriptate solo brevemente, quando è necessario firmare una transazione; per questo è necessario inserire la password. Questo viene fatto per ridurre al minimo il tempo durante il quale le informazioni sensibili non vengono crittografate nella memoria del computer.
zh_cn: 用户的种子和私钥通过AES-256-CBC进行加密。在用户签署交易的时候，私钥可暂时解密，这时，用户需要输入密码。这样的设计是为了最大限度地减少在计算机内存上解密敏感信息所需的时间。

source: In addition, your wallet file may be encrypted on disk. Note that the wallet information will remain unencrypted in the memory of your computer for the duration of your session. If a wallet is encrypted, then its password will be required in order to open it. Note that the password will not be kept in memory; Dash Electrum does not need it in order to save the wallet on disk, because it uses asymmetric encryption (ECIES).
ar: بالإضافة إلى ذلك ، قد يتم تشفير ملف المحفظة على القرص. لاحظ أن معلومات المحفظة ستبقى غير مشفرة في ذاكرة الكمبيوتر طوال مدة الجلسة. إذا كانت إحدى الحافظات مشفرة ، فستكون كلمة المرور الخاصة بها مطلوبة من أجل فتحها. لاحظ أنه لن يتم الاحتفاظ بكلمة المرور في الذاكرة؛ داش الكتروم لا يحتاج إليها لحفظ المحفظة على القرص ، لأنه يستخدم التشفير غير المتماثل (ECIES).
es: Además, tu archivo de billetera puede estar encriptado en el disco. Ten en cuenta que la información de la billetera permanecerá sin encriptar en la memoria de tu computadora durante tu sesión. Si una billetera está encriptada, entonces se requerirá tu contraseña para abrirla. Ten en cuenta que la contraseña no se mantendrá en la memoria; Dash Electrum no la necesita para guardar la billetera en el disco, ya que usa encriptación asimétrica (ECIES).
fr: De plus, votre fichier de portefeuille peut être chiffré sur le disque. Veuillez noter que les informations du portefeuille resteront déchiffrées dans la mémoire de votre ordinateur pour la durée de votre session. Si un portefeuille est chiffré, son mot de passe sera exigé pour l'ouvrir. À noter que le mot de passe ne sera pas conservé dans la mémoire ; Dash Electrum n'en a pas besoin pour enregistrer le portefeuille sur disque, car il utilise un chiffrage asymétrique (ECIES).
it: Inoltre, il file del tuo wallet potrebbe essere crittografato su disco. Tieni presente che le informazioni del wallet rimarranno non crittografate nella memoria del tuo computer per tutta la durata della sessione. Se un wallet è crittografato, sarà richiesta la sua password per aprirlo. Tieni presente che la password non verrà mantenuta in memoria; Dash Electrum non ne ha bisogno per salvare il wallet su disco, perché utilizza la crittografia asimmetrica (ECIES).
zh_cn: 此外，用户的钱包可以在磁盘上进行加密。值得注意的是，在会话期间，钱包信息将会在计算机内存上维持未加密的状态。如果钱包已经加密，那么用户需要输入密码才能打开钱包。由于密码不会保存在内存上，因此达世币轻钱包不需要用到密码就能将钱包保存在磁盘上，它借助的是非对称加密(ECIES)。

source: Wallet file encryption is activated by default since version 2.8. It is intended to protect your privacy, but also to prevent you from requesting Dash on a wallet that you do not control.
ar: يتم تنشيط تشفير ملف المحفظة افتراضيًا منذ الإصدار 2.8. الغرض منه هو حماية خصوصيتك ، ولكن أيضًا لمنعك من طلب داش على محفظة لا تتحكم فيها.
es: El encriptado de archivos de billetera se activa por defecto desde la versión 2.8. Su objetivo es proteger tu privacidad, pero también evitar que solicites Dash en una billetera que no controlas.
fr: Le chiffrage du fichier de portefeuille est activé par défaut depuis la version 2.8. Il est conçu pour protéger votre vie privée, mais aussi pour vous empêcher de demander des dashs sur un portefeuille que vous ne contrôlez pas.
it: La crittografia dei file del wallet è attivata per impostazione predefinita a partire dalla versione 2.8. Ha lo scopo di proteggere la tua privacy, ma anche di impedirti di richiedere Dash su un portafoglio che non controlli.
zh_cn: 自版本2.8起，钱包文件加密会在默认情况下激活。它旨在保护用户的隐私，同时也防止用户在个人无法控制的钱包上申请达世币支付。

source: I have forgotten my password but still have my seed. Is there any way I can recover my password?
ar: لقد نسيت كلمة المرور الخاصة بي ولكن لا يزال لدي بذري. هل هناك طريقة لاسترداد كلمة المرور الخاصة بي؟
es: Olvidé mi contraseña pero todavía tengo mi semilla. ¿Hay alguna manera de recuperar mi contraseña?
fr: J'ai oublié mon mot de passe mais j'ai encore ma graine. Y a-t-il un moyen de retrouver mon mot de passe ?
it: Ho dimenticato la mia password ma ho ancora il mio seed. C'è un modo per recuperare la mia password?
zh_cn: 我忘记了密码，但还存有种子。在这种情况下，要怎样才能恢复密码？

source: It is not possible to recover your password. However, you can restore your wallet from its seed phrase and choose a new password. If you lose both your password and your seed, there is no way to recover your money. This is why we ask you to save your seed phrase on paper.
ar: لا يمكن استعادة كلمة المرور الخاصة بك. ومع ذلك ، يمكنك استعادة محفظتك من عبارة البذور واختيار كلمة مرور جديدة. إذا فقدت كلمة المرور الخاصة بك وبذرك ، فلا توجد طريقة لاسترداد أموالك. هذا هو السبب في أننا نطلب منك حفظ عبارة البذور على الورق.
es: No es posible recuperar tu contraseña. Sin embargo, puedes restaurar tu billetera desde tu frase de semilla y elegir una nueva contraseña. Si pierdes tu contraseña y tu semilla, no hay forma de recuperar tu dinero. Es por eso que te pedimos que guardes tu frase de semilla en papel.
fr: Il est impossible de retrouver votre mot de passe. Cependant, vous pouvez restaurer votre portefeuille depuis sa graine, puis choisir un nouveau mot de passe. Si vous perdez à la fois votre mot de passe et votre graine, il n'existe aucun moyen de retrouver vos fonds. C'est pour cela que nous vous demandons d'écrire votre graine sur du papier et de la conserver en lieu sûr.
it: Non è possibile recuperare la password. Tuttavia, puoi ripristinare il tuo wallet dalla frase seed e scegliere una nuova password. Se perdi sia la password che il seed, non c'è modo di recuperare i tuoi soldi. Questo è il motivo per cui ti chiediamo di salvare la tua frase seed su carta.
zh_cn: 用户密码已经无法恢复了。不过，用户可以借助种子短语恢复钱包并设置新的密码。如果用户丢失了密码和种子，那就无法恢复对个人资金的访问权限了。这就是为什么用户需要将种子短语记录在案的原因。

source: To restore your wallet from its seed phrase, create a new wallet, select the type, choose **I already have a seed** and proceed to input your seed phrase.
ar: لاستعادة محفظتك من عبارة البذور الخاصة به ، قم بإنشاء محفظة جديدة ، حدد النوع ، اختر **لدي بالفعل بذور** وتابع لإدخال عبارة البذور الخاصة بك.
es: Para restaurar tu billetera desde tu frase de semilla, crea una nueva billetera, selecciona el tipo, elije **Ya tengo una semilla** y procede a ingresar tu frase de semilla.
fr: Pour restaurer votre portefeuille depuis sa graine, créez un nouveau portefeuille, choisissez-en le type, choisissez **Je dispose déjà d'une graine** et saisissez votre graine.
it: Per ripristinare il tuo wallet dalla sua frase seed, crea un nuovo wallet, seleziona il tipo, scegli **Ho già un seed** e procedi con l'inserimento della tua frase seed.
zh_cn: 如需借助种子短语恢复钱包，那么用户需要创建一个新钱包、选择类型、选中 **我已拥有一个种子** ，并输入种子短语。

source: Does Dash Electrum support cold wallets?
ar: هل يدعم داش إلكتروم محافظ التبريد؟
es: Dash Electrum admite billeteras frías?
fr: Dash Electrum permet-il de créer des "chambres froides" ?
it: Dash Electrum supporta i cold wallet?
zh_cn: 达世币轻钱包支持冷存储钱包吗？

source: Yes. See the :ref:`cold storage <electrum-cold-storage>` section.
ar: نعم. انظر :ref:`هنا <electrum-cold-storage>`
es: Sí. Consulta la :ref:`sección de almacenamiento en frío <electrum-cold-storage>`.
fr: Oui. Voir la section :ref:`chambre froide <electrum-cold-storage>`.
it: SÌ. Consultare la sezione :ref:`cold storage <electrum-cold-storage>`.
zh_cn: 是的。详情请参考 \ :ref:`冷存储 <electrum-cold-storage>`\ 的部分内容。

source: Can I import private keys from other Dash clients?
ar: هل يمكنني استيراد مفاتيح خاصة من عملاء داش الآخرين؟
es: Puedo importar llaves privadas de otros clientes de Dash?
fr: Puis-je importer des clés privées depuis d'autres logiciels Dash ?
it: Posso importare chiavi private da altri client Dash?
zh_cn: 用户可以从达世币客户端上导入私钥吗？

source: In Dash Electrum 2.0, you cannot import private keys in a wallet that has a seed. You should sweep them instead.
ar: في داش الكتروم 2.0 ، لا يمكنك استيراد مفاتيح خاصة في محفظة تحتوي على بذرة. يجب أن تجتاحهم بدلاً من ذلك
es: En Dash Electrum 2.0, no puedes importar llaves privadas en una billetera que tiene una semilla. Deberías en su lugar arrastrarlas.
fr: Dans Dash Electrum 2.0, vous ne pouvez pas importer des clés privées dans une portefeuille qui a une graine. À la place, vous devez les "balayer".
it: In Dash Electrum 2.0, non puoi importare chiavi private in un wallet che ha un seed. Dovresti invece spazzarli.
zh_cn: 在2.0版达世币轻钱包中，用户无法在具有种子的钱包中导入私钥。用户应该清除种子和私钥。

source: If you want to import private keys and not sweep them you need to create a special wallet that does not have a seed. For this, create a new wallet, select **Use public or private keys**, and instead of typing your seed, type a list of private keys, or a list of addresses if you want to create a watching-only wallet. A master public (xpub) or private (xprv) will also work to import a hierarchical deterministic series of keys. You will need to back up this wallet, because it cannot be recovered from seed.
ar: إذا كنت ترغب في استيراد مفاتيح خاصة وعدم مسحها ، فأنت بحاجة إلى إنشاء محفظة خاصة لا تحتوي على بذور. لذلك ، أنشئ محفظة جديدة ، حدد **استخدم مفاتيح عامة أو خاصة** ، وبدلاً من كتابة البذرة ، اكتب قائمة بالمفاتيح الخاصة ، أو قائمة عناوين إذا كنت تريد إنشاء محفظة مراقبة فقط. سيعمل أيضًا عام رئيسي (xpub) أو خاص (xprv) على استيراد سلسلة مفاتيح قائمة على التسلسل الهرمي. ستحتاج إلى عمل نسخة احتياطية من هذه المحفظة ، لأنه لا يمكن استردادها من البذور.
es: Si deseas importar llaves privadas y no arrastrarlas, debes crear una billetera especial que no tenga una semilla. Para esto, crea una nueva billetera, selecciona **Usar llaves públicas o privadas**, y en lugar de escribir tu semilla, escribe una lista de llaves privadas o una lista de direcciones si deseas crear una billetera solo para mirar. Un público maestro (xpub) o privado (xprv) también funcionará para importar una serie jerárquica determinista de llaves. Tendrás que hacer una copia de seguridad de esta billetera, ya que no se puede recuperar de la semilla.
fr: Si vous souhaitez importer des clés privées sans les "balayer", vous devez créer un portefeuille spécial qui n'a pas de graine. Pour cela, créez un nouveau portefeuille, choisissez **Utiliser des clés publiques ou privées** et, au lieu de taper votre graine, saisissez une liste de clés privées, ou une liste d'adresses si vous souhaitez créer un portefeuille en simple observateur. Une clé maître publique (xpub) ou privée (xprv) marchera aussi pour importer une série de clés hiérarchique et déterministe. Vous aurez à sauvegarder ce portefeuille, car il ne pourra pas être restauré à partir d'une graine.
it: Se vuoi importare chiavi private e non spazzarle devi creare un wallet speciale che non abbia seed. Per farlo, crea un nuovo wallet, seleziona **Utilizza chiavi pubbliche o private** e, invece di digitare il tuo seed, digita un elenco di chiavi private o un elenco di indirizzi se desideri creare un wallet di sola visione. Un master pubblico (xpub) o privato (xprv) funzionerà anche per importare una serie gerarchica deterministica di chiavi. Dovrai eseguire il backup di questo wallet, perché non può essere recuperato dal seed.
zh_cn: 如果用户想要导入私钥而不是进行清除，那么用户就需要创建一个没有种子的特殊钱包。为此，用户首先要创建一个新钱包，选择 **使用公钥或私钥** ，输入私钥列表而不是种子。又或者，如果用户想要创建的是仅供浏览的钱包，那么用户要输入的就是地址列表。一个公开（xpub）或私密（xprv）也可以用于导入HD密钥。用户需要备份钱包，因为用户无法接住种子恢复这个钱包。

source: Importing a list of private keys to create a wallet
ar: استيراد قائمة بالمفاتيح الخاصة لإنشاء محفظة
es: Importar de una lista de llaves privadas para crear una billetera
fr: Importation d'une liste de clés privées pour créer un portefeuille
it: Importazione di un elenco di chiavi private per creare un wallet
zh_cn: 导入私钥列表来创建钱包

source: Can I sweep private keys from other Dash clients?
ar: هل يمكنني مسح المفاتيح الخاصة من عملاء داش الآخرين؟
es: Puedo arrastrar llaves privadas de otros clientes de Dash?
fr: Puis-je "balayer" des clés privées depuis d'autres logiciels Dash ?
it: Posso rimuovere le chiavi private da altri client Dash?
zh_cn: 我可以从其它达世币客户端上清除私钥吗？

source: Sweeping private keys means to send all the Dash they control to an existing address in your wallet. The private keys you sweep do not become a part of your wallet. Instead, all the Dash they control are sent to an address that has been deterministically generated from your wallet seed.
ar: تعني مفاتيح الخصوصية الشاملة أن ترسل جميع داش التي يتحكم فيها إلى عنوان موجود في محفظتك. لا تصبح المفاتيح الخاصة التي تمسحها جزءًا من محفظتك. وبدلاً من ذلك ، يتم إرسال جميع شرطة الداش التي يسيطرون عليها إلى عنوان تم إنشاؤه بصورة حتمية من بذرة المحفظة.
es: Arrastrar las llaves privadas significa enviar todo los Dash que controlan a una dirección existente en tu billetera. Las llaves privadas que arrastras no se vuelven parte de tu billetera. En cambio, todos los Dash que controlan se envían a una dirección que se ha generado de manera determinista a partir de tu semilla de billetera.
fr: "Balayer" des clés privées signifie envoyer tous les fonds Dash qu'elles contiennent vers une adresse existante de votre portefeuille. Les clés privées que vous "balayez" ne sont pas intégrées à votre portefeuille. À la place, tous les dashs qu'elles contrôlent sont envoyés à une adresse qui a été générée de manière déterministe depuis la graine de votre portefeuille.
it: Rubare le chiavi private significa inviare tutti i Dash che controllano a un indirizzo esistente nel tuo portafoglio. Le chiavi private che raccogli non diventano parte del tuo wallet. Invece, tutti i Dash che controllano vengono inviati a un indirizzo che è stato generato in modo deterministico dal seed del tuo portafoglio.
zh_cn: 清除私钥意味着将私钥关联的所有达世币发送到钱包的现有地址上。被清除的私钥不再是用户钱包的一部分。相反，私钥关联的所有达世币都会转移到由钱包种子生成的地址上。

source: To sweep private keys go to **Wallet > Private Keys > Sweep**. Enter the private keys in the appropriate field. Leave the **Address** field unchanged. This is the destination address from your existing Dash Electrum wallet. Click on **Sweep**. Dash Electrum then takes you to the **Send** tab where you can set an appropriate fee and then click on **Send** to send the coins to your wallet.
ar: لاكتساح مفاتيح الخصوصية ، انتقل إلى **المحفظة> مفاتيح خاصة> Sweep**. أدخل المفاتيح الخاصة في الحقل المناسب. اترك الحقل **العنوان** بدون تغيير. هذا هو عنوان الوجهة من محفظة داش الكتروم الحالية. انقر فوق **Sweep**. ثم تأخذك داش الكتروم إلى علامة التبويب **ارسال** حيث يمكنك ضبط الرسوم المناسبة ثم النقر فوق **إرسال** لإرسال العملات إلى محفظتك.
es: Para arrastrar las llaves privadas, ve a **Billetera > Llaves privadas > Arrastrar**. Ingresa las llaves privadas en el campo apropiado. Deja el campo **Dirección** sin cambios. Esta es la dirección de destino de tu billetera Dash Electrum existente. Haz click en **Arrastrar**. Dash Electrum luego te llevará a la pestaña **Enviar** donde puedes establecer una comisión adecuada y luego hacer click en **Enviar** para enviar las monedas a tu billetera.
fr: Pour "balayer" des clés privées, allez sur **Portefeuille > Clés privées > Balayer**. Saisissez les clés privées dans le champ idoine. Laissez le champ **Adresse** tel quel. Il s'agit de l'adresse de destination déjà existante dans votre portefeuille Dash Electrum. Cliquez sur **Balayer**. Dash Electrum vous affiche alors l'onglet **Envoyer** où vous pouvez choisir des frais appropriés, puis cliquer sur **Envoyer** pour envoyer les fonds vers votre portefeuille.
it: Per spazzare le chiavi private vai su **Wallet > Chiavi private > Sweep**. Inserisci le chiavi private nel campo apposito. Lascia invariato il campo **Indirizzo**. Questo è l'indirizzo di destinazione del tuo wallet Dash Electrum esistente. Fare clic su **Sposta**. Dash Electrum ti porta quindi alla scheda **Invia** dove puoi impostare una commissione appropriata e quindi fare clic su **Invia** per inviare le monete al tuo wallet.
zh_cn: 如需清除私钥，用户应打开 **钱包 > 私钥 > 清除** ，在相应字段中输入私钥，并保持 **地址** 字段不变。这是个人达世币轻钱包的地址。接下来，用户需要点击 **清除** 。此时，达世币轻钱包将进入 **发送** 选项卡，用户就可以设置费率并点击 **发送** 来将达世币发送到钱包上了。

source: Where is my wallet file located?
ar: أين يوجد ملف المحفظة الخاص بي؟
es: Dónde está ubicado el archivo de mi billetera?
fr: Où se trouve mon fichier de portefeuille ?
it: Dove si trova il file del mio wallet?
zh_cn: 达世币钱包文件在哪里？

source: The default wallet file is called default_wallet and is created when you first run the application. It is located under the `/wallets` folder.
ar: يسمى ملف المحفظة الافتراضي بـ default_wallet ويتم إنشاؤه عند تشغيل التطبيق لأول مرة. وهي تقع تحت مجلد `wallets`
es: El archivo predeterminado de billetera se llama default_wallet y se crea cuando se ejecuta por primera vez la aplicación. Se encuentra debajo de la carpeta `/wallets`.
fr: Le fichier de portefeuille par défaut s'appelle default_wallet et il est créé au premier lancement de l'application. Il se trouve dans le répertoire `/wallets`.
it: Il file del wallet predefinito si chiama default_wallet e viene creato quando si esegue l'applicazione per la prima volta. Si trova nella cartella "/wallets".
zh_cn: 钱包文件的默认名称是default_wallet，它会在首次运行应用程序时创建。它位于`/ wallets`文件夹下。

source: **Linux:** Open Files, select **Go > Go to folder**, copy the path ``~/.electrum-dash`` and paste it into the dialog box
ar: **لينكس:** فتح الملفات ، حدد **اذهب > اذهب الى الملف** ، انسخ المسار ``~/.electrum-dash`` والصقه في مربع الحوار
es: **Linux:** Abre Archivos, selecciona **Ir > Ir a carpeta**, copia la ruta ``~/.electrum-dash`` y pégala en el cuadro de diálogo
fr: **Linux :** ouvrez Fichiers, choisissez **Aller > Aller au dossier**, copiez le chemin ``~/.electrum-dash`` et collez-le dans la boîte de dialogue
it: **Linux:** Apri File, seleziona **Vai > Vai alla cartella**, copia il percorso ``~/.electrum-dash`` e incollalo nella finestra di dialogo
zh_cn: **Linux**用户可以打开Files，选择 **跳转 > 跳转到文件夹**，然后在对话框中复制并粘贴路径``~/.electrum-dash``。

source: **macOS:** Open Finder, select **Go > Go to Folder**, copy the path ``~/.electrum-dash`` and paste it into the dialog box
ar: **ماك:** افتح Finder ، حدد **تذهب> اذهب الى الملف** ، انسخ المسار ``~/.electrum-dash`` والصقه في مربع الحوار
es: **macOS:** Abre el buscador, selecciona **Ir > Ir a carpeta**, copia la ruta ``~/.electrum-dash`` y pégala en el cuadro de diálogo
fr: **macOS :** ouvrez le Finder, choisissez **Aller > Aller au dossier**, copiez le chemin ``~/.electrum-dash`` et collez-le dans la boîte de dialogue
it: **macOS:** Apri Finder, seleziona **Vai > Vai alla cartella**, copia il percorso ``~/.electrum-dash`` e incollalo nella finestra di dialogo
zh_cn: **macOS：** 用户可以打开Finder，选择 **跳转 > 跳转到文件夹** ，然后在对话框中复制并粘贴路径``~/.electrum-dash``。

source: **Windows:** Open Explorer, copy the path ``%APPDATA%\Electrum-DASH`` and paste it in to the address bar
ar: **ويندوز:** افتح Explorer ، انسخ المسار ``PPDATA%\Electrum-DASH%A`` ولصقه في شريط العنوان
es: **Windows:** Abre el explorador, copia la ruta ``%APPDATA%\Electrum-DASH`` y pégala en la barra de direcciones
fr: **Windows :** ouvrez l'Explorateur, copiez le chemin ``%APPDATA%\Electrum-DASH`` et collez-le dans la barre d'adresse
it: **Windows:** Apri Explorer, copia il percorso ``%APPDATA%\Electrum-DASH`` e incollalo nella barra degli indirizzi
zh_cn: **Windows：** 用户可以打开Explorer，然后在地址栏上复制并粘贴 ``%APPDATA%\Electrum-DASH`` 。

source: Can I do bulk payments with Dash Electrum?
ar: هل يمكنني إجراء الدفعات المجمّعة باستخدام داش الكتروم؟
es: Puedo hacer pagos a granel con Dash Electrum?
fr: Puis-je faire des paiements multiples avec Dash Electrum ?
it: Posso effettuare pagamenti in blocco con Dash Electrum?
zh_cn: 我可以使用达世币轻钱包进行批量付款吗？

source: You can create a transaction with several outputs. In the GUI, type each address and amount on a line, separated by a comma.
ar: يمكنك إنشاء معاملة مع العديد من المخرجات. في واجهة المستخدم الرسومية ، اكتب كل عنوان ومبلغ على سطر ، مفصولة بفاصلة.
es: Puedes crear una transacción con varias salidas. En la GUI, escribe cada dirección y cantidad en una línea, separados por una coma.
fr: Vous pouvez créer une transaction à plusieurs sorties. Dans l'interface, tapez chaque adresse et son montant sur une ligne, séparés par une virgule.
it: È possibile creare una transazione con diversi output. Nella GUI, digita ciascun indirizzo e importo su una riga, separato da una virgola.
zh_cn: 用户可以创建包含多项付款的支付。在GUI中，用户需要在同一行上输入收款的各个地址和金额，并以逗号分隔开来。

source: Creating a transaction with multiple outputs in Dash Electrum
ar: إنشاء معاملة مع مخرجات متعددة في داش الكتروم
es: Crear una transacción con múltiples salidas en Dash Electrum
fr: Création d'une transaction à plusieurs sorties dans le portefeuille logiciel Dash Electrum
it: Creazione di una transazione con più output in Dash Electrum
zh_cn: 在达世币轻钱包中创建包含多项付款的支付

source: Amounts are in the current unit set in the client. The total is shown in the GUI. You can also import a CSV file in the **Pay to** field by clicking on the folder icon.
ar: المبالغ موجودة في الوحدة الحالية المحددة في العميل. يظهر المجموع في واجهة المستخدم الرسومية. يمكنك أيضًا استيراد ملف CSV في الحقل **الدفع إلى** بالنقر على رمز المجلد.
es: Las cantidades están en la unidad actual configurada en el cliente. El total se muestra en la GUI. También puedes importar un archivo CSV en el campo **Pagar a** haciendo click en el ícono de la carpeta.
fr: Les montants sont exprimés dans l'unité actuellement choisie dans le logiciel. Le total s'affiche dans l'interface. Vous pouvez aussi importer un fichier CSV dans le champ **Payer à** en cliquant sur l'icône en forme de dossier.
it: Gli importi sono espressi nell'unità corrente impostata nel client. Il totale è mostrato nella GUI. Puoi anche importare un file CSV nel campo **Paga a** facendo clic sull'icona della cartella.
zh_cn: 客户端显示了达世币的当前数额。此外，总数还会显示在GUI上。用户还可以单击文件夹图标并在 **向……支付** 字段中导入CSV文件。

source: Can Dash Electrum create and sign raw transactions?
ar: يمكن أن داش إلكتروم إنشاء وتوقيع المعاملات الخام؟
es: Puede Dash Electrum crear y firmar transacciones en bruto?
fr: Dash Electrum peut-il créer et signer des transactions brutes ?
it: Dash Electrum può creare e firmare transazioni grezze?
zh_cn: 达世币轻钱包可以创建和签署原始交易吗？
