Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/faq.po
Languages: ar, es, fr, it, zh_cn

source: Frequently Asked Questions about the Dash Electrum wallet
ar: الأسئلة المتداولة حول محفظة داش الكتروم
es: Preguntas Frecuentes acerca de la billetera Dash Electrum
fr: Foire aux questions sur le portefeuille logiciel Dash Electrum
it: Domande frequenti sul portafoglio Dash Electrum
zh_cn: 达世币Electrum钱包的常见问题

source: dash, wallet, electrum, faq, seed
ar: داش ، محفظة ، الكتروم ، أسئلة وأجوبة ، والبذور
es: dash, billetera, electrum, faq, semilla
fr: dash, portefeuille, electrum, faq, graine
zh_cn: 达世币，钱包，electrum，常见问题，种子

source: Frequently Asked Questions
ar: الأسئلة المتكررة
es: Preguntas frecuentes
fr: Foire aux questions
it: Domande frequenti (FAQ)
zh_cn: 常见问题答疑

source: How does Dash Electrum work?
ar: كيفية داش الكتروم تشتغل؟
es: Cómo funciona Dash Electrum?
fr: Comment fonctionne Dash Electrum ?
it: Come funziona Dash Electrum?
zh_cn: 达世币轻钱包的运作原理是什么？

source: Dash Electrum focuses on speed, low resource usage and providing a simple user experience for Dash. Startup times are instant because it operates in conjunction with high-performance servers that handle the most complicated parts of the Dash system.
ar: يركز داش إلكتروم على السرعة ، واستخدام الموارد المنخفض وتوفير تجربة مستخدم بسيطة لداش. تكون أوقات بدء التشغيل فورية لأنها تعمل بالاقتران مع الخوادم عالية الأداء التي تتعامل مع الأجزاء الأكثر تعقيدًا في نظام داش.
es: Dash Electrum se centra en la velocidad, el bajo uso de recursos y proporciona una experiencia de usuario sencilla para Dash. Los tiempos de inicio son instantáneos porque funciona junto con servidores de alto rendimiento que manejan las partes más complicadas del sistema Dash.
fr: Dash Electrum a pour priorités la vitesse, le faible usage des ressources, et une expérience utilisateur simplifiée pour Dash. Les temps de démarrage sont très rapides car Dash Electrum opère en conjonction avec des serveurs à haute performance qui gèrent les aspect les plus complexes du système Dash.
it: Dash Electrum si concentra sulla velocità, sul basso utilizzo delle risorse e sulla fornitura di un'esperienza utente semplice per Dash. I tempi di avvio sono immediati perché funziona insieme a server ad alte prestazioni che gestiscono le parti più complicate del sistema Dash.
zh_cn: 达世币轻钱包注重速度，仅占用极少的资源，且能提供简便的用户体验。用户在顷刻之间就能启动达世币轻钱包，因为它的运行依赖高性能且能处理最复杂的业务的服务器。

source: Does Dash Electrum trust servers?
ar: خوادم داش إلكتروم الثقة؟
es: Dash Electrum confía en los servidores?
fr: Dash Electrum fait-il confiance aux serveurs ?
it: Dash Electrum si fida dei server?
zh_cn: 达世币轻钱包是否信赖服务器的功能？

source: Not really; the Dash Electrum client never sends private keys to the servers. In addition, it verifies the information reported by servers using a technique called `Simple Payment Verification <https://docs.electrum.org/en/latest/spv.html>`_.
fr: Pas vraiment : le client Dash Electrum n'envoie jamais les clés privées aux serveurs. De plus, il vérifie les informations fournies par les serveurs au moyen d'une technologie appelée `Simple Payment Verification <https://docs.electrum.org/en/latest/spv.html>`_.
it: Non proprio; il client Dash Electrum non invia mai chiavi private ai server. Inoltre, verifica le informazioni riportate dai server utilizzando una tecnica chiamata `Simple Payment Verification <https://docs.electrum.org/en/latest/spv.html>`_.

source: What is the Seed?
ar: ما هي البذور؟
es: Qué es la semilla?
fr: Qu'est-ce que la graine ?
it: Cos'è il Seed?
zh_cn: 什么是种子？

source: The seed is a random phrase that is used to generate your private keys. Example::
ar: والبذرة عبارة عشوائية تُستخدم لإنشاء مفاتيحك الخاصة. مثال::
es: La semilla es una frase aleatoria que se usa para generar tus llaves privadas. Ejemplo::
fr: La graine est une phrase aléatoire qui est utilisée pour générer vos clés privées. Par exemple ::
it: Il seed è una frase casuale utilizzata per generare le tue chiavi private. Esempio::
zh_cn: 种子是用于生成个人私钥的一串随机字符。实例如下::

source: Your wallet can be entirely recovered from its seed. To do this, select the **I already have a seed** option during startup.
ar: يمكن استرداد محفظتك بالكامل من بذوره. للقيام بذلك ، حدد **لدي بالفعل خيار البذور** أثناء بدء التشغيل.
es: Tu billetera puede recuperarse completamente desde tu semilla. Para hacer esto, selecciona la opción **Ya tengo una semilla** durante el inicio.
fr: Votre portefeuille peut être entièrement reconstitué à partir de sa graine. Pour ce faire, choisissez l'option **Je dispose déjà d'une graine** lors du premier démarrage.
it: Il tuo portafoglio può essere completamente recuperato dal suo seed. Per fare ciò, seleziona l'opzione **Ho già un seed** durante l'avvio.
zh_cn: 用户可以通过种子完全恢复自己的钱包。如果需要恢复钱包，用户需要在启动的时候选择 **我已拥有一个种子** 。

source: How secure is the seed?
ar: ما مدى أمان البذور؟
es: Qué tan segura es la semilla?
fr: Quelle est la sécurité de la graine ?
it: Quanto è sicuro il seed?
zh_cn: 种子的安全性如何？

source: The seed created by Dash Electrum has 128 bits of entropy. This means that it provides the same level of security as a Dash private key (of length 256 bits). Indeed, an elliptic curve key of length n provides n/2 bits of security.
ar: تحتوي البذور التي أنشأتها داش الكتروم على 128 بت من الأنتروبيا. هذا يعني أنه يوفر نفس مستوى الأمان كمفتاح خاص داش (بطول 256 بت). وبالفعل ، يوفر مفتاح منحنى الإهليلجية للطول n n بتتين من الأمن.
es: La semilla creada por Dash Electrum tiene 128 bits de entropía. Esto significa que proporciona el mismo nivel de seguridad que una llave privada Dash (de longitud de 256 bits). De hecho, una llave de curva elíptica de longitud n proporciona n/2 bits de seguridad.
fr: La graine créée par Dash Electrum a une entropie de 128 bits. Cela signifie qu'elle fournit le même niveau de sécurité qu'une clé privée Dash (d'une longueur de 256 bits). En effet, une clé à courbe elliptique de longueur n fournit n/2 bits de sécurité.
it: Il seed creato da Dash Electrum ha 128 bit di entropia. Ciò significa che fornisce lo stesso livello di sicurezza di una chiave privata Dash (di lunghezza 256 bit). Infatti, una chiave a curva ellittica di lunghezza n fornisce n/2 bit di sicurezza.
zh_cn: 由达世币轻钱包生成的种子共有128位熵。这就意味着它的安全性和达世币私钥的一样（不过后者的熵共有256位）。事实上，虽然它的长度只有后者的一半，但却拥有相同的安全性能。

source: What are change addresses?
ar: ما هي عناوين التغيير؟
es: Qué son los cambios de dirección?
fr: Que sont les adresses de monnaie rendue ?
it: Cosa sono gli indirizzi di modifica?
zh_cn: 什么是零钱地址？

source: The Dash Electrum wallet design and workflow are based on a concept called a “wallet generation seed”. This seed is a unique, randomly- selected list of twelve words. A Dash Electrum wallet uses its seed as a template for generating addresses.
ar: ويستند تصميم محفظة داش إلكتروم وتدفق العمل إلى مفهوم يسمى "بذور جيل المحفظة". هذه البذرة هي قائمة فريدة من نوعها عشوائياً من اثني عشر كلمة. تستخدم محفظة داش الكتروم بذاتها كقالب لتوليد العناوين.
es: El diseño y el flujo de trabajo de la billetera Dash Electrum se basan en un concepto llamado "semilla de generación de billetera". Esta semilla es una lista única, seleccionada aleatoriamente de doce palabras. Una billetera Dash Electrum usa su semilla como plantilla para generar direcciones.
fr: La conception et les processus du portefeuille logiciel Dash Electrum se basent sur un concept appelé "graine de génération de portefeuille". Cette graine est une liste unique et aléatoire de douze mots. Un portefeuille logiciel Dash Electrum utilise cette graine comme un point de départ pour générer les adresses.
it: Il design e il flusso di lavoro del portafoglio Dash Electrum si basano su un concetto chiamato “seed di generazione del wallet”. Questo seed è un elenco unico di dodici parole selezionate casualmente. Un wallet Dash Electrum utilizza il suo seed come modello per generare indirizzi.
zh_cn: 达世币轻钱包的设计和工作流程以“钱包生成种子”的概念为基础。该种子是一个独特的十二位单词列表。达世币轻钱包使用它的种子作为模板，从而生成地址。

source: To understand the problem that seeds solve, browse to the Electrum **Receive** tab. Next, open the collapsible entry marked **Change**.
ar: لفهم المشكلة التي تحلها البذور ، انتقل إلى علامة الكتروم **استقبال**. بعد ذلك ، افتح الإدخال القابل للطي وضع عليه علامة **تغيير**.
es: Para comprender el problema que resuelven las semillas, ve a la pestaña Electrum **Recibir**. A continuación, abre la entrada plegable marcada **Cambiar**.
fr: Pour comprendre les problèmes auxquels répondent les graines, allez dans Dash Electrum sur l'onglet **Recevoir**, puis déroulez l'entrée nommée **Monnaie rendue**.
it: Per comprendere il problema risolto dai seed, vai alla scheda Electrum **Ricevi**. Successivamente, apri la voce comprimibile contrassegnata con **Cambia**.
zh_cn: 如需了解种子解决问题的能力，请浏览达世币轻钱包上的 **接收** 选项卡，然后再打开标记为 **零钱** 的折叠条目。

source: Receiving and change addresses in Dash Electrum
ar: تلقي وتغيير العناوين في داش الكتروم
es: Recibir y cambiar direcciones en Dash Electrum
fr: Adresses de réception et de monnaie rendue dans le portefeuille logiciel Dash Electrum
it: Ricevere e modificare indirizzi in Dash Electrum
zh_cn: 在达世币轻钱包中的收款和零钱地址

source: Notice that the total balance does not only show the sum of all receiving addresses, but also the separately listed **Change** addresses. Where did these new change addresses come from and why does the first one now hold funds?
ar: لاحظ أن الرصيد الإجمالي لا يُظهر فقط مجموع جميع عناوين الاستلام ، بل أيضًا عناوين **تغير** المدرجة على حدة. من أين جاءت عناوين التغيير الجديدة هذه ولماذا يمتلك أولها الآن أموالاً؟
es: Ten en cuenta que el saldo total no solo muestra la suma de todas las direcciones de recepción, sino también las direcciones de **Cambio** por separado. ¿De dónde vienen estas nuevas direcciones de cambio y por qué la primera ahora tiene fondos?
fr: Vous remarquerez que le solde total n'affiche pas seulement la somme de toutes les adresses de réception, mais aussi des adresses de **Monnaie rendue** répertoriées séparément. D'où viennent ces nouvelles adresses de monnaie rendue, et pourquoi la première d'entre elles contient-elle maintenant des fonds ?
it: Tieni presente che il saldo totale non mostra solo la somma di tutti gli indirizzi di ricezione, ma anche gli indirizzi **Cambia** elencati separatamente. Da dove provengono questi nuovi indirizzi di cambiamento e perché il primo ora detiene fondi?
zh_cn: 请注意，钱包总余额不仅显示所有接收地址上的金额的总和，还会显示单独列出的 **零钱** 地址上的金额。这些新的零钱地址来源于何处？为什么第一个零钱地址上会有资金？

source: Dash is an electronic cash system, meaning that it shares much in common with the process of using paper banknotes. Although some cash payments involve exact change, many do not. You tend to “overpay” when using cash, and expect to receive the difference as change. Perhaps surprisingly, this is how Dash transactions work as well. If the entire balance of an address is not required for any given transaction, the remainder is sent to a new and unused address under control of the same wallet. This address is generated deterministically (rather than randomly) from the wallet seed, which means that any other wallet will also regenerate the change addresses in the same order from the same recovery seed, and have access to the balances.
ar: داش هو نظام نقدي إلكتروني ، مما يعني أنه مشترك كثيرًا في عملية استخدام الأوراق النقدية الورقية. على الرغم من أن بعض المدفوعات النقدية تنطوي على تغيير دقيق ، فإن الكثير منها لا يفعل ذلك. أنت تميل إلى "الدفع الزائد" عند استخدام النقد ، ونتوقع أن تحصل على الفرق كتغيير. ربما من المدهش ، أن هذه هي الطريقة التي تعمل بها معاملات داش أيضًا. إذا كان الرصيد بالكامل من عنوان غير مطلوب لأي معاملة معينة ، يتم إرسال الباقي إلى عنوان جديد وغير مستخدم تحت السيطرة على نفس المحفظة. يتم إنشاء هذا العنوان بحتمية (بدلاً من عشوائيًا) من بذرة المحفظة ، مما يعني أن أي محفظة أخرى ستعيد أيضًا إنشاء عناوين التغيير بنفس الترتيب من بذرة الاسترداد نفسها ، ولها حق الوصول إلى الأرصدة.
es: Dash es un sistema de dinero electrónico, lo que significa que comparte mucho en común con el proceso de uso de notas de banco de papel. Aunque algunos pagos en efectivo implican un cambio exacto, muchos no lo hacen. Tiendes a "pagar de más" cuando usas efectivo, y esperar recibir la diferencia como cambio. Quizás sorprendentemente, así es como funcionan las transacciones Dash también. Si no se requiere el saldo completo de una dirección para una transacción determinada, el resto se envía a una dirección nueva y no utilizada bajo el control de la misma billetera. Esta dirección se genera de manera determinista (en lugar de al azar) desde la semilla de billetera, lo que significa que cualquier otra billetera también regenerará las direcciones de cambio en el mismo orden desde la misma semilla de recuperación y tendrá acceso a los saldos.
fr: Dash est un système d'argent liquide électronique, ce qui signifie qu'il a beaucoup à voir avec l'utilisation de billets de banque. Bien que quelques paiements en liquide soient exacts, la plupart ne le sont pas : vous avez tendance à "surpayer" en argent liquide, et vous vous attendez à recevoir la différence en échange. De manière peut-être surprenante, les transactions Dash fonctionnent de la même façon. Si le solde entier d'une adresse n'est pas requis pour une transaction donnée, le restant est renvoyé à une nouvelle adresse inutilisée qui est sous le contrôle du même portefeuille. Cette adresse est générée de manière déterministe (plutôt qu'aléatoire) à partir de la graine de portefeuille, ce qui signifie que tout autre portefeuille regénérera également les adresses de monnaie rendue dans le même ordre depuis la même graine de récupération, et qu'il aura accès aux soldes.
it: Dash è un sistema di cassa elettronico, il che significa che ha molto in comune con il processo di utilizzo delle banconote cartacee. Sebbene alcuni pagamenti in contanti comportino il resto esatto, molti non lo fanno. Tendi a "pagare più del dovuto" quando usi contanti e ti aspetti di ricevere la differenza come resto. Forse sorprendentemente, è così che funzionano anche le transazioni Dash. Se per una determinata transazione non è richiesto l'intero saldo di un indirizzo, il resto viene inviato a un indirizzo nuovo e non utilizzato sotto il controllo dello stesso wallet. Questo indirizzo viene generato in modo deterministico (anziché casuale) dal seed del wallet, il che significa che qualsiasi altro wallet rigenererà anche gli indirizzi di modifica nello stesso ordine dallo stesso seed di ripristino e avrà accesso ai saldi.
zh_cn: 达世币是一个数字化现金系统，这就意味着它的使用过程与纸币存在很多共同之处。虽然有些现金支付涉及实实在在的找零行为，但有些现金支付并非不需要找零。在使用现金时，消费者倾向于“多付”一些资金以便化整为零。令人吃惊的是，达世币的交易也具备现金交易的这个特点。如果既定交易不需要用到地址上的所有金额，那么完成交易后的余额将会被发送到由同一钱包管控的其它地址上。这个地址将会由钱包种子自动衍生（而不是随机生成）。这就意味着其它钱包也将借助相同的钱包种子和相同的步骤来生成零钱地址，并且用户也可以通过这些钱包访问零钱余额。

source: Spending the entire balance and sending any remainder to a change address is considered good practice because it prevents the transaction recipient from linking transactions by browsing the blockchain, thus compromising your privacy. If privacy is not a concern, change addresses can be disabled via the **Tools > Electrum preferences** menu option.
ar: يعتبر إنفاق الرصيد بالكامل وإرسال أي الباقي إلى عنوان التغيير ممارسة جيدة لأنه يمنع المستلم من ربط المعاملات عن طريق تصفح بلوكشين ، مما يهدد خصوصيتك. إذا لم تكن الخصوصية من الأمور التي تثير القلق ، فيمكن تعطيل عناوين التغيير من خلال خيار القائمة خيارات **الأدوات> الكتروم**.
es: Gastar todo el saldo y enviar el resto a una dirección de cambio se considera una buena práctica porque evita que el destinatario de la transacción vincule transacciones al explorar la cadena de bloques, lo que compromete tu privacidad. Si la privacidad no es una preocupación, las direcciones de cambio se pueden desactivar a través de la opción de menú **Herramientas > Preferencias de Electrum**.
fr: Dépenser entièrement le solde et renvoyer toute différence à une adresse de monnaie rendue est considéré comme étant de bonne pratique, car cela empêche le destinataire de la transaction de lier les transactions en inspectant la blockchain, et donc de compromettre votre vie privée. Si la vie privée n'est pas un souci pour vous, les adresses de monnaie rendue peuvent toujours être désactivées avec le menu **Outils > Préférences Electrum**.
it: Spendere l'intero saldo e inviare l'eventuale resto a un indirizzo di modifica è considerata una buona pratica perché impedisce al destinatario della transazione di collegare le transazioni navigando nella blockchain, compromettendo così la tua privacy. Se la privacy non è un problema, la modifica degli indirizzi può essere disabilitata tramite l'opzione di menu **Strumenti > Preferenze Electrum**.
zh_cn: 允许用户全额使用账户金额或将支付后的余额转存到零钱地址的操作非常实用，因为它可以防止收款方通过浏览区块链通告来推算并侵犯交易隐私。不担心隐私问题的用户可以通过 **工具 > 轻钱包选项** 菜单来禁用零钱地址。

source: How can I send the maximum available in my wallet?
ar: كيف يمكنني إرسال الحد الأقصى المتاح في محفظتي؟
es: Cómo puedo enviar el máximo disponible en mi billetera?
fr: Comment puis-je envoyer le maximum des fonds disponibles dans mon portefeuille ?
it: Come posso inviare il massimo disponibile nel mio wallet?
zh_cn: 用户如何发送钱包中的最大金额？

source: Type an exclamation mark (!) in the **Amount** field or simply click the **Max** button. The fee will be automatically adjusted for that amount.
ar: اكتب علامة تعجب (!) في الحقل **المبلغ** أو ببساطة انقر فوق الزر **الحد الأقصى**. سيتم تعديل الرسوم تلقائيًا لهذا المبلغ.
es: Escribe un signo de exclamación (!) En el campo **Cantidad** o simplemente haz click en el botón **Max**. La comisión se ajustará automáticamente por esa cantidad.
fr: Tapez un point d'exclamation (!) dans le champ **Montant** ou cliquez simplement sur le bouton **Max**. Les frais seront automatiquement déduits de ce montant.
it: Digita un punto esclamativo (!) nel campo **Importo** o fai semplicemente clic sul pulsante **Max**. La tariffa verrà automaticamente adeguata a tale importo.
zh_cn: 在 **金额** 字段中输入感叹号 (!) 或点击 **最大** 按键。此时，发送金额将自动调整到最大。

source: How can I send Dash without paying a transaction fee?
ar: كيف يمكنني إرسال داش دون دفع رسوم المعاملات؟
es: Cómo puedo enviar Dash sin pagar una comisión de transacción?
fr: Comment puis-je envoyer des dashs sans payer de frais de transaction ?
it: Come posso inviare Dash senza pagare una commissione di transazione?
zh_cn: 怎样发送达世币才不用支付交易费用？

source: You can create a zero fee transaction in the GUI by following these steps:
ar: يمكنك إنشاء معاملة بدون رسوم في واجهة المستخدم الرسومية باتباع الخطوات التالية:
es: Puedes crear una transacción con comisión cero en la GUI siguiendo estos pasos:
fr: Vous pouvez créer dans l'interface graphique une transaction à frais nuls en suivant ces étapes :
it: Puoi creare una transazione a commissione zero nella GUI seguendo questi passaggi:
zh_cn: 通过以下步骤，用户可以在GUI上创建零费率的达世币交易：

source: Enable the **Edit fees manually** option
ar: تمكين الخيار **تحرير الرسوم يدويًا**
es: Habilita la opción **Editar comisiones manualmente**
fr: Activer l'option **Modifier manuellement les frais**
it: Abilita l'opzione **Modifica manualmente le tariffe**
zh_cn: 启用 **手动设置交易费用** 选项

source: Enter 0 in the **Fee** field
ar: أدخل 0 في حقل **الرسوم**
es: Ingresa 0 en el campo **Comisión**
fr: Tapez 0 dans le champ **Frais**
it: Inserisci 0 nel campo **Tariffa**
zh_cn: 在 **交易费用** 字段中输入0

source: Enter the amount in the **Amount** field
ar: أدخل المبلغ في الحقل **المبلغ**
es: Ingresa el monto en el campo **Cantidad**
fr: Tapez le montant dans le champ **Montant**
it: Inserisci l'importo nel campo **Importo**
zh_cn: 在 **金额** 字段中输入金额

source: Note that transactions without fees might not be relayed by the Dash Electrum server, or by the Dash network.
ar: لاحظ أن المعاملات بدون رسوم قد لا يتم ترحيلها من قبل خادم داش الكتروم أو من خلال شبكة داش.
es: Ten en cuenta que las transacciones sin comisiones pueden no ser retransmitidas por el servidor de Dash Electrum o por la red de Dash.
fr: Veuillez noter que les transactions sans frais peuvent ne pas être retransmises par le serveur Dash Electrum ou par le réseau Dash.
it: Tieni presente che le transazioni senza commissioni potrebbero non essere inoltrate dal server Dash Electrum o dalla rete Dash.
zh_cn: 需要注意的是， 达世币轻钱包的服务器或达世币网络可能无法中继通过上述步骤创建的零费率交易。

source: Is there a way to enter amounts in USD in Dash Electrum?
ar: هل هناك طريقة لإدخال المبالغ بالدولار الأمريكي في داش ألكتروم؟
es: Hay alguna manera de ingresar montos en USD en Dash Electrum?
fr: Y a-t-il un moyen d'indiquer des montants en euros dans Dash Electrum ?
it: C'è un modo per inserire importi in USD in Dash Electrum?
zh_cn: 可以在达世币轻钱包上输入任何美元金额吗？

source: Yes, go to **Tools > Prefernce > Fiat** and select a **Fiat currency** to display the current exchange rate from the chosen **Source**.
ar: نعم ، انتقل إلى **الأدوات> تفضيل> Fiat** وحدد عملة **Fiat** لعرض سعر الصرف الحالي من الـ **المصدر** المختار.
es: Sí, ve a **Herramientas > Preferencias > Fiat** y selecciona una **moneda fiduciaria** para mostrar la tasa de cambio actual de la **Fuente** elegida.
fr: Oui. Allez sur **Outils > Préférences > Monnaie fiduciaire** et choisissez une **Monnaie fiduciaire** pour afficher le taux de change actuel depuis la **Source** choisie.
it: Sì, vai su **Strumenti > Preferenze > Fiat** e seleziona una **Valuta Fiat** per visualizzare il tasso di cambio corrente dalla **Fonte** scelta.
zh_cn: 可以。用户可以通过 **工具 > 选项 > 法币** 来选中 **法定货币** ，然后浏览所选 **来源** 显示的货币汇率。

source: Entering values in fiat currency in Dash Electrum
ar: إدخال القيم في العملة الورقية في داش ألكتروم
es: Ingresar valores en moneda fiduciaria en Dash Electrum
fr: Saisie de montants en monnaie fiduciaire dans Dash Electrum
it: Inserimento di valori in valuta fiat in Dash Electrum
zh_cn: 用户就可以在达世币轻钱包中输入法定货币的数值了。

source: What does it mean to “Freeze” an address in Dash Electrum?
ar: ماذا يعني "تجميد" عنوان في داش الكتروم؟
es: Qué significa "congelar" una dirección en Dash Electrum?
fr: Que signifie "geler" une adresse dans Dash Electrum ?
it: Cosa significa "congelare" un indirizzo in Dash Electrum?
zh_cn: 在达世币轻钱包中 “冻结” 一个地址是什么意思？

source: When you freeze an address, the funds in that address will not be used for sending Dash. You cannot send Dash if you don’t have enough funds in your non-frozen addresses.
ar: عندما تقوم بتجميد عنوان ، لن يتم استخدام الأموال في هذا العنوان لإرسال داش. لا يمكنك إرسال داش إذا لم يكن لديك أموال كافية في عناوينك غير المجمدة.
es: Cuando congelas una dirección, los fondos en esa dirección no se usarán para enviar Dash. No puedes enviar Dash si no tienes fondos suficientes en tus direcciones no congeladas.
fr: Quand vous gelez une adresse, les fonds dans cette adresse ne seront pas utilisés pour envoyer des dashs. Vous ne pouvez pas envoyer des dashs si vous n'avez pas assez de fonds dans vos adresses non gelées.
it: Quando blocchi un indirizzo, i fondi in quell'indirizzo non verranno utilizzati per l'invio di Dash. Non puoi inviare Dash se non disponi di fondi sufficienti nei tuoi indirizzi non bloccati.
zh_cn: 如果冻结地址，那么该地址上的资金将不能用于达世币发送。即使地址没有被冻结，如果地址上余额不足，用户也无法发送达世币。

source: How is the wallet encrypted?
ar: كيف يتم تشفير المحفظة؟
es: Cómo está encriptada la billetera?
fr: Comment le portefeuille est-il chiffré ?
it: Come viene crittografato il wallet?
zh_cn: 如何进行钱包的加密？

source: Dash Electrum uses two separate levels of encryption:
ar: يستخدم داش الكتروم مستويين منفصلين للتشفير:
es: Dash Electrum utiliza dos niveles separados de encriptación:
fr: Dash Electrum utilise deux niveaux distincts de chiffrage :
it: Dash Electrum utilizza due livelli separati di crittografia:
zh_cn: 达世币轻钱包使用两重独立加密：
