Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/faq.po
Languages: ar, es, fr, it, zh_cn

source: Dash Electrum lets you create and sign raw transactions right from the user interface using a form.
ar: يتيح لك داش الكتروم إنشاء وتوقيع معاملات أولية مباشرة من واجهة المستخدم باستخدام نموذج.
es: Dash Electrum te permite crear y firmar transacciones en bruto directamente desde la interfaz de usuario mediante un formulario.
fr: Dash Electrum vous permet de créer et signer des transactions brutes directement depuis l'interface utilisateur, en remplissant un formulaire.
it: Dash Electrum ti consente di creare e firmare transazioni grezze direttamente dall'interfaccia utente utilizzando un modulo.
zh_cn: 达世币轻钱包允许用户借助表单从用户界面创建和签署原始事务。

source: Dash Electrum freezes when I try to send Dash
ar: داش الكتروم يتجمد عندما أحاول إرسال داش
es: Dash Electrum se congela cuando intento enviar Dash
fr: Dash Electrum "gèle" quand j'essaie d'envoyer des dashs
it: Dash Electrum si blocca quando provo a inviare Dash
zh_cn: 在我尝试发送达世币的时候，达世币轻钱包出现了冻结的情况。这是怎么回事？

source: This might happen if you are trying to spend a large number of transactions outputs (for example, if you have collected hundreds of donations from a Dash faucet). When you send Dash, Dash Electrum looks for unspent coins that are in your wallet in order to create the new transaction. Unspent coins can have different values, much like physical coins and bills.
ar: قد يحدث هذا إذا كنت تحاول إنفاق عدد كبير من مخرجات المعاملات (على سبيل المثال ، إذا كنت قد جمعت مئات التبرعات من صنبور داش). عند إرسال داش ، تبحث داش الكتروم عن العملات غير المنفقة الموجودة في محفظتك لإنشاء المعاملة الجديدة. يمكن أن يكون للقطع النقدية غير المنفقة قيم مختلفة ، مثل الكثير من العملات المعدنية والفواتير.
es: Esto podría suceder si intentas gastar una gran cantidad de salidas de transacciones (por ejemplo, si has recolectado cientos de donaciones de un grifo Dash). Cuando envías Dash, Dash Electrum busca las monedas no gastadas que están en tu billetera para crear la nueva transacción. Las monedas no gastadas pueden tener diferentes valores, al igual que las monedas y billetes físicos.
fr: Cela peut arriver si vous tentez de dépenser un grand nombre de sorties de transaction (par exemple, si vous avez accumulé des centaines de dons depuis un robinet Dash). À l'envoi de dashs, Dash Electrum inspecte les fonds non dépensés de votre portefeuille pour créer la nouvelle transaction. Les fonds non dépensés peuvent avoir différentes valeurs, tout à fait comme les pièces et les billets physiques.
it: Ciò potrebbe accadere se stai tentando di spendere un numero elevato di transazioni in output (ad esempio, se hai raccolto centinaia di donazioni da un faucet Dash). Quando invii Dash, Dash Electrum cerca le monete non spese presenti nel tuo wallet per creare la nuova transazione. Le monete non spese possono avere valori diversi, proprio come le monete e le banconote fisiche.
zh_cn: 如果用户尝试进行大额的达世币支付（例如花费从达世币巨头那里获得的大笔捐赠，那么就有可能会发生这种情况）。在用户发送达世币的时候，达世币会查找钱包中未使用的币以便创建新交易。未使用的达世币可能具备不同的价值，就像实体货币和账单一样。

source: If this happens, you should consolidate your transaction inputs by sending smaller amounts of Dash to one of your wallet addresses; this would be the equivalent of exchanging a stack of nickels for a dollar bill.
ar: إذا حدث ذلك ، فيجب عليك دمج مدخلات المعاملة الخاصة بك عن طريق إرسال كميات صغيرة من داش إلى أحد عناوين المحفظة الخاصة بك ؛ هذا سيكون ما يعادل تبادل كومة من النيكل لفاتورة الدولار.
es: Si esto sucede, debes consolidar las entradas de tu transacción enviando cantidades más pequeñas de Dash a una de las direcciones de tu billetera; esto sería el equivalente a cambiar una pila de cinco centavos por un billete de un dólar.
fr: Si cela arrive, vous devriez consolider vos entrées de transaction en envoyant des montants plus faibles à une des adresses de votre portefeuille ; ce qui serait l'équivalent de changer une pile de pièces métalliques contre un seul billet de banque.
it: Se ciò accade, dovresti consolidare gli input delle tue transazioni inviando importi minori di Dash a uno degli indirizzi del tuo wallet; questo equivarrebbe a scambiare una pila di nichel con una banconota da un dollaro.
zh_cn: 如果发生上述情况，用户应该通过向个人的某个钱包地址发送少量达世币来合并交易输入。这个操作就像用一美元兑换一堆币一样。

source: What is the gap limit?
ar: ما هو الحد الفجوة؟
es: Qué es el límite de espacio?
fr: Qu'est-ce que la limite d'intervalle ?
it: Qual è il limite del gap?
zh_cn: 间隔限额是什么？

source: The gap limit is the maximum number of consecutive unused addresses in your deterministic sequence of addresses. Dash Electrum uses it in order to stop looking for addresses. In Dash Electrum 2.0, it is set to 20 by default, so the client will get all addresses until 20 unused addresses are found.
ar: الحد الفجوة هو الحد الأقصى لعدد العناوين غير المستخدمة المتتالية في سلسلة العناوين المحددة. يستخدم داش إلكتروم من أجل التوقف عن البحث عن العناوين. في داش الكتروم 2.0 ، يتم تعيينه على 20 افتراضيًا ، بحيث يحصل العميل على جميع العناوين حتى يتم العثور على 20 عنوانًا غير مستخدم.
es: El límite de espacio es la cantidad máxima de direcciones consecutivas no utilizadas en tu secuencia de direcciones determinista. Dash Electrum lo usa para dejar de buscar direcciones. En Dash Electrum 2.0, se establece en 20 de forma predeterminada, por lo que el cliente obtendrá todas las direcciones hasta que se encuentren 20 direcciones sin usar.
fr: La limite d'intervalle est, dans votre série déterministe d'adresses, le nombre maximal d'adresses non dépensées consécutives. Dash Electrum l'utilise pour savoir quand arrêter de chercher des adresses. Dans Dash Electrum 2.0, cette limite est définie par défaut à 20, donc le logiciel obtiendra toutes les adresses jusqu'à ce que 20 adresses non utilisées soient trouvées.
it: Il limite del gap è il numero massimo di indirizzi consecutivi inutilizzati nella sequenza deterministica di indirizzi. Dash Electrum lo usa per smettere di cercare indirizzi. In Dash Electrum 2.0, è impostato su 20 per impostazione predefinita, quindi il client riceverà tutti gli indirizzi finché non verranno trovati 20 indirizzi non utilizzati.
zh_cn: 间隔限额是指确定性地址序列中连续的、未经使用的地址的最大数量。达世币轻钱包通过它来停止对地址的搜索。在达世币轻钱包2.0版本中，默认的间隔限额是20，因此客户端将会收到所有的地址，直到达世币轻钱包查找到20个未经使用的地址。

source: How can I pre-generate new addresses?
ar: كيف يمكنني إنشاء عناوين جديدة مسبقًا
es: Cómo puedo pregenerar direcciones?
fr: Comment puis-je pré-générer de nouvelles adresses ?
it: Come posso pre-generare nuovi indirizzi?
zh_cn: 如何预生成新地址？

source: Dash Electrum will generate new addresses as you use them, until it hits the `gap limit`_.
ar: سيعمل داش الكتروم على إنشاء عناوين جديدة عند استخدامها ، إلى أن يصل إلى `حد الفجوة`_.
es: Dash Electrum generará nuevas direcciones a medida que las uses, hasta que llegue al `límite de espacio`_.
fr: Dash Electrum générera de nouvelles adresses au fur et à mesure que vous les utilisez, jusqu'à ce qu'il atteigne la `limite d'intervalle`_.
it: Dash Electrum genererà nuovi indirizzi man mano che li utilizzi, finché non raggiunge il `gap limit`_.
zh_cn: 达世币轻钱包会在用户使用时生成新地址，直到钱包达到 `gap limit`_。

source: If you need to pre-generate more addresses, you can do so by typing wallet.create_new_address() in the console. This command will generate one new address. Note that the address will be shown with a red background in the address tab, to indicate that it is beyond the gap limit. The red color will remain until the gap is filled.
ar: إذا كنت بحاجة إلى إنشاء المزيد من العناوين مسبقًا ، فيمكنك القيام بذلك عن طريق كتابة.() في وحدة التحكم. سيؤدي هذا الأمر إلى إنشاء عنوان جديد واحد. لاحظ أنه سيتم عرض العنوان مع خلفية حمراء في علامة تبويب العناوين ، للإشارة إلى أنه يتجاوز حد الفجوة. سيظل اللون الأحمر حتى يتم ملء الفجوة.
es: Si necesitas pregenerar más direcciones, puedes hacerlo escribiendo wallet.create_new_address() en la consola. Este comando generará una nueva dirección. Ten en cuenta que la dirección se mostrará con un fondo rojo en la pestaña de direcciones, para indicar que está más allá del límite de espacio. El color rojo permanecerá hasta que se llene el espacio.
fr: Si vous avez besoin de pré-générer davantage d'adresses, vous pouvez le faire en tapant ``wallet.create_new_address()`` dans la console. Cette commande générera une nouvelle adresse. Veuillez noter que l'adresse sera affichée dans l'onglet Adresses sur un fond rouge, pour indiquer qu'elle est au-delà de la limite d'intervalle. La couleur rouge restera affichée jusqu'à ce que l'intervalle soit rempli.
it: Se hai bisogno di pregenerare più indirizzi, puoi farlo digitando wallet.create_new_address() nella console. Questo comando genererà un nuovo indirizzo. Tieni presente che l'indirizzo verrà visualizzato con uno sfondo rosso nella scheda Indirizzo, per indicare che è oltre il limite di intervallo. Il colore rosso rimarrà finché il vuoto non sarà riempito.
zh_cn: 需要预生成更多地址的用户可以在控制台上输入wallet.create_new_address()。这项命令将会生成一个新的地址。请注意，地址选项卡上的地址将以红色背景突出显示，表明它已经超出了间隔限额。红色将保持到间隔限额的间隔填满为止。

source: WARNING: Addresses beyond the gap limit will not automatically be recovered from seed. To recover them will require either increasing the client’s gap limit or generating new addresses until the used addresses are found.
ar: تحذير: لن يتم استرداد العناوين خارج حدود الفجوة تلقائيًا من البذور. يتطلب استردادها إما زيادة حد فجوة العميل أو إنشاء عناوين جديدة حتى يتم العثور على العناوين المستخدمة.
es: ADVERTENCIA: las direcciones más allá del límite de espacio no se recuperarán automáticamente de la semilla. Para recuperarlas, será necesario aumentar el límite de espacio del cliente o generar nuevas direcciones hasta que se encuentren las direcciones utilizadas.
fr: AVERTISSEMENT : Les adresses au-delà de la limite d'intervalle ne seront pas restaurées automatiquement depuis la graine. Pour les restaurer, il faudra soit augmenter la limite d'intervalle du logiciel, soit générer de nouvelles adresses jusqu'à ce que les adresses déjà utilisées soient découvertes.
it: ATTENZIONE: gli indirizzi oltre il limite di gap non verranno recuperati automaticamente dal seed. Per recuperarli sarà necessario aumentare il limite di gap del cliente o generare nuovi indirizzi fino a quando non verranno trovati gli indirizzi utilizzati.
zh_cn: 警告：超出间隔限额的地址无法通过种子自动恢复。如需恢复这些地址，用户需要增大客户端上的间隔限额或在找到已使用地址前生成新的地址。

source: If you wish to generate more than one address, you may use a ‘for’ loop. For example, if you wanted to generate 50 addresses, you could do this::
ar: إذا كنت ترغب في إنشاء أكثر من عنوان واحد ، فيمكنك استخدام حلقة "for". على سبيل المثال ، إذا أردت إنشاء 50 عنوانًا ، فيمكنك القيام بذلك:
es: Si deseas generar más de una dirección, puedes usar un ciclo 'for'. Por ejemplo, si quisieras generar 50 direcciones, podrías hacer esto::
fr: Si vous souhaitez générer plus qu'une adresse, vous pouvez utiliser une boucle "for". Par exemple, si vous souhaitez générer 50 adresses, vous pouvez faire comme ceci ::
it: Se desideri generare più di un indirizzo, puoi utilizzare un ciclo "for". Ad esempio, se volessi generare 50 indirizzi, potresti fare così::
zh_cn: 希望生成多个地址的用户可以使用 ‘for’ 循环。举个例子，想要生成50个地址的用户可以采取以下做法::

source: How to upgrade Dash Electrum?
ar: كيفية ترقية داش إلكتروم؟
es: Cómo actualizar Dash Electrum?
fr: Comment mettre à jour Dash Electrum ?
it: Come aggiornare Dash Electrum?
zh_cn: 如何升级达世币轻钱包？

source: Warning: always save your wallet seed on paper before doing an upgrade.
ar: تحذير: احفظ دائمًا محفظتك على الورق قبل إجراء الترقية.
es: Advertencia: siempre guarda la semilla de tu billetera en papel antes de realizar una actualización.
fr: Avertissement : écrivez toujours la graine de votre portefeuille sur du papier avant de faire une mise à jour.
it: Attenzione: salva sempre il seed del tuo wallet su carta prima di effettuare un aggiornamento.
zh_cn: 警告：在升级完成之前，用户应将钱包种子记录在纸质文件上。

source: To upgrade Dash Electrum, just :ref:`install <electrum-installation>` the most recent version. The way to do this will depend on your OS. Note that your wallet files are stored separately from the software, so you can safely remove the old version of the software if your OS does not do it for you.
ar: لترقية داش إلكتروم ، فقط :ref:`تتبيث <electrum-installation>` الإصدار الأحدث. تعتمد طريقة القيام بذلك على نظام التشغيل الخاص بك. لاحظ أن ملفات المحفظة الخاصة بك يتم تخزينها بشكل منفصل عن البرنامج ، بحيث يمكنك إزالة الإصدار القديم من البرنامج بأمان إذا كان نظام التشغيل الخاص بك لا يقوم بذلك نيابة عنك.
es: Para actualizar Dash Electrum, solo :ref:`instala <electrum-installation>` la versión más reciente. La forma de hacerlo dependerá de tu sistema operativo. Ten en cuenta que tus archivos de billetera se almacenan por separado del software, por lo que puedes eliminar de forma segura la versión anterior del software si tu sistema operativo no lo hace por ti.
fr: Pour mettre à jour Dash Electrum, il vous suffit d':ref:`installer <electrum-installation>` la version la plus récente. La façon de le faire dépend de votre système d'exploitation. Veuillez noter que les fichiers de portefeuille sont stockés séparément du logiciel, donc vous pouvez enlever la vieille version du logiciel en toute sécurité si jamais votre système d'exploitation ne le fait pas pour vous.
it: Per aggiornare Dash Electrum, basta :ref:`installare <electrum-installation>` la versione più recente. Il modo per farlo dipenderà dal tuo sistema operativo. Tieni presente che i file del tuo wallet sono archiviati separatamente dal software, quindi puoi rimuovere in sicurezza la vecchia versione del software se il tuo sistema operativo non lo fa per te.
zh_cn: 如需升级达世币轻钱包，用户只需 \ :ref:`安装 <electrum-installation>`\ 最新版本。安装的具体步骤取决于计算机的操作系统。请注意，用户的钱包文件与软件是分开存储的，因此用户可以在操作系统没有删除旧版本的软件的时候自行完成这项操作，这一操作是安全的。

source: Some Dash Electrum upgrades will modify the format of your wallet files. For this reason, it is not recommended to downgrade Dash Electrum to an older version once you have opened your wallet file with the new version. The older version will not always be able to read the new wallet file.
ar: تقوم بعض ترقيات داش الكتروم بتعديل تنسيق ملفات المحفظة. لهذا السبب ، لا يُنصح بالرجوع إلى إصدار أقدم من داش الكتروم إلى إصدار قديم بمجرد فتح ملف المحفظة باستخدام الإصدار الجديد. لن يتمكن الإصدار القديم دائمًا من قراءة ملف المحفظة الجديد.
es: Algunas actualizaciones de Dash Electrum modificarán el formato de tus archivos de billetera. Por esta razón, no se recomienda degradar Dash Electrum a una versión anterior una vez que hayas abierto tu archivo de billetera con la nueva versión. La versión anterior no siempre podrá leer el nuevo archivo de billetera.
fr: Certaines mises à jour de Dash Electrum changeront le format de vos fichiers de portefeuille. Pour cette raison, il n'est pas recommandé de revenir à une version antérieure de Dash Electrum une fois que vous avez ouvert votre fichier de portefeuille avec une version plus récente. La version plus ancienne ne sera pas toujours capable de lire le nouveau fichier de portefeuille.
it: Alcuni aggiornamenti di Dash Electrum modificheranno il formato dei file del tuo wallet. Per questo motivo, non è consigliabile effettuare il downgrade di Dash Electrum a una versione precedente dopo aver aperto il file del wallet con la nuova versione. La versione precedente non sarà sempre in grado di leggere il nuovo file del wallet.
zh_cn: 有些达世币轻钱包的更新可能会修改钱包文件的格式。考虑到这一点，我们不建议使用新版本的软件打开过钱包文件的用户再使用旧版本的达世币轻钱包。旧版本的达世币轻钱包可能无法读取新的钱包文件。

source: The following issues should be considered when upgrading Dash Electrum 1.x wallets to Dash Electrum 2.x:
ar: يجب النظر في القضايا التالية عند ترقية محافظ داش الكتروم 1.x إلى داش الكتروم 2.x:
es: Los siguientes problemas se deben tener en cuenta al actualizar las billeteras de Dash Electrum 1.x a Dash Electrum 2.x:
fr: Les problèmes suivants sont possibles lors de la mise à jour des versions 1.x du portefeuille logiciel Dash Electrum vers des versions 2.x :
it: È necessario considerare i seguenti problemi quando si aggiornano i wallet Dash Electrum 1.x a Dash Electrum 2.x:
zh_cn: 将达世币轻钱包从1.0系列的版本升级到2.0系列的版本时，用户需要注意以下几点：

source: Dash Electrum 2.x will need to regenerate all of your addresses during the upgrade process. Please allow it time to complete, and expect it to take a little longer than usual for Dash Electrum to be ready.
ar: سيحتاج داش الكتروم 2.x إلى إعادة إنشاء جميع عناوينك أثناء عملية الترقية. يرجى إتاحة الوقت لإكمالها ، ونتوقع أن يستغرق الأمر وقتًا أطول من المعتاد لكي تكون داش الكتروم جاهزة.
es: Dash Electrum 2.x necesitará regenerar todas tus direcciones durante el proceso de actualización. Espera un momento para completar y espera que Dash Electrum tarde un poco más de lo normal para estar listo.
fr: Dash Electrum 2.x devra regénérer toutes vos adresses pendant le processus de mise à jour. Veuillez lui donner le temps de le faire, et attendez-vous à ce que ce soit un peu plus long que d'habitude avant que Dash Electrum ne soit prêt à être utilisé.
it: Dash Electrum 2.x dovrà rigenerare tutti i tuoi indirizzi durante il processo di aggiornamento. Attendi il completamento del processo e aspettati che richieda un po' più tempo del solito affinché Dash Electrum sia pronto.
zh_cn: 达世币轻钱包2.0系列的版本需要在升级的过程中重新生成所有的地址。用户需要预留出生成新地址所需的时间，并且这个时间比通常情况下要长一些。

source: The contents of your wallet file will be replaced with a Dash Electrum 2 wallet. This means Dash Electrum 1.x will no longer be able to use your wallet once the upgrade is complete.
ar: سيتم استبدال محتويات ملف المحفظة بمحفظة داش الكتروم 2. هذا يعني أن داش الكتروم 1.x لن يكون بإمكانه استخدام محفظتك بمجرد اكتمال الترقية.
es: El contenido de tu archivo de billetera se reemplazará con una billetera Dash Electrum 2. Esto significa que Dash Electrum 1.x ya no podrá usar tu billetera una vez que se complete la actualización.
fr: Le contenu de votre fichier de portefeuille sera remplacé par un portefeuille Dash Electrum 2. Cela signifie que Dash Electrum 1.x ne sera plus capable d'utiliser votre portefeuille une fois la mise à jour terminée.
it: Il contenuto del file del tuo wallet verrà sostituito con un wallet Dash Electrum 2. Ciò significa che Dash Electrum 1.x non sarà più in grado di utilizzare il tuo wallet una volta completato l'aggiornamento.
zh_cn: 升级后，钱包文件的内容将被替换为达世币轻钱包2.0系列的版本。这意味着用户在升级完成后将无法使用1.0系列版本的钱包。

source: The **Addresses** tab will not show any addresses the first time you launch Dash Electrum 2. This is expected behaviour. Restart Dash Electrum 2 after the upgrade is complete and your addresses will be available.
ar: لن تعرض علامة **العناوين** أي عناوين في المرة الأولى التي تقوم فيها بتشغيل داش إلكتروم 2. هذا هو السلوك المتوقع. أعد تشغيل داش الكتروم 2 بعد اكتمال الترقية وستكون عناوينك متاحة.
es: La pestaña **Direcciones** no mostrará ninguna dirección la primera vez que inicies Dash Electrum 2. Este es el comportamiento esperado. Reinicia Dash Electrum 2 después de que se complete la actualización y tus direcciones estarán disponibles.
fr: L'onglet **Adresses** n'affichera aucune adresse au premier lancement de Dash Electrum 2. Il s'agit d'un comportement normal. Redémarrez Dash Electrum 2 après la fin de la mise à jour, et vos adresses seront disponibles.
it: La scheda **Indirizzi** non mostrerà alcun indirizzo la prima volta che avvii Dash Electrum 2. Si tratta di un comportamento previsto. Riavvia Dash Electrum 2 una volta completato l'aggiornamento e i tuoi indirizzi saranno disponibili.
zh_cn: 在用户第一次启动达世币轻钱包2.0系列的版本时， **地址** 选项卡上不会显示任何地址。这是可以预见的情况。此时，用户需要在升级完成后重启达世币轻钱包2.0系列的版本，这样， **地址** 选项卡上就会显示地址了。

source: Offline copies of Dash Electrum will not show the addresses at all because it cannot synchronize with the network. You can force an offline generation of a few addresses by typing the following into the Console: `wallet.synchronize()`. When it’s complete, restart Dash Electrum and your addresses will once again be available.
ar: لن تعرض نسخ Offline من داش الكتروم العناوين على الإطلاق لأنها لا تستطيع المزامنة مع الشبكة. يمكنك فرض جيل غير متصل بعناوين قليلة عن طريق كتابة ما يلي في وحدة التحكم: `wallet.synchronize ()`. عند اكتمال العملية ، أعد تشغيل داش الكتروم وستكون عناوينك متاحة مرة أخرى.
es: Las copias fuera de línea de Dash Electrum no mostrarán las direcciones porque no pueden sincronizarse con la red. Puedes forzar una generación fuera de línea de algunas direcciones escribiendo lo siguiente en la consola: `wallet.synchronize()`. Cuando esté completo, reinicia Dash Electrum y tus direcciones volverán a estar disponibles.
fr: Les versions hors ligne de Dash Electrum n'afficheront aucune adresse car elles ne peuvent pas se synchroniser avec le réseau. Vous pouvez forcer la génération hors ligne de quelques adresses en tapant ceci dans la console : ``wallet.synchronize()``. Une fois terminé, redémarrez Dash Electrum et vos adresses seront de nouveau disponibles.
it: Le copie offline di Dash Electrum non mostreranno affatto gli indirizzi perché non possono sincronizzarsi con la rete. Puoi forzare la generazione offline di alcuni indirizzi digitando quanto segue nella console: `wallet.synchronize()`. Al termine, riavvia Dash Electrum e i tuoi indirizzi saranno nuovamente disponibili.
zh_cn: 达世币轻钱包在脱机状态下不会显示地址，因为它无法与达世币网络同步。用户可以在控制台上输入`wallet.synchronize()`，从而在线下生成一些地址。完成这些步骤之后，用户需要重启达世币轻钱包才能浏览并使用生成的地址。
