Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/send-receive.po
Languages: ar, de, es, fr, it, pt, zh_cn

source: The **History** tab lists all current and pending transactions. A transaction to an address in your wallet will appear in the list soon after it is made. Initially, this transaction will be marked as **Unconfirmed**, followed by a clock indicator on the left. As the Dash network processes the transaction, the status will update in the transaction history list. The network confirms transactions with a new block roughly every 2.5 minutes, and a transaction is considered confirmed (and therefore spendable) after six confirmations. These processed transactions are denoted with a green checkmark and the timestamp at which the transaction was made.
ar: تسرد علامة التبويب **المحفوظات** جميع المعاملات الحالية والمعلقة. ستظهر المعاملة إلى عنوان في محفظتك في القائمة بعد وقت قصير من إنشاءها. مبدئيًا ، سيتم وضع علامة على هذه المعاملة كـ **غير مؤكدة** ، متبوعة بمؤشر على مدار الساعة على اليسار. عندما تقوم شبكة داش بمعالجة المعاملة ، سيتم تحديث الحالة في قائمة محفوظات المعاملة. تؤكد الشبكة المعاملات مع كتلة جديدة كل 2.5 دقيقة تقريبًا ، وتعتبر المعاملة مؤكدة (وبالتالي قابلة للتنفيذ) بعد ست تأكيدات. تتم الإشارة إلى هذه المعاملات التي تمت معالجتها باستخدام علامة اختيار خضراء والطابع الزمني الذي تم إجراء المعاملة به.
de: Die **History** Registerkarte listet alle aktuellen und anstehenden Transaktionen. Eine Transaktion an eine Adresse der Wallet erscheint, sobald sie vorgenommen wurde. Zunächst wird die Transaktion als **Unconfirmed** angezeigt, worauf eine Uhr erscheint, die den Fortschritt dokumentiert. Während das Dash-Netzwerk die Transaktion verarbeitet, wird die Anzeige in der Transaktionsgeschichtenliste durchgehend aktualisiert. Das Netzwerk bestätigt die Transaktion mit jedem Block etwa alle 2,5 Minuten und eine Transaktion wird als bestätigt angesehen (und damit als weiterversendbar), nachdem sie sechs Mal bestätigt wurde. Diese verarbeiteten Transaktionen werden mit einem grünen Hacken und dem korrekten Zeitstempel der Transaktionszeit versehen.
es: La pestaña **Historial** enumera todas las transacciones actuales y pendientes. Una transacción a una dirección en tu billetera aparecerá en la lista poco después de que se realice. Inicialmente, esta transacción se marcará como **Sin confirmar**, seguida de un indicador de reloj a la izquierda. A medida que la red Dash procesa la transacción, el estado se actualizará en la lista del historial de transacciones. La red confirma las transacciones con un nuevo bloque aproximadamente cada 2,5 minutos, y una transacción se considera confirmada (y, por lo tanto, se puede gastar) después de seis confirmaciones. Estas transacciones procesadas se indican con una marca de verificación verde y la marca de tiempo en la que se realizó la transacción.
fr: L'onglet **Historique** répertorie toutes les transactions en cours ou achevées. Une transaction vers une adresse de votre portefeuille apparaîtra dans la liste peu après son exécution. Tout d'abord, cette transaction sera indiquée comme **Non confirmée**, accompagnée par une icône en forme d'horloge sur la gauche. Au fur et à mesure que le réseau Dash opère la transaction, cet état sera mis à jour dans la liste d'historique de transactions. Le réseau confirme les transactions avec chaque nouveau bloc, à peu près toutes les 2,5 minutes, et une transaction est considérée comme confirmée (et donc dépensable) après six confirmations. Ces transactions achevées sont indiquées par une coche verte et par l'horodatage de l'exécution de la transaction.
it: La scheda **Cronologia** elenca tutte le transazioni correnti e in sospeso. Una transazione verso un indirizzo nel tuo wallet apparirà nell'elenco subito dopo essere stata effettuata. Inizialmente, questa transazione verrà contrassegnata come **Non confermata**, seguita da un indicatore di orologio sulla sinistra. Man mano che la rete Dash elabora la transazione, lo stato verrà aggiornato nell'elenco della cronologia delle transazioni. La rete conferma le transazioni con un nuovo blocco ogni 2,5 minuti circa, e una transazione viene considerata confermata (e quindi spendibile) dopo sei conferme. Queste transazioni elaborate sono contrassegnate da un segno di spunta verde e dal timestamp in cui è stata effettuata la transazione.
pt: A guia **Histórico** lista todas as transações atuais e pendentes. Uma transação para um endereço em sua carteira aparecerá na lista logo após ser feita. Inicialmente, esta transação será marcada como **Não confirmada**, seguida por um indicador de relógio à esquerda. Como a rede do Dash processa a transação, o status será atualizado na lista do histórico de transações. A rede confirma transações com um novo bloco aproximadamente a cada 2,5 minutos, e uma transação é considerada confirmada (e, portanto, utilizável) após seis confirmações. Essas transações processadas são indicadas com uma marca de seleção verde e o registro de data e hora em que a transação foi feita.
zh_cn: **历史记录** 选项卡中显示了当前及待办的所有交易。在对某一地址的交易启动后，用户的钱包软件很快就会显示相关的记录。一开始，交易的状态显示为 **未确认**，同时左侧还有一个指示时间的时钟。伴随达世币网络对交易的处理进程，历史记录中的交易状态也会不断更新。达世币网络大约每2.5分钟就会通过一个新的区块确认交易，在完成六次交易确认后，相应的达世币交易就完成确认（可使用）了。此时，完成确认的交易将会附上绿色的确认标记和时间戳。

source: Dash Electrum wallet History tab immediately after receiving a transaction and after confirmation is complete
ar: محفوظات محفوظات داش ألكتروم مباشرةً بعد تلقي المعاملة وبعد اكتمال التأكيد
de: Die History Registerkarte der Dash Electrum Wallet nachdem eine Transaktionen empfangen wurde und nachdem sie vollständig bestätigt wurde
es: Pestaña Historial de la billetera Dash Electrum inmediatamente después de recibir una transacción y una vez completada la confirmación
fr: Onglet Historique du portefeuille Dash Electrum, après réception d'une transaction et achèvement de sa confirmation
it: Scheda Cronologia del wallet Dash Electrum immediatamente dopo aver ricevuto una transazione e dopo il completamento della conferma
pt: A guia Histórico da carteira do Dash Electrum imediatamente após o recebimento de uma transação e após a conclusão da confirmação
zh_cn: 达世币轻钱包的历史记录选项卡将在收到交易资金和完成交易确认后予以更新

source: To view additional transaction details, right click a transaction on the **History** tab and select **Details** from the context menu. You can also use this menu to copy the transaction ID to the clipboard (this can be used as proof that a given transaction occurred), edit the transaction description for your records or view the transaction on an external block explorer.
ar: لعرض تفاصيل المعاملات الإضافية ، انقر بزر الماوس الأيمن فوق إحدى المعاملات في علامة **المحفوظات** ، ثم حدد **التفاصيل** من قائمة السياق. يمكنك أيضًا استخدام هذه القائمة لنسخ معرف المعاملة إلى الحافظة (يمكن استخدام ذلك كدليل على حدوث معاملة معينة) ، أو تحرير وصف المعاملة للسجلات الخاصة بك أو عرض المعاملة على مستكشف كتلة خارجي.
de: Um weitere Transaktionsdetails anzusehen, ist ein Rechtsklick auf die Transaktion in der **History** Registerkarte und danach auf die Option **Details** im nun erscheinenden Menü notwendig. Über dieses Menü können ebenfalls die Transaktions-ID in die Zwischenablage kopiert (um das Durchführen der Transaktion zu beweisen), die Transaktionsbeschreibung für die eigenen Aufzeichnungen editiert und die Transaktion über einen externen Blockexplorer angesehen werden.
es: Para ver detalles adicionales de la transacción, haz click con el botón derecho en una transacción en la pestaña **Historial** y selecciona **Detalles** en el menú contextual. También puedes usar este menú para copiar la identificación de la transacción en el portapapeles (esto puede usarse como prueba de que se produjo una transacción determinada), edita la descripción de la transacción para tus registros o ve la transacción en un explorador de bloques externo.
fr: Pour afficher des détails supplémentaires sur la transaction, faites un clic-droit sur elle dans l'onglet **Historique**, puis choisissez **Détails** dans le menu contextuel. Vous pouvez aussi utiliser ce menu pour copier l'identifiant de transaction dans le presse-papiers (il peut servir de preuve que la transaction a bien été exécutée), pour modifier la description de la transaction dans votre historique personnel, ou pour consulter la transaction dans un explorateur de blocs externe.
it: Per visualizzare ulteriori dettagli sulla transazione, fai clic con il pulsante destro del mouse su una transazione nella scheda **Cronologia** e seleziona **Dettagli** dal menu contestuale. Puoi anche utilizzare questo menu per copiare l'ID della transazione negli appunti (questo può essere usato come prova che una determinata transazione è avvenuta), modificare la descrizione della transazione per i tuoi record o visualizzare la transazione su un block explorer esterno.
pt: Para visualizar detalhes adicionais da transação, clique com o botão direito do mouse em uma transação na guia **Histórico** e selecione **Detalhes** no menu de contexto. Você também pode usar esse menu para copiar o ID da transação para a área de transferência (isso pode ser usado como prova de que uma transação ocorreu), editar a descrição da transação para seus registros ou visualizar a transação em um explorador de bloco externo.
zh_cn: 如需查阅额外的交易细节，用户可以右键单击 **历史记录** 选项卡并在弹出菜单中选择 **细节信息** 。用户还可以使用这个菜单来将交易ID复制到剪贴板上（这也可以用作既定交易已发生的证明）、编辑历史记录上的交易说明或在外部区块资源管理器上查看交易资讯。

source: Transaction details in Dash Electrum wallet
ar: تفاصيل المعاملة في محفظة داش ألكتروم
de: Transaktionsdetails in der Dash Electrum Wallet
es: Detalles de la transacción en la billetera Dash Electrum
fr: Détails de transaction dans le portefeuille Dash Electrum
it: Dettagli della transazione nel wallet Dash Electrum
pt: Detalhes da transação na carteira Dash Electrum
zh_cn: 达世币轻钱包中的交易详情
