Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/electrum/send-receive.po
Languages: ar, de, es, fr, it, pt, zh_cn

source: Guide to sending and receiving Dash using the Dash Electrum wallet
ar: دليل لإرسال واستقبال داش باستخدام محفظة داش إلكتروم
de: Anleitung für das Verschicken von Dash mit der Dash Electrum Wallet
es: Guía para enviar y recibir Dash usando la billetera Dash Electrum
fr: Guide d'envoi et de réception de dashs au moyen du portefeuille logiciel Dash Electrum
it: Guida per inviare e ricevere Dash utilizzando il wallet Dash Electrum
pt: Guia para enviar e receber o Dash usando a carteira do Dash Electrum
zh_cn: 使用达世币轻钱包发送和接收达世币

source: dash, wallet, electrum, send, receive, transaction
ar: داش، محفظة، ألكتروم، إرسال، إستقبال، المعاملة
de: dash, wallet, electrum, senden, empfangen, transaktion
es: dash, billetera, electrum, enviar, recibir, transacción
fr: dash, portefeuille logiciel, electrum, envoyer, recevoir, transaction
it: dash, wallet, electrum, invia, ricevi, transazione
pt: dash, carteira, electrum, enviar, receber, tranação
zh_cn: 达世币，钱包，轻钱包，发送，接收，交易

source: Sending and receiving
ar: الإرسال و الإستقبال
de: Senden und Empfangen
es: Enviar y recibir
fr: Envoyer et recevoir
it: Invia e ricevi
pt: Enviando e recebendo
zh_cn: 发送和接收

source: You may own Dash stored in another software wallet, or on an exchange such as Bittrex or Kraken, or simply want to send or receive funds as a wage or business transaction. Funds can be transferred between these source and the Electrum wallet using Dash addresses. Your wallet contains multiple addresses, and will generate new addresses as necessary. Since the Dash blockchain is transparent to the public, it is considered best practice to use a new address for each transaction in order to maintain your privacy.
ar: يمكنك امتلاك داش المخزنة في محفظة برامج أخرى ، أو في تبادل مثل Bittrex أو Kraken ، أو ببساطة ترغب في إرسال أو تلقي الأموال كصفقة للأجور أو الأعمال. يمكن تحويل الأموال بين هذا المصدر ومحفظتك ألكتروم باستخدام عناوين داش. تحتوي محفظتك على عناوين متعددة ، وستقوم بإنشاء عناوين جديدة حسب الضرورة. نظرًا لأن مجموعة داش بلوكشين تتسم بالشفافية للجمهور ، فإنه من الأفضل ممارسة استخدام عنوان جديد لكل معاملة من أجل الحفاظ على خصوصيتك.
de: Ein Nutzer, der Dash auf einer anderen Software Wallet oder einem Exchange, wie z.B. Bittrex oder Kraken, lagert, oder Dash als normale Transaktion versenden oder empfangen möchte, kann hierfür auf die Dash Electrum Wallet und deren Dash-Adressen zugreifen. Jede Wallet verfügt über mehrere Adressen und kann bei Bedarf auch neue generieren. Da die Dash-Blockchain öffentlich einsehbar ist, wird empfohlen eine Adresse nur einmal und nicht mehrmals zu verwenden, damit die Privatsphäre geschützt werden kann.
es: Puede que tengas Dash almacenado en otra billetera de software, o en una casa de cambio como Bittrex o Kraken, o simplemente que deseas enviar o recibir fondos como una transacción salarial o comercial. Los fondos se pueden transferir entre estas fuentes y la billetera Electrum usando direcciones de Dash. Tu billetera contiene varias direcciones y generará nuevas direcciones según sea necesario. Dado que la cadena de bloques de Dash es transparente para el público, se considera como mejor práctica utilizar una nueva dirección para cada transacción a fin de mantener tu privacidad.
fr: Peut-être possédez-vous des dashs stockés dans un autre portefeuille logiciel, ou bien sur une plateforme de change telle que Bittrex ou Kraken, ou bien voulez-vous simplement envoyer ou recevoir des fonds tels qu'un salaire ou une transaction commerciale. Les fonds peuvent être transmis entre ces sources et le portefeuille Electrum, en utilisant des adresses Dash. Votre portefeuille contient de nombreuses adresses, et générera autant de nouvelles adresses que nécessaire. Comme la blockchain Dash est transparente et consultable par chacun, il est conseillé d'utiliser une nouvelle adresse pour chaque transaction afin de protéger votre vie privée.
it: Potresti possedere Dash archiviato in un altro wallet software o su un exchange come Bittrex o Kraken, o semplicemente voler inviare o ricevere fondi come stipendio o transazione commerciale. I fondi possono essere trasferiti tra queste fonti e il portafoglio Electrum utilizzando gli indirizzi Dash. Il tuo portafoglio contiene più indirizzi e genererà nuovi indirizzi se necessario. Poiché la blockchain di Dash è trasparente al pubblico, è considerata buona pratica utilizzare un nuovo indirizzo per ogni transazione al fine di mantenere la propria privacy.
pt: Você pode possuir o Dash armazenado em outra carteira de software, ou em uma bolsa como Bittrex ou Kraken, ou simplesmente desejar enviar ou receber fundos como uma transação salarial ou comercial. Os fundos podem ser transferidos entre essas fontes e a carteira Electrum usando os endereços do Dash. Sua carteira contém vários endereços e gerará novos endereços conforme necessário. Como o blockchain do Dash é transparente para o público, considera-se como prática recomendada usar um novo endereço para cada transação, a fim de manter sua privacidade.
zh_cn: 用户可能将达世币存储在别的软件钱包、Bittrex 或Kraken等交易平台上。又或者，用户只是希望收发交易资金或薪酬。在这种情况下，用户只需借助地址就能在达世币轻钱包上完成达世币的收发了。用户的钱包中含有多个地址，而且还能在必要的时候生成新的地址。由于达世币区块链是公开的，因此建议用户在各个交易中都使用新的地址，以便保护个人隐私。

source: Sending
ar: إرسال
de: Senden
es: Enviando
fr: Envoyer des fonds
it: Invio
pt: Enviando
zh_cn: 发送

source: Click the **Send** tab to make a payment. Enter the destination address in the **Pay to** field, either manually or by pasting from the clipboard. Optionally enter a **Description** for to appear in your transaction history, followed by the **Amount** to be sent. The total amount of the transaction is the sum of the sent amount and transaction fee, which is calculated automatically. Dash Electrum issues a warning if the total transaction amount exceeds the wallet balance.
ar: انقر فوق علامة **إرسال** لإجراء عملية دفع. أدخل عنوان الوجهة في الحقل **الدفع إلى** ، إما يدويًا أو عن طريق اللصق من الحافظة. بشكل اختياري ، أدخل **وصف** لتظهر في سجل معاملاتك ، متبوعًا بـ **المبلغ** ليتم إرساله. المبلغ الإجمالي للمعاملة هو مجموع المبلغ المرسل ورسم المعاملة ، والذي يتم حسابه تلقائيًا. يصدر داش ألكتروم تحذيرًا إذا تجاوز إجمالي مبلغ المعاملة رصيد المحفظة.
de: Transaktionen können über die Registerkarte **Send** verschickt werden. Die Adresse des Empfängers kann manuell oder per Kopierfunktion in das Feld **Pay to** eingefügt werden. In **Description** kann eine Beschreibung eingetragen werden, die nur lokal gespeichert wird und in **Amount** kann die gewünschte Geldmenge eingetragen werden. Der Gesamtbetrag aus gewünschter Geldmenge und Transaktionsgebühr wird automatisch berechnet. Dash Electrum gibt eine Warnung heraus, falls die Wallet nicht ausreichend gedeckt ist, um die gewünschte Transaktion durchzuführen.
es: Haz clic en la pestaña **Enviar** para realizar un pago. Ingresa la dirección de destino en el campo **Pagar a**, ya sea manualmente o pegando desde el portapapeles. Opcionalmente, ingresa una **Descripción** para que aparezca en tu historial de transacciones, seguido por el **Monto** que se enviará. El monto total de la transacción es la suma del monto enviado y la comisión de transacción, que se calcula automáticamente. Dash Electrum emite una advertencia si el monto total de la transacción excede el saldo de la billetera.
fr: Cliquez sur l'onglet **Envoyer** pour émettre un paiement. Saisissez l'adresse de destination dans le champ **Payer à**, soit manuellement, soit en la collant depuis le presse-papiers. Facultativement, vous pouvez aussi saisir une **Description** qui apparaîtra dans votre historique de transactions, suivie par le **Montant** qui doit être envoyé. Le montant total de la transaction est la somme du montant envoyé et des frais de transaction, qui sont calculés automatiquement. Dash Electrum affiche un avertissement si le montant total de la transaction dépasse le solde du portefeuille.
it: Fai clic sulla scheda **Invia** per effettuare un pagamento. Inserisci l'indirizzo di destinazione nel campo **Paga a**, manualmente o incollandolo dagli appunti. Facoltativamente, inserisci una **Descrizione** da visualizzare nella cronologia delle transazioni, seguita dall'**Importo** da inviare. L'importo totale della transazione è la somma dell'importo inviato e della commissione di transazione, che viene calcolata automaticamente. Dash Electrum emette un avviso se l'importo totale della transazione supera il saldo del portafoglio.
pt: Clique na guia **Enviar** para efetuar um pagamento. Digite o endereço de destino no campo **Pagar para**, manualmente ou colando na área de transferência. Opcionalmente, insira uma **Descrição** para aparecer no seu histórico de transações, seguido pelo **Quantidade** a ser enviado. O valor total da transação é a soma do valor enviado e da taxa de transação, que é calculada automaticamente. A Dash Electrum emite um aviso se o valor total da transação exceder o saldo da carteira.
zh_cn: 用户可以点击 **发送** 选项卡来进行支付。具体来说，用户可以通过在 **发送至** 字段中输入、手动复制粘贴或剪贴板来输入收款地址。此外，用户还可以输入 **金额** 并在 **描述** 中添加备注，以便在交易历史记录中显示相关说明。用户输入的金额应包括发送的金额和交易的费用，不过，钱包会自动计算交易费用。达世币轻钱包会在发送金额超过过余额的情况下发出警告。

source: Transaction ready to send in Dash Electrum wallet
ar: المعاملة جاهزة لإرسال محفظة داش ألكتروم
de: Die Dash Electrum Wallet ist bereit eine Transaktion durchzuführen
es: Transacción lista para enviar en a la billetera Dash Electrum
fr: Transaction prête à l'envoi dans le portefeuille Dash Electrum
it: Transazione pronta per l'invio nel wallet Dash Electrum
pt: Transação pronta para enviar a carteira Dash Electrum
zh_cn: 达世币轻钱包已经做好了交易准备

source: The wallet will request your password, then broadcast the transaction to the network and display a confirmation dialog with your transaction ID.
ar: ستطلب المحفظة كلمة المرور الخاصة بك ، ثم تقوم ببث المعاملة إلى الشبكة وعرض مربع حوار التأكيد مع معرف المعاملة الخاص بك.
de: Bei jeder Transaktion fragt die Wallet nach dem Passwort, bevor sie die Transaktion an das Netzwerk übermittelt und eine Bestätigung mit der Transaktions-ID anzeigt.
es: La billetera solicitará tu contraseña, luego transmitirá la transacción a la red y mostrará un cuadro de diálogo de confirmación con tu ID de transacción.
fr: Le portefeuille demandera votre mot de passe, puis diffusera la transaction au réseau et affichera un dialogue de confirmation comprenant votre identifiant de transaction.
it: Il wallet richiederà la tua password, quindi trasmetterà la transazione alla rete e visualizzerà una finestra di dialogo di conferma con il tuo ID transazione.
pt: A carteira solicitará sua senha, então transmitirá a transação para a rede e exibirá uma caixa de diálogo de confirmação com o ID da transação.
zh_cn: 达世币轻钱包将请求用户输入密码、在网络上公告交易资讯，并与交易ID一同显示交易确认信息。

source: Password prompt and transaction confirmation in Dash Electrum wallet
ar: تأكيد كلمة المرور وتأكيد المعاملة في محفظة داش ألكتروم
de: Passworteingabe und Transaktionsbestätigung in der Dash Electrum Wallet
es: Solicitud de contraseña y confirmación de transacción en la billetera Dash Electrum
fr: Demande de mot de passe et confirmation de transaction dans le portefeuille Dash Electrum
it: Richiesta della password e conferma della transazione nel wallet Dash Electrum
pt: Prompt de senha e confirmação de transação na carteira Dash Electrum
zh_cn: 达世币轻钱包中输入密码的提示和交易确认

source: Receiving
ar: إستقبال
de: Empfangen
es: Recibiendo
fr: Recevoir des fonds
it: Ricezione
pt: Recebendo
zh_cn: 接收

source: You can view your receiving addresses by clicking the **Receive** tab. Double-click the **Receiving address**, then copy it to the clipboard by clicking the Copy to clipboard icon. If you intend to use the address repeatedly, you can also enter a description click Save to store the address in the Requests list. Clicking an address in the list will display the stored information in the top area, together with a QR code containing the same information.
ar: يمكنك عرض عناوين المتلقي الخاصة بك بالنقر فوق علامة التبويب **إستقبال**. انقر نقرًا مزدوجًا فوق **عناوين الإستقبال** ، ثم قم بنسخه إلى الحافظة بالنقر فوق رمز انسخ. إذا كنت تنوي استخدام العنوان بشكل متكرر ، يمكنك أيضًا إدخال وصف انقر فوق حفظ لتخزين العنوان في قائمة الطلبات. سيؤدي النقر فوق أحد العناوين الموجودة في القائمة إلى عرض المعلومات المخزنة في المنطقة العليا ، بالإضافة إلى رمز الاستجابة السريعة الذي يحتوي على نفس المعلومات.
de: Die Empfangsadresse der Wallet kann über die Registerkarte **Receive** abgerufen werden. Durch einen Doppelklick auf **Receiving address** wird die Adresse markiert und durch einen Klick auf das Kopiersymbol wird sie kopiert. Falls die Adresse mehrmals verwendet werden soll, kann sie zudem in einer Liste gespeichert werden. Durch einen Klick auf die Adresse in der Liste werden alle Informationen und ein QR-Code, der diese Informationen ebenfalls enthält, angezeigt.
es: Puedes ver tus direcciones de recepción haciendo click en la pestaña **Recibir**. Haz doble click en **Dirección de recepción** y luego cópiala en el portapapeles haciendo click en el icono Copiar al portapapeles. Si tienes la intención de utilizar la dirección varias veces, también puedes ingresar una descripción, haz click en Guardar para almacenar la dirección en la lista de Solicitudes. Al hacer clic en una dirección en la lista se mostrará la información almacenada en el área superior, junto con un código QR que contiene la misma información.
fr: Vous pouvez afficher vos adresses de réception en cliquant sur l'onglet **Recevoir**. Double-cliquez sur **Adresse de réception** puis copiez-la dans le presse-papiers en cliquant l'icône Copier dans le presse-papiers. Si vous avez l'intention de réutiliser plus tard cette adresse, vous pouvez aussi saisir une description puis cliquer sur **Enregistrer** dans la liste **Demandes**. Cliquer sur une adresse de la liste affichera l'information enregistrée dans la zone supérieure, en même temps qu'un QR-code contenant la même information.
it: Puoi visualizzare gli indirizzi di ricezione facendo clic sulla scheda **Ricevi**. Fai doppio clic sull'**Indirizzo di ricezione**, quindi copialo negli appunti facendo clic sull'icona Copia negli appunti. Se intendi utilizzare l'indirizzo ripetutamente, puoi anche inserire una descrizione e fare clic su Salva per memorizzare l'indirizzo nell'elenco Richieste. Facendo clic su un indirizzo nell'elenco verranno visualizzate le informazioni memorizzate nell'area superiore, insieme a un codice QR contenente le stesse informazioni.
pt: Você pode visualizar seus endereços de recebimento clicando na guia **Receber**. Clique duas vezes no **Endereço de recebimento** e copie-o para a área de transferência clicando no ícone Copiar para a área de transferência. Se você pretende usar o endereço repetidamente, também é possível inserir uma descrição. Clique em Salvar para armazenar o endereço na lista Solicitações. Clicar em um endereço na lista exibirá as informações armazenadas na área superior, junto com um código QR contendo as mesmas informações.
zh_cn: 用户可以点击 **接收** 选项卡来浏览地址。随后，用户可以双击 **接收地址** ，然后将地址复制到剪贴板上。如果希望反复使用某个地址，用户还可以输入相关描述并点击保存，以便将该地址存储到请求列表上。在用户点击列表中的地址后，钱包将在顶部显示所存信息和包含相同信息的二维码。

source: Enter this address in the software sending the funds, send it to the person transferring funds to you or scan it directly from your mobile wallet. Once the transaction is complete, the balance will appear in the lower left corner of your wallet, and the indicator in the **Requests** table will change from **Pending** to **Paid**.
ar: أدخل هذا العنوان في البرنامج الذي يرسل الأموال ، أرسله إلى الشخص الذي يقوم بتحويل الأموال إليك أو مسحه ضوئيًا مباشرة من محفظتك المحمولة. بمجرد اكتمال المعاملة ، سيظهر الرصيد في الزاوية السفلية اليسرى من محفظتك ، وسيتغير المؤشر في جدول **الطلبات** من **معلق** إلى **مدفوع**.
de: Diese Adresse kann in die Software kopiert werden, die zum Versenden verwendet wird, sie kann an den Absender der zu zahlenden Coins geschickt werden oder sie kann direkt durch eine mobile Wallet eingescannt werden. Nachdem die Transaktion abgeschlossen wurde, wird das Guthaben im linken unteren Bereich der Wallet angezeigt und der Indikator in der **Requests** Registerkarte wird von **Pending** auf **Paid** wechseln.
es: Ingresa esta dirección en el software que envía los fondos, envíala a la persona que te transfiere los fondos o escanea directamente desde tu billetera móvil. Una vez que se complete la transacción, el saldo aparecerá en la esquina inferior izquierda de tu billetera, y el indicador en la tabla **Solicitudes** cambiará de **Pendiente** a **Pagado**.
fr: Saisissez cette adresse dans le logiciel qui envoie les fonds, envoyez-la à la personne qui doit vous envoyer des fonds, ou bien scannez-la directement depuis votre portefeuille mobile. Une fois la transaction achevée, le solde apparaîtra dans le coin inférieur gauche de votre portefeuille, et la mention **En cours** dans le tableau **Demandes** deviendra **Payé**.
it: Inserisci questo indirizzo nel software che invia i fondi, invialo alla persona che ti trasferisce i fondi o scansionalo direttamente dal tuo wallet mobile. Una volta completata la transazione, il saldo verrà visualizzato nell'angolo in basso a sinistra del tuo portafoglio e l'indicatore nella tabella **Richieste** cambierà da **In sospeso** a **Pagato**.
pt: Digite este endereço no software enviando os fundos, envie-o para a pessoa que transfere fundos para você ou digitalize-o diretamente da sua carteira móvel. Quando a transação estiver concluída, o saldo aparecerá no canto inferior esquerdo de sua carteira, e o indicador na tabela **Requisição** mudará de **Pendente** para **Pago**.
zh_cn: 用户可以在软件中输入地址，以便向需要进行转账的个人发送该地址；又或者，用户可以直接在移动钱包上直接扫描地址。交易完成后，钱包的左下角将显示达世币余额，此时， **请求** 列表中的显示将从 **等待中** 变更为 **已付**。

source: Successfully received payment in Dash Electrum wallet
ar: تم استلام الدفعة بنجاح في محفظة داش ألكتروم
de: Die Dash Electrum Wallet hat erfolgreich eine Zahlung empfangen
es: Recibir de manera exitosa un pago en la billetera Dash Electrum
fr: Paiement bien reçu dans le portefeuille Dash Electrum
it: Pagamento ricevuto con successo nel wallet Dash Electrum
pt: Pagamento recebido com sucesso na carteira do Dash Electrum
zh_cn: 在达世币轻钱包中成功地接收付款

source: Once you have used an address, you can either continue using it or click **New** to generate a new address.
ar: بمجرد استخدامك لعنوان ، يمكنك إما الاستمرار في استخدامه أو النقر فوق **جديد** لإنشاء عنوان جديد.
de: Nachdem eine Adresse einmal verwendet wurde, kann sie entweder weiter verwendet werden oder eine neue Adresse kann über **New** generiert werden.
es: Una vez que hayas utilizado una dirección, puedes continuar usándola o hacer click en **Nueva** para generar una nueva dirección.
fr: Une fois que vous avez utilisé une adresse, vous pouvez soit continuer à l'utiliser, soit cliquer sur **Nouveau** pour en générer une nouvelle.
it: Una volta utilizzato un indirizzo, puoi continuare a utilizzarlo oppure fare clic su **Nuovo** per generare un nuovo indirizzo.
pt: Depois de usar um endereço, você pode continuar a usá-lo ou clicar em **Nova** para gerar um novo endereço.
zh_cn: 在使用某一地址后，用户可以继续使用该地址，也可以单击 **新地址** 以便生成新地址。

source: Monitoring transactions
ar: مراقبة المعاملات
de: Transaktionen beobachten
es: Supervisar transacciones
fr: Suivi des transactions
it: Monitoraggio delle transazioni
pt: Monitorando transações
zh_cn: 交易监控
