Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/mining/p2pool.po
Languages: it

source: Guide to setting up a Dash P2Pool node
it: Guida alla configurazione di un nodo Dash P2Pool

source: P2Pool Node Setup
it: Configurazione del nodo P2Pool

source: This guide describes how to set up a Dash P2Pool node to manage a pool of miners. Unlike centralized mining pools, P2Pool is based on the same peer-2-peer (P2P) model as Dash, making the pool as a whole highly resistant to malicious attacks, and preserving and protecting the decentralized nature of Dash. When you launch a P2Pool node, it seeks out, connects with, and shares data with a decentralized network of other P2Pool nodes (also known as peers). P2Pool nodes share a cryptographic chain of data representing value, similar to Dash's blockchain. The P2Pool version is called the sharechain. The decentralized and fair nature of this mining model means mining with P2Pool is strongly encouraged. P2Pool for Dash uses the `p2pool-dash <https://github.com/dashpay/p2pool-dash>`_ software on GitHub, which is a fork of p2pool for Bitcoin. For more information, see `here <https://en.bitcoin.it/wiki/P2Pool>`__.
it: Questa guida descrive come configurare un nodo Dash P2Pool per gestire un pool di miner. A differenza delle mining pool centralizzate, P2Pool si basa sullo stesso modello peer-2-peer (P2P) di Dash, rendendo il pool nel suo insieme altamente resistente agli attacchi dannosi e preservando e proteggendo la natura decentralizzata di Dash. Quando avvii un nodo P2Pool, cerca, si connette e condivide i dati con una rete decentralizzata di altri nodi P2Pool (noti anche come peer). I nodi P2Pool condividono una catena crittografica di dati che rappresentano valore, simile alla blockchain di Dash. La versione P2Pool si chiama sharechain. La natura decentralizzata ed equa di questo modello di mining fa sì che il mining con P2Pool sia fortemente incoraggiato. P2Pool per Dash utilizza il software `p2pool-dash <https://github.com/dashpay/p2pool-dash>`_ su GitHub, che è un fork di p2pool per Bitcoin. Per maggiori informazioni vedi `qui <https://en.bitcoin.it/wiki/P2Pool>`__.

source: Because of the way P2Pool manages difficulty adjustments on the sharechain, it is important to maintain low latency between the miners and the P2Pool node to avoid miners submitting shares too late to enter the sharechain. When setting up your node, you need to consider its physical and network location relative to the miners you intend to connect to the node. If you operate a mining farm, your P2Pool node should probably be a physical machine on the same local network as your miners. If you plan to operate a public node, it may be best to set up your P2Pool node as a virtual machine in a data center with a high speed connection so geographically close miners can mine to your pool with relatively low latency.
it: A causa del modo in cui P2Pool gestisce gli aggiustamenti della difficoltà sulla catena azionaria, è importante mantenere una bassa latenza tra i miner e il nodo P2Pool per evitare che i miner inviino le azioni troppo tardi per entrare nella catena azionaria. Quando configuri il tuo nodo, devi considerare la sua posizione fisica e di rete rispetto ai minatori che intendi connettere al nodo. Se gestisci una mining farm, il tuo nodo P2Pool dovrebbe probabilmente essere una macchina fisica sulla stessa rete locale dei tuoi miner. Se prevedi di gestire un nodo pubblico, potrebbe essere meglio configurare il tuo nodo P2Pool come una macchina virtuale in un data center con una connessione ad alta velocità in modo che i miner geograficamente vicini possano estrarre nel tuo pool con una latenza relativamente bassa.

source: This following section describes the steps to setup an Ubuntu Server running P2Pool for Dash. It has been tested with Ubuntu 20.04 LTS and Dash 0.16. While a reasonable effort will be made to keep it up to date, it should be possible to modify the instructions slightly to support different versions or operating systems as necessary.
it: La sezione seguente descrive i passaggi per configurare un server Ubuntu che esegue P2Pool per Dash. È stato testato con Ubuntu 20.04 LTS e Dash 0.16. Anche se verrà fatto uno sforzo ragionevole per mantenerlo aggiornato, dovrebbe essere possibile modificare leggermente le istruzioni per supportare versioni o sistemi operativi diversi, se necessario.

source: Setting up the host server
it: Configurazione del server host

source: Download a copy of Ubuntu Server LTS from https://ubuntu.com/download/server and install it on your system according to the steps described `here <https://ubuntu.com/tutorials/install-ubuntu-server>`__. If you are using a VPS such as Vultr or AWS, your provider will most likely provide an option to install this system during provisioning. Ensure you enable OpenSSH server during setup so you can control your server from a remote console. Once you have access to your server, create a new non-root user if you have not already done so using the following command, replacing ``<username>`` with a username of your choice::
it: Scarica una copia di Ubuntu Server LTS da https://ubuntu.com/download/server e installala sul tuo sistema seguendo i passaggi descritti `qui <https://ubuntu.com/tutorials/install-ubuntu-server>` __. Se utilizzi un VPS come Vultr o AWS, molto probabilmente il tuo provider fornirà un'opzione per installare questo sistema durante il provisioning. Assicurati di abilitare il server OpenSSH durante la configurazione in modo da poter controllare il server da una console remota. Una volta ottenuto l'accesso al tuo server, crea un nuovo utente non root se non lo hai già fatto utilizzando il comando seguente, sostituendo ``<username>`` con un nome utente a tua scelta::

source: You will be prompted for a password. Enter and confirm using a new password (different to your root password) and store it in a safe place. You will also see prompts for user information, but this can be left blank. Once the user has been created, we will add them to the sudo group so they can perform commands as root::
it: Ti verrà richiesta una password. Inserisci e conferma utilizzando una nuova password (diversa dalla password di root) e conservala in un luogo sicuro. Verranno inoltre visualizzate le richieste per le informazioni sull'utente, ma è possibile lasciarlo vuoto. Una volta creato l'utente, lo aggiungeremo al gruppo sudo in modo che possa eseguire comandi come root::

source: Reboot your server and log in as the new user. At this point it is recommended to connect remotely using `PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ (for Windows) or ssh (for Linux and macOS) if you have not already done so.
it: Riavvia il server e accedi come nuovo utente. A questo punto è consigliato connettersi da remoto utilizzando `PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ (per Windows) o ssh (per Linux e macOS) se non lo hai già fatto.

source: Setting up port forwarding
it: Configurazione delle port forwarding

source: If you are on a private network behind a router, you will need to set up port forwarding for at least port 8999 (UDP/TCP) for access to the sharechain, as well as port 7903 (UDP/TCP) if you want your node to be accessible to the public. How this is done depends on your particular network router and is therefore beyond the scope of this documentation. An example from the popular DD-WRT open source router distribution is shown below. Guides to setting up port forwarding can be found `here <https://www.wikihow.com/Set-Up-Port-Forwarding-on-a-Router>`__ and `here <https://www.noip.com/support/knowledgebase/general-port-forwarding-guide/>`__.
it: Se ti trovi su una rete privata dietro un router, dovrai impostare il port forwarding almeno per la porta 8999 (UDP/TCP) per l'accesso alla sharechain, così come per la porta 7903 (UDP/TCP) se vuoi che il tuo nodo essere accessibili al pubblico. Il modo in cui ciò viene eseguito dipende dal router di rete specifico e pertanto va oltre lo scopo di questa documentazione. Di seguito è mostrato un esempio tratto dalla popolare distribuzione di router open source DD-WRT. Le guide per la configurazione del port forwarding possono essere trovate `qui <https://www.wikihow.com/Set-Up-Port-Forwarding-on-a-Router>`__ e `qui <https://www.noip.com/support/knowledgebase/general-port-forwarding-guide/>`__.

source: Take note of your IP address either from your router management interface or by visiting https://www.whatismyip.com
it: Prendi nota del tuo indirizzo IP dall'interfaccia di gestione del router o visitando https://www.whatismyip.com

source: Setting up port forwarding under DD-WRT
it: Configurazione delle port forwarding in DD-WRT

source: Manual setup
it: Configurazione manuale

source: First update your operating system as follows::
it: Per prima cosa aggiorna il tuo sistema operativo come segue:

source: Setting up dashd
it: Configurazione di dashd

source: P2Pool requires a full Dash node to be running to get block and transaction data. To download and install Dash, visit https://www.dash.org/downloads/ on your computer to find the link to the latest Dash Core wallet. Click **Linux**, then right-click on **Download TGZ** for **Dash Core x64** and select **Copy link address**. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
it: P2Pool richiede l'esecuzione di un nodo Dash completo per ottenere i dati sui blocchi e sulle transazioni. Per scaricare e installare Dash, visita https://www.dash.org/downloads/ sul tuo computer per trovare il collegamento all'ultimo wallet Dash Core. Fai clic su **Linux**, quindi fai clic con il pulsante destro del mouse su **Scarica TGZ** per **Dash Core x64** e seleziona **Copia indirizzo collegamento**. Torna alla finestra del terminale e inserisci il comando seguente, incollando l'indirizzo dell'ultima versione di Dash Core facendo clic con il pulsante destro del mouse o premendo **Ctrl + V**::

source: Verify the authenticity of your download by checking its detached signature against the public key published by the Dash Core development team. All releases of Dash are signed using GPG with one of the following keys:
it: Verifica l'autenticità del tuo download controllando la sua firma staccata rispetto alla chiave pubblica pubblicata dal team di sviluppo di Dash Core. Tutte le versioni di Dash sono firmate utilizzando GPG con una delle seguenti chiavi:

source: Alexander Block (codablock) with the key ``63A9 6B40 6102 E091``, `verifiable here on Keybase <https://keybase.io/codablock>`__
it: Alexander Block (codablock) con la chiave ``63A9 6B40 6102 E091``, `verificabile qui su Keybase <https://keybase.io/codablock>`__

source: Pasta (pasta) with the key ``5252 7BED ABE8 7984``, `verifiable here on Keybase <https://keybase.io/pasta>`__
it: Pasta (pasta) con la chiave ``5252 7BED ABE8 7984``, `verificabile qui su Keybase <https://keybase.io/pasta>`__

source: Create a working directory for Dash, extract the compressed archive, copy the necessary files to the directory and set them as executable::
it: Crea una directory di lavoro per Dash, estrai l'archivio compresso, copia i file necessari nella directory e impostali come eseguibili::

source: Clean up unneeded files::
it: Pulisci i file non necessari::

source: Create a configuration file using the following command::
it: Crea un file di configurazione utilizzando il seguente comando::

source: An editor window will appear. We now need to create a configuration file specifying several variables. Copy and paste the following text to get started, then replace the variables specific to your configuration as follows::
it: Apparirà una finestra dell'editor. Ora dobbiamo creare un file di configurazione specificando diverse variabili. Copia e incolla il seguente testo per iniziare, quindi sostituisci le variabili specifiche della tua configurazione come segue:

source: Replace the fields marked with ``XXXXXXX`` as follows:
it: Sostituisci i campi contrassegnati con ``XXXXXXX`` come segue:

source: ``rpcuser``: enter any string of numbers or letters, no special characters allowed
it: ``rpcuser``: inserisci qualsiasi stringa di numeri o lettere, non sono ammessi caratteri speciali

source: ``rpcpassword``: enter any string of numbers or letters, no special characters allowed
it: ``rpcpassword``: inserisci qualsiasi stringa di numeri o lettere, non sono ammessi caratteri speciali

source: The result should look something like this:
it: Il risultato dovrebbe assomigliare a questo:

source: Entering key data in dash.conf on the P2Pool node
it: Immissione dei dati chiave in dash.conf sul nodo P2Pool

source: Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. You can now start running Dash on the masternode to begin synchronization with the blockchain::
it: Premi **Ctrl + X** per chiudere l'editor e **Y** e **Invio** salvano il file. Ora puoi iniziare a eseguire Dash sul masternode per iniziare la sincronizzazione con la blockchain::

source: You will see a message reading **Dash Core server starting**. You can continue with the following steps and check synchronization periodically using the following command. Synchronization is complete when the number of ``blocks`` is equal to the current number of blocks in the Dash blockchain, as can be seen from any synchronized Dash wallet or `block explorer <https://insight.dash.org/insight/>`_::
it: Verrà visualizzato il messaggio **Server Dash Core in avvio**. È possibile continuare con i passaggi seguenti e verificare periodicamente la sincronizzazione utilizzando il comando seguente. La sincronizzazione è completa quando il numero di ``blocchi`` è uguale al numero attuale di blocchi nella blockchain di Dash, come si può vedere da qualsiasi wallet Dash sincronizzato o `block explorer <https://insight.dash.org/insight/>`_::

source: Setting up P2Pool
it: Configurazione di P2Pool

source: We will now set up the P2Pool software and its dependencies. Begin with the dependencies::
it: Ora configureremo il software P2Pool e le sue dipendenze. Inizia con le dipendenze::

source: Create working directories and set up p2pool-dash::
it: Crea directory di lavoro e configura p2pool-dash::

source: We will add some optional extra interfaces to the control panel::
it: Aggiungeremo alcune interfacce extra opzionali al pannello di controllo:

source: You can now start p2pool and optionally specify the payout address, external IP (if necessary), fee and donation as follows::
it: Ora puoi avviare p2pool e facoltativamente specificare l'indirizzo di pagamento, l'IP esterno (se necessario), la tariffa e la donazione come segue:

source: You can then monitor your node by browsing to the following addresses, replacing ``<ip_address>`` with the IP address of your P2Pool node:
it: Potrai quindi monitorare il tuo nodo navigando ai seguenti indirizzi, sostituendo ``<ip_address>`` con l'indirizzo IP del tuo nodo P2Pool:

source: Punchy interface: http://ip_address:7903/static
it: Interfaccia incisiva: http://ip_address:7903/static

source: Legacy interface: http://ip_address:7903/static/legacy
it: Interfaccia legacy: http://indirizzo_ip:7903/static/legacy

source: Status interface: http://ip_address:7903/static/status
it: Status interfaccia: http://ip_address:7903/static/status

source: Extended interface: http://ip_address:7903/static/ext
it: Interfaccia estesa: http://ip_address:7903/static/ext

source: Example configuration showing a single Bitmain Antminer D3 connected to a p2pool-dash node on the local network
it: Configurazione di esempio che mostra un singolo Bitmain Antminer D3 connesso a un nodo p2pool-dash sulla rete locale
