Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/mining/pools.po
Languages: fr, it, ru

source: Guide to mining using a mining pool
fr: Guide pour le minage en utilisant une équipe de minage
it: Guida al mining utilizzando una mining pool
ru: Руководство по майнингу используя майнинг-пул

source: dash, mining, X11, CPU, GPU, ASIC, hardware, pool, mining pools, Luxor
fr: dash, minage, X11, CPU, GPU, ASIC, matériel, équipe, équipes de minage, Luxor
ru: dash, майнинг, X11, ЦПУ, GPU, ASIC, аппаратные средства, пул, пулы для майнинга, Luxor

source: Mining Pools
fr: Équipes de minage
ru: Пулы для майнинга

source: Mining Dash in pools is more likely to generate rewards than solo mining directly on the blockchain. This is because you are extremely unlikely to mine a block as an individual given the current mining difficulty, so pooling efforts results in more frequent incremental rewards than extremely rare large rewards. Commercial mining pools offer a number of services, described below using the example of Luxor Mining.
fr: Miner Dash dans des équipes est plus susceptible de générer des récompenses que le minage solitaire directement sur la blockchain. C'est parce qu'il est très improbable que vous miniez un bloc en tant qu'individu, étant donné l'actuelle difficulté de minage. Donc mettre en équipe ses travaux entraîne des récompenses incrémentielles plus fréquentes que de vastes récompenses très rares. Les équipes commerciales de minage proposent un certain nombre de services, décrits ci-dessous à partir de l'exemple de Luxor Mining.
it: È più probabile che le Mining pool di Dash generino ricompense rispetto al mining solista direttamente sulla blockchain. Questo perché è estremamente improbabile che tu possa estrarre un blocco come individuo data l'attuale difficoltà di mining, quindi la condivisione degli sforzi si traduce in ricompense incrementali più frequenti rispetto a ricompense di grandi dimensioni estremamente rare. Le mining pool commerciali offrono una serie di servizi, descritti di seguito utilizzando l'esempio di Luxor Mining.
ru: При добыче Dash в пулах вероятность получения вознаграждения выше, чем при одиночной добыче непосредственно на блокчейне. Это связано с тем, что при текущей сложности майнинга добыть блок в одиночку крайне маловероятно, поэтому объединение усилий приводит к более частым постепенным вознаграждениям, чем крайне редкие крупные вознаграждения. Коммерческие майнинговые пулы предлагают ряд услуг, описанных ниже на примере компании Luxor Mining.

source: Miner Hosting
fr: Hébergement de mineur
ru: Майнер-хостинг

source: Some miners may decide to host the machines directly in their homes. This can work if you have a good shed or basement. But keep in mind that ASIC machines can be intrusive in your home. They are quite loud when operating (think a vacuum cleaner). In addition, mining hardware consumes a very significant amount of electricity, so running multiple mining ASICs in your home may damage your wiring or fuse board, may require additional ventilation or power and network distribution systems, and bears a risk of starting a fire. Ensure you are properly informed about these challenges before mining at home.
fr: Certains mineurs peuvent décider d'héberger les machines directement chez eux. Cela peut fonctionner si vous avez un bon endroit pour cela. Mais gardez à l'esprit que les machines ASIC peuvent être envahissantes chez vous. Elles sont particulièrement bruyantes quand elles tournent (du genre aspirateur). De plus, le matériel de minage consomme un montant très significatif d'électricité, donc faire tourner plusieurs ASIC de minage chez vous peut endommager votre réseau électrique, peut exiger une aération supplémentaire ou des systèmes de distribution électrique ou de réseau, et fait courir le risque de démarrer un incendie. Assurez-vous que vous êtes correctement informé de ces aspects avant de miner chez vous.
it: Alcuni miner potrebbero decidere di ospitare le macchine direttamente nelle loro case. Questo può funzionare se hai un buon capannone o un seminterrato. Ma tieni presente che le macchine ASIC possono essere invadenti nella tua casa. Sono piuttosto rumorosi durante il funzionamento (pensa ad un aspirapolvere). Inoltre, l'hardware di mining consuma una quantità molto significativa di elettricità, quindi l'utilizzo di più ASIC di mining in casa potrebbe danneggiare il cablaggio o la scheda dei fusibili, potrebbe richiedere ulteriore ventilazione o sistemi di distribuzione di alimentazione e di rete e comporta il rischio di provocare un incendio. Assicurati di essere adeguatamente informato su queste sfide prima di fare mining a casa.
ru: Некоторые майнеры решают размещать машины прямо у себя дома. Это может сработать, если у вас есть хороший сарай или подвал. Однако следует помнить, что ASICи могут мешать в доме. При работе они довольно громко работают (вспомните пылесос). Кроме того, оборудование для майнинга потребляет очень большое количество электроэнергии, поэтому использование нескольких ASIC-машин для майнинга в доме может привести к повреждению проводки или предохранительного щитка, потребовать дополнительной вентиляции или систем распределения электроэнергии и сети, а также чревато возникновением пожара. Убедитесь, что вы должным образом проинформированы об этих проблемах, прежде чем приступать к майнингу в домашних условиях.

source: Depending on the above considerations and your electricity rate, it may make sense to send your mining machine to a mining colocation site for hosting on your behalf. The mining colocation business takes a "hosting fee" in return for setup, ensuring proper operations, electricity and ongoing maintenance.
fr: En fonction des considérations ci-dessus et de vos frais d'électricité, il peut être pertinent d'envoyer votre machine de minage sur un site de colocation de minage. La colocation de minage demande des frais d'hébergement pour couvrir la mise en place, s'assurer des bonnes opérations, de l'électricité et de la maintenance courante.
it: A seconda delle considerazioni di cui sopra e della tariffa elettrica, potrebbe avere senso inviare la tua macchina per mining a un sito di colocation mineraria per l'hosting per tuo conto. L'attività di colocation mineraria richiede una "tariffa di hosting" in cambio della configurazione, garantendo operazioni adeguate, elettricità e manutenzione continua.
ru: В зависимости от вышеизложенных соображений и тарифов на электроэнергию, возможно, имеет смысл отправить майнинг-машину на площадку для размещения майнинга (mining colocation) от вашего имени. Компания, занимающаяся размещением майнинга, берет "плату за хостинг" в обмен на настройку, обеспечение надлежащей работы, электроэнергию и текущее обслуживание.

source: There are many hosting options available in the US / Canada such as `Compute North <https://www.computenorth.com/>`__, `Frontier <https://www.bitcoinmined.net/>`__, `Core Scientific <https://www.corescientific.com/>`__, `Lightspeed <https://www.lightspeedhosting.com/>`__, and many more. `Crypto Mining Tools <https://cryptomining.tools/>`__ offers a `mining map <https://cryptomining.tools/directory/map/1541>`__ with more options in North America. `Hashrate Index <https://hashrateindex.com>`__ provides a `database of hosted colocations <https://hashrateindex.com/farms>`__ in the US, Canada, Russia, Paraguay and more. `F2Pool <https://www.f2pool.com/>`__ has a `list of hosting locations <https://www.f2pool.com/>`__ in China and the CIS region. `BC Mining <https://bcmining.uy/>`__ offers multiple projects in South America. Please make sure to do your own research before making any decision on engaging a colocation business.
fr: Il existe beaucoup d'options d'hébergement aux États-Unis et au Canada, telles que `Compute North <https://www.computenorth.com/>`__, `Frontier <https://www.bitcoinmined.net/>`__, `Core Scientific <https://www.corescientific.com/>`__, `Lightspeed <https://www.lightspeedhosting.com/>`__, et bien plus. `Crypto Mining Tools <https://cryptomining.tools/>`__ propose une `carte de minage <https://cryptomining.tools/directory/map/1541>`__ avec plus d'options en Amérique du Nord. `Hashrate Index <https://hashrateindex.com>`__ fournit une `base de données des colocations hébergées <https://hashrateindex.com/farms>`__ aux États-Unis, au Canada, en Russie, au Paraguay et dans d'autres pays. `F2Pool <https://www.f2pool.com/>`__ a une `liste d'endroits d'hébergement <https://www.f2pool.com/>`__ en Chine et dans les régions voisines. `BC Mining <https://bcmining.uy/>`__ propose beaucoup de projets en Amérique du Sud. Veuillez vous assurer de conduire vos propres recherches avant de prendre toute décision relative à une colocation.
it: Negli Stati Uniti/Canada sono disponibili molte opzioni di hosting come `Compute North <https://www.computenorth.com/>`__, `Frontier <https://www.bitcoinmined.net/>`__, `Core Scientific <https://www.corescientific.com/>`__, `Lightspeed <https://www.lightspeedhosting.com/>`__ e molti altri. `Crypto Mining Tools <https://cryptomining.tools/>`__ offre una `mappa di mining <https://cryptomining.tools/directory/map/1541>`__ con più opzioni in Nord America. `Hashrate Index <https://hashrateindex.com>`__ fornisce un `database di colocation ospitate <https://hashrateindex.com/farms>`__ negli Stati Uniti, Canada, Russia, Paraguay e altro ancora. `F2Pool <https://www.f2pool.com/>`__ ha un `elenco di località di hosting <https://www.f2pool.com/>`__ in Cina e nella regione della CSI. `BC Mining <https://bcmining.uy/>`__ offre molteplici progetti in Sud America. Assicurati di fare le tue ricerche prima di prendere qualsiasi decisione sull'assunzione di un'attività di colocation.
ru: В США/Канаде существует множество вариантов хостинга, таких как `Compute North <https://www.computenorth.com/>`__, `Frontier <https://www.bitcoinmined.net/>`__, `Core Scientific <https://www.corescientific.com/>`__, `Lightspeed <https://www.lightspeedhosting.com/>`__ и многие другие. `Crypto Mining Tools <https://cryptomining.tools/>`__ предлагает карту майнинга <https://cryptomining.tools/directory/map/1541>`__ с дополнительными возможностями в Северной Америке. `Hashrate Index <https://hashrateindex.com>`__ предоставляет базу данных хостингов <https://hashrateindex.com/farms>`__ в США, Канаде, России, Парагвае и других странах. `F2Pool <https://www.f2pool.com/>`__ содержит `список хостинг-локаций <https://www.f2pool.com/>`__ в Китае и странах СНГ. `BC Mining <https://bcmining.uy/>`__ предлагает несколько проектов в Южной Америке. Пожалуйста, прежде чем принимать решение о привлечении компании, предоставляющей услуги, проведите собственное исследование.

source: Setting up your miner
fr: Configurer votre mineur
it: Configurazione del tuo miner
ru: Настройте свой майнер

source: Powering up the Miner
fr: Allumer votre mineur
it: Accensione del miner
ru: Запитайте майнер

source: Connect your machine to the power outlet via the built-in PSU. Then connect your miner to your internet-connected router or switch using a standard network cable. You are now ready to power up your miner.
fr: Connectez votre machine à la prise électrique via le PSU intégré. Puis connectez votre mineur au routeur ou au switch Internet, en utilisant un câble réseau standard. Vous pouvez désormais allumer votre mineur.
it: Collega la tua macchina alla presa di corrente tramite l'alimentatore integrato. Quindi collega il tuo miner al router connesso a Internet o cambia utilizzando un cavo di rete standard. Ora sei pronto per potenziare il tuo miner.
ru: Подключите машину к розетке через встроенный БП. Затем подключите майнер к подключенному к Интернету маршрутизатору или коммутатору с помощью стандартного сетевого кабеля. Теперь вы готовы к включению майнера.

source: Scanning for Devices
fr: Repérer les appareils
it: Scansione dei dispositivi
ru: Сканирование устройств

source: To get started, use a scanning tool like `AngryIP <https://angryip.org/>`__ or `Locator <https://minerstat.com/software/locator>`__ to scan every device on your local network and see its IP address. After you have identified your miner’s IP address, you are ready to proceed with Configuration.
fr: Pour commencer, utilisez un outil de repérage tel que `AngryIP <https://angryip.org/>`__ ou `Locator <https://minerstat.com/software/locator>`__ pour repérer tous les appareils sur votre réseau local et voir leurs adresses IP. Après avoir identifié l'adresse IP de votre mineur, vous pouvez exécuter la configuration.
it: Per iniziare, utilizza uno strumento di scansione come `AngryIP <https://angryip.org/>`__ o `Locator <https://minerstat.com/software/locator>`__ per scansionare ogni dispositivo sulla tua rete locale e vedere il suo indirizzo IP. Dopo aver identificato l'indirizzo IP del tuo miner, sei pronto per procedere con la configurazione.
ru: Для начала воспользуйтесь инструментом сканирования, например `AngryIP <https://angryip.org/>`__ или `Locator <https://minerstat.com/software/locator>`__, чтобы просканировать все устройства в локальной сети и узнать их IP-адреса. После определения IP-адреса майнера можно приступать к его настройке.

source: Configuration
it: Configurazione
ru: Конфигурация

source: Enter the local network IP address of your miner in the URL bar of any web browser. A dashboard similar to the one shown below will pop up. We are setting up a StrongU STU-U6, but the process is similar for other ASICs.
fr: Saisissez l'adresse IP sur réseau local de votre mineur dans la barre URL de n'importe quel navigateur web. Un tableau de bord similaire à celui ci-dessous apparaîtra. Nous mettons en place un StrongU STU-U6, mais la procédure est similaire avec d'autres ASIC.
it: Inserisci l'indirizzo IP della rete locale del tuo miner nella barra degli URL di qualsiasi browser web. Verrà visualizzata una dashboard simile a quella mostrata di seguito. Stiamo configurando uno StrongU STU-U6, ma il processo è simile per altri ASIC.
ru: Введите IP-адрес локальной сети вашего майнера в строку URL любого браузера. На экране появится панель, аналогичная показанной ниже. Мы настраиваем StrongU STU-U6, но процесс аналогичен настройке других ASIC.

source: Setting up a mining ASIC to use a pool
fr: Configurer un ASIC de minage pour joindre une équipe
it: Configurazione di un ASIC di mining per utilizzare una pool
ru: Настройка ASIC для работы с пулом

source: Choosing a Mining Pool
fr: Choisir une équipe de minage
it: Scegli una Mining Pool
ru: Выбор майнинг-пула

source: To finish the configuration, you will need to choose a mining pool. A deep dive into the mining pool landscape is available `here <https://blog.dash.org/luxor-launches-dash-pps-mining-pool-daf493bce9d2>`__.
fr: Pour terminer la configuration, vous devez choisir une équipe de minage. Un examen approfondi du paysage de minage par équipe est disponible `ici <https://blog.dash.org/luxor-launches-dash-pps-mining-pool-daf493bce9d2>`__.
it: Per completare la configurazione, dovrai scegliere una mining pool. Un approfondimento sul panorama delle mining pool è disponibile `qui <https://blog.dash.org/luxor-launches-dash-pps-mining-pool-daf493bce9d2>`__.
ru: Для завершения настройки необходимо выбрать майнинг-пул. Глубокое погружение в мир майнинговых пулов доступно `здесь <https://blog.dash.org/luxor-launches-dash-pps-mining-pool-daf493bce9d2>`__.

source: To help with the security of the network and decentralization we recommend using P2Pool. To set up your own P2Pool server, follow the setup documentation available :ref:`here <p2pool>`. The code for p2pool-dash is `available on GitHub <https://github.com/dashpay/p2pool-dash>`__.
fr: Pour assurer la sécurité et la décentralisation du réseau, nous recommandons d'utiliser P2Pool. Pour installer votre propre serveur P2Pool, suivez la documentation disponible :ref:`ici <p2pool>`. Le code pour p2pool-dash est `disponible sur GitHub <https://github.com/dashpay/p2pool-dash>`__.
it: Per aiutare con la sicurezza della rete e la decentralizzazione consigliamo di utilizzare P2Pool. Per configurare il tuo server P2Pool, segui la documentazione di configurazione disponibile :ref:`qui <p2pool>`. Il codice per p2pool-dash è `disponibile su GitHub <https://github.com/dashpay/p2pool-dash>`__.
ru: Для обеспечения безопасности сети и децентрализации мы рекомендуем использовать P2Pool. Чтобы настроить собственный сервер P2Pool, следуйте документации по настройке, доступной :ref:`здесь <p2pool>`. Код p2pool-dash доступен на GitHub <https://github.com/dashpay/p2pool-dash>`__.

source: If you do not want to set up your own pool, you can check out a list of pools `here <https://chainz.cryptoid.info/dash/#!extraction>`__. In this guide we will set up a miner with `Luxor <https://mining.luxor.tech/>`__, a US-based mining pool that operates based on the pay-per-share (PPS) payment method. Other pools can be found `here <https://miningpoolstats.stream/dash>`__.
fr: Si vous ne voulez pas installer votre propre équipe, vous pouvez trouver une liste d'équipes `ici <https://chainz.cryptoid.info/dash/#!extraction>`__. Dans ce guide nous installerons un mineur avec `Luxor <https://mining.luxor.tech/>`__, une équipe de minage basée aux États-Unis qui fonctionne avec la méthode de paiement pay-per-share (PPS). D'autres équipes peuvent être trouvées `ici <https://miningpoolstats.stream/dash>`__.
it: Se non vuoi impostare il tuo pool, puoi controllare un elenco di pool `qui <https://chainz.cryptoid.info/dash/#!extraction>`__. In questa guida configureremo un miner con `Luxor <https://mining.luxor.tech/>`__, una mining pool con sede negli Stati Uniti che opera in base al metodo di pagamento pay-per-share (PPS). Altri pool possono essere trovati `qui <https://miningpoolstats.stream/dash>`__.
ru: Если вы не хотите создавать свой собственный пул, вы можете ознакомиться со списком пулов `здесь <https://chainz.cryptoid.info/dash/#!extraction>`__. В данном руководстве мы будем настраивать майнер на `Luxor <https://mining.luxor.tech/>`__, американском майнинговом пуле, работающем по методу оплаты за долю (PPS). Другие пулы можно найти `здесь <https://miningpoolstats.stream/dash>`__.

source: Completing Configuration
fr: Achever la configuration
it: Completamento della configurazione
ru: Окончание настройки

source: Once you have created a `user account <https://medium.com/luxor/meet-user-accounts-a0d56235c0e6>`__ with the mining pool, you will have all the information you need to complete the setup process.
fr: Une fois que vous avez créé un `compte utilisateur <https://medium.com/luxor/meet-user-accounts-a0d56235c0e6>`__ avec l'équipe de minage, vous disposerez de toutes les informations dont vous avez besoin pour achever la procédure d'installation.
it: Dopo aver creato un `account utente <https://medium.com/luxor/meet-user-accounts-a0d56235c0e6>`__ con la mining pool, avrai tutte le informazioni necessarie per completare il processo di configurazione.
ru: После создания учетной записи <https://medium.com/luxor/meet-user-accounts-a0d56235c0e6>`__ в майнинг-пуле вы будете располагать всей необходимой информацией для завершения процесса настройки.

source: Worker: ``[LuxorUsername].WorkerName`` Workername can be anything, but avoid using symbols or special characters as it may be invalid.
fr: Travailleur : ``[LuxorUsername].WorkerName`` Le nom de travailleur peut être ce que vous souhaitez, mais évitez d'utiliser des symboles ou des caractères spéciaux qui le rendraient invalide.
it: Lavoratore: ``[LuxorUsername].WorkerName`` Il nome del lavoratore può essere qualsiasi cosa, ma evita di utilizzare simboli o caratteri speciali poiché potrebbe non essere valido.
ru: Worker: ``[LuxorUsername].WorkerName`` Рабочее имя может быть любым, но избегайте использования символов или специальных знаков, так как оно может быть недействительным.

source: Password: ``123``
fr: Mot de passe : ``123``
ru: Пароль: ``123``

source: For the other nodes (Pool 2 and Pool 3), feel free to use any of the other region nodes or other pools, such as ``dash-eu.luxor.tech:5050``.
fr: Pour les autres nœuds (Équipe 2 et Équipe 3), utilisez librement tout autre nœud ou équipe, par exemple ``dash-eu.luxor.tech:5050``.
it: Per gli altri nodi (Pool 2 e Pool 3), sentiti libero di utilizzare uno qualsiasi dei nodi di altre regioni o altre pool, come ``dash-eu.luxor.tech:5050``.
ru: Для остальных узлов (Pool 2 и Pool 3) можно использовать любые узлы других регионов или другие пулы, например ``dash-eu.luxor.tech:5050``.

source: Once you have filled out the details, click **Save & Apply**. Setup is now complete.
fr: Une fois les détails renseignés, cliquez sur **Enregistrer & Appliquer**. La mise en place est désormais terminée.
it: Una volta inseriti i dettagli, fai clic su **Salva e applica**. La configurazione è ora completa.
ru: После заполнения данных нажмите кнопку **Сохранить и применить**. Настройка завершена.

source: Monitoring Results
fr: Surveiller les résultats
it: Risultati del monitoraggio
ru: Наблюдение результатов

source: It will take about 5 minutes for your workers to appear on the stats page. To find your user, simply go to Luxor, login to your account and navigate to the Workers tab. You should see something like this:
fr: Il faudra environ 5 minutes pour que vos travailleurs apparaissent sur la page de statistiques. Pour trouver votre utilisateur, allez simplement sur Luxor, connectez-vous à votre compte et naviguez jusqu'à l'onglet Travailleurs. Vous devriez voir quelque chose comme ceci :
it: Ci vorranno circa 5 minuti affinché i tuoi lavoratori appaiano nella pagina delle statistiche. Per trovare il tuo utente, vai semplicemente su Luxor, accedi al tuo account e vai alla scheda Lavoratori. Dovresti vedere qualcosa del genere:
ru: Для того чтобы ваши работники появились на странице статистики, потребуется около 5 минут. Чтобы найти своего пользователя, просто зайдите в Luxor, войдите в свой аккаунт и перейдите на вкладку "Рабочие". Вы должны увидеть примерно следующее:

source: Monitoring mining results with Luxor pool
fr: Surveiller les résultats de minage avec l'équipe Luxor
it: Monitoraggio dei risultati del mining con la pool Luxor
ru: Мониторинг результатов добычи с помощью бассейна Luxor

source: Note: For P2Pool, there is no central point to check balance. To learn more about P2Pool, see the :ref:`P2Pool documentation <p2pool>`.
fr: Note : dans P2Pool, il n'y pas de lieu central pour vérifier le solde. Pour en savoir plus sur P2Pool, voir la :ref:`documentation P2Pool <p2pool>`.
it: Nota: per P2Pool non esiste un punto centrale per verificare il saldo. Per saperne di più su P2Pool, consultare la :ref:`Documentazione P2Pool <p2pool>`.
ru: Примечание: Для P2Pool не существует центральной точки для проверки баланса. Более подробную информацию о P2Pool можно найти в :ref:`P2Pool documentation <p2pool>`.

source: Setting up the Dash Wallet
fr: Configurer le portefeuille Dash
it: Configurazione del portafoglio Dash
ru: Настройка кошелька Dash Wallet

source: The last step is to set up your Dash address where you will receive your miner payouts. To do this in the Dash Core wallet, see :ref:`here <dashcore-send-receive>`.
fr: La dernière étape est de configurer l'adresse Dash où vous recevrez vos paiements de minage. Pour faire ceci dans le portefeuille Dash Core, voir :ref:`ici <dashcore-send-receive>`.
it: L'ultimo passaggio è impostare il tuo indirizzo Dash dove riceverai i pagamenti del miner. Per farlo nel portafoglio Dash Core, vedi :ref:`qui <dashcore-send-receive>`.
ru: Последний шаг - настройка адреса Dash, на который будут поступать выплаты от майнеров. Как это сделать в кошельке Dash Core, смотрите :ref:`here <dashcore-send-receive>`.
