Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/mining/pools.po
Languages: fr, it, ru

source: Once you have your address, navigate to the Settings page in the top right-hand corner of the `Luxor <https://mining.luxor.tech/>`__ site after you have logged in. You can enter your address and set a custom payout threshold here.
fr: Une fois que vous avez votre adresse, allez sur la page Réglages dans le coin supérieur droit du site `Luxor <https://mining.luxor.tech/>`__ après vous être connecté. Vous pouvez y saisir votre adresse et définir un seuil de paiement personnalisé.
it: Una volta ottenuto il tuo indirizzo, vai alla pagina Impostazioni nell'angolo in alto a destra del sito `Luxor <https://mining.luxor.tech/>`__ dopo aver effettuato l'accesso. Puoi inserire il tuo indirizzo e impostare una soglia di pagamento personalizzata qui.
ru: Получив адрес, перейдите на страницу "Настройки", расположенную в правом верхнем углу сайта `Luxor <https://mining.luxor.tech/>`__ после входа в систему. Здесь вы можете ввести свой адрес и задать порог выплат.

source: Setting the payout threshold with Luxor pool
fr: Définir le seuil de paiement dans l'équipe Luxor
it: Impostazione della soglia di pagamento con la pool Luxor
ru: Установка порога выплат с помощью пула Luxor
