Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/index.po
Languages: es, ru

source: First Steps
es: Primeros Pasos
ru: Первые шаги

source: Users
es: Usuarios
ru: Пользователи

source: Network
es: Red
ru: Сеть

source: The Dash Documentation offers information and guides on Dash, the open source peer-to-peer cryptocurrency with a strong focus on the payments industry.
es: La Documentación Dash ofrece información y guía sobre Dash, la criptomoneda de código abierto punto-a-punto con un fuerte foco en la industria de pagos.
ru: Документация Dash содержит информацию и руководства по Dash, децентрализованной криптовалюте с открытым исходным кодом, особое внимание в которой уделяется индустрии платежей.

source: dash, cryptocurrency, blockchain, documentation, guide, masternodes, mining, wallets, merchants, governance, instantsend, coinjoin, privatesend, x11, instant, private, secure, digital cash
es: dash, criptomoneda, cadena de bloques, documentación, guía, masternodes, minería, billeteras, comercios, gobernanza, instantsend, coinjoin, privatesend, x11, instantáneo, privado, seguro, efectivo digital
ru: dash, криптовалюта, блокчейн, документация, руководство, мастерноды, майнинг, кошельки, продавцы, сервисы, управление, instantsend, coinjoin, privatesend, x11, мгновенность, приватность, безопасность, цифровая наличность

source: User Docs
es: Documentación para usuarios
ru: Документация для пользователей

source: Dash is an open source peer-to-peer cryptocurrency with a strong focus on the payments industry. Dash offers a form of money that is portable, inexpensive, divisible and fast. It can be spent securely both online and in person with only minimal transaction fees.
es: Dash es una criptomoneda de código abierto con una red de pares fuertemente enfocada en la industria de pagos. Dash ofrece una forma de dinero que es portable, de bajo coste, divisible y rápida. Puede gastarse de forma segura tanto en línea como en persona con bajísimas comisiones por transacción.
ru: Dash — открытая децентрализованная платёжная система в форме криптовалюты, ориентированная на индустрию платежей. Dash предлагает портативные, недорогие, делимые и быстрые деньги, которые можно безопасно тратить как онлайн, так и лично, с минимальными комиссиями за транзакции.

source: Features
es: Características
ru: Особенности

source: Based on the Bitcoin project, Dash aims to be the most user-friendly and scalable payments system in the world. In addition to Bitcoin's feature set, Dash currently also offers instant transactions (:ref:`instantsend`), private transactions (:ref:`coinjoin`) and operates a self-governing and self-funding model that enables the Dash network to pay individuals and businesses for work that adds value to the network. This :ref:`decentralized governance and budgeting system <governance>` makes it one of the first ever successful decentralized autonomous organizations (DAO).
es: Basado en el proyecto Bitcoin, Dash trata de ser el sistema de pagos más fácil de usar y escalable en el mundo. Además de las funcionalidades de Bitcoin, Dash actualmente también ofrece transacciones instantáneas (:ref:`instantsend`), transacciones privadas (:ref:`coinjoin`) y gestiona un modelo de autogobernanza y autofinanciación que permite a la red de Dash pagar a particulares y empresas por trabajo que añada valor a la red. Esta :ref:`gobernanza descentralizada y su sistema presupuestario <governance>` lo convierten en una de las primeras organizaciones autónomas descentralizadas exitosas.
ru: Dash, основанный на проекте Bitcoin, стремится стать самой удобной и масштабируемой платёжной системой в мире. Помимо функций Bitcoin, Dash в настоящее время предлагает мгновенные транзакции (:ref:`instantsend`), конфиденциальные транзакции (:ref:`coinjoin`) и использует модель самоуправления и самофинансирования, которая позволяет сети Dash выплачивать вознаграждения частным лицам и компаниям за работу, добавляющую ценность сети. Эта :ref:`децентрализованная система управления и бюджетирования <governance>` делает Dash одной из первых в истории успешных децентрализованных автономных организаций (ДАО).

source: Security
es: Seguridad
ru: Безопасность

source: If you are new to cryptocurrencies, the most important change to understand is that transactions occur directly between two parties without any central authority to facilitate the transaction. This also means that you are responsible for your own security - there is no bank or credit card company to reverse a transaction if your funds are stolen or lost. In this sense, it is similar to cash or gold, but cryptocurrency can be spent locally and internationally with equal ease, if you are confident you are sending funds to the right destination.
es: Si acabas de llegar al mundo de las criptomonedas, el cambio más importante que hay que entender es que las transacciones se llevan a cabo directamente entre dos partes sin ninguna autoridad central que facilite la transacción. Esto también significa que eres responsable de tu propia seguridad —no hay ningún banco o empresa de tarjetas de crédito para revertir una transacción si tus fondos son robados o se pierden—. En este sentido, es parecido al efectivo o el oro, pero las criptomonedas pueden gastarse local e internacionalmente con la misma facilidad, si estás seguro de que estás mandando los fondos al destinatario adecuado.
ru: Если вы новичок в криптовалюте, самое важное изменение, которое нужно понимать, заключается в том, что транзакции происходят напрямую между двумя сторонами без какого-либо центрального органа, обеспечивающего их проведение. Это также означает, что вы сами несёте ответственность за свою безопасность — нет ни банка, ни кредитной компании, которые могли бы отменить транзакцию в случае кражи или потери ваших средств. В этом смысле криптовалюта похожа на наличные или золото, но её можно тратить как локально, так и за рубежом с одинаковой лёгкостью, если вы уверены, что отправляете средства по назначению.

source: For these reasons, the Dash documentation has a strong focus on safety and understanding the concepts and features that drive the Dash ecosystem. The videos, links and documentation below can help you get started, or use the table of contents on the left to find a specific topic of interest.
es: Por estas razones, la documentación de Dash se centra mucho en la seguridad y en explicar los conceptos y funcionalidades que son el eje del ecosistema de Dash. Los vídeos, enlaces y documentación a continuación pueden ayudarte a comenzar, o usa la tabla de contenidos a la izquierda para encontrar un tema concreto que te interese.
ru: По этим причинам в документации Dash особое внимание уделяется безопасности и пониманию концепций и функций, лежащих в основе экосистемы Dash. Видео, ссылки и документация ниже помогут вам начать работу, а оглавление слева поможет найти интересующую вас тему.
