Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/developers/insight.po
Languages: de, es, fr, it, ru, zh_cn

source: The open-source Dash Insight REST API provides you with a convenient, powerful and simple way to read data from the Dash network and build your own services with it.
de: Die Open-Source Dash Insight REST API bietet einen benutzerfreundlichen, leistungsstarken und einfachen Weg, um Daten aus dem Dash-Netzwerk in die eigene Plattform zu integrieren.
es: La REST API Insight de fuente abierta te proporciona una forma conveniente, potente y sencilla de leer datos de la red de Dash y crear tus propios servicios con ella.
fr: L'API REST open source Dash Insight est un moyen simple, pratique et puissant de lire des données sur le réseau Dash et de bâtir vos propres services à partir d'elles.
it: L'API REST di Dash Insight open source ti offre un modo comodo, potente e semplice per leggere i dati dalla rete Dash e creare i tuoi servizi con essa.
ru: Dash Insight REST API c открытым кодом - это удобный, мощный и простой способ считывать данные из сети Dash и разрабатывать с его помощью свои собственные сервисы.
zh_cn: 开源Dash Insight REST API为你提供一个方便强大而简单的方式来从 Dash 网络读取数据和用它来建立你自己的服务。

source: dash, insight, API, REST, blockchain, explorer, JSON, HTTP, blocks, index, transactions
de: dash, insight, API, REST, blockchain, explorer, JSON, HTTP, blöcke, index, transaktionen
es: dash, insight, API, REST, cadena de bloques, explorador, JSON, HTTP, bloques, indice, transacciones
fr: dash, insight, API, REST, blockchain, explorateur, JSON, HTTP, blocs, index, transactions
it: dash, insight, API, REST, blockchain, explorer, JSON, HTTP, blocchi, indice, transazioni
ru: dash, insight, API, REST, блокчейн, обозреватель, JSON, HTTP, блоки, index, транзакции

source: Insight API Installation
es: Instalación de API Insight
fr: Installation de l'API Insight
it: Installazione API Insight
ru: Установка Insight API
zh_cn: Insight API 安装

source: The open-source Dash Insight REST API provides you with a convenient, powerful and simple way to read data from the Dash network and build your own services with it. Simple HTTP endpoints exist for all common operations on the Dash blockchain familiar from the Bitcore Insight API, as well as Dash-specific features such as InstantSend transactions, budget proposals, sporks and the masternode list. This documentation describes how to set up the `Dash Insight API <https://github.com/dashevo/insight-api>`__ server and (optionally) the `Dash Insight UI <https://github.com/dashevo/insight-ui>`__ block explorer.
de: Die Open-Source Dash Insight REST API bietet einen benutzerfreundlichen, leistungsstarken und einfachen Weg, um Daten aus dem Dash-Netzwerk in die eigene Plattform zu integrieren. Einfache HTTP-Endpunkte existieren, um auf alle gewöhnlichen Funktionen der Dash-Blockchain, die der Bitcore Insight API gleichen, sowie alle Dash-Sonderfunktionen zuzugreifen, wie InstantSend-Transaktionen, Budget Proposal, Sporks und die Masternode-Liste. Diese Dokumentation beschreibt das Aufsetzen eines `Dash Insight API <https://github.com/dashevo/insight-api>`__ Servers und (optional) eines `Dash Insight UI <https://github.com/dashevo/insight-ui>`__ Blockexplorers.
es: La REST API Insight de fuente abierta te proporciona una forma conveniente, potente y sencilla de leer datos de la red de Dash y crear tus propios servicios con ella. Puntos finales sencillos de HTTP existen para todas las operaciones comunes en la cadena de bloques familiar de Dash de la API de Bitcore Insight, así como las características especificas de Dash como transacciones de InstantSend, propuesta de financiamiento, sporks y la lista de masternode. Esta documentación describe como configurar la `API Insight de Dash <https://github.com/dashevo/insight-api>`__ servidor y (opcionalmente) el explorador de bloque de la `UI Insight de Dash <https://github.com/dashevo/insight-ui>`__.
fr: L'API open source REST Dash Insight est un moyen pratique, puissant et simple de lire des données du réseau Dash et de bâtir vos propres services avec elles. Des points de contact HTTP simples existent pour toutes les opérations les plus communes sur la blockchain Dash, à l'image de l'API Bitcore Insight, mais aussi pour les fonctionnalités propres à Dash telles que les transactions InstantSend, les propositions budgétaires, les sporks et la liste des masternodes. La présente documentation explique comment mettre en place le serveur de `l'API Dash Insight <https://github.com/dashevo/insight-api>`__ et (facultativement) `l'interface graphique Dash Insight <https://github.com/dashevo/insight-ui>`__ pour l'explorateur de blocs.
it: L'API REST di Dash Insight open source ti offre un modo comodo, potente e semplice per leggere i dati dalla rete Dash e creare i tuoi servizi con essa. Esistono endpoint HTTP semplici per tutte le operazioni comuni sulla blockchain di Dash originati dall'API Bitcore Insight, nonché funzionalità specifiche di Dash come transazioni InstantSend, proposte di budget, spork e l'elenco masternode. Questa documentazione descrive come configurare il server `Dash Insight API <https://github.com/dashevo/insight-api>`__ e (facoltativamente) l'interfaccia utente Dash Insight <https://github.com/dashevo/insight-ui>`__ block explorer.
ru: Dash Insight REST API c открытым кодом - это удобный, мощный и простой способ считывать данные из сети Dash и разрабатывать с его помощью свои собственные сервисы. Существующие для всех стандартных операций простые конечные точки HTTP в блокчейне Dash похожи на Bitcore Insight API, кроме того, есть особенные функции Dash, например, транзакции InstantSend, бюджетные предложения, спорки и список мастернод. В этой инструкции описывается, как установить `Dash Insight API <https://github.com/dashevo/insight-api>`__ сервер и (по желанию) `Dash Insight UI <https://github.com/dashevo/insight-ui>`__ обозреватель блоков.
zh_cn: 开源Dash Insight REST API为你提供一个方便强大而简单的方式来从 Dash 网络读取数据和用它来建立你自己的服务。简单 HTTP 端点为那些熟悉 Bitcore Insight API 的人提供所有在 Dash 链上的普通操作，还有 Dash 特性功能如即时支付，预算提案，sporks，主节点列表。此文档描述了如何搭建`Dash Insight API <https://github.com/dashevo/insight-api>`__服务器和（可选）`Dash Insight UI <https://github.com/dashevo/insight-ui>`__区块链浏览器。

source: A standard installation of Ubuntu Linux 20.04 LTS will be used as an environment for the server. We assume you are running as a user with sudo permissions. First update all packages and install some tools and dependencies::
fr: Une installation standard d'Ubuntu Linux 20.04 LTS sera utilisée comme environnement serveur. Nous supposons que votre utilisateur a les autorisations sudo. Tout d'abord, mettez à jour tous les paquets et installez quelques outils et dépendances :

source: Download and extract the latest version of Dash Core::
de: Lade die aktuelle Dash Core Version herunter und entpacke sie::
es: Descarga y extrae la ultima versión de Dash Core::
fr: Téléchargez et décompressez la version la plus récente de Dash Core :
it: Scarica ed estrai l'ultima versione di Dash Core:
ru: Скачайте и распакуйте последнюю версию Dash Core::
zh_cn: 下载并获取最新版本的 Dash Core：

source: Install `Dashcore Node <https://github.com/dashevo/dashcore-node>`_ and create your configuration::
de: Installiere `Dashcore Node <https://github.com/dashevo/dashcore-node>`_ und erstelle die Konfigurationen::
es: Instala `Nodo Dashcore <https://github.com/dashevo/dashcore-node>`_ y crea tu configuración::
fr: Installez `Dashcore Node <https://github.com/dashevo/dashcore-node>`_ et créez votre configuration :
it: Installa `Dashcore Node <https://github.com/dashevo/dashcore-node>` _ e crea la tua configurazione:
ru: Установите `Dashcore Node <https://github.com/dashevo/dashcore-node>`_ и создайте собственную конфигурацию::
zh_cn: 安装 `Dashcore Node <https://github.com/dashevo/dashcore-node>`_ 并创建你的配置：

source: Install the Insight API service and (optionally) Insight UI::
de: Installiere den Insight API-Dienst und die (optionale) Insight UI::
es: Instala los servicios de la API Insight y (opcionalmente) UI Insight::
fr: Installez le service Insight API et (facultativement) Insight UI :
it: Installa il servizio API Insight e (facoltativamente) l'interfaccia utente Insight:
ru: Установите сервис Insight API и (по желанию) Insight UI::
zh_cn: 安装 Insight API 服务和（可选）Insight UI：

source: Change paths in the configuration file as follows::
de: Ändere die Pfade der Konfiguration wie folgt::
es: Cambia las rutas en el archivo de configuración de la siguiente manera:
fr: Modifiez les chemins dans le fichier de configuration, comme suit :
it: Modifica i percorsi nel file di configurazione come qui di seguito:
ru: Измените пути в файле конфигурации следующим образом::
zh_cn: 改变配置文件中的路径如下：

source: Change the value of ``datadir`` to ``../../.dashcore``
fr: Définissez la valeur de ``datadir`` comme ``../../.dashcore``

source: Change the value of ``exec`` to ``../../dashcore-0.16.1/bin/dashd``
fr: Définissez la valeur de ``exec`` comme ``../../dashcore-0.16.1/bin/dashd``

source: **Optionally** change the value of ``network`` to ``testnet`` if you want to run Insight on testnet
de: **Optional** ändere den Wert von ``network`` zu ``testnet``, wenn du Insight über das Testnet laufen lassen willst
es: **Opcionalmente** cambia el valor de ``network`` a ``testnet`` si quieres ejecutar Insight en testnet
fr: **Facultatif** : changez la valeur de ``network`` sur ``testnet`` si vous souhaitez faire tourner Insight sur le réseau de test.
it: ** Facoltativamente ** modifica il valore di `` network`` in `` testnet '' se desideri eseguire Insight su testnet
ru: **При необходимости** измените значение ``network`` на ``testnet``, если хотите выполнить запуск Insight в тестовой сети
zh_cn: **可选**将”network“的值改为”testnet“如果你想在测试网络上运行 Insight 的话

source: Run it::
de: Führe aus::
es: Ejecutalo::
fr: Lancez-le :
it: Eseguilo:
ru: Запустите приложение::
zh_cn: 运行：

source: Your Insight API node will start up and begin to sync. Progress will be displayed on stdout. Once sync is complete, the `API endpoints listed in the documentation <https://github.com/dashevo/insight-api#api-http-endpoints>`_ will be available at::
de: Deine Insight API Node wird mit der Synchronisierung beginnen. Der Fortschritt wird über stdout ausgegeben. Nachdem die Synchronisierung abgeschlossen wurde, können die `API-Endpunkte, die in der Dokumentation aufgeführt werden <https://github.com/dashevo/insight-api#api-http-endpoints>`_, hier angezeigt werden::
es: Tu nodo API Insight arrancara y comenzara a sincronizar. EL progreso se mostrara en stdout. Una vez la sincronización este completa, los `puntos finales de la API listados en la documentación estaran disponibles en <https://github.com/dashevo/insight-api#api-http-endpoints>`_::
fr: Votre nœud API Insight démarrera et commencera à se synchroniser. L'état sera affiché dans stdout. Une fois la synchronisation terminée, les `points de contact API répertoriés dans la documentation <https://github.com/dashevo/insight-api#api-http-endpoints>`_ seront disponibles :
it: Il tuo nodo API Insight verrà avviato e inizierà la sincronizzazione. Lo stato di avanzamento verrà visualizzato su stdout. Una volta completata la sincronizzazione, gli endpoint API elencati nella documentazione <https://github.com/dashevo/insight-api#api-http-endpoints> `_ saranno disponibili all'indirizzo :
ru: Ваша Insight API нода запустится и начнёт синхронизацию. Прогресс будет отображаться в stdout. Когда синхронизация завершится, `конечные точки API, описанные в документации <https://github.com/dashevo/insight-api#api-http-endpoints>`_ будут доступны тут::
zh_cn: 你的 Insight API 节点将启动并开始同步。进度将显示在标准输出。一旦同步完成，可查询 `API endpoints listed in the documentation <https://github.com/dashevo/insight-api#api-http-endpoints>`_ ：

source: The Insight UI block explorer will be available at::
de: Der Insight UI Blockexplorer ist verfügbar unter::
es: La UI Insight del explorador de bloque estará disponible en::
fr: L'explorateur de blocs Insight UI sera disponible :
it: Il block explorer dell'interfaccia utente di Insight sarà disponibile all'indirizzo:
ru: Обозреватель блоков Insight UI будет доступен тут::
zh_cn: Insight UI 区块浏览器可在：

source: A standard installation of Ubuntu Linux 18.04 LTS will be used as an environment for the server. We assume you are running as a user with sudo permissions. First update all packages and install some tools and dependencies::
de: Eine Standardinstallation von Ubuntu Linux 18.04 LTS wird als Serverumgebung verwendet. Wir setzen voraus, dass der Nutzer mit Sudo-Rechten operiert. Zuerst müssen alle Pakete upgedatet und verschiedene Tools und Dependencies installiert werden::
es: Una instalación de Linux Ubuntu 18.04 LTS sera utilizada como ambiente para los servidores. Asumimos que esta ejecutando como usuarios con permisos sudo. Primero actualice todos los paquetes e instale algunas herramientas y dependencias::
it: Verrà utilizzata un'installazione standard di Ubuntu Linux 18.04 LTS come ambiente per il server. Supponiamo che tu stia eseguendo come utente con autorizzazioni sudo. Per prima cosa aggiorna tutti i pacchetti e installa alcuni strumenti e dipendenze:
ru: В качестве рабочей среды для этого сервера будет использоваться стандартная установка Ubuntu Linux 18.04 LTS. Мы исходим из того, что вы работаете пользователем с sudo допусками. Для начала, обновите все пакеты и установите некоторые инструменты и зависимые приложения::
zh_cn: 一个在Ubuntu Linux 18.04 LTS标准安装将作为服务器环境。我们假使你使用一个具有 sudo 权限的账号。首先升级所有包和安装一些工具及依赖：

source: Change the value of ``datadir`` to ``../.dashcore``
de: Ändere den Wert von ``datadir`` zu ``../.dashcore``
es: Cambia el valor de ``datadir`` a ``../.dashcore``
it: Cambia il valore di `` datadir '' in `` ../. Dashcore ''
ru: Измените значение ``datadir`` на ``../.dashcore``
zh_cn: 将“datadir”的值改为”../.dashcore“

source: Change the value of ``exec`` to ``../dashcore-0.16.0/bin/dashd``
it: Cambia il valore di ``exec`` in ``../dashcore-0.16.0/bin/dashd``
