Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/developers/integration.po
Languages: fr

source: Features: Blockchain queries, Event Notifications, Transaction Broadcast, Payment Processing, etc.
fr: Fonctionnalités : requêtes sur blockchain, notifications d'événement, diffusion de transaction, processeur de paiement, etc.

source: Pricing Model: Free trial, pay per API call
fr: Grille tarifaire : essai gratuit, paiement par appel API

source: Сryptocurrency wallet, merchant & API provider. Blockmove is a simple and easy way to start accepting payments in cryptocurrency.
fr: Portefeuille cryptomonétaire, services pour vendeurs et fournisseur d'API. Blockmove est une manière simple et rapide d'accepter des paiements en cryptomonnaie.

source: Features: Non-custodial wallet, HD Wallet, High anonymity, Low fees. Private keys are not stored and are available only to the user.
fr: Fonctionnalités : portefeuilles sans garde, portefeuille HD, anonymat élevé, frais bas. Les clés privées ne sont pas stockées et ne sont accessibles que par l'utilisateur.

source: Pricing Model: API - 0.3% for withdrawal transactions. Merchant - 1 year free, then $49/month
fr: Gamme tarifaire — API : 0,3% pour les transactions de retrait ; vendeurs : première année gratuite, puis 49 dollars par mois.

source: NOWNodes provides simple, fast, and secure RPC access to Dash full nodes. The low latency and high performance is of great use to researchers and businesses such as crypto miners or hardware wallet providers.
fr: NOWNodes fournit un accès RPC simple, rapide et sûr à des nœuds complets Dash. La latence très basse et la haute performance sont très utiles aux chercheurs et aux entreprises telles que les mineurs de cryptomonnaie ou les fournisseurs de portefeuille matériel.

source: Features: All Dash RPC commands
fr: Fonctionnalités : toutes les commandes RPC Dash.

source: Pricing Model: Free up to 20k requests, Pricing tiers
fr: Gamme tarifaire : gratuit jusqu'à 20 000 requêtes, puis seuils tarifaires.

source: The GoCoin platform makes taking Dash as easy as installing a plugin. Payment processing is already implemented for every major shopping platform. GoCoin is focused on helping merchants in privacy-related niches and specific industries, and handles all transaction risk for all payments from your customers.
fr: La plateforme GoCoin rend l'acceptation de Dash aussi simple que d'installer un plug-in. Le processeur de paiement est déjà implémenté pour chaque plateforme commerciale majeure. GoCoin se dédie particulièrement à aider les vendeurs de secteurs nécessitant une grande confidentialité et ceux de secteurs spécifiques. GoCoin assume tous les risques de transaction de tous les paiements de vos clients.

source: Features: Invoicing, Exchange Rates, WebHook Callbacks. GoCoin holds Private Keys on their server allowing the merchant to withdraw funds in Cryptocurrency or convert to Fiat.
fr: Fonctionnalités : facturation, taux de change, appels WebHook. GoCoin détient les clés privées sur son serveur, permettant au vendeur de retirer les fonds en cryptomonnaie ou de les convertir en monnaie fiduciaire.

source: Integrations: WooCommerce, Magento, Prestashop, VirtueMart, ZenCart, OpenCart, OSCommerce, UberCart, nopCommerce, WHMCS, NATS4, Shopify.
fr: Intégrations : WooCommerce, Magento, Prestashop, VirtueMart, ZenCart, OpenCart, OSCommerce, UberCart, nopCommerce, WHMCS, NATS4, Shopify.

source: Pricing Model: 1% Processing Fee (https://gocoin.com/fees)
fr: Grille tarifaire : 1% de frais de traitement (https://gocoin.com/fees)

source: CoinPayments is an integrated payment gateway for cryptocurrencies such as Dash. Shopping cart plugins are available for all popular webcarts used today. CoinPayments can help you set up a new checkout, or integrate with your pre-existing checkout.
fr: CoinPayments est une passerelle intégrée de paiement pour les cryptomonnaies telles que Dash. Des plug-ins de panier d'achat sont disponibles pour toutes les applications de commerce populaires. CoinPayments peut vous aider à installer un nouveau système de caisse, ou s'intégrer à votre système existant.

source: Features: Invoicing, Exchange Rates, WebHook Callbacks. CoinPayments holds Private Keys on their server allowing merchant to withdraw funds in Cryptocurrency or convert to Fiat.
fr: Fonctionnalités : facturation, taux de change, appels WebHook. CoinPayments détient les clés privées sur son serveur, permettant au vendeur de retirer les fonds en cryptomonnaie ou de les convertir en monnaie fiduciaire.

source: Integrations: aMember Pro, Arastta, Blesta, BoxBilling, Drupal, Ecwid, Hikashop, Magento, OpenCart, OSCommerce, PrestaShop, Tomato Cart, WooCommerce, Ubercart, XCart, ZenCart
fr: Intégrations : aMember Pro, Arastta, Blesta, BoxBilling, Drupal, Ecwid, Hikashop, Magento, OpenCart, OSCommerce, PrestaShop, Tomato Cart, WooCommerce, Ubercart, XCart, ZenCart

source: Pricing Model: 0.5% Processing Fee (https://www.coinpayments.net/help-fees)
fr: Grille tarifaire : 0,5% de frais de traitement (https://www.coinpayments.net/help-fees)

source: SDK Resources
fr: Ressources SDK

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-SDK.pdf>`__.
fr: Cette documentation est également disponible au `format PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-SDK.pdf>`__.

source: SDKs (Software Development Kits) are used to accelerate the design and development of a product for the Dash Network. These resources can either be used to interface with an API provider or for the creation of standalone applications by forming transactions and/or performing various wallet functions.
fr: Des SDK (kits de développement logiciel) sont utilisés pour accélérer la conception et le développement d'un produit destiné au réseau Dash. Ces ressources peuvent être utilisées soit pour communiquer avec un fournisseur d'API, soit pour la création d'applications autonomes, par formation de transactions et/ou exécution de divers services de portefeuille.

source: Dash Developer Guide
fr: Guide développeur Dash

source: The Dash Developer Portal aims to provide the information you need to understand Dash and start building Dash-based applications. To make the best use of this documentation, you may want to install the current version of Dash Core and Dash Platform, either from source, from a pre-compiled executable or from Docker Hub.
fr: Le guide développeur Dash a pour but de fournir l'information dont vous avez besoin pour comprendre Dash et commencer à créer des applications basées sur Dash. Pour utiliser au mieux cette documentation, il vous est conseillé d'installer la version la plus récente du portefeuille logiciel Dash Core et de Dash Platform, soit depuis le code source, soit en tant qu'exécutable pré-compilé, soit depuis Docker Hub.

source: Dashcore is a fork of Bitcore and operates as a full Dash node — your apps run directly on the peer-to-peer network. For wallet application development, additional indexes have been added into Dash for querying address balances, transaction history, and unspent outputs.
fr: Dash Core est un "fork" de Bitcoin et tourne en tant que nœud complet Dash — vos applications tournent directement sur le réseau pair à pair. Pour le développement d'applications portefeuille, des index supplémentaires ont été ajoutés dans Dash, permettant de demander les soldes d'adresses, les historiques de transactions et les sorties non dépensées.

source: Platform: NodeJS / Javascript
fr: Plateforme : NodeJS / Javascript

source: Repository lib: https://github.com/dashevo/dashcore-lib
fr: Bibliothèque de dépôt : https://github.com/dashevo/dashcore-lib

source: Repository node: https://github.com/dashevo/dashcore-node
fr: Nœud de dépôt : https://github.com/dashevo/dashcore-node

source: See also: `Insight API <https://github.com/dashevo/insight-api>`__
fr: Voir aussi : `API Insight <https://github.com/dashevo/insight-api>`__

source: DashJS allows you to transact on L1 or fetch/register documents on L2 within a single library, including management and signing of your documents.
fr: DashJS vous permet d'opérer des transactions sur L1 ou d'obtenir/d'enregistrer des documents sur L2 depuis une seule et unique bibliothèque, incluant la gestion et la signature de vos documents.

source: Bitcoin-PHP is an implementation of Bitcoin with support for Dash using mostly pure PHP.
fr: Bitcoin-PHP est une implémentation de Bitcoin compatible avec Dash, conçue presque exclusivement en PHP.

source: Platform: PHP
fr: Plateforme : PHP

source: Repository: https://github.com/snogcel/bitcoin-php
fr: Dépôt logiciel : https://github.com/snogcel/bitcoin-php

source: PyCoin is an implementation of a bunch of utility routines that may be useful when dealing with Bitcoin and Dash. It has been tested with Python 2.7, 3.6 and 3.7.
fr: PyCoin est l'implémentation de toute une série de routines utilitaires, qui peuvent être utiles pour manipuler Bitcoin ou Dash. Elle a été testée avec Python 2.7, 3.6 et 3.7.

source: Platform: Python
fr: Plateforme : Python

source: Repository: https://github.com/DeltaEngine/pycoin
fr: Dépôt logiciel : https://github.com/DeltaEngine/pycoin

source: See also: `JSON-RPC Utilities <https://github.com/DeltaEngine/python-dashrpc>`__
fr: Voir aussi : `Utilitaires JSON-RPC <https://github.com/DeltaEngine/python-dashrpc>`__

source: DashJ is a library for working with the Dash protocol. It can maintain a wallet, send/receive transactions (including InstantSend) without needing a local copy of Dash Core, and has many other advanced features. It's implemented in Java but can be used from any JVM compatible language: examples in Python and JavaScript are included.
fr: DashJ est une bibliothèque permettant de travailler avec le protocole Dash. Elle peut gérer un portefeuille, envoyer ou recevoir des transactions (y compris InstantSend) sans besoin de disposer d'une copie locale de Dash Core, et a beaucoup d'autres fonctions avancées. Elle est conçue en Java mais peut être utilisée depuis tout langage compatible JVM : des exemples en Python et JavaScript sont inclus.

source: Platform: Java
fr: Plateforme : Java

source: Example application: https://github.com/tomasz-ludek/pocket-of-dash
fr: Application d'exemple : https://github.com/tomasz-ludek/pocket-of-dash

source: Dash-Sync is an Objective-C Dash blockchain framework for iOS. It implements all most relevant Bitcoin Improvement Proposals (BIPs) and Dash Improvement Proposals (DIPs).
fr: Dash-Sync est une architecture de la blockchain Dash pour iOS, en Objective-C. Elle implémente les propositions d'améliorations de Bitcoin (BIP) les plus pertinentes, ainsi que les propositions d'amélioration de Dash (DIP).

source: Platform: iOS
fr: Plateforme : iOS

source: Repository: https://github.com/dashevo/dashsync-iOS
fr: Dépôt logiciel : https://github.com/dashevo/dashsync-iOS

source: NBitcoin is the most complete Bitcoin library for the .NET platform, and has been patched to include support for Dash. It implements all most relevant Bitcoin Improvement Proposals (BIPs) and Dash Improvement Proposals (DIPs). It also provides low level access to Dash primitives so you can easily build your application on top of it.
fr: NBitcoin est la bibliothèque Bitcoin la plus complète pour la plateforme .NET, et elle a été modifiée pour devenir compatible avec Dash. Elle implémente les propositions d'amélioration de Bitcoin (BIP) et celles de Dash (DIP) les plus pertinentes. Elle permet aussi un accès bas niveau aux composants de Dash, pour vous permettre de bâtir vos applications au-dessus.

source: Platform: .NET
fr: Plateforme : .NET

source: Repository: https://github.com/MetacoSA/NBitcoin
fr: Dépôt : https://github.com/MetacoSA/NBitcoin

source: See also: `JSON-RPC Utilities <https://github.com/cryptean/bitcoinlib>`__
fr: Voir aussi : `Utilitaires JSON-RPC <https://github.com/cryptean/bitcoinlib>`__

source: BlockCypher also offers client SDKs.
fr: BlockCypher propose aussi des SDK client.

source: Platform: Ruby, Python, Java, PHP, Go, NodeJS
fr: Plateforme : Ruby, Python, Java, PHP, Go, NodeJS

source: Repositories: https://www.blockcypher.com/dev/dash/#blockcypher-supported-language-sdks
fr: Dépôts : https://www.blockcypher.com/dev/dash/#blockcypher-supported-language-sdks

source: Platform: JavaScript, PHP, Java, Ruby, .NET, Python
fr: Plateforme : JavaScript, PHP, Java, Ruby, .NET, Python

source: Repositories: https://gocoin.com/docs
fr: Dépôts : https://gocoin.com/docs

source: Vending Machines
fr: Distributeurs automatiques

source: Community member moocowmoo has released code to help merchants build their own vending machine and set it up to receive Dash InstantSend payments. The Dashvend software can also be used to create any sort of payment system, including point-of-sale systems, that can accept InstantSend payments.
fr: Moocowmoo, membre de la communauté, a publié un code pour aider les vendeurs à concevoir leur propre distributeur automatique et à leur permettre d'y accepter les paiements InstantSend Dash. Le logiciel Dashvend peut aussi être utilisé pour créer toutes sortes de systèmes de paiement, y compris des systèmes sur point de vente, compatibles avec les paiements InstantSend.

source: `Open Source Code <https://github.com/moocowmoo/dashvend>`_
fr: `Code open source <https://github.com/moocowmoo/dashvend>`_

source: `Demonstration website <http://code.dashndrink.com>`_
fr: `Site web de démonstration <http://code.dashndrink.com>`_

source: `Demonstration video <https://www.youtube.com/watch?v=SX-3kwbam0o>`_
fr: `Vidéo de démonstration <https://www.youtube.com/watch?v=SX-3kwbam0o>`_

source: Price Tickers
fr: Afficheurs de cours

source: Similar widgets with different designs are available from `CoinLib <https://coinlib.io/widgets>`_, `WorldCoinIndex <https://www.worldcoinindex.com/Widget>`_ and `Cryptonator <https://www.cryptonator.com/widget>`_, while an API providing similar information is available from `DashCentral <https://www.dashcentral.org/about/api>`_.
fr: Des widgets similaires avec des apparences différentes sont disponibles sur `CoinLib <https://coinlib.io/widgets>`_, `WorldCoinIndex <https://www.worldcoinindex.com/Widget>`_ et `Cryptonator <https://www.cryptonator.com/widget>`_, tandis qu'une API fournissant des informations analogues est disponible sur `DashCentral <https://www.dashcentral.org/about/api>`_.

source: Many wallets are capable of generating QR codes which can be scanned to simplify entry of the Dash address. Printing these codes or posting the on your website makes it easy to receive payment and tips in Dash, both online and offline.
fr: Beaucoup de portefeuilles logiciels peuvent générer des QR-codes destinés à être scannés, pour simplifier la saisie d'une adresse Dash. Imprimer ces codes ou les publier sur votre site web facilite la réception de paiements ou de dons en dashs, à la fois en ligne ou hors ligne.

source: In Dash Core, go to the **Receive** tab, generate an address if necessary, and double-click it to display a QR code. Right click on the QR code and select **Save Image** to save a PNG file.
fr: Dans le portefeuille logiciel Dash Core, allez sur l'onglet **Recevoir**, générez si nécessaire une adresse et double-cliquez-la pour afficher un QR-code. Faites un clic-droit sur le QR-code et choisissez **Enregistrer l'image** pour l'enregistrer comme fichier PNG.

source: In Dash for Android, tap **Request Coins** and then tap the QR code to display a larger image. You can screenshot this to save an image.
fr: Dans le portefeuille logiciel Dash pour Android, touchez **Demander un paiement** puis touchez le QR-code pour en afficher une version plus grande. Vous pouvez en faire une capture d'écran pour la conserver.

source: In Dash for iOS, swipe to the left to display the **Receive Dash** screen. A QR code and address will appear. You can screenshot this to save an image.
fr: Dans le portefeuille logiciel Dash pour iOS, balayez vers la gauche pour accéder à l'écran **Recevoir**. Un QR-code et une adresse seront affichés. Vous pouvez en faire une capture d'écran pour le conserver.

source: To generate a QR code from any Dash address, visit `CWA QR Code Generator <https://cwaqrgen.com/dash>`_ and simply paste your Dash address to generate an image.
fr: Pour générer un QR-code depuis n'importe quelle adresse Dash, allez sur le `générateur de QR-code CWA <https://cwaqrgen.com/dash>`_ et collez simplement votre adresse Dash pour générer une image.
