Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/developers/integration.po
Languages: fr

source: Technical guides for merchants using Dash. API and SDK resources.
fr: Guides techniques pour les vendeurs acceptant Dash. Ressources API et SDK.

source: dash, merchants, payment processor, API, SDK, insight, blockcypher, gocoin, instantsend, python, .NET, java, javascript, nodejs, php, objective-c, vending machines
fr: dash, vendeurs, processeur de paiement, API, SDK, insight, blockcypher, gocoin, instantsend, python, .NET, java, javascript, nodejs, php, objective-c, distributeurs automatiques

source: Integration Overview
fr: Généralités sur l'intégration

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_v0.13_IntegrationOverview.pdf>`__.
fr: Cette documentation est aussi disponible au `format PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_v0.13_IntegrationOverview.pdf>`__.

source: `Dash Core <https://github.com/dashpay/dash>`__ is a “fork” of `Bitcoin Core <https://github.com/bitcoin/bitcoin>`__ and shares many common functionalities. Key differences relate to existing JSON-RPC commands which have been customized to support unique functionalities such as InstantSend.
fr: `Dash Core <https://github.com/dashpay/dash>`__ est un “fork" de `Bitcoin Core <https://github.com/bitcoin/bitcoin>`__ et partage avec lui beaucoup de fonctionnalités. Les différences principales sont relatives aux commandes JSON-RPC, qui ont été personnalisées pour être compatibles avec des fonctionnalités uniques à Dash telles qu'InstantSend.

source: **General Information:** Dash is a “Proof of Work” network and is similar to Bitcoin.
fr: **Information générale :** Dash est un réseau à preuve de travail (Proof of Work) et il est similaire à Bitcoin.

source: Block Time: ~2.6 Minutes per Block
fr: Durée de bloc : environ 2,6 minutes par bloc

source: Github Source: https://github.com/dashpay/dash
fr: Code source GitHub : https://github.com/dashpay/dash

source: Latest Release: https://github.com/dashpay/dash/releases
fr: Version la plus récente : https://github.com/dashpay/dash/releases

source: **JSON-RPC Interface:** The majority of commands are unchanged from Bitcoin making integration into existing systems relatively straightforward. Note that the following commands have been modified to support InstantSend:
fr: **Interface JSON-RPC :** la majorité des commandes JSON-RPC de Bitcoin sont inchangées, rendant assez simple l'intégration dans des systèmes existants. Veuillez noter que les commandes suivantes ont été modifiées pour être compatibles avec InstantSend :

source: **Block Hashing Algorithm:** Dash uses the “X11” algorithm in place of SHA256 used in Bitcoin. It’s important to note, however, that this only affects the hashing of the Block itself. All other internals utilize SHA256 hashes (transactions, merkle root, etc) which allows for most existing libraries to work in the Dash ecosystem.
fr: **Algorithme de hachage de bloc :** Dash utilise l'algorithme "X11" à la place de SHA256 qu'utilise Bitcoin. Il est cependant important de noter que cela ne concerne que le hachage du bloc lui-même. Tous les autres composants internes utilisent des empreintes SHA256 (transactions, arbre Merkle, etc.), ce qui permet à la plupart des bibliothèques déjà existantes de fonctionner dans l'écosystème Dash.

source: **Special Transactions:** Dash Core v0.13.x introduces the concept of “Special Transactions”. Please see the `Transaction Type Integration Guide <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__ for more information.
fr: **Transactions spéciales :** Dash Core v0.13.x introduit la notion de "transactions spéciales". Veuillez vous référer au `Guide d'intégration des types de transaction <https://github.com/dashpay/docs/raw/master/binary/merchants/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__ pour obtenir plus d'informations.

source: Special Transactions
fr: Transactions spéciales

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__.
fr: Cette documentation est également disponible au `format PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__.

source: Dash 0.13.0 and higher implement `DIP002 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, which form a basis for new transaction types that provide on-chain metadata to assist various consensus mechanisms. The following special transaction types exist:
fr: Dash, dans sa version 0.13.0 et ultérieure, implémente les `transactions spéciales DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, qui forment la base de nouveaux types de transactions fournissant des métadonnées sur chaîne, pour rendre possibles différents mécanismes de consensus. Les types de transactions spéciales sont les suivants :

source: Release
fr: Publication

source: Payload Size
fr: Volume de charge

source: Payload
fr: Charge

source: Payload JSON
fr: Charge JSON

source: Transaction Purpose
fr: But de la transaction

source: n/a
fr: n/d

source: Standard Transaction
fr: Transaction standard

source: `Masternode Registration <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-pro-reg-tx>`__
fr: `Enregistrement de masternode <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-pro-reg-tx>`__

source: `Update Masternode Service <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-pro-up-serv-tx>`__
fr: `Mise à jour du service de masternode <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-pro-up-serv-tx>`__

source: `Update Masternode Operator <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-pro-up-reg-tx>`__
fr: `Mise à jour de l'opérateur de masternode <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-pro-up-reg-tx>`__

source: `Masternode Revocation <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-pro-up-rev-tx>`__
fr: `Révocation de masternode <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-pro-up-rev-tx>`__

source: `Masternode List Merkle Proof <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-cb-tx>`__
fr: `Preuve Merkel de la liste de masternodes <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-cb-tx>`__

source: `Quorum Commitment <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-qc-tx>`__
fr: `Engagement de quorum <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions#section-qc-tx>`__

source: Integration notes:
fr: Notes sur l'intégration :

source: `DIP002 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ are a foundational component of Dash Core v0.13.0 and introduce a new Transaction Version and related “Payload” to the network.
fr: Les `transactions spéciales DIP002 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ sont un composant de base de Dash Core version 0.13.0 et inaugurent pour le réseau une nouvelle version de transaction et sa “charge" liée.

source: Integrated Systems must be able to `serialize and deserialize <https://github.com/dashpay/dips/blob/master/dip-0002.md#serialization-hashing-and-signing>`__ these new Transaction Types in order to accurately encode and decode Raw Transaction data.
fr: Les systèmes intégrés doivent pouvoir `sérialiser et désérialiser <https://github.com/dashpay/dips/blob/master/dip-0002.md#serialization-hashing-and-signing>`__ ces nouveaux types de transactions, afin d'encoder et de décoder correctement les données brutes de transaction.

source: From a `backwards compatibility <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__ perspective, the 4 byte (32-bit) ``version`` field included in Legacy Transactions has been split into two fields: ``version`` and ``type`` (each consisting of 2 bytes).
fr: Du point de vue de la `rétro-compatibilité <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__, le champ 4 octets (32 bits) ``version`` inclus dans les transactions antérieures a été divisé en deux champs : ``version`` et ``type`` (chacun de 2 octets).

source: Refer to the `Special Transactions <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions>`__ section of the dash developer reference for additional detail on these data types, e.g. <variable int>.
fr: Veuillez consulter la section `Transactions spéciales <https://dashcore.readme.io/docs/core-ref-transactions-special-transactions>`__ du guide de référence des développeurs Dash pour obtenir plus de détail sur ces types de données, par ex. <variable int>.

source: See the `v0.13.0 transaction types integration documentation (PDF) <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__ for worked examples of each transaction type.
fr: Veuillez vous référer au `Guide d'intégration des types de transaction <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__ pour obtenir des exemples fonctionnels de chaque type de transaction.

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_v0.14_LLMQ_InstantSend.pdf>`__.
fr: Cette documentation est aussi disponible au `format PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Dash_v0.14_LLMQ_InstantSend.pdf>`__.

source: InstantSend is a feature provided by the Dash network that allows for zero-confirmation transactions to be safely accepted and re-spent. The network attempts to lock the inputs of every valid transaction when it is broadcast to the network. Every secured transaction is included in a following block in accordance with standard blockchain principles.
fr: InstantSend est une fonctionnalité fournie par le réseau Dash qui permet aux transactions à 0 confirmation d'être acceptées et aussitôt dépensées à nouveau, en toute sécurité. Le réseau tâche de verrouiller les entrées de chaque transaction valide lorsqu'elle est diffusée au réseau. Chaque transaction sécurisée est incluse dans un bloc suivant, conformément aux principes standard de la blockchain.

source: InstantSend is enabled by the Masternode Network which comprises approximately 5,000 masternode servers. These nodes are differentiated from standard nodes by having proven ownership of 1,000 Dash, making the network `highly resistant to Sybil attacks <https://en.wikipedia.org/wiki/Sybil_attack>`__. Masternodes form `Long-Living Masternode Quorums (LLMQs) <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, which are responsible for providing near instant certainty to the transaction participants that the transaction inputs cannot be respent, and that the transaction will be included in a following block instead of a conflicting transaction.
fr: InstantSend est rendu possible par le réseau des masternodes, qui comprend environ 5000 serveurs. Ces nœuds se différencient des nœuds standard en prouvant qu'ils possèdent 1000 dashs, ce qui rend le réseau `hautement résistant aux attaques Sybil <https://fr.wikipedia.org/wiki/Attaque_Sybil>`__. Les masternodes forment des `quorums de masternode de longue durée (Long-Living Masternode Quorums, LLMQ) <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__ dont la mission est de garantir presque instantanément aux participants de la transaction que ses entrées ne peuvent pas être dépensées à nouveau, et que la transaction sera incluse dans un bloc ultérieur, sans pouvoir faire l'objet d'une contestation.

source: This concept works as an extension to Nakamoto Consensus. InstantSend enables transacted funds to be immediately and securely respent by the recipient, even before the transaction is included in a block.
fr: Ce concept constitue une extension du consensus Nakamoto. InstantSend permet aux fonds de la transaction d'être immédiatement retransmis par le destinataire en toute sécurité, avant même que la transaction ne soit incluse dans un bloc.

source: Receiving InstantSend Transactions
fr: Réception de transactions InstantSend

source: Receiving an InstantSend Transaction introduces two requirements:
fr: Recevoir une transaction InstantSend suppose deux obligations :

source: The ability to determine the “InstantSend Status” of a given transaction.
fr: La capacité à déterminer l'état InstantSend d'une transaction donnée.

source: The ability to adjust “Confirmation Status” independently of block confirmation.
fr: La capacité à ajuster l'état de confirmation indépendamment de la confirmation de bloc.

source: InstantSend Status is typically determined through direct connection with the dash daemon, `ZMQ notification <https://github.com/dashpay/dash/blob/master/doc/instantsend.md#zmq>`__, or through the usage of an external wallet notification script.
fr: L'état InstantSend est typiquement déterminé par une connexion directe au "daemon" Dash, `ZMQ notification <https://github.com/dashpay/dash/blob/master/doc/instantsend.md#zmq>`__, ou bien par l'utilisation du script de notification d'un portefeuille externe.

source: **Direct Connection:** InstantSend Status can be identified through direct connection with the Dash daemon using JSON-RPC protocol. The “instantlock” attribute of the JSON response reflects the status of the transaction and is included in the following commands:
fr: **Connexion directe :** l'état InstantSend peut être identifié par une connexion directe au "daemon" Dash au moyen du protocole JSON-RPC. L'attribut "instantlock" de la réponse JSON reflète l'état de la transaction et il est inclus dans les commandes suivantes :

source: **ZMQ Notification:** Whenever a transaction enters the mempool and whenever a transaction is locked in the mempool, ZMQ notifications can be broadcast by the node. A list of possible ZMQ notifications can be found `here <https://github.com/dashpay/dash/blob/master/doc/zmq.md#usage>`__.
fr: **Notification ZMQ :** dès qu'une transaction est incluse ou verrouillée dans le tampon mémoire, les notifications ZMQ peuvent être diffusées par le nœud. Une liste des notifications ZMQ possibles peut être consultée `ici <https://github.com/dashpay/dash/blob/master/doc/zmq.md#usage>`__.

source: The following notifications are relevant for recognizing transactions and their corresponding instantlocks:
fr: Les notifications suivantes sont utiles pour reconnaître les transactions et leurs verrouillages instantanés correspondants :

source: **Wallet Notification:** The Dash Core Daemon can be configured to execute an external script whenever an InstantSend transaction relating to that wallet is observed. This is configured by adding the following line to the dash.conf file::
fr: **Notification de portefeuille :** le "daemon" Dash Core peut être configuré pour exécuter un script externe dès qu'une transaction InstantSend relative à ce portefeuille est détectée. On le configure en ajourant la ligne suivante au fichier dash.conf :

source: This is typically used with a wallet that has been populated with `watch-only <https://dashcore.readme.io/docs/core-additional-resources-glossary#section-watch-only-address>`__ addresses.
fr: C'est typiquement utilisé avec un portefeuille qui a été doté d'adresses `en lecture seule <https://dashcore.readme.io/docs/core-additional-resources-glossary#section-watch-only-address>`__.

source: Broadcasting InstantSend Transactions
fr: Diffusion des transactions InstantSend

source: Since Dash v0.14.0 established LLMQs on the Dash network, quorums will now attempt to lock every valid transaction by default without any additional fee or action by the sending wallet or user. A transaction is eligible for InstantSend when each of its inputs is considered confirmed. This is the case when at least one of the following circumstances is true:
fr: Depuis que la version 0.14.0 de Dash a lancé les LLMQ sur le réseau Dash, les quorums tentent par défaut de verrouiller chaque transaction valide, sans frais supplémentaires ni action à effectuer par le portefeuille d'envoi ou l'utilisateur. Une transaction est éligible pour InstantSend quand chacune de ses entrées est considérée comme confirmée. Cela est le cas dès qu'une des conditions suivantes est vraie :

source: the previous transaction referred to by the input is confirmed with 6 blocks
fr: la transaction précédente à laquelle l'entrée fait référence est confirmée par 6 blocs

source: the previous transaction is confirmed through an older InstantSend lock
fr: la transaction précédente est confirmée par un verrouillage InstantSend antérieur

source: the block containing the previous transaction is `ChainLocked <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__
fr: le bloc contenant la transaction précédente est `verrouillé sur chaîne <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__

source: When checking the previous transaction for an InstantSend lock, it is important to also do this on mempool (non-mined) transactions. This allows chained InstantSend locking.
fr: Lorsqu'on vérifie le verrouillage InstantSend d'une transaction précédente, il est important de le faire également sur des transactions non encore minées (dans le tampon mémoire). Cela rend possible le verrouillage InstantSend chaîné.

source: Additional Resources
fr: Ressources supplémentaires

source: The following resources provide additional information about InstantSend and are intended to help provide a more complete understanding of the underlying technologies.
fr: Les ressources suivantes fournissent des informations supplémentaires sur InstantSend et sont destinées à fournir une compréhension plus complète des technologies sous-jacentes.

source: `InstantSend Technical Information <https://github.com/dashpay/dash/blob/master/doc/instantsend.md#zmq>`__
fr: `Informations techniques sur InstantSend <https://github.com/dashpay/dash/blob/master/doc/instantsend.md#zmq>`__

source: `InstantSend Developer Documentation <https://dashcore.readme.io/docs/core-guide-dash-features-instantsend>`__
fr: `Documentation InstantSend pour les développeurs <https://dashcore.readme.io/docs/core-guide-dash-features-instantsend>`__

source: `DIP0010: LLMQ InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__
fr: `DIP0010 : InstantSend LLMQ <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__

source: `Product Brief: Dash Core v0.14 Release <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__
fr: `Résumé de produit : Dash Core version 0.14 <https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96>`__

source: API Services
fr: Services API

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-API.pdf>`__.
fr: Cette documentation est également disponible au `format PDF <https://github.com/dashpay/docs/raw/master/binary/integration/Integration-Resources-API.pdf>`__.

source: Several API services exist to facilitate quick and easy integration with the Dash network for services including:
fr: Plusieurs services d'API existent pour faciliter l'intégration rapide et simple de services au réseau Dash, parmi lesquels :

source: Transaction broadcasting
fr: Diffusion de transaction

source: Exchange rates
fr: Taux de conversion

source: Currency conversion
fr: Change entre monnaies

source: Invoice generation
fr: Génération de facture

source: API Services are typically leveraged to eliminate that requirement of running your own infrastructure to support blockchain interactions. This includes mechanisms such as:
fr: Les services d'API sont en général employés dans le but de vous épargner de faire tourner votre propre infrastructure pour interagir avec la blockchain. Cela comprend des mécanismes tels que :

source: Forming and Broadcasting a Transaction to the network.
fr: Former une transaction et la diffuser au réseau.

source: Address generation using HD Wallets.
fr: Générer des adresses avec des portefeuilles HD.

source: Payment Processing using WebHooks.
fr: Traiter le paiement avec des WebHooks.

source: There are a variety of options for supporting these methods, with the key differentiator being the pricing model included and supported features. The following list of API Providers attempts to outline these key features/differentiators and also includes a link to related documentation.
fr: Il existe plusieurs moyens d'accomplir cela, leur facteur principal de différenciation étant la grille tarifaire et les fonctionnalités fournies. La liste suivante de fournisseurs d'API essaie de souligner ces différences et fonctions clés, et inclut également un lien vers la documentation pertinente.

source: The open-source Insight REST API provides you with a convenient, powerful and simple way to read data from the Dash network and build your own services with it. A practical guide to getting started with the Insight API and Insight UI block explorer is available :ref:`here <insight-api>`.
fr: L'API REST open source Insight est un moyen simple, pratique et puissant de lire des données sur le réseau Dash et de bâtir vos propres services à partir d'elles. Un guide pratique pour s'initier à l'API Insight et à son explorateur de blocs est disponible :ref:`ici <insight-api>`.

source: Features: Transaction Broadcast, WebSocket Notifications.
fr: Fonctionnalités : diffusion de transaction, notifications WebSocket.

source: Pricing Model: Free / Open Source
fr: Grille tarifaire : gratuit / open source

source: BlockCypher is a simple, mostly RESTful JSON API for interacting with blockchains, accessed over HTTP or HTTPS from the api.blockcypher.com domain.
fr: BlockCypher est une API JSON simple, principalement RESTful, pour interagir avec des blockchains consultées via HTTP ou HTTPS depuis le domaine api.blockcypher.com.

source: Features: Transaction Broadcast, HD Wallet / Address Generation, WebSocket and WebHook Callbacks as well as Payment Forwarding. BlockCypher does not handle Private Keys.
fr: Fonctionnalités : diffusion de transaction, portefeuille HD et génération d'adresses, appels WebSocket et WebHook mais aussi transfert de paiement. BlockCypher ne manipule pas de clés privées.

source: BitGo provides a simple and robust RESTful API and client SDK to integrate digital currency wallets with your application. Support for Dash InstantSend is available.
fr: BitGo fournit une API REST simple et robuste et un SDK client, permettant d'intégrer des portefeuilles de monnaie numérique dans votre application. La compatibilité avec InstantSend est assurée.

source: Features: Multi-Signature HD Wallets, Wallet Operations, WebSocket and WebHook Notifications, Custody Solutions
fr: Fonctionnalités : portefeuilles HD à multi-signature, opérations sur portefeuille, notifications WebSocket et WebHook, solutions de garde.

source: Pricing Model: Per API Call
fr: Modèle tarifaire : par appel API

source: ChainRider is a cloud service providing a set of REST APIs for digital currency management and exploration.
fr: ChainRider est un service dans le nuage qui fournit un jeu d'API REST pour la gestion et l'exploration des monnaies numériques.
