Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/developers/testnet.po
Languages: fr, ru

source: Dash testnet and devnets are used by Dash developers for testing using tDASH
fr: Les réseaux de test et de développement Dash sont utilisés par les développeurs Dash pour des essais avec l'unité de compte tDASH
ru: Тестовая сеть и сеть разработчиков Dash используются разработчиками Dash для тестирования с использованием монет tDASH

source: dash, masternodes, testnet, devnet, faucet, masternodes, testing, pool, explorer, mining pools, block explorer
fr: dash, masternodes, réseau de test, réseau de développement, robinet, masternodes, essai, groupe, explorateur, groupes de minage, explorateur de blocs
ru: dash, мастерноды, тестовая сеть, сеть разработчиков, кран, мастерноды, тестирование, пул, обозреватель, пулы для майнинга, обозреватель блоков

source: Testnet and devnets
fr: Réseaux de test et réseaux de développement
ru: Тестовая сеть и devnets

source: Testnet is a fully functioning Dash blockchain with the one key exception that because the Dash on the network can be created freely, it has no value. This currency, known as tDASH, can be requested from a faucet to help developers test new versions of Dash, as well as test network operations using identical versions of the software before they are carried out on the mainnet. There are a few other key differences:
fr: Le réseau de test est une blockchain Dash entièrement fonctionnelle, à l'exception cruciale qu'elle n'a aucune valeur car ses dashs peuvent être créés librement. Cette monnaie de test, nommée tDASH, peut être demandée à un robinet pour aider les développeurs à tester de nouvelles versions de Dash, ainsi qu'à tester des opérations de réseau avec des versions logicielles identiques avant qu'elles ne soient activées sur le réseau principal. Il y a quelques autres différences clés :
ru: Testnet - это полностью функционирующий блокчейн Dash с одним ключевым отличием, которое состоит в том, что монеты Dash в этой сети могут создаваться свободно и они не имеют ценности. Эта валюта, известная как tDASH, может запрашиваться на специальных сайтах-кранах и призвана помочь разработчикам протестировать новые версии Dash, а также проверить сетевые операции с использованием идентичных версий программного обеспечения, прежде чем они начнут работать в основной сети. Существует еще несколько ключевых отличий:

source: Testnet operates on port 19999 (instead of 9999)
fr: Le réseau de test fonctionne sur le port 19999 (au lieu de 9999)
ru: Testnet работает на порту 19999 (вместо 9999)

source: Testnet addresses start with "y" instead of "X", ADDRESSVERSION is 140 (instead of 76)
fr: Les adresses du réseau de test commencent par "y" au lieu de "X", ADDRESSVERSION est de 140 (au lieu de 76)
ru: Адреса в тестовой сети начинаются с «y» вместо «X», ADDRESSVERSION - 140 (вместо 76)

source: Testnet balances are denominated in tDASH (instead of DASH)
fr: Les soldes du réseau de test sont libellés en tDASH (au lieu de DASH)
ru: Балансы Testnet выражены в tDASH (вместо DASH)

source: Protocol message header bytes are 0xcee2caff (instead of 0xbf0c6bbd)
fr: Les octets d'en-tête de message du protocole sont 0xcee2caff (au lieu de 0xbf0c6bbd)
ru: Протокол байтов заголовков сообщений равен 0xcee2caff (вместо 0xbf0c6bbd)

source: Bootstrapping uses different DNS seeds: test.dnsseed.masternode.io, testnet-seed.darkcoin.qa, testnet-seed.dashpay.io
fr: Les amorces utilisent des graines DNS différentes : test.dnsseed.masternode.io, testnet-seed.darkcoin.qa, testnet-seed.dashpay.io
ru: Во время начальной загрузки используются разные источники DNS: test.dnsseed.masternode.io, testnet-seed.darkcoin.qa, testnet-seed.dashpay.io

source: Launching Dash Core in testnet mode shows an orange splash screen
fr: Démarrage du portefeuille logiciel Dash Core en mode de réseau de test, avec un écran de démarrage orange
ru: При запуске Dash Core в режиме testnet на экране появляется оранжевая заставка

source: To start Dash Core in testnet mode, find your dash.conf file and enter the following line::
fr: Pour démarrer le portefeuille logiciel Dash Core en mode de réseau de test, ouvrez votre fichier "dash.conf" et saisissez la ligne suivante ::
ru: Чтобы запустить Dash Core в режиме testnet, найдите файл dash.conf и введите следующую строку::

source: With the release of Dash Core 12.3, Dash added support for a great new feature — **named devnets**. Devnets are developer networks that combine some aspects of testnet (the global and public testing network) and some aspects of regtest (the local-only regression testing mode that provides controlled block generation). Unlike testnet, multiple independent devnets can be created and coexist without interference. For practical documentation on how to use devnets, see the `developer documentation <https://dashcore.readme.io/docs/core-examples-testing-applications>`__ or this `blog post <https://blog.dash.org/dash-devnets-bc27ecbf0085>`__.
fr: Avec la sortie de Dash Core 12.3, Dash s'est doté d'une très intéressante nouvelle fonctionnalité : les **réseaux de développement nommés**. Les réseaux de développement sont des réseaux pour développeurs qui regroupent certains aspects du réseau de test (le réseau de test global et public) et d'autres aspects du réseau de régression (le mode de test de régression qui permet une génération contrôlée des blocs, en local seulement). À la différence du réseau de test, plusieurs réseaux de développement indépendants peuvent être créés et coexister sans interférer. Pour une documentation pratique sur l'utilisation des réseaux de développement, voir la `documentation développeur <https://dashcore.readme.io/docs/core-examples-testing-applications>`__ ou ce `billet de blog <https://blog.dash.org/dash-devnets-bc27ecbf0085>`__.

source: Tools and links
fr: Outils et liens
ru: Инструменты и ссылки

source: The links below were collected from various community sources and may not necessarily be online or functioning at any given time. Please join `Dash Nation Discord <http://dashchat.org>`_ or the `Dash Forum <https://www.dash.org/forum/>`_ if you have a question relating to a specific service.
fr: Les liens ci-dessous ont été réunis depuis diverses sources communautaires et ne sont peut-être pas en ligne ou fonctionnels à un instant donné. Veuillez vous rendre sur `le Discord Dash Nation <http://dashchat.org>`_ ou le `forum Dash <https://www.dash.org/forum/>`_ si vous avez une question sur un de ces services.
ru: Ссылки, приведенные ниже, были собраны из различных источников сообщества и не обязательно могут быть онлайн или функционировать в любой момент времени. Присоединяйтесь к `Dash Nation Discord <http://dashchat.org>`_ или `Dash Forum <https://www.dash.org/forum/>`_, если у вас есть вопросы, связанные с конкретными услугами.

source: **Test builds:** https://gitlab.com/dashpay/dash/pipelines
fr: **Compilations de test :** https://gitlab.com/dashpay/dash/pipelines

source: **Bugtracker:** https://github.com/dashpay/dash/issues/new
fr: **Suivi de bugs :** https://github.com/dashpay/dash/issues/new
ru: **Отслеживание ошибок:** https://github.com/dashpay/dash/issues/new

source: **Discussion and help:** https://www.dash.org/forum/topic/testing.53/
fr: **Discussion et aide :** https://www.dash.org/forum/topic/testing.53/
ru: **Обсуждение и помощь:** https://www.dash.org/forum/topic/testing.53/

source: **Masternode tools:** https://test.dashninja.pl/masternodes.html
fr: **Outils pour masternode :** https://test.dashninja.pl/masternodes.html
ru: **Инструменты для Мастернод:** https://test.dashninja.pl/masternodes.html

source: **Android wallet:** https://github.com/dashevo/dash-wallet/releases/tag/v7.0.2
fr: **Portefeuille Android :** https://github.com/dashevo/dash-wallet/releases/tag/v7.0.2

source: **Testnet for Bitcoin:** https://en.bitcoin.it/wiki/Testnet
fr: **Réseau de test de Bitcoin :** https://en.bitcoin.it/wiki/Testnet
ru: **Testnet для Биткойна:** https://en.bitcoin.it/wiki/Testnet

source: Faucets
fr: Robinets
ru: Краны

source: https://testnet-faucet.dash.org - by Dash Core Group
fr: https://testnet-faucet.dash.org - par Dash Core Group

source: http://test.faucet.masternode.io - by coingun
fr: http://test.faucet.masternode.io - par coingun
ru: http://test.faucet.masternode.io - пользователя coingun

source: http://faucet.test.dash.crowdnode.io - by ndrezza
fr: http://faucet.test.dash.crowdnode.io - par ndrezza
ru: http://faucet.test.dash.crowdnode.io - пользователя ndrezza

source: https://test.faucet.dashninja.pl - by elbereth
fr: https://test.faucet.dashninja.pl - par elbereth
ru: https://test.faucet.dashninja.pl - пользователя elbereth

source: Explorers
fr: Explorateurs de blocs
ru: Обозреватели

source: Pools
fr: Groupes de minage
ru: Пулы

source: https://test.pool.dash.org [stratum+tcp://test.stratum.dash.org] - by flare
fr: https://test.pool.dash.org [stratum+tcp://test.stratum.dash.org] - par flare
ru: https://test.pool.dash.org [stratum+tcp://test.stratum.dash.org] - пользователя flare

source: http://test.p2pool.dash.siampm.com [stratum+tcp://test.p2pool.dash.siampm.com:17903] by thelazier
fr: http://test.p2pool.dash.siampm.com [stratum+tcp://test.p2pool.dash.siampm.com:17903] par thelazier
ru: http://test.p2pool.dash.siampm.com [stratum+tcp://test.p2pool.dash.siampm.com:17903] пользователя thelazier

source: http://p2pool.dashninja.pl:17903/static - by elbereth
fr: http://p2pool.dashninja.pl:17903/static - par elbereth
ru: http://p2pool.dashninja.pl:17903/static - пользователя elbereth

source: http://test.p2pool.masternode.io:18998/static - by coingun
fr: http://test.p2pool.masternode.io:18998/static - par coingun
ru: http://test.p2pool.masternode.io:18998/static - пользователя coingun

source: Installing a masternode under testnet generally follows the same steps as the :ref:`mainnet masternode installation guide <masternode-setup>`, but with a few key differences:
fr: Installer un masternode sur le réseau de test suit les même étapes générales que le :ref:`guide d'installation d'un masternode sur le réseau principal <masternode-setup>`, mais avec quelques différences clés :
ru: Установка Мастерноды в тестовой сети обычно выполняется в той же последовательности, что и :ref:`руководство по установке Мастерноды в основной сети <masternode-setup>`, но с несколькими ключевыми отличиями:

source: You will probably be running a development version of Dash instead of the stable release. See `here <https://gitlab.com/dashpay/dash/pipelines>`__ for a list of builds, then choose the latest successful ``develop`` build and click **Artifacts** to view a list of binaries.
fr: Vous ferez sans doute tourner une version de développement de Dash plutôt que la version stable. Voir `ici <https://gitlab.com/dashpay/dash/pipelines>`__ pour une liste d'exécutables, puis choisissez la plus récente compilation réussie et cliquez sur **Artifacts** pour voir la liste des binaires.

source: When opening the firewall, port 19999 must be opened instead of (or in addition to) 9999. Use this command: ``ufw allow 19999/tcp``
fr: À l'ouverture du pare-feu, le port 19999 doit être ouvert au lieu (ou en plus) du port 9999. Utilisez cette commande : ``ufw allow 19999/tcp``
ru: При открытии брандмауэра порт 19999 должен быть открыт вместо (или в дополнение к) 9999. Используйте команду: ``ufw allow 19999/tcp``

source: Your desktop wallet must be running in testnet mode. Add the following line to *dash.conf*: ``testnet = 1``
fr: Votre portefeuille logiciel de bureau doit tourner en mode de réseau de test. Ajoutez la ligne suivante au fichier *dash.conf* : ``testnet = 1``
ru: Кошелёк на вашем компьютере должен быть запущен в режиме тестовой сети. Добавьте следующую строку в файл *dash.conf*: ``testnet = 1``

source: When sending the collateral, you can get the 1000 tDASH for free from a faucet (see above)
fr: Pour l'envoi de la caution, vous pouvez obtenir les 1000 tDASH gratuitement d'un robinet (voir plus haut)
ru: Если хотите отправить залог, то 1000 tDASH вы можете получить бесплатно с помощью сайтов-кранов (ссылки на них приведены выше)

source: Your masternode configuration file must also specify testnet mode. Add the following line when setting up *dash.conf* on the masternode: ``testnet = 1``
fr: Votre fichier de configuration de masternode doit aussi indiquer le mode de réseau de test. Ajoutez la ligne suivante au fichier *dash.conf* sur le masternode : ``testnet = 1``
ru: В файле конфигурации вашей мастерноды также должен быть указан режим тестовой сети. Добавьте следующую строку при настройке файла *dash.conf* мастерноды: ``testnet = 1``

source: As for mainnet masternodes, the RPC username and password must contain alphanumeric characters only
fr: Comme pour les masternodes de réseau principal, le nom d'utilisateur RPC et son mot de passe ne doivent être composés que de caractères alphanumériques
ru: Что касается мастернод, работающих в основной сети, то имя пользователя RPC и пароль должны содержать только буквенно-цифровые символы

source: When cloning sentinel, you may need to clone the development branch using the ``-b`` option, for example: ``git clone -b develop https://github.com/dashpay/sentinel.git``
fr: Pour cloner Sentinel, vous aurez peut-être besoin de cloner la branche de développement en utilisant l'option ``-b``, par exemple : ``git clone -b develop https://github.com/dashpay/sentinel.git``

source: Once sentinel is installed, modify ``~/.dashcore/sentinel/sentinel.conf``, comment the mainnet line and uncomment: ``network=testnet``
fr: Une fois Sentinel installé, modifiez ``~/.dashcore/sentinel/sentinel.conf``, commentez la ligne relative au réseau principal, et décommentez : ``network=testnet``
ru: После того, как sentinel был установлен, модифицируйте файл ``~/.dashcore/sentinel/sentinel.conf``, оставьте следующий комментарий в основной сети, а затем удалите его: ``network=testnet``

source: The wallet holding the masternode collateral will expect to find the ``masternode.conf`` file in ``~/.dashcore/testnet3/masternode.conf`` instead of ``~/.dashcore/masternode.conf``.
fr: Le portefeuille détenant la caution de masternode cherchera le fichier ``masternode.conf`` dans ``~/.dashcore/testnet3/masternode.conf`` plutôt que dans ``~/.dashcore/masternode.conf``.
ru: Для кошелька, в котором удерживается залог мастерноды, файл ``masternode.conf`` должен располагаться по адресу ``~/.dashcore/testnet3/masternode.conf`` вместо``~/.dashcore/masternode.conf``.

source: Testnet 0.16.0
fr: Réseau de test 0.16.0

source: In June 2020, the Dash team announced the start of testing of the upcoming Dash 0.16.0 release. Extensive internal testing has already been done on the 0.16.0 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
fr: En juin 2020, l'équipe Dash a annoncé le début des tests sur la version 0.16.0 à venir de Dash. Des tests soutenus ont déjà été menés en interne sur le code de la version 0.16.0, mais de nombreux bugs ne pourront être découverts que par l'utilisation réelle par des gens réels. L'équipe Dash invite toute personne intéressée à télécharger le logiciel et à participer activement au réseau de test. Cette version inclut :

source: Block reward reallocation
fr: Réallocation de la récompense de bloc

source: Core Wallet UI/UX Improvements
fr: Améliorations de l'interface du portefeuille Core

source: Quorum Signing Optimizations
fr: Optimisations des signatures de quorum

source: Network Threading Improvement
fr: Amélioration des files réseau

source: Minimum Protocol Check
fr: Vérification du protocole minimal

source: Bitcoin 0.16 and 0.17 Backports
fr: Rétroports de Bitcoin 0.16 et 0.17

source: Discussion:
fr: Débat :
ru: Обсуждение:

source: Testnet announcement: https://www.dash.org/forum/threads/v0-16-testing.50294/
fr: Annonce du réseau de test : https://www.dash.org/forum/threads/v0-16-testing.50294/

source: Product brief: https://blog.dash.org/updated-product-brief-dash-core-release-v0-16-0-d3debdb6242e
fr: Résumé du produit : https://blog.dash.org/updated-product-brief-dash-core-release-v0-16-0-d3debdb6242e

source: Testnet tools: https://docs.dash.org/en/stable/developers/testnet.html
fr: Outils de réseau de test : https://docs.dash.org/en/stable/developers/testnet.html

source: Issue tracking: https://github.com/dashpay/dash/issues/new
fr: Suivi des problèmes : https://github.com/dashpay/dash/issues/new
ru: Отслеживание проблем: https://github.com/dashpay/dash/issues/new

source: Latest test binaries:
fr: Exécutables de test les plus récents :
ru: Последние тестовые двоичные файлы:

source: Testnet 0.15.0
fr: Réseau de test 0.15.0

source: In December 2019, the Dash team announced the start of testing of the upcoming Dash 0.15.0 release. Extensive internal testing has already been done on the 0.15.0 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
fr: En décembre 2019, l'équipe Dash a annoncé le début des tests sur la version 0.15.0 à venir de Dash. Des tests soutenus ont déjà été menés en interne sur le code de la version 0.15.0, mais de nombreux bugs ne pourront être découverts que par l'utilisation réelle par des gens réels. L'équipe Dash invite toute personne intéressée à télécharger le logiciel et à participer activement au réseau de test. Cette version inclut :

source: Bitcoin 0.15 backports
fr: Rétroports de Bitcoin 0.15

source: Removal of legacy code
fr: Suppression de code obsolète

source: Testnet announcement: https://www.dash.org/forum/threads/v15-0-testing.49140/
fr: Annonce du réseau de test : https://www.dash.org/forum/threads/v15-0-testing.49140/

source: Product brief: https://blog.dash.org/product-brief-dash-core-release-v0-15-0-acd7633a91ab
fr: Résumé du produit : https://blog.dash.org/product-brief-dash-core-release-v0-15-0-acd7633a91ab

source: Testnet 0.14.0
fr: Réseau de test 0.14.0

source: In March 2019, the Dash team announced the start of testing of the upcoming Dash 0.14.0 release. Extensive internal testing has already been done on the 0.14.0 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
fr: En mars 2019, l'équipe Dash a annoncé le début des tests sur la version 0.14.0 à venir de Dash. Des tests soutenus ont déjà été menés en interne sur le code de la version 0.14.0, mais de nombreux bugs ne pourront être découverts que par l'utilisation réelle par des gens réels. L'équipe Dash invite toute personne intéressée à télécharger le logiciel et à participer activement au réseau de test. Cette version inclut :

source: LLMQ based ChainLocks
fr: ChainLocks basé sur LLMQ

source: LLMQ based InstantSend
fr: InstantSend basé sur LLMQ

source: Testnet announcement: https://www.dash.org/forum/threads/v14-0-testing.44047/
fr: Annonce du réseau de test : https://www.dash.org/forum/threads/v14-0-testing.44047/

source: Product brief: https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96
fr: Fiche produit : https://blog.dash.org/product-brief-dash-core-release-v0-14-0-now-on-testnet-8f5f4ad45c96

source: Testnet 0.13.0
fr: Réseau de test 0.13.0
ru: Тестовая сеть версии 0.13.0

source: In November 2018, the Dash team announced the start of testing of the upcoming Dash 0.13.0 release. Extensive internal testing has already been done on the 0.13.0 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
fr: En novembre 2018, l'équipe Dash a annoncé le début des tests sur la version 0.13.0 à venir de Dash. Des tests soutenus ont déjà été menés en interne sur le code de la version 0.13.0, mais de nombreux bugs ne pourront être découverts que par l'utilisation réelle par des gens réels. L'équipe Dash invite toute personne intéressée à télécharger le logiciel et à participer activement au réseau de test. Cette version inclut :
ru: В ноябре 2018 года команда Dash объявила о начале тестирования предстоящего выпуска клиента Dash версии 0.13.0. Обширное внутреннее тестирование уже было выполнено по коду версии 0.13.0, но есть множество ошибок, которые могут быть обнаружены только в случае реального использования реальными людьми. Команда Dash приглашает любого, кто заинтересован, скачать программное обеспечение и проявить активность в тестовой сети. Этот выпуск включает:

source: Automatic InstantSend for Simple Transactions
fr: InstantSend automatique pour les transactions simples
ru: Автоматическое задействование функции InstantSend для простых транзакций

source: Deterministic Masternode List
fr: Liste déterministe de masternodes
ru: Детерминированный список мастернод

source: 3 Masternode Keys: Owner, Operator and Voting
fr: 3 clés de masternode : propriétaire, opérateur et vote
ru: 3 ключа мастерноды: для владельца, оператора и голосования

source: Special Transactions
fr: Transactions spéciales
ru: Специальные транзакции

source: PrivateSend Improvements
fr: Améliorations de PrivateSend
ru: Улучшения в функции PrivateSend

source: Testnet announcement: https://www.dash.org/forum/threads/v13-0-testing.41945/
fr: Annonce du réseau de test : https://www.dash.org/forum/threads/v13-0-testing.41945/

source: Product brief: https://blog.dash.org/product-brief-dash-core-release-v0-13-0-5d7fddffb7ef
fr: Résumé du produit : https://blog.dash.org/product-brief-dash-core-release-v0-13-0-5d7fddffb7ef
ru: Кратко о продукте: https://blog.dash.org/product-brief-dash-core-release-v0-13-0-5d7fddffb7ef

source: Testnet 0.12.3
fr: Réseau de test 0.12.3
ru: Тестовая сеть версии 0.12.3

source: In June 2018, the Dash team announced the start of testing of the upcoming Dash 0.12.3 release. Extensive internal testing has already been done on the 0.12.2 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
fr: En juin 2018, l'équipe Dash a annoncé le début des tests sur la version 0.12.3 à venir de Dash. Des tests soutenus ont déjà été menés en interne sur le code de la version 0.12.2, mais de nombreux bugs ne pourront être découverts que par l'utilisation réelle par des gens réels. L'équipe Dash invite toute personne intéressée à télécharger le logiciel et à participer activement au réseau de test. Cette version inclut :
ru: В июне 2018 года команда Dash объявила о начале тестирования предстоящего выпуска кошелька Dash версии 0.12.3. Обширное внутреннее тестирование уже было выполнено по коду версии 0.12.2, но есть множество ошибок, которые могут быть обнаружены только в случае реального использования реальными людьми. Команда Dash приглашает любого, кто заинтересован скачать программное обеспечение и проявить активность в тестовой сети, принять в этом участие. Этот выпуск включает:

source: Named Devnets, to help developers quickly create multiple independent devnets
fr: Réseaux de développement nommés, pour aider les développeurs à créer rapidement de nombreux réseaux de développement indépendants
ru: Именованные Devnets, которые помогают разработчикам быстро создавать несколько независимых devnets

source: New format of network message signatures
fr: Nouveau format de signatures de message réseau
ru: Новый формат подписей сетевых сообщений

source: Governance system improvements
fr: Améliorations du système de gouvernance
ru: Усовершенствованную систему управления
