Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/developers/testnet.po
Languages: fr, ru

source: PrivateSend improvements
fr: Améliorations de PrivateSend
ru: Усовершенствованную функцию PrivateSend

source: Additional indexes cover P2PK now
fr: Les index supplémentaires pour P2PK désormais
ru: Дополнительные индексы, которые теперь охватывают P2PK

source: Support for pruned nodes in Lite Mode
fr: Compatibilité des nœuds élagués dans le Mode allégé
ru: Поддержку урезанных узлов в режиме Lite

source: New Masternode Information Dialog
fr: Nouvelle boîte de dialogue d'information sur les masternodes
ru: Новое окно информационного диалога Мастернод

source: Testnet 0.12.2
fr: Réseau de test 0.12.2
ru: Тестовая сеть версии 0.12.2

source: In October 2017, the Dash team announced the launch of a testnet for public testing of the upcoming 0.12.2 release of the Dash software. Extensive internal testing has already been done on the 0.12.2 code, but there are numerous bugs that can only be revealed with actual use by real people. The Dash team invites anybody who is interested to download the software and become active on testnet. This release includes:
fr: En octobre 2017, l'équipe Dash a annoncé le lancement d'un réseau de tests pour des tests publics sur la version 0.12.2 à venir de Dash. Des tests soutenus ont déjà été menés en interne sur le code de la version 0.12.2, mais de nombreux bugs ne pourront être découverts que par l'utilisation réelle par des gens réels. L'équipe Dash invite toute personne intéressée à télécharger le logiciel et à participer activement au réseau de test. Cette version inclut :
ru: В октябре 2017 года команда Dash объявила о запуске тестовой сети для публичного тестирования предстоящего выпуска программного обеспечения Dash версии 0.12.2. Обширное внутреннее тестирование уже было выполнено по коду этой версии, но есть множество ошибок, которые могут быть обнаружены только в случае реального использования реальными людьми. Команда Dash приглашает любого, кто заинтересован скачать программное обеспечение и стать его активным пользователем в тестовой сети. Этот выпуск включает:

source: DIP0001 implementation https://github.com/dashpay/dips/blob/master/dip-0001.md
fr: Implémentation de la DIP0001 : https://github.com/dashpay/dips/blob/master/dip-0001.md
ru: Имплементацию DIP0001 https://github.com/dashpay/dips/blob/master/dip-0001.md

source: 10x transaction fee reduction (including InstantSend fee)
fr: Réduction d'un facteur 10 des frais de transaction (dont les frais InstantSend)
ru: Уменьшение комиссии за транзакцию в 10 раз (включая комиссию InstantSend)

source: InstantSend vulnerability fix
fr: Correction de la faille InstantSend
ru: Исправление уязвимости InstantSend

source: Lots of other bug fixes and performance improvements
fr: Beaucoup d'autres corrections de bugs et d'améliorations de performance
ru: Многие другие исправления ошибок и улучшения производительности

source: Experimental BIP39/BIP44 complaint HD wallet (disabled by default, should be fully functional but there is no GUI yet)
fr: Portefeuille HD BIP39/BIP44 expérimental (désactivé par défaut, devrait être entièrement fonctionnel mais il n'existe pas encore d'interface graphique)
ru: Экспериментальную версию HD-кошелька, выпущенного по рекламации BIP39/BIP44 (который отключён по умолчанию и должен стать полностью функциональным, но пока не имеет своего графического интерфейса)

source: Testnet 12.2 discussion: https://www.dash.org/forum/threads/v12-2-testing.17412/
fr: Débat sur le réseau de test 12.2 : https://www.dash.org/forum/threads/v12-2-testing.17412/
ru: Обсуждение Testnet версии 12.2: https://www.dash.org/forum/threads/v12-2-testing.17412/

source: Testnet tools: https://www.dash.org/forum/threads/testnet-tools-resources.1768/
fr: Outils de réseau de test : https://www.dash.org/forum/threads/testnet-tools-resources.1768/
ru: Инструменты для тестовой сети: https://www.dash.org/forum/threads/testnet-tools-resources.1768/

source: Latest successfully built develop branch binaries:
fr: Exécutables les plus récents de la branche de développement :
ru: Последние успешные сборки версий разработки:

source: Masternodes
ru: Мастерноды
