Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/hosting.po
Languages: fr

source: Masternode hosting services can help you set up and maintain a Dash masternode
fr: Les services d'hébergement de masternode peuvent vous aider à configurer et à administrer un masternode Dash

source: dash, cryptocurrency, hosting, server, linux, masternode, contact, trezor, setup, operator, owner, dip3, reward
fr: dash, cryptomonnaie, hébergement, serveur, linux, masternode, contact, trezor, installation, opérateur, propriétaire, dip3, récompense

source: Hosting Services
fr: Services d'hébergement

source: Several Dash community members offer masternode hosting services. This service can be realized securely without the customer ever giving up control of the 1000 DASH required for collateral. For security reasons, it is highly recommended to keep the collateral on a hardware wallet when taking advantage of a hosting service. A list of currently available masternode hosting services is available below.
fr: Plusieurs membres de la communauté Dash proposent des services d'hébergement de masternode. Ce service peut être accompli de manière sûre, sans que le client n'ait à abandonner le contrôle des 1000 dashs représentant la caution. Pour des raisons de sécurité, il est chaudement recommandé de conserver la caution sur un portefeuille matériel lorsqu'on souhaite bénéficier d'un service d'hébergement. Une liste des services d'hébergement de masternode actuellement disponibles est consultable ci-dessous.

source: List of hosting services
fr: Liste de services d'hébergement

source: **Disclaimer**: Dash Core may be affiliated with these community members, but is not involved in the provision of any of these services.
fr: **Avertissement** : Dash Core peut éventuellement être affilié à certains des membres de la communauté ci-dessous, mais n'est impliqué dans la fourniture d'aucun des services suivants.

source: Operated by: CrowdNode ApS
fr: Géré par : CrowdNode ApS

source: Services: Hosting, Shares
fr: Services : Hébergement, Parts

source: Cost: 15% of masternode payments
fr: Coût : 15% des paiements de masternode

source: `Email <hello@crowdnode.io>`__
fr: `Adresse e-mail <hello@crowdnode.io>`__

source: Operated by: Sephiroth
fr: Géré par : Sephiroth

source: Services: Monitoring, Hosting
fr: Services : Surveillance, Hébergement

source: Cost: from $4.50/month
fr: Tarif : à partir de 4,50 dollars par mois

source: `Email <info@allnodes.com>`__
fr: `Adresse e-mail <info@allnodes.com>`__

source: SID Hosting Service
fr: Service d'hébergement SID

source: Operated by: splawik21 (Dash Core team member)
fr: Géré par : splawik21 (membre de l'équipe Dash Core)

source: Services: Hosting
fr: Services : Hébergement

source: Cost: €25/month, paid in Dash
fr: Coût : 25 €/mois, payés en dashs

source: `Email <sidhosting@protonmail.com>`__
fr: `Adresse e-mail <sidhosting@protonmail.com>`__

source: Operated by: Perry Woodin
fr: Géré par : Perry Woodin

source: Services: Hosting, Voting, Tax Compliance
fr: Services: Hébergement, Vote, Conseil fiscal

source: 0.34 Dash/month (variable, discounts available)
fr: Coût : 0,34 dash/mois (variable, des réductions sont possibles)

source: `Email <info@node40.com>`__
fr: `Adresse e-mail <info@node40.com>`__

source: `Review <https://dashnews.org/interview-perry-woodin-node40-dash-compliance/>`__
fr: `Avis : <https://dashnews.org/interview-perry-woodin-node40-dash-compliance/>`__

source: Operated by: Pool of Stake OÜ
fr: Opéré par : Pool of Stake OÜ

source: 15% of masternode payments (5% with tokens)
fr: 15% des paiements de masternode (5% avec des jetons)

source: `Site <https://www.poolofstake.io>`__
fr: `Site web <https://www.poolofstake.io>`__

source: `Email <mail@poolofstake.io>`__
fr: `Adresse e-mail <mail@poolofstake.io>`__

source: Operated by: Staked
fr: Opéré par : Staked

source: Services: Hosting, Reporting
fr: Services : hébergement, suivi

source: Cost: 10% of rewards
fr: Coût : 10% des récompenses

source: `Site <https://staked.us>`__
fr: `Site web <https://staked.us>`__

source: `Email <sales@staked.us>`__
fr: `Adresse e-mail <sales@staked.us>`__

source: Operated by: NodeHub.io Platform
fr: Opéré par : NodeHub.io Platform

source: Services: Hosting, Governance, Stats
fr: Services : hébergement, gouvernance, statistiques

source: Cost: $9.90/month (charged daily at $0.33)
fr: Coût : 9,90 dollars/mois (facturé 0,33 dollar par jour)

source: `Site <https://nodehub.io>`__
fr: `Site web <https://nodehub.io>`__

source: `Email <hello@nodehub.io>`__
fr: `Adresse e-mail <hello@nodehub.io>`__

source: Operated by: Gentarium International OÜ
fr: Opéré par : Gentarium International OÜ

source: Cost: $3.99/month (charged daily at $0.15)
fr: Coût : 3,99 dollars/mois (facturé 0,15 dollar par jour)

source: `Site <https://mn.gtmcoin.io>`__
fr: `Site web <https://mn.gtmcoin.io>`__

source: `Email <info@gtmcoin.io>`__
fr: `Adresse e-mail <info@gtmcoin.io>`__

source: Operated by: p5yc071c
fr: Opéré par : p5yc071c

source: Cost: 50 CHF/month
fr: Tarif : 50 francs suisses par mois

source: `Site <https://pennyscavs.com>`__
fr: `Site web : <https://pennyscavs.com>`__

source: Operated by: flare (Dash Core team member)
fr: Géré par : flare (membre de l'équipe Dash Core)

source: Cost: €18/month
fr: Coût : 18 €/mois

source: `Email <holger@masternodehosting.com>`__
fr: `Adresse e-mail <holger@masternodehosting.com>`__

source: Registering a hosted masternode
fr: Enregistrer un masternode hébergé

source: Dash 0.13.0 implements DIP003, which introduces several changes to how a Dash masternode is set up and operated. A list of available documentation appears below:
fr: Dash 0.13.0 met en œuvre la DIP003, qui introduit certains changements dans la façon d'installer et de gérer un masternode. Veuillez trouver ci-dessous une liste de la documentation disponible :

source: `DIP003 Deterministic Masternode Lists <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
fr: `DIP003 Listes de masternodes déterministes <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__

source: `Dash 0.13 Upgrade Procedure for Masternodes (legacy documentation) <https://docs.dash.org/en/0.13.0/masternodes/dip3-upgrade.html>`__
fr: :ref:`Procédure de mise à jour Dash 0.13 pour les masternodes (documentation archivée) <dip3-upgrade>`

source: :ref:`Full masternode setup guide <masternode-setup>`
fr: :ref:`Guide complet de mise en place d'un masternode <masternode-setup>`

source: :ref:`Information for users of hosted masternodes <hosted-setup>` (you are here)
fr: :ref:`Informations pour les utilisateurs de masternodes hébergés <hosted-setup>` (vous êtes ici)

source: :ref:`Information for operators of hosted masternodes <operator-transactions>`
fr: :ref:`Information pour les opérateurs de masternodes hébergés <operator-transactions>`

source: It is highly recommended to first read at least the list of changes before continuing in order to familiarize yourself with the new concepts in DIP003.
fr: Il est hautement recommandé, avant de continuer, de lire d'abord la liste des changements, afin de se familiariser avec les nouveaux concepts de la DIP003.

source: Registering a hosted masternode is done in several steps:
fr: L'enregistrement d'un masternode hébergé se fait en plusieurs étapes :

source: Send 1000 DASH to an address you control in a single transaction and wait for 15 confirmations
fr: Envoyez 1000 dashs à une adresse que vous contrôlez, en une seule transaction, puis attendez 15 confirmations

source: Correspond with your hosting provider to determine who will generate the operator BLS keys, whether their fee will be paid by an operator reward percentage or according to a separate contract, and whether the masternode will be set up before or after the registration transaction
fr: Correspondez avec votre hébergeur pour déterminer qui générera les clés BLS d'opérateur, si les frais de l'hébergeur seront payés par un pourcentage de la récompense ou selon un contrat séparé, et si le masternode sera mis en place avant ou après la transaction d'enregistrement

source: Prepare, sign and broadcast the registration transaction using Dash Core or DMT
fr: Préparez, signez et émettez la transaction d'enregistrement en utilisant le portefeuille logiciel Dash Core ou l'utilitaire DashMasternodeTool

source: It is **highly recommended** to store the keys to your masternode collateral on a :ref:`hardware wallet <dash-hardware-wallet>` for added security against hackers. Since the hardware wallet is only used to sign a transaction, there is no need to ever connect this wallet to the internet. However, a Dash Core wallet with balance (for the transaction fee) is required to submit the registration transaction. The masternode registration process closely follows the :ref:`setup guide <masternode-setup>`, beginning from the :ref:`registration step <register-masternode>`.
fr: Il est **hautement recommandé** de stocker les clés de votre caution de masternode sur un :ref:`portefeuille matériel <dash-hardware-wallet>` pour une meilleure sécurité contre les pirates. Comme le portefeuille matériel n'est utilisé que pour signer une transaction, il n'y a aucun besoin de connecter ce portefeuille à Internet. Cependant, un portefeuille logiciel Dash Core comportant des fonds (pour les frais de transaction) est obligatoire pour soumettre la transaction d'enregistrement. Le processus d'enregistrement de masternode suit pas à pas le :ref:`guide d'installation <masternode-setup>` à partir de :ref:`l'étape d'enregistrement <register-masternode>`.

source: Operator transactions
fr: Transactions d'opérateur

source: This documentation is intended for operators managing nodes on behalf of owners. If you provide an IP address and port of a synchronized full node with your ``masternodeblsprivkey`` entered in the ``dash.conf`` file as descibed :ref:`here <bls-generation>` to the masternode owner, it will appear in the DIP003 valid set immediately after they submit the ``protx register_submit`` command as described above. If the full node is not running, or if the owner submits ``0`` for the ``ipAndPort``, then the node will be registered in a PoSe-banned state. In this case, the operator will need to issue a :ref:`ProUpServTx transaction <update-dip3-config>` to update the service features and register the masternode.
fr: La présente section s'adresse aux opérateurs gérant des nœuds pour le compte de propriétaires. Si vous fournissez au propriétaire du masternode l'adresse IP et le port d'un nœud complet synchronisé dont le fichier ``dash.conf`` comprend votre ``masternodeblsprivkey`` tel que décrit :ref:`ici <bls-generation>`, le masternode apparaîtra dans le groupe des masternodes DIP003 valides immédiatement après que le propriétaire a soumis la commande ``protx register_submit`` telle que décrite ci-dessus. Si le nœud complet ne tourne pas, ou si le propriétaire indique ``0`` pour ``ipAndPort``, alors le nœud sera enregistré dans un état de bannissement PoSe. Dans ce cas, l'opérateur doit émettre une :ref:`transaction ProUpServTx <update-dip3-config>` pour mettre à jour les caractéristiques du service et enregistrer le masternode.

source: The ProRegTx submitted by the owner also specifies the percentage reward for the operator. It does not specify the operator's reward address, so a ProUpServTx is also required to claim this reward by specifying a Dash address. If the reward is not claimed, it will be paid to the owner in full.
fr: La transaction ProRegTx soumise par le propriétaire indique également le pourcentage de récompense alloué à l'opérateur. Elle n'indique pas l'adresse où doit être versé ce pourcentage, donc une transaction ProUpServTx est également obligatoire pour réclamer cette récompense en indiquant une adresse Dash. Si la récompense n'est pas réclamée, elle sera payée intégralement au propriétaire.
