Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup.po
Languages: fr

source: Once the transaction appears, click the QR code on the right to view the transaction on the blockchain. Keep this window open as we complete the following steps, since we will soon need to confirm that 15 confirmations exist, as shown in the following screenshot.
fr: Une fois la transaction apparue, cliquez sur le QR-code à droite pour afficher la transaction dans la blockchain. Gardez cette fenêtre ouverte le temps des étapes suivantes, car nous aurons bientôt à vérifier que les 15 confirmations ont bien eu lieu, comme dans la capture d'écran suivante.

source: Trezor blockchain explorer showing 15 confirmations for collateral transfer
fr: Explorateur de blocs de Trezor montrant 15 confirmations pour le transfert de la caution

source: While we are waiting for 15 confirmations, download the latest version of the Dash Masternode Tool (DMT) from the GitHub releases page `here <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Unzip and run the file. The following window appears.
fr: Pendant que nous attendons les 15 confirmations, téléchargez la plus récente version de DashMasternodeTool (DMT) depuis la page GitHub `ici <https://github.com/Bertrand256/dash-masternode- tool/releases>`_. Décompressez le fichier et lancez l'exécutable. La fenêtre suivante s'affiche.

source: Dash Masternode Tool startup screen
fr: Écran de démarrage de DashMasternodeTool

source: Click the third button from the left **Check Dash Network Connection** in the top left corner of the main window to verify that the connection is working. Then connect your Trezor device and click the next button **Test Hardware Wallet Connection** to verify the Trezor connection is working.
fr: Cliquez sur le troisième bouton depuis la gauche, **Vérifier la connexion au réseau Dash**, dans le coin supérieur gauche de la fenêtre principale, pour vérifier que la connexion fonctionne. Puis connectez votre appareil Trezor et cliquez sur **Tester la connexion au portefeuille matériel** pour vérifier que la connexion au Trezor fonctionne.

source: Dash Masternode Tool successful connection confirmations
fr: Confirmations de connexion réussie dans DashMasternodeTool

source: We will now use DMT to extract the transaction ID and legacy masternode key (necessary for successful startup during the DIP003 transition period). Carry out the following sequence of steps as shown in this screenshot:
fr: Nous allons maintenant nous servir de DMT pour extraire l'identifiant de transaction et l'ancienne clé de masternode (nécessaire pour le démarrer pendant la période de transition vers DIP003). Suivez les étapes ci-dessous, telles que montrées dans cette capture d'écran :

source: Dash Masternode Tool configuration steps
fr: Étapes de configuration de DashMasternodeTool

source: Click the **New** button.
fr: Cliquez sur le bouton **Nouveau**.

source: Ensure you are on the settings page for a Non-deterministic masternode and click **Generate new** to generate a legacy masternode key. Copy this key into a text editor.
fr: Assurez-vous d'être sur la page de réglages d'un masternode non déterministe, puis cliquez sur **Generate new** pour générer une ancienne clé de masternode. Copiez-collez cette clé dans un éditeur de texte.

source: Click **Alter configuration to deterministic**
fr: Cliquez sur **Alter configuration to deterministic** (Convertir la configuration en mode déterministe)

source: Enter a name for your masternode. The host name you specified for your VPS above is a good choice.
fr: Tapez un nom pour votre masternode. Le nom d'hôte que vous avez indiqué précédemment pour votre VPS est un bon choix.

source: Enter the IP address of your masternode. This was given to you by the VPS provider when you set up the server.
fr: Tapez l'adresse IP de votre masternode. Elle vous a été donnée par l'hébergeur de VPS, à la mise en place de votre serveur.

source: Enter the TCP port number. This should be 9999.
fr: Saisissez le numéro de port TCP. Ce devrait être 9999.

source: Click **Locate collateral** to view unused collateral funding transactions available on the connected hardware wallet. The **Collateral address**, **index** and **Collateral TX hash** fields should be filled automatically
fr: Cliquez sur **Locate collateral** (Trouver la caution) pour afficher les transactions de caution inutilisées qui sont disponibles sur le portefeuille matériel. Les champs **Collateral address** (Adresse de caution), **index** et **Collateral TX hash** (Empreinte de la transaction de caution) devraient être remplis automatiquement

source: Dash Masternode Tool with configuration ready to start masternode
fr: DashMasternodeTool avec sa configuration, prêt à démarrer le masternode

source: Leave DMT open and continue with the next step: :ref:`installing Dash Core on your VPS <masternode-setup-install-dashcore>`.
fr: Laissez DMT ouvert puis passez à l'étape suivante : :ref:`installer Dash Core sur votre VPS <masternode-setup-install-dashcore>`.

source: Option 2: Sending from Dash Core wallet
fr: Option 2 : Envoi depuis le portefeuille logiciel Dash Core

source: Open Dash Core wallet and wait for it to synchronize with the network. It should look like this when ready:
fr: Lancez le portefeuille logiciel Dash Core et attendez qu'il se synchronise avec le réseau. Il devrait ressembler à ça, une fois prêt :

source: Fully synchronized Dash Core wallet
fr: Portefeuille logiciel Dash Core entièrement synchronisé

source: Click **Tools > Debug console** to open the console. Type the following two commands into the console to generate a legacy masternode key (necessary for successful startup during the DIP003 transition period) and a new Dash address for the collateral::
fr: Cliquez sur **Outils > Console de débogage** pour ouvrir la console. Tapez les deux commandes suivantes dans la console pour générer une ancienne clé de masternode (nécessaire pour le démarrage durant la période de transition DIP003) et obtenir une nouvelle adresse Dash pour la caution ::

source: Take note of the legacy masternode private key and collateral address, since we will need it later. The next step is to secure your wallet (if you have not already done so). First, encrypt the wallet by selecting **Settings > Encrypt wallet**. You should use a strong, new password that you have never used somewhere else. Take note of your password and store it somewhere safe or you will be permanently locked out of your wallet and lose access to your funds. Next, back up your wallet file by selecting **File > Backup Wallet**. Save the file to a secure location physically separate to your computer, since this will be the only way you can access our funds if anything happens to your computer. For more details on these steps, see :ref:`here <dashcore-backup>`.
fr: Prenez bonne note de l'ancienne clé privée de masternode et de l'adresse de la caution, car vous en aurez besoin plus tard. La prochaine étape est de sécuriser votre portefeuille (si vous ne l'avez pas déjà fait). Tout d'abord, chiffrez votre portefeuille en allant sur le menu **Réglages > Chiffrer le portefeuille**. Il vous est conseillé d'utiliser un mot de passe fort, nouveau, que vous n'avez jamais utilisé ailleurs. Prenez note de votre mot de passe et conservez-le dans un endroit sûr, sinon votre portefeuille vous sera inaccessible de manière définitive et vous perdrez tout accès à vos fonds. Ensuite, sauvegardez le fichier de votre portefeuille en allant dans le menu **Fichier > Sauvegarder le portefeuille**. Enregistrez le fichier dans un endroit sûr et physiquement séparé de votre ordinateur, car il sera le seul moyen d'accéder à vos fonds si quoi que ce soit arrive à votre ordinateur. Pour en savoir plus sur ces étapes, voir :ref:`ici <dashcore-backup>`.

source: Now send exactly 1000 DASH in a single transaction to the new address you generated in the previous step. This may be sent from another wallet, or from funds already held in your current wallet. Once the transaction is complete, view the transaction in a `blockchain explorer <http://insight.dash.org/insight/>`_ by searching for the address. You will need 15 confirmations before you can start the masternode, but you can continue with the next step at this point already: installing Dash Core on your VPS.
fr: À présent, envoyez exactement 1000 dashs, en une seule transaction, à l'adresse que vous avez générée à l'étape précédente. Cette somme peut être envoyée depuis un autre portefeuille, ou depuis des fonds déjà présents dans ce portefeuille-ci. Une fois la transaction achevée, affichez la transaction dans un `explorateur de blocs <http://insight.dash.org/insight/>`_ en recherchant l'adresse. Vous aurez besoin de 15 confirmations avant de pouvoir démarrer le masternode, mais vous pouvez passer sans attendre à l'étape suivante : installer Dash Core sur votre VPS.

source: Install Dash Core
fr: Installation de Dash Core sur votre VPS

source: Dash Core is the software behind both the Dash Core GUI wallet and Dash masternodes. If not displaying a GUI, it runs as a daemon on your VPS (dashd), controlled by a simple command interface (dash-cli).
fr: Dash Core est le logiciel formant le socle, à la fois, du portefeuille logiciel Dash Core à interface graphique et des masternodes Dash. Lorsqu'il tourne sans interface graphique, il fonctionne en tant que daemon sur votre VPS (dashd) et il peut être contrôlé par une ligne de commande (dash-cli).

source: Open PuTTY or a console again and connect using the username and password you just created for your new, non-root user. There are two options to install Dash Core, an automated option using a script utility called dashman by Dash Core Team member moocowmoo, and a more complicated option which will allow you to understand all of the key steps involved in preparing your masternode.
fr: Lancez une nouvelle fois PuTTY ou une console de terminal, et connectez-vous à votre VPS avec le nom d'utilisateur et le mot de passe que vous venez de créer pour votre nouvel utilisateur non-root. Il existe deux manières d'installer Dash Core sur votre VPS : une option automatisée qui utilise un utilitaire nommé Dashman, créé par Moocowmoo, membre de l'équipe de développement, et une option plus compliquée qui vous permettra de comprendre toutes les étapes clés de la préparation d'un masternode.

source: Option 1: Automated installation using dashman
fr: Option 1 : Installation automatisée avec Dashman

source: To install Dash using dashman, enter the following commands after logging in::
fr: Pour installer Dash Core avec Dashman, saisissez les commandes suivantes après vous être connecté ::

source: dashman will download the latest version of Dash Core for your system, as well as an initial snapshot of the blockchain to speed up the bootstrapping process. Next download and install Sentinel, which is required for masternodes at version 0.12.1 or higher::
fr: Dashman téléchargera la version la plus récente de Dash Core pour votre système d'exploitation, ainsi qu'une amorce de la blockchain pour accélérer le processus de démarrage. Ensuite, téléchargez et installez Sentinel, qui est indispensable pour les masternodes de version 0.12.1 ou ultérieure :

source: Your system is now running as a standard Dash node, and is busy completing synchronisation with the blockchain. Since dashman does not automatically restart your masternode in the event of a system error, add a check function to crontab to make sure it checks every minute to ensure your masternode is still running::
fr: Votre système tourne maintenant en tant que nœud Dash standard, et s'occupe d'achever la synchronisation avec la blockchain. Comme Dashman ne redémarre pas automatiquement votre masternode en cas d'erreur système, ajoutez au fichier crontab une fonction de surveillance pour vous assurer qu'il soit vérifié toutes les minutes que votre masternode tourne toujours :

source: Choose nano as your editor and enter the following line at the end of the file, after the line for sentinel::
fr: Choisissez Nano comme éditeur de texte puis saisissez la ligne suivante à la fin du fichier, après la ligne concernant Sentinel ::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. Check the sync status and wait until all blockchain synchronisation and the 15 confirmations for the collateral transaction are complete::
fr: Appuyez sur **Entrée** pour vous assurer qu'il y ait une ligne vide à la fin du fichier, puis faites la combinaison de touches **Ctrl-X** pour fermer l'éditeur de texte et appuyez sur **O** puis **Entrée** pour confirmer. Ensuite, vérifiez l'état de la synchronisation et patientez jusqu'à l'achèvement de la synchronisation de la blockchain et l'apparition de 15 confirmations pour la transaction de caution :

source: dashman status output showing masternode ready to be started
fr: Affichage de Dashman montrant un masternode prêt à être démarré

source: Continue with the :ref:`next step to register your masternode <register-masternode>`.
fr: Passez à :ref:`l'étape suivante pour enregistrer votre masternode <register-masternode>`.

source: Option 2: Manual installation
fr: Option 2 : Installation manuelle

source: To manually download and install the components of your Dash masternode, visit the `GitHub releases page <https://github.com/dashpay/dash/releases>`_ and copy the link to the latest ``x86_64-linux-gnu`` version. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
fr: Pour télécharger et installer manuellement les composants de votre masternode Dash, allez sur la `page GitHub des publications <https://github.com/dashpay/dash/releases>`_ et copiez le lien vers la version ``x86_64-linux-gnu`` la plus récente. Revenez à votre fenêtre de terminal et saisissez la commande suivante, en y collant l'adresse de la plus récente version de Dash Core par un clic-droit, ou par la combinaison de touches **Ctrl-V** :

source: Verify the integrity of your download by running the following command and comparing the output against the value for the file as shown in the ``SHA256SUMS.asc`` file::
fr: Vérifiez l'intégrité de votre téléchargement en lançant la commande suivante et en comparant sa valeur de sortie à la valeur donnée par le fichier ``SHA256SUMS.asc`` ::

source: You can also optionally verify the authenticity of your download as an official release by Dash Core Team. All releases of Dash are signed using GPG by Alexander Block (codablock) with the key ``63A9 6B40 6102 E091``, `verifiable here on Keybase <https://keybase.io/codablock>`_. Import the key, download the ASC file for the current release of Dash and verify the signature as follows::
fr: Vous pouvez aussi, de manière facultative mais conseillée, vérifier l'authenticité de votre téléchargement et son caractère officiel de logiciel de l'équipe Dash Core. Tous les logiciels Dash ont une signature GPG émise par Alexander Block (codablock) avec la clé ``63A9 6B40 6102 E091``, `qu'on peut vérifier ici sur Keybase <https://keybase.io/codablock>`_. Importez la clé, téléchargez le fichier ASC pour la version la plus récente de Dash et vérifiez la signature comme ceci :

source: Downloading the PGP key and verifying the signed binary
fr: Téléchargement de la clé PGP et vérification de l'exécutable signé

source: Create a working directory for Dash, extract the compressed archive and copy the necessary files to the directory::
fr: Créez un répertoire de travail pour Dash, décompressez l'archive et copiez les fichiers nécessaires dans le répertoire :

source: Create a configuration file using the following command::
fr: Créez un fichier de configuration avec la commande suivante ::

source: An editor window will appear. We now need to create a configuration file specifying several variables. Copy and paste the following text to get started, then replace the variables specific to your configuration as follows::
fr: Une fenêtre d'éditeur de texte apparaîtra. Nous devons à présent créer un fichier de configuration définissant plusieurs variables. Copiez et collez le texte suivant pour démarrer, puis remplacez les variables propres à votre configuration, comme suit ::

source: Replace the fields marked with ``XXXXXXX`` as follows:
fr: Remplacez les champs marqués ``XXXXXXX`` comme suit :

source: ``rpcuser``: enter any string of numbers or letters, no special characters allowed
fr: ``rpcuser`` : saisissez une chaîne alphanumérique aléatoire, sans caractères spéciaux

source: ``rpcpassword``: enter any string of numbers or letters, no special characters allowed
fr: ``rpcpassword`` : saisissez une chaîne alphanumérique aléatoire, sans caractères spéciaux

source: ``masternodeprivkey``: this is the legacy masternode private key you generated in the previous step
fr: ``masternodeprivkey`` : il s'agit de l'ancienne clé privée de masternode que vous avez générée à l'étape précédente

source: ``externalip``: this is the IP address of your VPS
fr: ``externalip`` : il s'agit de l'adresse IP de votre VPS

source: The result should look something like this:
fr: Le résultat devrait ressembler à ça :

source: Entering key data in dash.conf on the masternode
fr: Saisie de données clés dans le fichier "dash.conf" sur le VPS du masternode

source: Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. You can now start running Dash on the masternode to begin synchronization with the blockchain::
fr: Faites la combinaison de touches **Ctrl-X** pour fermer l'éditeur de texte, puis **O** et **Entrée** pour enregistrer le fichier. Vous pouvez à présent lancer Dash sur le masternode pour commencer la synchronisation avec la blockchain ::

source: You will see a message reading **Dash Core server starting**. We will now install Sentinel, a piece of software which operates as a watchdog to communicate to the network that your node is working properly::
fr: Un message **Démarrage du serveur Dash Core** vous sera affiché. Nous allons maintenant installer Sentinel, un logiciel de surveillance qui renseigne le réseau sur le bon fonctionnement de votre nœud ::

source: You will see a message reading **dashd not synced with network! Awaiting full sync before running Sentinel.** Add dashd and sentinel to crontab to make sure it runs every minute to check on your masternode::
fr: Un message vous sera affiché, disant **dashd non synchronisé avec le réseau ! En attente de la synchronisation complète avant de lancer Sentinel**. Ajoutez dashd et Sentinel au fichier crontab pour vous assurer qu'il soit lancé chaque minute pour surveiller votre masternode ::

source: Choose nano as your editor and enter the following lines at the end of the file::
fr: Choisissez Nano comme éditeur de texte puis saisissez les lignes suivantes à la fin du fichier ::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. We now need to wait for 15 confirmations of the collateral transaction to complete, and wait for the blockchain to finish synchronizing on the masternode. You can use the following commands to monitor progress::
fr: Appuyez sur Entrée pour vous assurer qu'il y ait une ligne vide à la fin du fichier, puis faites la combinaison de touches **Ctrl-X** pour fermer l'éditeur de texte et **O** et **Entrée** pour enregistrer le fichier. Nous devons maintenant attendre les 15 confirmations de la transaction de caution, ainsi que la fin de la synchronisation du masternode avec la blockchain. Vous pouvez vous servir des commandes suivantes pour suivre la progression ::

source: When synchronisation is complete, you should see the following response::
fr: Quand la synchronisation est terminée, vous devriez voir le message suivant ::

source: Continue with the next step to construct the ProTx transaction required to enable your masternode.
fr: Passez à l'étape suivante pour composer la transaction ProTx requise pour activer votre masternode.

source: Register your masternode
fr: Enregistrer votre masternode

source: DIP003 introduces several changes to how a masternode is set up and operated. These are described briefly under :ref:`dip3-changes` in this documentation, or in full detail in `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ itself. It is highly recommended to first read at least the brief documentation before continuing in order to familiarize yourself with the new concepts in DIP003.
fr: La DIP003 apporte plusieurs changements à la façon dont un masternode est installé et géré. Ces changements sont brièvement décrits dans la section :ref:`dip3-changes` de cette documentation, ou en grand détail dans la `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ elle-même. Il est hautement recommandé de lire au minimum la brève documentation avant de continuer, afin de se familiariser avec les nouveaux concepts apportés par la DIP003.

source: Option 1: Registering from a hardware wallet
fr: Option 1 : Enregistrement depuis un portefeuille matériel

source: Go back to DMT and ensure that all fields from the previous step are still filled out correctly. Click **Generate new** for the three private keys required for a DIP003 deterministic masternode:
fr: Revenez à DashMasternodeTool et assurez-vous que tous les champs de l'étape précédente sont encore remplis correctement. Cliquez sur **Generate new** (Générer nouveau) pour les trois clés privées requises pour un masternode déterministe DIP003 :

source: Owner private key
fr: Clé privée du propriétaire

source: Operator private key
fr: Clé privée de l'opérateur

source: Voting private key
fr: Clé privée de vote

source: Dash Masternode Tool ready to register a new masternode
fr: DashMasternodeTool prêt à enregistrer un nouveau masternode

source: Then click **Send ProRegTx** and confirm the following two messages:
fr: Puis cliquez sur **Send ProRegTx** (Envoyer ProRegTx) et confirmez les deux messages suivants :

source: Dash Masternode Tool confirmation dialogs to register a masternode
fr: Dialogues de confirmation de DashMasternodeTool pour enregistrer un masternode

source: The BLS secret key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner, as we just did above. Edit the configuration file on your masternode as follows::
fr: La clé secrète BLS doit être saisie dans le fichier ``dash.conf`` sur le masternode. Cela permet au masternode de surveiller sur la blockchain les transactions Pro*Tx correspondantes, et cela le démarrera en tant que masternode quand la transaction signée ProRegTx sera diffusée par le propriétaire, comme nous venons de le faire ci-dessus. Modifiez le fichier de configuration sur votre masternode, comme suit :

source: The editor appears with the existing masternode configuration. Add this line to the end of the file, replacing the key with your BLS secret key generated above::
fr: L'éditeur s'affiche avec la configuration existante du masternode. Ajoutez cette ligne en fin de fichier, en remplaçant la clé avec votre clé secrète BLS générée plus tôt ::
