Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup-testnet.po
Languages: fr

source: This guide describes how to set up a Dash masternode with evo services.
fr: Ce guide explique comment mettre en place un masternode Dash avec des services Evo.

source: dash, guide, masternodes, trezor, dip3, setup, bls
fr: dash, guide, masternodes, trezor, dip3, installation, bls

source: Testnet Setup
fr: Mise en place d'un réseau de test

source: Setting up a masternode with support for evo services requires a basic understanding of Linux and blockchain technology, as well as an ability to follow instructions closely. It also requires regular maintenance and careful security, particularly if you are not storing your Dash on a hardware wallet. There are some decisions to be made along the way, and optional extra steps to take for increased security.
fr: Mettre en place un masternode avec support des services Evo demande une compréhension de base de Linux et de la technologie blockchain, ainsi qu'une capacité à suivre des instructions de près. Cela demande également une régularité de gestion et une sécurité pointilleuse, en particulier si vous ne stockez pas vos dashs sur un portefeuille matériel. Il y aura quelques choix à faire lors de la procédure, et quelques étapes supplémentaires facultatives à suivre pour une meilleure sécurité.

source: Commercial :ref:`masternode hosting services <masternode-hosting>` are available if you prefer to delegate day-to-day operation of your masternode to a professional operator. When using these hosting services, you retain full control of the 1000 DASH collateral and pay an agreed percentage of your reward to the operator. It is also possible to delegate your voting keys to a representative, see the :ref:`governance documentation <delegating-votes>` for more information.
fr: Des :ref:`services commerciaux d'hébergement de masternode <masternode-hosting>` sont disponibles si vous préférez déléguer la gestion au jour le jour de votre masternode à un opérateur professionnel. En utilisant ces services d'hébergement, vous conservez un contrôle total sur la caution de 1000 dashs et vous payez un pourcentage convenu d'avance à l'opérateur, à titre de rétribution. Il est également possible de déléguer vos clés de vote à un représentant, veuillez consulter la :ref:`documentation sur la gouvernance <delegating-votes>` pour en savoir plus.

source: Before you begin
fr: Avant de commencer

source: This guide assumes you are setting up a single testnet masternode for the first time. If you are updating a masternode, see :ref:`here <masternode-update>` instead. You will need:
fr: Ce guide présuppose que vous mettez en place un seul masternode sur réseau de test, pour la première fois. Pour mettre à jour un masternode existant, voyez plutôt :ref:`ici <masternode-update>`. Voici ce dont vous aurez besoin :

source: 1000 Dash
fr: 1000 dashs

source: A wallet to store your Dash, preferably a hardware wallet, although Dash Core wallet is also supported
fr: un portefeuille pour stocker vos dashs, de préférence un portefeuille matériel, bien que le portefeuille logiciel Dash Core soit aussi envisageable

source: A Linux server, preferably a Virtual Private Server (VPS)
fr: un serveur Linux, de préférence un serveur privé virtuel (VPS)

source: Dash 0.13.0 and later implement DIP003, which introduces several changes to how a Dash masternode is set up and operated. While this network upgrade was completed in early 2019, a list of available documentation appears below:
fr: Dash version 0.13.0 et ultérieure met en œuvre la DIP003, qui introduit certains changements dans la façon d'installer et de gérer un masternode. Bien que cette mise à jour du réseau ait été achevée début 2019, veuillez trouver ci-dessous une liste de sa documentation disponible :

source: `DIP003 Deterministic Masternode Lists <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
fr: `DIP003 Listes de masternodes déterministes <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__

source: `Dash 0.13 Upgrade Procedure for Masternodes (legacy documentation) <https://docs.dash.org/en/0.13.0/masternodes/dip3-upgrade.html>`__
fr: :ref:`Procédure de mise à jour Dash 0.13 pour les masternodes (documentation archivée) <dip3-upgrade>`

source: :ref:`Full masternode setup guide <masternode-setup>` (you are here)
fr: :ref:`Guide complet de mise en place d'un masternode <masternode-setup>` (you are here)

source: :ref:`Information for users of hosted masternodes <hosted-setup>`
fr: :ref:`Information pour les utilisateurs de masternodes hébergés <hosted-setup>`

source: :ref:`Information for operators of hosted masternodes <operator-transactions>`
fr: :ref:`Information pour les opérateurs de masternodes hébergés <operator-transactions>`

source: This documentation describes the commands as if they were entered in the Dash Core GUI by opening the console from **Tools > Debug console**, but the same result can be achieved on a masternode by entering the same commands and adding the prefix ``~/.dashcore/dash-cli`` to each command.
fr: Les commandes indiquées ci-dessous peuvent être saisies dans la console Dash Core ouverte par le menu **Outils > Console de débogage**, mais le même résultat peut être obtenu sur un masternode en entrant les mêmes commandes, chacune précédée par ``~/.dashcore/dash-cli ``.

source: Set up your VPS
fr: Configuration de votre VPS

source: A VPS, more commonly known as a cloud server, is fully functional installation of an operating system (usually Linux) operating within a virtual machine. The virtual machine allows the VPS provider to run multiple systems on one physical server, making it more efficient and much cheaper than having a single operating system running on the "bare metal" of each server. A VPS is ideal for hosting a Dash masternode because they typically offer guaranteed uptime, redundancy in the case of hardware failure and a static IP address that is required to ensure you remain in the masternode payment queue. While running a masternode from home on a desktop computer is technically possible, it will most likely not work reliably because most ISPs allocate dynamic IP addresses to home users.
fr: Un VPS, plus connu sous le nom de "serveur dans le nuage", est une installation entièrement fonctionnelle d'un système d'exploitation (Linux, en général) exécutée dans une machine virtuelle. La machine virtuelle permet au fournisseur de VPS de faire tourner de nombreux systèmes sur un seul serveur physique, rendant l'ensemble plus efficace et beaucoup moins cher que de faire tourner un unique système d'exploitation sur le "métal nu" de chaque serveur. Un VPS est idéal pour héberger un masternode Dash car les VPS proposent en général une garantie sur la disponibilité, une redondance dans le cas de problèmes matériels et une adresse IP statique qui est indispensable pour que votre masternode ne soit pas éjecté de la file d'attente des paiements. Bien que faire tourner un masternode depuis son domicile, sur un ordinateur de bureau, soit techniquement possible, cela ne marchera certainement pas de manière fiable car la plupart des fournisseurs d'accès allouent des adresses IP dynamiques aux utilisateurs domestiques.

source: We will use `Vultr <https://www.vultr.com/>`_ hosting as an example of a VPS, although `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https://aws.amazon.com/ec2/>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>`_ and `OVH <https://www.ovh.com.au/>`_ are also popular choices. First create an account and add credit. Then go to the **Servers** menu item on the left and click **+** to add a new server. Select a location for your new server on the following screen:
fr: Nous utiliserons l'hébergeur `Vultr <https://www.vultr.com/>`_ comme VPS pour notre exemple, bien que `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https://aws.amazon.com/ec2/>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>`_ ou encore `OVH <https://www.ovh.com/>`_ soient également des choix reconnus. Tout d'abord, créez un compte et créditez-le. Puis allez sur le menu Serveurs sur la gauche et cliquez sur **+** pour ajouter un nouveau serveur. Choisissez un endroit pour votre nouveau serveur, sur l'écran suivant :

source: Vultr server location selection screen
fr: Page Vultr de choix d'emplacement de serveur

source: Select Ubuntu 20.04 x64 as the server type. We use this LTS release of Ubuntu instead of the latest version because LTS releases are supported with security updates for 5 years, instead of the usual 9 months.
fr: Choisissez Ubuntu 20.04 x64 comme type de serveur. Nous utilisons cette version LTS d'Ubuntu plutôt que la version la plus récente, car les versions LTS d'Ubuntu se voient fournir des mises à jour de sécurité pendant 5 ans, plutôt que pendant les 9 mois habituels.

source: Vultr server type selection screen
fr: Page Vultr de choix du type de serveur

source: Select a server size offering at least 2GB of memory.
fr: Choisissez une taille de serveur avec au moins 2 Go de mémoire vive.

source: Vultr server size selection screen
fr: Page Vultr de choix de taille de serveur

source: Enter a hostname and label for your server. In this example we will use ``dashmn1`` as the hostname.
fr: Tapez un nom d'hôte et une étiquette pour votre serveur. Dans cet exemple, nous utiliserons "dashmn1" comme nom d'hôte.

source: Vultr server hostname & label selection screen
fr: Page Vultr de choix du nom d'hôte et de l'étiquette du serveur

source: Vultr will now install your server. This process may take a few minutes.
fr: Vultr installe à présent votre serveur. Cette étape peut prendre quelques minutes.

source: Vultr server installation screen
fr: Page Vultr d'installation du serveur

source: Click **Manage** when installation is complete and take note of the IP address, username and password.
fr: Cliquez sur **Gérer** quand l'installation est terminée et prenez note de l'adresse IP, du nom d'utilisateur et du mot de passe.

source: Vultr server management screen
fr: Page Vultr de gestion du serveur

source: Set up your operating system
fr: Configuration de votre système d'exploitation

source: We will begin by connecting to your newly provisioned server. On Windows, we will first download an app called PuTTY to connect to the server. Go to the `PuTTY download page <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ and select the appropriate MSI installer for your system. On Mac or Linux you can ssh directly from the terminal - simply type ``ssh root@<server_ip>`` and enter your password when prompted.
fr: Nous commencerons par nous connecter à votre serveur fraîchement créé. Sous Windows, vous devrez d'abord télécharger une application appelée PuTTY pour vous connecter au serveur. Allez sur la `page de téléchargement de PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ et choisissez l'installeur MSI approprié à votre ordinateur. Sur Mac ou Linux, vous pouvez vous connecter directement par ssh depuis le Terminal — tapez simplement ``ssh root@<server_ip>`` puis votre mot de passe quand il vous est demandé.

source: PuTTY download page
fr: Page de téléchargement de PuTTY

source: Double-click the downloaded file to install PuTTY, then run the app from your Start menu. Enter the IP address of the server in the **Host Name** field and click **Open**. You may see a certificate warning, since this is the first time you are connecting to this server. You can safely click **Yes** to trust this server in the future.
fr: Double-cliquez sur le fichier téléchargé pour installer PuTTY, puis lancez l'application depuis votre menu Démarrer. Tapez l'adresse IP du serveur dans le champ **Nom d'hôte** puis cliquez sur **Ouvrir**. Il est possible qu'un avertissement sur le certificat vous soit affiché, puisque c'est votre première connexion à ce serveur. Vous pouvez sans risque cliquer sur **Oui** pour faire confiance à ce serveur à l'avenir.

source: PuTTY security alert when connecting to a new server
fr: Alerte de sécurité de PuTTY à la connexion à un nouveau serveur

source: You are now connected to your server and should see a terminal window. Begin by logging in to your server with the user ``root`` and password supplied by your hosting provider.
fr: Vous êtes maintenant connecté à votre serveur et vous devriez voir une fenêtre de terminal. Commencez par vous identifier sur votre serveur avec l'utilisateur "root" et le mot de passe fourni par votre hébergeur.

source: Password challenge when connecting to your VPS for the first time
fr: Demande de mot de passe à la première connexion à votre VPS

source: You should immediately change the root password and store it in a safe place for security. You can copy and paste any of the following commands by selecting them in your browser, pressing **Ctrl + C**, then switching to the PuTTY window and right-clicking in the window. The text will paste at the current cursor location::
fr: Il vous est fortement conseillé de modifier sans attendre le mot de passe de "root" et de le garder dans un endroit sûr. Vous pouvez copier et coller chacune des commandes suivantes en les sélectionnant dans votre navigateur, en faisant la combinaison de touches **Ctrl-C** puis en revenant sur le fenêtre PuTTY pour y faire un clic-droit. Le texte se collera à la position actuelle du curseur ::

source: Enter and confirm a new password (preferably long and randomly generated). Next we will create a new user with the following command, replacing ``<username>`` with a username of your choice::
fr: Tapez et confirmez un nouveau mot de passe (de préférence long et généré aléatoirement). Ensuite, nous allons créer un nouvel utilisateur avec la commande suivante, en remplaçant ``<username>`` par le nom d'utilisateur de votre choix ::

source: You will be prompted for a password. Enter and confirm using a new password (different to your root password) and store it in a safe place. You will also see prompts for user information, but this can be left blank. Once the user has been created, we will add them to the sudo group so they can perform commands as root::
fr: Un mot de passe vous sera demandé. Tapez un nouveau mot de passe (différent de votre mot de passe "root") puis confirmez-le. Conservez-le ensuite dans un endroit sûr. Il vous sera aussi demandé différentes informations sur l'utilisateur, mais vous pouvez les laisser vides. Une fois l'utilisateur créé, nous allons l'ajouter au groupe "sudo" de manière à ce qu'il puisse passer des commandes en tant que "root" ::

source: Now, while still as root, we will update the system from the Ubuntu package repository::
fr: Maintenant, toujours en tant que "root", nous allons mettre à jour le système directement depuis le dépôt logiciel Ubuntu ::

source: The system will show a list of upgradable packages. Press **Y** and **Enter** to install the packages. We will now install a firewall, add swap memory and reboot the server to apply any necessary kernel updates, and then login to our newly secured environment as the new user::
fr: Le système affiche une liste de paquets prêts à être mis à jour. Appuyez sur **O** et **Entrée** pour installer les paquets. Nous allons maintenant installer un pare-feu, ajouter de la mémoire virtuelle et redémarrer le serveur pour que soit appliquée toute mise à jour nécessaire du noyau. Puis nous nous connecterons en tant que nouvel utilisateur à notre environnement fraîchement sécurisé ::

source: (press **Y** and **Enter** to confirm)
fr: (appuyez sur **O** et **Entrée** pour confirmer)

source: Add the following line at the end of the file (press tab to separate each word/number), then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file.
fr: Ajoutez la ligne suivante à la fin du fichier (appuyez sur Tabulation pour séparer chaque mot ou nombre), puis faites la combinaison de touches **Ctrl-X** pour fermer l'éditeur de texte, puis appuyez sur **O** et **Entrée** pour enregistrer le fichier.

source: Finally, in order to prevent brute force password hacking attacks, we will install fail2ban and disable root login over ssh. These steps are optional, but highly recommended. Start with fail2ban::
fr: Enfin, pour empêcher les attaques par force brute sur les mots de passe, nous allons installer fail2ban et désactiver le login root par SSH. Ces étapes sont facultatives, mais hautement recommandées. Commencez par fail2ban :

source: Create a new configuration file::
fr: Créez un nouveau fichier de configuration :

source: And paste in the following configuration::
fr: Collez-y la configuration suivante :

source: Then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file. Retart and enable the fail2ban service::
fr: Puis faites la combinaison de touches **Ctrl-X** pour fermer l'éditeur de texte, puis **O** et **Entrée** pour enregistrer le fichier. Redémarrez et activez le service fail2ban :

source: Next, open the SSH configuration file to disable root login over SSH::
fr: Ensuite, ouvrez le fichier de configuration SSH pour désactiver le login root par SSH ::

source: Locate the line that reads ``PermitRootLogin yes`` and set it to ``PermitRootLogin no``. Directly below this, add a line which reads ``AllowUsers <username>``, replacing ``<username>`` with the username you selected above. Then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file.
fr: Repérez la ligne ``PermitRootLogin yes`` et changez-la en ``PermitRootLogin no``. Juste en-dessous, ajoutez une ligne ``AllowUsers <username>``, en remplaçant ``<username>`` avec le nom d'utilisateur que vous avez choisi plus haut. Puis faites la combinaison de touches **Ctrl-X** pour fermer l'éditeur de texte, puis **Y** et **Entrée** pour enregistrer le fichier.

source: Then reboot the server::
fr: Puis redémarrez le serveur :

source: PuTTY will disconnect when the server reboots.
fr: PuTTY se déconnectera au redémarrage du serveur.

source: While this setup includes basic steps to protect your server against attacks, much more can be done. In particular, `authenticating with a public key <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ instead of a username/password combination and `enabling automatic security updates <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_ is advisable. More tips are available `here <https://www.cyberciti.biz/tips/linux-security.html>`__. However, since the masternode does not actually store the keys to any Dash, these steps are considered beyond the scope of this guide.
fr: Ce guide comprend les étapes de base pour protéger votre serveur des attaques, mais on peut faire beaucoup plus. En particulier, on peut `s'authentifier avec une clé publique <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ plutôt qu'avec une combinaison nom d'utilisateur/mot de passe et `activer les mises à jour automatiques de sécurité <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_. Plus d'astuces sont disponibles `ici <https://www.cyberciti.biz/tips /linux-security.html>`__. Cependant, puisque le masternode ne stocke pas les clés de fonds Dash, ces étapes sont considérées comme en dehors de la portée de ce guide.

source: Send the collateral
fr: Envoi de la caution

source: A Dash address with a single unspent transaction output (UTXO) of exactly 1000 DASH is required to operate a masternode. Once it has been sent, various keys regarding the transaction must be extracted for later entry in a configuration file and registration transaction as proof to write the configuration to the blockchain so the masternode can be included in the deterministic list. A masternode can be registered from a hardware wallet or the official Dash Core wallet, although a hardware wallet is highly recommended to enhance security and protect yourself against hacking. This guide will describe the steps for both hardware wallets and Dash Core.
fr: Une adresse Dash avec une unique transaction de sortie non dépensée (UTXO) d'un montant exact de 1000 dashs est obligatoire pour mettre en place un masternode. Une fois cette transaction exécutée, différentes clés qui lui sont relatives doivent être collectées pour être, plus tard, saisies dans un fichier de configuration et dans une transaction d'enregistrement, en tant que preuve permettant d'enregistrer la configuration sur la blockchain et d'inclure le masternode dans la liste déterministe. Un masternode peut être démarré depuis un portefeuille matériel ou depuis le portefeuille logiciel officiel Dash Core, bien qu'un portefeuille matériel soit hautement recommandé pour améliorer la sécurité et vous protéger du piratage. Ce guide décrit toutes les étapes aussi bien pour les portefeuilles matériels que pour le portefeuille logiciel Dash Core.

source: Option 1: Holding collateral in a hardware wallet
fr: Option 1 : Détenir la caution dans un portefeuille matériel

source: Set up your Trezor using the Trezor wallet at https://wallet.trezor.io/ and send a test transaction to verify that it is working properly. For help on this, see :ref:`this guide <hardware-trezor>` - you may also choose to (carefully!) `add a passphrase <https://blog.trezor.io/passphrase-the-ultimate-protection-for-your-accounts-3a311990925b>`_ to your Trezor to further protect your collateral. Create a new account in your Trezor wallet by clicking **Add account**. Then click the **Receive** tab and send exactly 1000 DASH to the address displayed. If you are setting up multiple masternodes, send 1000 DASH to consecutive addresses within the same new account. You should see the transaction as soon as the first confirmation arrives, usually within a few minutes.
fr: Configurez votre Trezor en utilisant le portefeuille Trezor à l'adresse https://wallet.trezor.io/ et envoyez-lui une transaction d'essai pour vérifier que tout fonctionne bien. Pour obtenir de l'aide sur cette étape, voir :ref:`ce guide <hardware-trezor>`. Vous pouvez aussi (avec prudence !) `ajouter une phrase de passe <https://blog.trezor.io/passphrase-the-ultimate-protection-for-your-accounts-3a311990925b>`_ à votre Trezor pour protéger encore mieux votre caution. Créez un nouveau compte dans votre portefeuille Trezor en cliquant sur **Ajouter un compte**. Puis cliquez sur l'onglet **Recevoir** et envoyez exactement 1000 dashs à l'adresse affichée. Si vous mettez en place plusieurs masternodes, envoyez 1000 dashs aux adresses consécutives du même compte. Vous devriez voir la transaction arriver dès les premières confirmations, en général sous quelques minutes.

source: Trezor Wallet Receive tab showing successfully received collateral of 1000 DASH
fr: Onglet Recevoir du portefeuille Trezor, montrant une caution de 1000 dashs bien reçue

source: Once the transaction appears, click the QR code on the right to view the transaction on the blockchain. Keep this window open as we complete the following steps, since we will soon need to confirm that 15 confirmations exist, as shown in the following screenshot.
fr: Une fois la transaction apparue, cliquez sur le QR-code à droite pour afficher la transaction dans la blockchain. Gardez cette fenêtre ouverte le temps des étapes suivantes, car nous aurons bientôt à vérifier que les 15 confirmations ont bien eu lieu, comme dans la capture d'écran suivante.

source: Trezor blockchain explorer showing 15 confirmations for collateral transfer
fr: Explorateur de blocs de Trezor montrant 15 confirmations pour le transfert de la caution
