Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup-testnet.po
Languages: fr

source: While we are waiting for 15 confirmations, download the latest version of the Dash Masternode Tool (DMT) from the GitHub releases page `here <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Unzip and run the file. The following window appears.
fr: Pendant que nous attendons les 15 confirmations, téléchargez la plus récente version de DashMasternodeTool (DMT) depuis la page GitHub `ici <https://github.com/Bertrand256/dash-masternode- tool/releases>`_. Décompressez le fichier et lancez l'exécutable. La fenêtre suivante s'affiche.

source: Dash Masternode Tool startup screen
fr: Écran de démarrage de DashMasternodeTool

source: Click the third button from the left **Check Dash Network Connection** in the top left corner of the main window to verify that the connection is working. Then connect your Trezor device and click the next button **Test Hardware Wallet Connection** to verify the Trezor connection is working.
fr: Cliquez sur le troisième bouton depuis la gauche, **Vérifier la connexion au réseau Dash**, dans le coin supérieur gauche de la fenêtre principale, pour vérifier que la connexion fonctionne. Puis connectez votre appareil Trezor et cliquez sur **Tester la connexion au portefeuille matériel** pour vérifier que la connexion au Trezor fonctionne.

source: Dash Masternode Tool successful connection confirmations
fr: Confirmations de connexion réussie dans DashMasternodeTool

source: We will now use DMT to enter some basic information about the masternode and extract the transaction ID. Carry out the following sequence of steps as shown in this screenshot:
fr: Nous allons maintenant nous servir de DMT pour saisir quelques informations de base sur le masternode, et extraire l'identifiant de transaction. Suivez les étapes ci-dessous, telles que montrées dans cette capture d'écran :

source: Dash Masternode Tool configuration steps
fr: Étapes de configuration de DashMasternodeTool

source: Click the **New** button.
fr: Cliquez sur le bouton **Nouveau**.

source: Enter a name for your masternode. The host name you specified for your VPS above is a good choice.
fr: Tapez un nom pour votre masternode. Le nom d'hôte que vous avez indiqué précédemment pour votre VPS est un bon choix.

source: Enter the IP address of your masternode. This was given to you by the VPS provider when you set up the server. Then enter the TCP port number. This should be 19999.
fr: Tapez l'adresse IP de votre masternode. Elle vous a été donnée par l'hébergeur de VPS, à la mise en place de votre serveur. Puis entrez le numéro du port TCP, qui devrait être 19999.

source: Click **Locate collateral** to view unused collateral funding transactions available on the connected hardware wallet. Select the address to which you sent 1000 Dash and click **Apply**. The **Collateral address**, **path**, **Collateral TX hash** and **index** fields should be filled automatically.
fr: Cliquez sur **Locate collateral** (Trouver la caution) pour afficher les transactions de caution inutilisées qui sont disponibles sur le portefeuille matériel. Choisissez l'adresse à laquelle vous avez envoyé les 1000 dashs puis cliquer sur **Apply** (Appliquer). Les champs **Collateral address** (Adresse de caution), **index** et **Collateral TX hash** (Empreinte de la transaction de caution) devraient être remplis automatiquement.

source: Dash Masternode Tool with masternode configuration
fr: DashMasternodeTool avec une configuration de masternode

source: Leave DMT open and continue with the next step: :ref:`installing Dash Core on your VPS <testnet-masternode-setup-install>`.
fr: Laissez DMT ouvert puis passez à l'étape suivante : :ref:`installer Dash Core sur votre VPS <testnet-masternode-setup-install>`.

source: Option 2: Holding collateral in Dash Core wallet
fr: Option 2 : Détenir la caution dans un portefeuille logiciel Dash Core

source: Open Dash Core wallet and wait for it to synchronize with the network. It should look like this when ready:
fr: Lancez le portefeuille logiciel Dash Core et attendez qu'il se synchronise avec le réseau. Il devrait ressembler à ça, une fois prêt :

source: Fully synchronized Dash Core wallet
fr: Portefeuille logiciel Dash Core entièrement synchronisé

source: Click **Tools > Debug console** to open the console. Type the following command into the console to generate a new Dash address for the collateral::
fr: Cliquez sur **Outils > Console de débogage** pour ouvrir la console. Tapez la commande suivante dans la console pour générer une adresse neuve pour la caution ::

source: Take note of the collateral address, since we will need it later. The next step is to secure your wallet (if you have not already done so). First, encrypt the wallet by selecting **Settings > Encrypt wallet**. You should use a strong, new password that you have never used somewhere else. Take note of your password and store it somewhere safe or you will be permanently locked out of your wallet and lose access to your funds. Next, back up your wallet file by selecting **File > Backup Wallet**. Save the file to a secure location physically separate to your computer, since this will be the only way you can access our funds if anything happens to your computer. For more details on these steps, see :ref:`here <dashcore-backup>`.
fr: Prenez bonne note de l'adresse de la caution, car vous en aurez besoin plus tard. La prochaine étape est de sécuriser votre portefeuille (si vous ne l'avez pas déjà fait). Tout d'abord, chiffrez votre portefeuille en allant sur le menu **Réglages > Chiffrer le portefeuille**. Il vous est conseillé d'utiliser un mot de passe fort, nouveau, que vous n'avez jamais utilisé ailleurs. Prenez note de votre mot de passe et conservez-le dans un endroit sûr, sinon votre portefeuille vous sera inaccessible de manière définitive et vous perdrez tout accès à vos fonds. Ensuite, sauvegardez le fichier de votre portefeuille en allant dans le menu **Fichier > Sauvegarder le portefeuille**. Enregistrez le fichier dans un endroit sûr et physiquement séparé de votre ordinateur, car il sera le seul moyen d'accéder à vos fonds si quoi que ce soit arrive à votre ordinateur. Pour en savoir plus sur ces étapes, voir :ref:`ici <dashcore-backup>`.

source: Now send exactly 1000 DASH in a single transaction to the new address you generated in the previous step. This may be sent from another wallet, or from funds already held in your current wallet. Once the transaction is complete, view the transaction in a `blockchain explorer <https://insight.dash.org/insight/>`_ by searching for the address. You will need 15 confirmations before you can register the masternode, but you can continue with the next step at this point already: generating your masternode operator key.
fr: À présent, envoyez exactement 1000 dashs, en une seule transaction, à l'adresse que vous avez générée à l'étape précédente. Cette somme peut être envoyée depuis un autre portefeuille, ou depuis des fonds déjà présents dans ce portefeuille-ci. Une fois la transaction achevée, affichez la transaction dans un `explorateur de blocs <https://insight.dash.org/insight/>`_ en recherchant l'adresse. Vous aurez besoin de 15 confirmations avant de pouvoir enregistrer le masternode, mais vous pouvez passer sans attendre à l'étape suivante : générer la clé d'opérateur de votre masternode.

source: Masternode Installation
fr: Installation de masternode

source: The following tools are available for installing a Dash masternode:
fr: Les outils suivants sont disponibles pour installer un masternode Dash :

source: :ref:`dashmate installation <testnet-masternode-setup-install-dashmate>`
fr: :ref:`installation Dashmate <testnet-masternode-setup-install-dashmate>`

source: :ref:`Manual installation <testnet-masternode-setup-install-manual>`
fr: :ref:`installation manuelle <testnet-masternode-setup-install-manual>`

source: `Dash Masternode Zeus <https://github.com/kxcd/Masternode-Zeus>`__ (does not yet support platform services)
fr: `Dash Masternode Zeus <https://github.com/kxcd/Masternode-Zeus>`__ (ne supporte pas encore les services de plateforme)

source: dashmate installation
fr: installation Dashmate

source: ``dashmate`` replaces the `dashman <https://github.com/moocowmoo/dashman/>`__ masternode installer by moocowmoo. dashmate is based on Docker technology and features an interactive setup command and the ability to manage multiple node configs and multiple networks. It handles the installation of Dash Core and Tenderdash, as well as all dependencies and supporting services. Full dashmate documentation is available `here <https://github.com/dashevo/dashmate#readme>`__.
fr: ``Dashmate`` remplace l'ancien installeur de masternode `Dashman <https://github.com/moocowmoo/dashman/>`__ de Moocowmoo. Dashmate se base sur la technologie Docker et propose une commande d'installation interactive, et la possibilité de gérer des configurations de nœud multiples et des réseaux multiples. Il gère l'installation de Dash Core et de Tenderdash, aussi bien que les dépendances et les services supportés. La documentation complète de Dashmate est consultable `ici <https://github.com/dashevo/dashmate#readme>`__.

source: Open PuTTY or a console again and connect using the username and password you just created for your new, non-root user. Begin by installing dashmate dependencies::
fr: Lancez une nouvelle fois PuTTY ou une console de terminal, et connectez-vous avec le nom d'utilisateur et le mot de passe que vous venez de créer pour votre nouvel utilisateur non-root. Commencez par installer les dépendances Dashmate :

source: Add your current user to the docker group, ensure docker starts on boot and refresh the environment::
fr: Ajoutez votre utilisateur actuel au groupe Docker, assurez-vous que Docker est lancé au démarrage et réactualisez l'environnement :

source: Clone the dashmate repository, set up the dependencies and link the CLI::
fr: Dupliquez le dépôt Dashmate, installez les dépendances et liez la CLI :

source: Run the interactive setup wizard::
fr: Lancez l'assistant d'installation interactif :

source: You will be prompted to select a network, node type, IP address and BLS private key. Enter this information or accept the detected/generated defaults. Start your node as follows::
fr: Il vous sera demandé de choisir un réseau, un type de nœud, une adresse IP et une clé privée BLS. Saisissez ces informations ou acceptez les valeurs par défaut détectées ou générées. Démarrez votre nœud comme suit :

source: You can manage your masternode status, configuration, and running state entirely from within dashmate. See the documentation `here <https://github.com/dashevo/dashmate#readme>`__ or use the built-in help system to learn more:
fr: Vous pouvez gérer l'état de votre masternode, sa configuration, et le lancer entièrement depuis Dashmate. Consultez la documentation `ici <https://github.com/dashevo/dashmate#readme>`__ ou utilisez l'aide intégrée pour en savoir plus :

source: dashmate displaying a range of status output
fr: Dashmate affichant une série d'états

source: You can check the status of your masternode using the various ``dashmate status`` commands as follows::
fr: Vous pouvez consulter l'état de votre masternode en utilisant les différentes commandes ``dashmate status`` comme suit :

source: Continue with the :ref:`Registration step <testnet-register-masternode>` to setup the collateral, keys and construct the ProTx transaction required to enable your masternode.
fr: Continuez avec :ref:`l'étape d'enregistrement <testnet-register-masternode>` pour mettre en place la caution et les clés, et construire la transaction ProTx indispensable pour activer votre masternode.

source: Masternode Update
fr: Mise à jour de masternode

source: Masternode registration
fr: Enregistrement de masternode

source: DIP003 introduced several changes to how a masternode is set up and operated. These changes and the three keys required for the different masternode roles are described briefly under :ref:`dip3-changes` in this documentation.
fr: La DIP003 a inauguré plusieurs changements sur la façon de mettre en place et d'opérer un masternode. Ces changements et les trois clés requises pour les différents rôles de masternode sont décrits brièvement dans la section :ref:`dip3-changes` de la présente documentation.

source: Option 1: Registering from a hardware wallet
fr: Option 1 : Enregistrement depuis un portefeuille matériel

source: Go back to DMT and ensure that all fields from the previous step are still filled out correctly. Click **Generate new** for the three private keys required for a DIP003 deterministic masternode:
fr: Revenez à DashMasternodeTool et assurez-vous que tous les champs de l'étape précédente sont encore remplis correctement. Cliquez sur **Generate new** (Générer nouveau) pour les trois clés privées requises pour un masternode déterministe DIP003 :

source: Owner private key
fr: Clé privée du propriétaire

source: Operator private key (generate new or use private key generated by dashmate)
fr: Clé privée d'opérateur (générez-en une neuve, ou bien utilisez la clé privée générée par Dashmate)

source: Voting private key
fr: Clé privée de vote

source: Dash Masternode Tool ready to register a new masternode
fr: DashMasternodeTool prêt à enregistrer un nouveau masternode

source: Then click **Register masternode**. Optionally specify a different **Payout address** and/or **Operator reward**, then click **Continue**. Select **Remote Dash RPC Node (automatic method)**. (See `here <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__ for documentation on using your own local RPC node.) and confirm the following two messages:
fr: Puis cliquez sur **Register masternode** (Enregistrer le masternode). Vous pouvez, facultativement, indiquer une **Payout address** (Adresse de paiement) différente et/ou une **Operator reward** (Récompense d'opérateur) différente, puis cliquez sur **Continue**. Choisissez **Remote Dash RPC Node (automatic method)** (Nœud Dash RPC distant (méthode automatique)). (Voir `ici <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__ une documentation sur l'utilisation de votre propre nœud RPC local.) Confirmez les deux messages suivants :

source: Dash Masternode Tool confirmation dialogs to register a masternode
fr: Dialogues de confirmation de DashMasternodeTool pour enregistrer un masternode

source: The public key will be used in following steps. The private key must be entered in the configuration on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner (final step below). If you are using the BLS key generated by ``dashmate setup``, this information is already configured for your masternode. If you generated your own BLS key pair, edit the dashmate configuration as follows::
fr: La clé publique sera utilisée lors des étapes suivantes. La clé privée doit être saisie dans la configuration sur le masternode. Cela permet au masternode de surveiller sur la blockchain les transactions Pro*Tx correspondantes, et cela le démarrera en tant que masternode quand la transaction signée ProRegTx sera diffusée par le propriétaire (dernière étape ci-dessous). Si vous utilisez la clé BLS générée par ``dashmate setup``, cette information est déjà configurée pour votre masternode. Si vous avez généré votre propre paire de clé BLS, modifiez la configuration Dashmate comme suit :

source: At this point you can go back to your terminal window and monitor your masternode by entering ``dashmate status`` or using the **Get status** function in DMT.
fr: Arrivé à cette étape, vous pouvez revenir à votre fenêtre de terminal et surveiller votre masternode avec la commande ``dashmate status``, ou bien en utilisant la fonction **Get status** (Voir l'état) dans DMT.

source: You can now safely log out of your server by typing ``exit``. Congratulations! Your masternode is now running.
fr: À cette étape, vous pouvez vous déconnecter de votre serveur en tapant ``exit``. Félicitations ! Votre masternode est désormais fonctionnel.

source: Option 2: Registering from Dash Core wallet
fr: Option 2 : Enregistrement depuis le portefeuille logiciel Dash Core

source: Identify the funding transaction
fr: Identifier la transaction de financement

source: If you used an address in Dash Core wallet for your collateral transaction, you now need to find the txid of the transaction. Click **Tools > Debug console** and enter the following command::
fr: Si vous avez utilisé une adresse de votre portefeuille logiciel Dash Core pour votre transaction de caution, vous devez à présent trouver l'identifiant de la transaction. Cliquez sur **Outils > Console de débogage** et tapez la commande suivante ::

source: This should return a string of characters similar to the following::
fr: Cela devrait vous renvoyer une chaîne de caractères analogue à celle-ci ::

source: The first long string is your ``collateralHash``, while the last number is the ``collateralIndex``.
fr: La première chaîne, longue, est votre ``collateralHash``, et le nombre à la fin est le ``collateralIndex``.

source: Generate a BLS key pair
fr: Générer une paire de clés BLS

source: A public/private BLS key pair is required to operate a masternode. The private key is specified on the masternode itself, and allows it to be included in the deterministic masternode list once a provider registration transaction with the corresponding public key has been created.
fr: Une paire de clés BLS publique/privée est obligatoire pour opérer un masternode. La clé privée est spécifiée sur le masternode lui-même, et lui permet d'être inclus dans la liste déterministe des masternodes une fois qu'une transaction d'enregistrement avec la clé publique correspondante a été créée.

source: If you are using a hosting service, they may provide you with their public key, and you can skip this step. If you are hosting your own masternode or have agreed to provide your host with the BLS private key, you can use the BLS key generated by the ``dashmate setup`` command. Alternatively, you can generate a BLS public/private keypair in Dash Core by clicking **Tools > Debug console** and entering the following command::
fr: Si vous utilisez un service d'hébergement de masternode, il vous fournira sa clé publique, et vous pouvez sauter cette étape. Si vous hébergez vous-même votre masternode ou avez convenu avec votre hébergeur que vous lui fournirez votre clé privée BLS, vous pouvez utiliser la clé BLS générée par la commande ``dashmate setup``. Alternativement, vous pouvez générer une paire de clés BLS publique et privée dans le portefeuille logiciel Dash Core en choisissant le menu **Outils > Console de débogage** et en saisissant la commande suivante :

source: **These keys are NOT stored by the wallet or dashmate and must be kept secure, similar to the value provided in the past by the** ``masternode genkey`` **command.**
fr: **Ces clés ne sont PAS stockées par le portefeuille ni par Dashmate, et elles doivent être conservées dans un lieu sûr**, à l'image de la valeur que retournait, par le passé, la commande ``masternode genkey``.

source: Add the private key to your masternode configuration
fr: Ajouter la clé privée à la configuration de votre masternode

source: The public key will be used in following steps. The private key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner (final step below). If you are using the BLS key generated by ``dashmate setup``, this information is already configured for your masternode. If you generated your own BLS key pair, edit the dashmate configuration as follows::
fr: La clé publique sera utilisée lors des étapes suivantes. La clé privée doit être saisie dans le fichier ``dash.conf`` sur le masternode. Cela permet au masternode de surveiller sur la blockchain les transactions Pro*Tx correspondantes, et cela le démarrera en tant que masternode quand la transaction signée ProRegTx sera diffusée par le propriétaire (dernière étape ci-dessous). Si vous utilisez la clé BLS générée par ``dashmate setup``, cette information est déjà configurée pour votre masternode. Si vous avez généré votre propre paire de clé BLS, modifiez la configuration Dashmate comme suit :

source: We will now prepare the transaction used to register the masternode on the network.
fr: Nous allons maintenant préparer la transaction qui sera utilisée pour enregistrer le masternode sur le réseau.

source: Prepare a ProRegTx transaction
fr: Préparer une transaction ProRegTx

source: A pair of BLS keys for the operator were already generated above, and the private key was entered on the masternode. The public key is used in this transaction as the ``operatorPubKey``.
fr: Une paire de clés BLS pour l'opérateur a déjà été générée ci-dessus, et la clé privée a été entrée sur le masternode. La clé publique est utilisée dans cette transaction en tant que ``operatorPubKey``.

source: First, we need to get a new, unused address from the wallet to serve as the **owner key address** (``ownerKeyAddr``). This is not the same as the collateral address holding 1000 Dash. Generate a new address as follows::
fr: D'abord, nous devons obtenir du portefeuille une adresse neuve et inutilisée, qui servira comme **adresse de clé du propriétaire** (``ownerKeyAddr``). Elle est différente de l'adresse de la caution de 1000 dashs. Générez une nouvelle adresse comme suit :

source: This address can also be used as the **voting key address** (``votingKeyAddr``). Alternatively, you can specify an address provided to you by your chosen voting delegate, or simply generate a new voting key address as follows::
fr: Cette adresse peut aussi être utilisée comme **adresse de clé de vote** (``votingKeyAddr``). Alternativement, vous pouvez indiquer une adresse fournie par votre délégataire de vote, ou bien simplement générer une nouvelle adresse de clé de vote, comme suit :

source: Then either generate or choose an existing address to receive the **owner's masternode payouts** (``payoutAddress``). It is also possible to use an address external to the wallet::
fr: Ensuite, générez une seconde adresse ou choisissez une adresse déjà existante, qui servira au propriétaire pour recevoir les **paiements du propriétaire du masternode** (``payoutAddress``). Il est également possible d'utiliser une adresse externe au portefeuille :

source: You can also optionally generate and fund another address as the **transaction fee source** (``feeSourceAddress``). If you selected an external payout address, you must specify a fee source address.
fr: Vous pouvez aussi, facultativement, générer et alimenter une troisième adresse comme **source des frais de transaction** (``feeSourceAddress``). Si vous avez choisi une adresse de paiement externe, vous devez indiquer une adresse source pour les frais.

source: Either the payout address or fee source address must have enough balance to pay the transaction fee, or the ``register_prepare`` transaction will fail.
fr: L'une de ces deux adresses, de paiement ou de frais, doit avoir un solde suffisant pour régler les frais de transaction, faute de quoi la transaction ``register_prepare`` échouera.
