Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup.po
Languages: fr

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. We now need to restart the masternode for this change to take effect. Enter the following commands, waiting a few seconds in between to give Dash Core time to shut down::
fr: Appuyez sur **Entrée** pour vous assurer qu'il y ait une ligne vide à la fin du fichier, puis faites la combinaison de touches **Ctrl-X** pour fermer l'éditeur de texte et **O** et **Entrée** pour enregistrer le fichier. Nous devons maintenant redémarrer le masternode pour que ce changement prenne effet. Saisissez les commandes suivantes en laissant passer quelques secondes après chacune, pour laisser à Dash Core le temps de se fermer ::

source: At this point you can monitor your masternode using ``dashman/dashman status``, by entering ``~/.dashcore/dash-cli masternode status`` or using the **Get status** function in DMT. The final result should appear as follows:
fr: Arrivé à cette étape, vous pouvez surveiller votre masternode avec la commande ``dashman/dashman status``, en tapant la commande ``~/.dashcore/dash-cli masternode status``, ou bien en utilisant la fonction **Get status** (Voir l'état) dans DMT. Le résultat final devrait ressembler à ceci :

source: dash-cli masternode status output showing successfully started masternode
fr: Message d'état de dash-cli pour un masternode bien démarré

source: At this point you can safely log out of your server by typing ``exit``. Congratulations! Your masternode is now running.
fr: À cette étape, vous pouvez vous déconnecter de votre serveur en tapant ``exit``. Félicitations ! Votre masternode est désormais fonctionnel.

source: Option 2: Registering from Dash Core wallet
fr: Option 2 : Enregistrement depuis le portefeuille logiciel Dash Core

source: Identify the funding transaction
fr: Identifier la transaction de financement

source: If you used an address in Dash Core wallet for your collateral transaction, you now need to find the txid of the transaction. Click **Tools > Debug console** and enter the following command::
fr: Si vous avez utilisé une adresse de votre portefeuille logiciel Dash Core pour votre transaction de caution, vous devez à présent trouver l'identifiant de la transaction. Cliquez sur **Outils > Console de débogage** et tapez la commande suivante ::

source: This should return a string of characters similar to this::
fr: Cela devrait vous renvoyer une chaîne de caractères analogue à celle-ci ::

source: The first long string is your transaction hash, while the last number is the index.
fr: La première chaîne, longue, est votre empreinte de transaction, et le nombre à la fin est son index.

source: Generate a BLS key pair
fr: Générer une paire de clés BLS

source: A public/private BLS key pair is required for the operator of the masternode. If you are using a hosting service, they may provide you with their public key, and you can skip this step. If you are hosting your own masternode or have agreed to provide your host with the BLS private key, generate a BLS public/private keypair as follows::
fr: Une paire de clés BLS publique et privée est obligatoire pour l'opérateur du masternode. Si vous utilisez un service d'hébergement de masternode, il vous fournira sa clé publique, et vous pouvez sauter cette étape. Si vous hébergez vous-même votre masternode ou avez convenu avec votre hébergeur que vous lui fournirez votre clé privée BLS, générez une paire de clés BLS publique et privée comme suit :

source: **These keys are NOT stored by the wallet and must be kept secure, similar to the value provided in the past by the** ``masternode genkey`` **command.**
fr: **Ces clés ne sont PAS stockées par le portefeuille et doivent être conservées dans un lieu sûr**, à l'image de la valeur que retournait, par le passé, la commande ``masternode genkey``.

source: Add the private key to your masternode configuration
fr: Ajouter la clé privée à la configuration de votre masternode

source: The public key will be used in following steps. The private key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the network for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner (final step below). Log in to your masternode using ``ssh`` or PuTTY and edit the configuration file on your masternode as follows::
fr: La clé publique sera utilisée lors des étapes suivantes. La clé privée doit être saisie dans le fichier ``dash.conf`` sur le masternode. Cela permet au masternode de surveiller sur la blockchain les transactions Pro*Tx correspondantes, et cela le démarrera en tant que masternode quand la transaction signée ProRegTx sera diffusée par le propriétaire (dernière étape ci-dessous). Connectez-vous à votre masternode avec ``ssh`` ou PuTTY, puis modifiez le fichier de configuration sur votre masternode, comme suit :

source: We will now prepare the transaction used to register a DIP003 masternode on the network.
fr: Nous allons maintenant préparer la transaction qui sera utilisée pour enregistrer le masternode DIP003 sur le réseau.

source: Prepare a ProRegTx transaction
fr: Préparer une transaction ProRegTx

source: First, we need to get a new, unused address from the wallet to serve as the owner address. This is different to the collateral address. It must also be used as the voting address if Spork 15 is not yet active. Generate a new address as follows::
fr: D'abord, nous devons obtenir du portefeuille une adresse neuve et inutilisée, qui servira comme adresse du propriétaire. Elle est différente de l'adresse de la caution. Elle doit également être utilisée comme adresse de vote tant que le Spork 15 n'est pas encore activé. Générez une nouvelle adresse comme suit ::

source: Then either generate or choose an existing second address to receive the owner's masternode payouts. It is also possible to use an address external to the wallet::
fr: Ensuite, générez une seconde adresse ou choisissez une adresse déjà existante, qui servira au propriétaire pour recevoir les paiements du masternode. Il est également possible d'utiliser une adresse externe au portefeuille :

source: You can also optionally generate and fund a third address to pay the transaction fee. If you selected an external payout address, you must specify a fee source address. Either the payout address or fee source address must have enough balance to pay the transaction fee, or the final `register_submit` transaction will fail.
fr: Vous pouvez aussi, facultativement, générer et alimenter une troisième adresse pour régler les frais de transaction. Si vous avez choisi une adresse de paiement externe, vous devez indiquer une adresse source pour les frais. L'une de ces deux adresse, de paiement ou de frais, doit avoir un solde suffisant pour régler les frais de transaction, faute de quoi la transaction finale `register_submit` échouera.

source: The private keys to the owner and fee source addresses must exist in the wallet submitting the transaction to the network. If your wallet is protected by a password, it must now be unlocked to perform the following commands. Unlock your wallet for 5 minutes::
fr: Les clés privées des adresses du propriétaire et des frais doivent être accessibles par le portefeuille qui soumettra la transaction au réseau. Si votre portefeuille est protégé par mot de passe, il doit à présent être déverrouillé pour exécuter les commandes suivantes. Déverrouillez votre portefeuille pendant 5 minutes :

source: We will now prepare an unsigned ProRegTx special transaction using the ``protx register_prepare`` command. This command has the following syntax::
fr: Nous allons maintenant préparer une transaction spéciale ProRegTx non signée, en utilisant la commande ``protx register_prepare``. Cette commande a la syntaxe suivante :

source: Open a text editor such as notepad to prepare this command. Replace each argument to the command as follows:
fr: Ouvrez un éditeur de texte, tel que Notepad, pour préparer cette commande. Remplacez chaque argument de la commande comme suit :

source: ``collateralHash``: The txid of the 1000 Dash collateral funding transaction
fr: ``collateralHash`` : l'identifiant de la transaction (txid) de la caution de 1000 dashs

source: ``collateralIndex``: The output index of the 1000 Dash funding transaction
fr: ``collateralIndex`` : l'index de sortie de la transaction de la caution de 1000 dashs

source: ``ipAndPort``: Masternode IP address and port, in the format ``x.x.x.x:yyyy``
fr: ``ipAndPort`` : l'adresse IP et le port du masternode, suivant le format ``x.x.x.x:yyyy``

source: ``ownerKeyAddr``: The new Dash address generated above for the owner/voting address
fr: ``ownerKeyAddr`` : l'adresse Dash nouvellement générée ci-dessus, pour l'adresse du propriétaire et de vote

source: ``operatorPubKey``: The BLS public key generated above (or provided by your hosting service)
fr: ``operatorPubKey`` : la clé publique BLS générée ci-dessus (ou fournie par votre service d'hébergement de masternode)

source: ``votingKeyAddr``: The new Dash address generated above, or the address of a delegate, used for proposal voting
fr: ``votingKeyAddr`` : l'adresse Dash nouvellement générée ci-dessus, ou bien l'adresse d'un délégué, utilisée pour le vote des propositions budgétaires

source: ``operatorReward``: The percentage of the block reward allocated to the operator as payment
fr: ``operatorReward`` : le pourcentage de la récompense de bloc à allouer à l'opérateur en tant que paiement

source: ``payoutAddress``: A new or existing Dash address to receive the owner's masternode rewards
fr: ``payoutAddress`` : une adresse Dash nouvelle ou déjà existante, où le propriétaire recevra les paiements de masternode

source: ``feeSourceAddress``: An (optional) address used to fund ProTx fee. ``payoutAddress`` will be used if not specified.
fr: ``feeSourceAddress`` : une adresse (facultative) d'où seront prélevés les frais de la transaction ProTx. Si elle n'est pas spécifiée, c'est l'adresse ``payoutAddress`` qui sera utilisée.

source: Note that the operator is responsible for :ref:`specifying their own reward <dip3-update-service>` address in a separate ``update_service`` transaction if you specify a non-zero ``operatorReward``. The owner of the masternode collateral does not specify the operator's payout address.
fr: Veuillez noter qu'il revient à l'opérateur de :ref:`spécifier sa propre adresse de paiement <dip3-update-service>` avec une transaction ``update_service`` distincte, dans le cas où vous définissez une ``operatorReward`` différente de zéro. Le propriétaire de la caution du masternode ne spécifie pas lui-même l'adresse de paiement de l'opérateur.

source: Example (remove line breaks if copying)::
fr: Exemple (effacez les sauts de ligne si vous le copiez) ::

source: Output::
fr: Sortie ::

source: Next we will use the ``collateralAddress`` and ``signMessage`` fields to sign the transaction, and the output of the ``tx`` field to submit the transaction.
fr: Ensuite, nous allons utiliser les champs ``collateralAddress`` et ``signMessage`` pour signer la transaction, et la sortie du champ ``tx`` pour soumettre la transaction au réseau.

source: Sign the ProRegTx transaction
fr: Signer la transaction ProRegTx

source: We will now sign the content of the ``signMessage`` field using the private key for the collateral address as specified in ``collateralAddress``. Note that no internet connection is required for this step, meaning that the wallet can remain disconnected from the internet in cold storage to sign the message. In this example we will again use Dash Core, but it is equally possible to use the signing function of a hardware wallet. The command takes the following syntax::
fr: Nous allons maintenant signer le contenu du champ ``signMessage`` au moyen de la clé privée de l'adresse de la caution telle que spécifiée dans ``collateralAddress``. Veuillez noter qu'aucune connexion à Internet n'est obligatoire pour cette étape, ce qui signifie que le portefeuille peut être déconnecté de l'Internet (en "chambre froide") pour signer le message. Dans cet exemple nous allons à nouveau utiliser le portefeuille logiciel Dash Core, mais il est également possible d'utiliser la fonction de signature d'un portefeuille matériel. La commande a la syntaxe suivante :

source: Example::
fr: Exemple ::

source: Submit the signed message
fr: Soumettre le message signé

source: We will now submit the ProRegTx special transaction to the blockchain to register the masternode. This command must be sent from a Dash Core wallet holding a balance, since a standard transaction fee is involved. The command takes the following syntax::
fr: Nous allons maintenant créer la transaction spéciale ProRegTx pour enregistrer le masternode sur la blockchain. Cette commande doit être envoyée depuis un portefeuille Dash Core contenant des fonds, car des frais de transaction standard seront prélevés. La commande a la syntaxe suivante :

source: Where:
fr: Où :

source: ``tx``: The serialized transaction previously returned in the ``tx`` output field from the ``protx register_prepare`` command
fr: ``tx`` : la transaction sérialisée précédemment renvoyée dans le champ de sortie ``tx`` par la commande ``protx register_prepare``

source: ``sig``: The message signed with the collateral key from the ``signmessage`` command
fr: ``sig`` : le message signé avec la clé de la caution par la commande ``signmessage``

source: Your masternode is now registered and will appear on the Deterministic Masternode List after the transaction is mined to a block. You can view this list on the **Masternodes -> DIP3 Masternodes** tab of the Dash Core wallet, or in the console using the command ``protx list valid``, where the txid of the final ``protx register_submit`` transaction identifies your DIP003 masternode. Note again that all functions related to DIP003 will only take effect once Spork 15 is enabled on the network. You can view the spork status using the ``spork active`` command.
fr: Votre masternode est à présent enregistré et il apparaîtra dans la liste des masternodes déterministes dès que la transaction sera minée dans un bloc. Vous pouvez afficher cette liste dans l'onglet **Masternodes > Masternodes DIP3** du portefeuille logiciel Dash Core, ou dans la console en utilisant la commande ``protx list valid``, où l'identifiant (txid) de la transaction finale ``protx register_submit`` identifie votre masternode DIP003. Veuillez à nouveau noter que toutes les fonctions relatives à la DIP003 ne prendront effet qu'une fois que le Spork 15 sera activé sur le réseau. Vous pouvez connaître l'état du spork avec la commande ``spork active``.

source: At this point you can go back to your terminal window and monitor your masternode using ``dashman/dashman status``, by entering ``~/.dashcore/dash-cli masternode status`` or using the **Get status** function in DMT. The final result should appear as follows:
fr: Arrivé à cette étape, vous pouvez revenir à votre fenêtre de terminal et surveiller votre masternode avec la commande ``dashman/dashman status``, en tapant la commande ``~/.dashcore/dash-cli masternode status``, ou bien en utilisant la fonction **Get status** (Voir l'état) dans DMT. Le résultat final devrait ressembler à ceci :

source: dashman status output showing successfully started masternode
fr: Message d'état de Dashman pour un masternode bien démarré
