Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup-testnet.po
Languages: fr

source: The private keys to the owner and fee source addresses must exist in the wallet submitting the transaction to the network. If your wallet is protected by a password, it must now be unlocked to perform the following commands. Unlock your wallet for 5 minutes::
fr: Les clés privées des adresses du propriétaire et des frais doivent être accessibles par le portefeuille qui soumettra la transaction au réseau. Si votre portefeuille est protégé par mot de passe, il doit à présent être déverrouillé pour exécuter les commandes suivantes. Déverrouillez votre portefeuille pendant 5 minutes :

source: We will now prepare an unsigned ProRegTx special transaction using the ``protx register_prepare`` command. This command has the following syntax::
fr: Nous allons maintenant préparer une transaction spéciale ProRegTx non signée, en utilisant la commande ``protx register_prepare``. Cette commande a la syntaxe suivante :

source: Open a text editor such as notepad to prepare this command. Replace each argument to the command as follows:
fr: Ouvrez un éditeur de texte, tel que Notepad, pour préparer cette commande. Remplacez chaque argument de la commande comme suit :

source: ``collateralHash``: The txid of the 1000 Dash collateral funding transaction
fr: ``collateralHash`` : l'identifiant de la transaction (txid) de la caution de 1000 dashs

source: ``collateralIndex``: The output index of the 1000 Dash funding transaction
fr: ``collateralIndex`` : l'index de sortie de la transaction de la caution de 1000 dashs

source: ``ipAndPort``: Masternode IP address and port, in the format ``x.x.x.x:yyyy``
fr: ``ipAndPort`` : l'adresse IP et le port du masternode, suivant le format ``x.x.x.x:yyyy``

source: ``ownerKeyAddr``: The new Dash address generated above for the owner/voting address
fr: ``ownerKeyAddr`` : l'adresse Dash nouvellement générée ci-dessus, pour l'adresse du propriétaire et de vote

source: ``operatorPubKey``: The BLS public key generated above (or provided by your hosting service)
fr: ``operatorPubKey`` : la clé publique BLS générée ci-dessus (ou fournie par votre service d'hébergement de masternode)

source: ``votingKeyAddr``: The new Dash address generated above, or the address of a delegate, used for proposal voting
fr: ``votingKeyAddr`` : l'adresse Dash nouvellement générée ci-dessus, ou bien l'adresse d'un délégué, utilisée pour le vote des propositions budgétaires

source: ``operatorReward``: The percentage of the block reward allocated to the operator as payment
fr: ``operatorReward`` : le pourcentage de la récompense de bloc à allouer à l'opérateur en tant que paiement

source: ``payoutAddress``: A new or existing Dash address to receive the owner's masternode rewards
fr: ``payoutAddress`` : une adresse Dash nouvelle ou déjà existante, où le propriétaire recevra les paiements de masternode

source: ``feeSourceAddress``: An (optional) address used to fund ProTx fee. ``payoutAddress`` will be used if not specified.
fr: ``feeSourceAddress`` : une adresse (facultative) d'où seront prélevés les frais de la transaction ProTx. Si elle n'est pas spécifiée, c'est l'adresse ``payoutAddress`` qui sera utilisée.

source: Note that the operator is responsible for :ref:`specifying their own reward <dip3-update-service>` address in a separate ``update_service`` transaction if you specify a non-zero ``operatorReward``. The owner of the masternode collateral does not specify the operator's payout address.
fr: Veuillez noter qu'il revient à l'opérateur de :ref:`spécifier sa propre adresse de paiement <dip3-update-service>` avec une transaction ``update_service`` distincte, dans le cas où vous définissez une ``operatorReward`` différente de zéro. Le propriétaire de la caution du masternode ne spécifie pas lui-même l'adresse de paiement de l'opérateur.

source: Example (remove line breaks if copying)::
fr: Exemple (effacez les sauts de ligne si vous le copiez) :

source: Output::
fr: Sortie :

source: Next we will use the ``collateralAddress`` and ``signMessage`` fields to sign the transaction, and the output of the ``tx`` field to submit the transaction.
fr: Ensuite, nous allons utiliser les champs ``collateralAddress`` et ``signMessage`` pour signer la transaction, et la sortie du champ ``tx`` pour soumettre la transaction au réseau.

source: Sign the ProRegTx transaction
fr: Signer la transaction ProRegTx

source: We will now sign the content of the ``signMessage`` field using the private key for the collateral address as specified in ``collateralAddress``. Note that no internet connection is required for this step, meaning that the wallet can remain disconnected from the internet in cold storage to sign the message. In this example we will again use Dash Core, but it is equally possible to use the signing function of a hardware wallet. The command takes the following syntax::
fr: Nous allons maintenant signer le contenu du champ ``signMessage`` au moyen de la clé privée de l'adresse de la caution telle que spécifiée dans ``collateralAddress``. Veuillez noter qu'aucune connexion à Internet n'est obligatoire pour cette étape, ce qui signifie que le portefeuille peut être déconnecté de l'Internet (en "chambre froide") pour signer le message. Dans cet exemple nous allons à nouveau utiliser le portefeuille logiciel Dash Core, mais il est également possible d'utiliser la fonction de signature d'un portefeuille matériel. La commande a la syntaxe suivante :

source: Example::
fr: Exemple :

source: Submit the signed message
fr: Soumettre le message signé

source: We will now submit the ProRegTx special transaction to the blockchain to register the masternode. This command must be sent from a Dash Core wallet holding a balance on either the ``feeSourceAddress`` or ``payoutAddress``, since a standard transaction fee is involved. The command takes the following syntax::
fr: Nous allons maintenant créer la transaction spéciale ProRegTx pour enregistrer le masternode sur la blockchain. Cette commande doit être envoyée depuis un portefeuille Dash Core contenant des fonds à l'adresse ``feeSourceAddress`` ou à l'adresse ``payoutAddress``, car des frais de transaction standard seront prélevés. La commande a la syntaxe suivante :

source: Where:
fr: Où :

source: ``tx``: The serialized transaction previously returned in the ``tx`` output field from the ``protx register_prepare`` command
fr: ``tx`` : la transaction sérialisée précédemment renvoyée dans le champ de sortie ``tx`` par la commande ``protx register_prepare``

source: ``sig``: The message signed with the collateral key from the ``signmessage`` command
fr: ``sig`` : le message signé avec la clé de la caution par la commande ``signmessage``

source: Your masternode is now registered and will appear on the Deterministic Masternode List after the transaction is mined to a block. You can view this list on the **Masternodes -> DIP3 Masternodes** tab of the Dash Core wallet, or in the console using the command ``protx list valid``, where the txid of the final ``protx register_submit`` transaction identifies your masternode.
fr: Votre masternode est à présent enregistré et il apparaîtra dans la liste des masternodes déterministes dès que la transaction sera minée dans un bloc. Vous pouvez afficher cette liste dans l'onglet **Masternodes > Masternodes DIP3** du portefeuille logiciel Dash Core, ou dans la console en utilisant la commande ``protx list valid``, où l'identifiant (txid) de la transaction finale ``protx register_submit`` identifie votre masternode.

source: Manual installation
fr: Installation manuelle

source: **The manual installation guide is currently a work in progress.**
fr: **Ce guide d'installation manuelle est actuellement un travail non achevé.**

source: Core services
fr: Services Core

source: Dash Core is a fork of Bitcoin Core and is responsible for all consensus and communication relating to the base blockchain. Download Dash Core as follows::
fr: Dash Core est un fork de Bitcoin Core et il est responsable de tout le consensus et de toute la communication relative à la blockchain de base. Téléchargez Dash Core comme suit :

source: Verify the authenticity of your download by checking its detached signature against the public key published by the Dash Core development team. All releases of Dash are signed using GPG with one of the following keys:
fr: Vérifiez l'authenticité de votre téléchargement en comparant sa signature séparée à la clé publique diffusée par l'équipe de développement Dash Core. Toutes les versions de Dash sont signées avec GPG avec une des clés suivantes :

source: Alexander Block (codablock) with the key ``63A9 6B40 6102 E091``, `verifiable here on Keybase <https://keybase.io/codablock>`__
fr: Alexander Block (codablock) avec la clé ``63A9 6B40 6102 E091``, `vérifiable ici sur Keybase <https://keybase.io/codablock>`__

source: Pasta (pasta) with the key ``5252 7BED ABE8 7984``, `verifiable here on Keybase <https://keybase.io/pasta>`__
fr: Pasta (pasta) avec la clé ``5252 7BED ABE8 7984``, `vérifiable ici sur Keybase <https://keybase.io/pasta>`__

source: Extract the compressed archive and copy the necessary files to the directory::
fr: Décompressez l'archive et copiez les nouveaux fichiers dans le répertoire :

source: Start Dash Core::
fr: Démarrez Dash Core :

source: Verify Dash Core is running::
fr: Vérifiez si Dash Core fonctionne :

source: Sentinel is a watchdog and works to communicate to the network that your node is working properly. Install Sentinel as follows::
fr: Sentinel est un outil de surveillance qui communique au réseau que votre nœud fonctionne sans problème. Installez Sentinel comme suit :

source: When synchronisation is complete, you should see the following response::
fr: Quand la synchronisation est terminée, vous devriez voir le message suivant ::

source: Platform services
fr: Services Platform

source: Next, we will install the Dash Platform services. Start with some common dependencies::
fr: Ensuite, nous allons installer les services Dash Platform. Commençons par quelques dépendances courantes :

source: MongoDB is a document-oriented database. Install MongoDB as follows::
fr: MongoDB est une base de données orientée documents. Installez MongoDB comme suit :

source: Restart MongoDB::
fr: Redémarrez MongoDB :

source: Verify MongoDB is running::
fr: Vérifiez que MongoDB est fonctionnel :

source: Drive is a replicated state machine for Dash Platform. Download Drive as follows::
fr: Drive est une machine d'état répliqué pour Dash Platform. Téléchargez Drive comme suit :

source: Install package dependencies::
fr: Installez des dépendances de paquet :

source: Start Drive::
fr: Démarrez Drive :

source: Verify Drive is running by checking for a time value under ``uptime``::
fr: Vérifiez que Drive fonctionne en inspectant une valeur temporelle sous ``uptime`` :

source: Tenderdash is a fork of Tendermint and is the blockchain implementation used by Dash Platform. As binaries are not yet published, you will need to build from source. Install Go as follows::
fr: Tenderdash est un fork de Tendermint. Il s'agit de l'implémentation de blockchain utilisée par Dash Platform. Comme les binaires ne sont pas encore publiés, vous devrez les compiler depuis la source. Installez Go comme suit :

source: Build and install Tenderdash as follows::
fr: Compilez et installez Tenderdash comme suit :

source: Initialize Tenderdash::
fr: Initialisez Tenderdash :

source: Ensure Dash Core is fully synced and start Tenderdash::
fr: Assurez-vous que Dash Core est entièrement synchronisé, puis démarrez Tenderdash :

source: Verify Tenderdash is running::
fr: Vérifiez que Tenderdash est fonctionnel :

source: DAPI provides masternode services over the JSON RPC and gRPC protocols. Download DAPI as follows::
fr: DAPI fournit des services masternode via les protocoles JSON RPC et gRPC. Téléchargez DAPI comme suit :

source: Start DAPI::
fr: Démarrez DAPI :

source: Start the transaction filter stream::
fr: Démarrez les filtres de transaction :

source: Envoy is a gRPC service proxy for cloud-native applications. Install Envoy as follows::
fr: Envoy est un proxy de service gRPC pour les applications cloud natives. Installez Envoy comme suit :

source: Start Envoy::
fr: Démarrez Envoy :

source: At this point you can safely log out of your server by typing ``exit``. Congratulations! Your masternode is now running.
fr: À cette étape, vous pouvez vous déconnecter de votre serveur en tapant ``exit``. Félicitations ! Votre masternode est désormais fonctionnel.

source: Developer installation
fr: Installation pour développeurs

source: Developers requiring a local masternode can get started quickly by starting dashmate and providing a private key containing collateral directly. Install dependencies if necessary (Docker, NodeJS, NPM, Github CLI). Windows, macOS and Linux are supported, the following example shows how to install dependencies under Ubuntu 20.04 LTS.::
fr: Les développeurs qui ont besoin d'un masternode local peuvent démarrer rapidement en lançant Dashmate et en fournissant une clé privée contenant directement la caution. Installez des dépendances si nécessaire (Docker, NodeJS, NPM, Github CLI). Windows, macOS et Linux sont compatibles. L'exemple suivant montre comment installer des dépendances sous Ubuntu 20.04 LTS :

source: Generate a new Dash address for temporary use using `this script <https://repl.it/@strophy/Generate-Dash-Address>`__ or the ``getnewaddress`` and ``dumpprivkey`` RPC commands in `Dash Core <https://www.dash.org/downloads>`__ in testnet mode. Go to https://testnet-faucet.dash.org/ and request 1000+ tDash to your new address using the promo code 'masternode'. Then download and initialize dashmate as follows::
fr: Générez une nouvelle adresse Dash à usage temporaire en utilisant `ce script <https://repl.it/@strophy/Generate-Dash-Address>`__ ou bien les commandes RPC ``getnewaddress`` et ``dumpprivkey`` dans `Dash Core <https://www.dash.org/downloads>`__ en mode testnet. Allez sur https://testnet-faucet.dash.org/ et demandez plus de 1000 tDash à votre nouvelle adresse, en utilisant le code promo 'masternode'. Puis téléchargez et initialisez Dashmate comme suit :

source: If you are using Windows, you will need to change the path for two log files. Modify the example below with a log path of your choosing::
fr: Si vous utilisez Windows, vous devrez modifier le chemin de deux fichiers journal. Modifiez l'exemple ci-dessous avec un chemin journal de votre choix :

source: Register your masternode on the network as follows::
fr: Enregistrez votre masternode sur le réseau, comme suit :

source: Wait until sync and registration are complete. Then start the masternode::
fr: Attendez que la synchronisation et l'enregistrement soient terminés. Puis démarrez le masternode :

source: Your masternode is now providing service on the following local ports::
fr: Votre masternode fournit désormais ses services sur les ports locaux suivants :

source: Note that platform sync will take some time after core sync is complete. You can monitor progress with ``dashmate status:platform`` or use ``dashmate --help`` to view other commands.
fr: Veuillez noter que la synchronisation de plateforme prendra quelque temps après la fin de la synchronisation Core. Vous pouvez en suivre le progrès avec la commande ``dashmate status:platform``, ou bien utilisez la commande ``dashmate --help`` pour en découvrir d'autres.
