Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/understanding.po
Languages: fr, ru, vi

source: Masternode payments in Dash version 0.13.0 are entirely deterministic and based on a simple list sort algorithm. For documentation of version 0.12.0 payment logic, see the `legacy masternode payment documentation <https://docs.dash.org/en/0.12.3/masternodes/understanding.html#payment-logic>`_. Dash version 0.13.0 implements `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ and defines two sets of masternodes.
fr: Les paiements de masternode dans Dash 0.13.0 sont entièrement déterministes et se basent sur un simple algorithme de tri de liste. Pour en savoir plus sur la logique de paiement de la version précédente (0.12.0), voir `l'ancienne documentation sur la logique de paiement <https://docs.dash.org/en/0.12.3/masternodes/understanding.html#payment-logic>`_. Dash 0.13.0 implémente la `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ et définit deux groupes de masternodes.
ru: Платежи мастернод в версии Dash 0.13.0 являются полностью детерминированными и основаны на простом алгоритме сортировки списка. Документация о принципах оплаты в версии 0.12.0 приведена в `документации по оплате для старых версий мастернод <https://docs.dash.org/en/0.12.3/masternodes/understanding.html#payment-logic>`_. В версии Dash 0.13.0 реализован `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_, в котором определено два набора мастернод.
vi: Thanh toán cho masternode ở Dash phiên bản 0.13.0 được xác định hoàn toàn và dựa trên thuật toán sắp xếp danh sách đơn giản. Để có tài liệu về logic cho thanh toán trong phiên bản 0.12.0, hãy xem `tài liệu cập nhật về thanh toán cho masternode <https://docs.dash.org/vi/0.12.3/masternodes/understanding.html#payment-logic>`_. Dash phiên bản 0.13.0 thực hiện `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ và định nghĩa hai nhóm masternode.

source: The full set, which contains all registered masternodes that have not spent their collateral funding transactions.
fr: Le groupe complet, qui contient tous les masternodes enregistrés qui n'ont pas dépensé leur caution.
ru: Полный набор, который содержит все зарегистрированные мастерноды, не потратившие своё залоговое подтверждение.
vi: Trọn bộ, nó có chứa tất cả các masternode đã được đăng ký mà chưa tiêu mất khoản tiền trong các giao dịch đặt cọc.

source: The valid set, a subset of the full set which contains all masternodes which are not marked as Proof of Service (PoSe) banned.
fr: Le groupe valide, qui est un sous-groupe du groupe complet, et qui contient tous les masternodes qui ne sont pas marqués comme étant bannis de la preuve de service (PoSe).
ru: Допустимый набор является подмножеством полного набора, который содержит все мастерноды, у которых нет метки бана Proof of Service (PoSe).
vi: Hợp lệ, là một tập hợp con của Trọn Bộ nó có chứa tất cả các masternode mà không được đánh dấu là bị cấm Proof of Service (PoSe).

source: Each masternode in the set of valid masternodes, identified by its registration transaction ID, is associated with the block at which it was last paid. If it has never received payment or was banned for failing to meet the PoSe requirements, then the block at which it was first registered or at which service was restored is used instead. The list is sorted in ascending order by this block height and ProRegTx hash (as a tie breaker in case two masternodes were registered in the same block), and the first entry is selected for payment.
fr: Chaque masternode du groupe de masternodes valides, identifié par son identifiant de transaction d'enregistrement, est associé au bloc où il a reçu son plus récent paiement. S'il n'a jamais été payé ou s'il a été banni pour ne pas avoir rempli les conditions de la preuve de service (PoSe), il est identifié à la place par le bloc où il a été enregistré pour la première fois, ou par celui où le service a été rétabli. La liste est classée par ordre ascendant de hauteur de bloc et d'empreinte de hachage ProRegTx (pour départager deux masternodes dans le cas où ils ont été enregistrés dans un même bloc), et son premier élément est sélectionné pour le paiement.
ru: Каждая мастернода в наборе допустимых мастернод имеет свой ID, присвоенный ей при регистрационной транзакции и ассоциируется с блоком, в котором мастернодой последний раз была получена выплата. Если мастернода ни разу не получала выплату или была заблокирована за несоблюдение требований PoSe, то вместо блока последней выплаты используется блок, в котором мастернода была впервые зарегистрирована или в котором была восстановлена блокирования. Список сортируется в порядке возрастания по высоте блока и хешу ProRegTx (в качестве идентификатора для случаев, когда две мастерноды были зарегистрированы в одном блоке), и выплата отравляется первой записи в нём.
vi: Mỗi masternode trong tập các masternode hợp lệ, xác định bởi mã của giao dịch đăng ký liên kết với khối mà nó được thanh toán lần cuối. Nếu nó chưa từng nhận được thanh toán hoặc bị cấm do không đáp ứng được yêu cầu về PoSe, thì tại block đó nó sẽ được đăng ký như là lần đầu và dịch vụ sẽ được khôi phục trở lại. Một danh sách được sắp xếp tăng dần theo thứ tự độ cao của khối và giá trị băm ProRegTx (như là một bộ ngắt trong trường hợp có hai masternode cùng được đăng ký trong cùng một block), và cái nào đăng ký trước sẽ được chọn để thanh toán.

source: Proof of Service
fr: Preuve de service
ru: Доказательство предоставления услуги

source: Proof of Service (PoSe) is a scoring system used to determine if a masternode is providing network services in good faith. A number of metrics are involved in the calculation, so it is not possible to game the system by causing masternodes to be PoSe banned for failing to respond to ping requests by e.g. a DDoS attack just prior to payment. Each failure to provide service results in an increase in the PoSe score relative to the maximum score, which is equal to the number of registered masternodes. If the score reaches the number of registered masternodes, a PoSe ban is enacted and the masternode must be repaired to ensure it provides reliable service and registered in the list again using a :ref:`ProUpServTx <dip3-update-service>`. The current scoring rules as of Dash 0.14 are:
fr: La preuve de service (PoSe) est un système de note utilisé pour déterminer si un masternode fournit des services au réseau de manière honnête. Un certain nombre de paramètres sont utilisés pour son calcul, et il n'est donc pas possible de tromper le système en faisant en sorte que des masternodes soient bannis de la preuve de service parce qu'ils ne répondraient pas aux requêtes de ping, par exemple par une attaque DDoS juste avant un paiement. Chaque échec à fournir un service entraîne une augmentation de la note PoSe, relative à la note maximale qui est égale au nombre de masternodes enregistrés. Si la note atteint le nombre de masternodes enregistrés, un bannissement PoSe est instauré, et le masternode doit être reconfiguré pour s'assurer qu'il fournisse un service fiable, puis enregistré à nouveau dans la liste au moyen d'une transaction :ref:`ProUpServTx <dip3-update-service>`. Les règles actuelles de notation, en vigueur avec Dash 0.14, sont :
vi: Proof of Service (PoSe) là một hệ thống tính điểm dùng để xác định liệu một masternode có cung cấp các dịch vụ một cách trung thực không. Một số tiêu chí được cậy cho việc tính toán, do vậy không thể chơi trò với hệ thống bằng việc làm cho các masternode có thể bị cấm PoSe vì không trả lời các yêu cầu ping bằng việc, ví dụ việc tấn công từ chối dịch vụ DDoS trước khi thanh toán. Mỗi lần thất bại trong việc cung cấp dịch vụ dẫn đến việc tăng điểm PoSe so với điểm tối đa, nó bằng với số lượng masternode đã đăng ký. Nếu điểm số bằng với số masternode được được đăng ký thì một lệnh cấm PoSe sẽ được kích hoạt và masternode phải được sửa chữa để đảm bảo cung cấp những dịch vụ đáng tin cậy và đăng ký vào danh sách lại sử dụng một lệnh :ref:`ProUpServTx <dip3-update-service>`. Quy luật tính điểm hiện tại trong Dash 0.14 là:

source: Failure to participate in `DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__\ = 66% punishment
fr: Absence de participation à `DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__\ = sanction de 66%
ru: Проблемы при участии в `DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__\ = 66% наказания
vi: Không tham gia vào `DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__\ = 66% hình phạt

source: Each subsequent block reduces PoSe score by 1
fr: Chaque bloc consécutif réduit la note PoSe de 1
ru: Каждый последующий блок снижает количество баллов PoSe на 1
vi: Mỗi khối tiếp theo làm giảm điểm PoSe xuống 1

source: Quorum selection
fr: Sélection par quorum
ru: Выбор кворума
vi: Lựa chọn Quorum

source: In past versions of Dash, quorums of 10 masternodes were formed spontaneously to lock InstantSend transactions. As of Dash 0.14, quorums are deterministically formed, contain more masternodes and remain alive for a longer period of time. While they remain responsible for InstantSend transactions, the locking mechanism has changed to automatically attempt locks on most network transactions according to the requirements described :ref:`here <is-broadcast>`. Masternodes are now also responsible for more network consensus functions, such as :ref:`ChainLocks <chainlocks>`. Masternode quorums are formed through a process of `distributed key generation <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__. Failure to participate in DKG will eventually result in a PoSe ban as described above.
fr: Dans des versions antérieures de Dash, des quorums de 10 masternodes se formaient spontanément pour verrouiller les transactions InstantSend. Depuis Dash v. 0.14, les quorums sont formés de manière déterministe, contiennent davantage de masternodes et demeurent actifs pendant un temps plus long. Ils restent responsables des transactions InstantSend, mais le mécanisme de verrouillage a évolué et essaie automatiquement de verrouiller la plupart des transactions du réseau, selon les conditions décrites :ref:`ici <is-broadcast>`. Les masternodes sont également chargés de davantage de fonctions de consensus réseau, telles que :ref:`ChainLocks <chainlocks>`. Les quorums de masternodes sont formés par un processus de `génération de clé distribuée (DKG) <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__. L'échec de participation à une DKG entraîne un bannissement au titre de la preuve de service (PoSe), tel que décrit ci-dessus.
vi: Trong những phiên bản trước của Dash, một nhóm tối thiểu 10 masternode được lựa chọn một cách tức thời để khoá các giao dịch InstantSend. Từ phiên bản 0.14 của Dash, một nhóm tối thiểu được xác định trước, gồm có các masternode đang và có thời gian hoạt động lâu nhất trên mạng. Trong khi chúng vẫn có nhiệm vụ cho các giao dịch InstantSend, cơ chế khoá này đã thay đổi để tự động khoá một cách tối đa các giao dịch trên mạng mà đạt được những yêu cầu theo như mô tả :ref:`ở đây <is-broadcast>`. Các Masternode bây giờ cũng chịu trách nhiệm cho nhiều chức năng đồng thuận hơn, như :ref:`ChainLocks <chainlocks>`. Các nhóm tối thiểu các masternode được lập nên thông qua một quá trình `sinh khoá phân tán <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__. Nếu không tham gia được vào DKG thì thậm chí kết quả sẽ bị khoá PoSe như đã mô tả ở trên.

source: Masternode requirements
fr: Caractéristiques minimales d'un masternode
ru: Тербования к мастернодам
vi: Các yêu cầu cho masternode

source: 1000 Dash: Arguably the hardest part. Dash can be obtained from exchanges such as Poloniex, Bittrex, Kraken and LiveCoin. Shapeshift's service is also an excellent way.
fr: 1000 dashs : sans doute la condition la plus difficile. Les dashs peuvent être obtenus sur des plateformes de change telles que Poloniex, Bittrex, Kraken ou LiveCoin. Les services de ShapeShift sont aussi un excellent moyen.
ru: 1000 DASH: пожалуй, самая трудная часть, но это утверждение спорно. Dash можно приобрести на таких биржах как Poloniex, Bittrex, Kraken и Livecoin. Также будет очень удобно воспользоваться ShapeShift.
vi: 1000 Dash: Thường được cho rằng là phần khó nhất. Có thể có được Dash bằng việc mua nó trên các sàn giao dịch như Poloniex, Bittrẽ, Kraken và LiveCoin. Sử dụng dịch vụ của Shapeshift cũng là một cách hay.

source: A server or VPS running Linux: Most recent guides use Ubuntu 18.04 LTS. We recommend VPS services such as Vultr and DigitalOcean, although any decent provider will do. Generally an instance with low to average specifications will do, although performance requirements will increase according to this roadmap.
fr: Un serveur ou un VPS tournant sous Linux : la plupart des guides récents recommandent Ubuntu 18.04 LTS. Nous recommandons des fournisseurs de VPS tels que Vultr ou DigitalOcean, même si tout fournisseur correct fera l'affaire. En général, un serveur avec des caractéristiques modestes à moyennes devrait faire l'affaire, bien qu'il soit prévu, selon la feuille de route, que les exigences de performance augmentent à terme.
ru: Сервер, работающий на Linux: последние руководства используют Ubuntu 18.04 LTS, Мы рекомендуем VPS сервисы такие как Vultr и DigitalOcean, но подойдёт любой хороший провайдер. В целом, подойдёт система со средними характеристиками, но по мере продвижения по дорожной карте, системные требования будут расти.
vi: Một máy chủ hoặc một máy chủ ảo chạy Linux: Trong những tài liệu hướng dẫn mới nhất thì có sử dụng Ubuntu 18.04 LTS. Chúng tôi đề nghị sử dụng dịch vụ máy chủ ảo như Vultr và DigitalOcean, mặc dù bất kỳ nhà cung cấp tốt nào khác cũng có thể dùng được. Nói chung, có thể nói một mức yêu cầu thấp cũng có thể chấp nhận được, nhưng tuy nhiên do yêu cầu tốc độ nên phần cứng yêu cầu có thể tăng lên theo lộ trình này.

source: A dedicated IP address: These usually come with the VPS/server.
fr: Une adresse IP dédiée : elle est en général fournie avec le serveur ou VPS.
ru: Выделенный IP адрес: обычно они прилагаются к VPS/серверу.
vi: Có một địa chỉ IP dành riêng: Thường được đi cùng với một máy chủ/máy chủ ảo.

source: In addition to the 1000 Dash held in collateral, masternodes also have minimum hardware requirements. For Dash versions 0.14 and higher, these requirements are as follows:
fr: En plus de la caution de 1000 dashs, les masternodes ont aussi des caractéristiques matérielles minimales. Pour la version 0.12.4 et ultérieure de Dash, ces caractéristiques minimales sont les suivantes :
vi: Thêm vào với 1000 Dash được giữ trong khoản đặt cọc, các masternode cũng cần đảm bảo yêu cầu phần cứng tối thiểu. Với Dash phiên bản 0.14 hoặc cao hơn, thì phần cứng yêu cầu là như sau:

source: Recommended
fr: Recommandé
ru: Рекомендованные
vi: Đề xuất

source: CPU
fr: Processeur (CPU)
ru: Процессор

source: 2 GB + 2 GB swap
fr: 2 Go + swap de 2 Go

source: 4 GB + 2 GB swap
fr: 4 Go + swap de 2 Go

source: Disk
fr: Stockage disque
ru: Место на жёстком диске
vi: Ổ Đĩa

source: 40 GB
fr: 40 Go
ru: 40 ГБ

source: 60 GB
fr: 60 Go

source: Network
fr: Réseau
ru: Сетевой траффик
vi: Mạng

source: 400 GB/mth
fr: 400 Go/mois
ru: 400 Гб/мес

source: 1 TB/mth
fr: 1 To/mois
ru: 1 Тб/мес

source: Masternode bandwidth use ranges between 300-500 GB per month and will grow as the network does.
fr: La bande passante d'un masternode est entre 300 et 500 Go mensuels, et augmentera avec l'utilisation du réseau.
ru: Мастернода передаёт информации порядка 300-500 Гб в месяц и это число будет расти вместе с сетью.
vi: Masternode sử dụng băng thông vào khoảng 300-500 GB cho mỗi tháng và sẽ tăng lên khi mạng lưới phát triển.

source: The exact hardware requirements for Dash Evolution masternodes have yet to be determined, although some pointers can be taken from the `roadmap <https://www.dash.org/roadmap/>`_ and this `blog post <https://medium.com/@eduffield222/how-to-enabling-on-chain-scaling-2ffab5997f8b>`_. It should be possible to run Dash masternodes on normal VPS servers until the block size reaches approximately 20 MB, after which custom hardware such as GPUs and eventually ASICs may be required.
fr: Les caractéristiques matérielles minimales pour les masternodes Dash Evolution restent à déterminer, même si certains indices peuvent être trouvés dans la `feuille de route <https://www.dash.org/fr/feuille-de-route/>`_ et dans ce `billet de blog <https://medium.com/@eduffield222/how-to-enabling-on-chain-scaling-2ffab5997f8b>`_. Il devrait être possible de faire tourner des masternodes Dash sur des serveurs VPS normaux jusqu'à ce que la taille de blocs atteigne environ 20 Mo, après quoi du matériel spécialisé sera nécessaire, tel que des GPU voire des ASIC.

source: Minimum
ru: Минимальные
vi: Tối thiểu

source: 1x 1 GHz
ru: 1x 1 ГГц

source: 1x 2 GHz
ru: 1x 2 ГГц

source: RAM
ru: Оперативная память
