Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/understanding.po
Languages: fr, ru, vi

source: Explanation of how Dash masternodes work in theory and practice to support InstantSend, PrivateSend and governance
fr: Explication du fonctionnement des masternodes Dash en théorie et en pratique, pour mise en œuvre d'InstantSend, de PrivateSend et de la gouvernance
ru: Объяснение теоретических и практических принципов работы мастернод Dash при обеспечении функций InstantSend, PrivateSend и управления.
vi: Giải thích masternode của Dash hoạt động thế nào trên lý thuyết và thực tế để hỗ trợ cho InstantSend, PrivateSend và hệ thống quản trị

source: dash, masternodes, hosting, linux, payment, instantsend, privatesend, governance, quorum, evolution, bls,
fr: dash, masternodes, hébergement, linux, paiement, instantsend, privatesend, gouvernance, quorum, evolution, bls
ru: dash, мастерноды, хостинг, linux, платежи, instantsend, privatesend, управление, кворум, evolution, bls
vi: dash, masternodes, hosting, linux, thanh toán, payment, instantsend, privatesend, governance, quorum, evolution, bls,

source: Understanding Masternodes
fr: Comprendre les masternodes
ru: Основы мастернод
vi: Hiểu về Masternode

source: Masternodes, once unique to the Dash network, are now becoming popular as the technology is forked into other blockchains. This section of the documentation describes the principles and mechanisms of masternodes and the services they provide to the Dash network specifically.
fr: Les masternodes, à l'origine uniques au réseau Dash, sont en train de devenir populaires, au fur et à mesure que la technologie est reprise par d'autres blockchains. Cette section de la documentation décrit les principes et mécanismes des masternodes, ainsi que les services qu'ils fournissent spécifiquement au réseau Dash.
ru: Мастерноды когда-то были уникальной особенностью сети Dash, но сейчас приобрели они популярность и в других криптовалютах, так как технология перешла в другие блокчейны посредством форка. Данная документация объясняет принципы и механизмы работы мастернод и той работы, которую они выполняют для сети Dash.
vi: Masternode, đã từng là độc nhất cho mạng lưới Dash, nhưng bây giờ trở nên một công nghệ phổ biến và được đưa lên những nền tảng blockchain khác. Phần tài liệu này sẽ mô tả những nguyên tắc và cơ chế của masternode và các dịch vụ mà chúng cung cấp đặc biệt cho mạng lưới Dash.

source: Simply put, a masternode is a server with a full copy of the Dash blockchain, which guarantees a certain minimum level of performance and functionality to perform certain tasks related to block validation, as well as PrivateSend and InstantSend, as the privacy and instant transaction features in Dash are called. The masternodes are paid for this service, using a concept known as Proof of Service. This is in addition to the Proof of Work done by miners to secure the blockchain. Masternodes are also allowed to vote on :ref:`governance and funding proposals <governance>`, with each masternode receiving one vote (yes/no/abstain) on each proposal submitted to the system.
fr: En quelques mots, un masternode est un serveur comportant un exemplaire complet de la blockchain Dash, serveur qui s'engage à un certain niveau minimal de performance et de fonctionnalités, afin d'exécuter certaines tâches relatives à la validation de bloc mais aussi pour opérer les fonctionnalités PrivateSend et InstantSend, noms donnés aux fonctions de confidentialité et de transactions instantanées propres à Dash. Les masternodes sont rémunérés pour ce service, selon un concept connu sous le nom de preuve de service. Cela vient en complément à la preuve de travail assurée par les mineurs pour sécuriser la blockchain. Les masternodes ont aussi un droit de vote sur les :ref:`les propositions de gouvernance et de financement <governance>`, chaque masternode recevant un droit de vote (oui/non/abstention) sur chaque proposition soumise au système.
vi: Nói một cách dễ hiểu, một masternode là một máy chủ với một phiên bản đầy đủ của blockchain của Dash, cần bảo đảm một mức độ tối thiểu về tốc độ và chức năng để thực hiện những nhiệm vụ liên quan đến kiểm tra khối, cũng như là các dịch vụ như PrivateSend và InstantSend, đó là các tính năng về giao dịch riêng tư và tức thời của Dash. Các masternode cũng được trả công cho dịch vụ của mình, bằng việc sử dụng cơ chế có tên Proof of Service. Đây là một cơ chế bổ sung cho Proof of Work thực hiện bởi các thợ mỏ để bảo đảm cho blockchain. Masternode cũng được quyền bỏ phiếu cho :ref:`các đề xuất quản trị hoặc cấp vốn cho các dự án <governance>`, với mỗi masternode có được một phiếu bầu (yes/no/abstain tương đương với ủng hộ/phản đối/không ý kiến) cho mỗi một đề xuất được gửi lên hệ thống.

source: Anyone can run a masternode. The objective is to have enough decentralization to ensure that no single person controls a significant fraction of the masternodes. However, to avoid bloating the network with unnecessary masternodes or encouraging reckless operators, there is one condition that needs to be fulfilled: proof of ownership of 1000 Dash. The coins don't need to be in the masternode, but they need to be kept in a certain way that is transparent to the entire network. If the owner moves or spends those coins, the masternode stops working and payment ceases.
fr: N'importe qui peut opérer un masternode. L'objectif est d'avoir un niveau de décentralisation suffisant pour garantir qu'aucune personne unique ne contrôle une part significative des masternodes. Cependant, pour éviter de surcharger le réseau avec des masternodes non nécessaires et pour décourager les opérateurs malveillants, il y a une condition qui doit impérativement être remplie : la preuve de possession de 1000 dashs. Ces fonds n'ont pas besoin d'être stockés sur le masternode, mais ils doivent être conservés de façon qu'ils soient visibles par le réseau entier. Si leur propriétaire les déplace ou les dépense, le masternode cesse de fonctionner et d'être rémunéré.
ru: Запустить мастерноду может каждый. Смысл этого в обеспечении достаточного уровня децентрализации для предотвращения возможности одного человека контролировать значительную часть мастернод. тем не менее, для предотвращения появления излишнего количества мастернод и появления безответственных владельцев мастернод, существует обязательное требование: наличие 1000 DASH. Эти монеты необходимо хранить определённым образом, который прозрачен для всей сети. Если владелец переместит или потратит эти монеты, то мастернода прекратит свою работу и выплаты прекратятся.
vi: Bất cứ ai cũng có thể chạy một masternode. Mục đích của việc này là có được sự phi tập trung cần thiết để đảm bảo rằng không một ai có thể kiểm soát phần lớn các masternode. Tuy nhiên, để tránh làm đầy mạng lưới với nhiều masternode không cần thiết hoặc khuyến khích những người thiếu thận trọng, thì có một điều kiện cần phải thực hiện: đó là chứng minh việc sở hữu 1000 DASH. Coin không cần thiết phải ở trong masternode, nhưng nó cần phải được giữ trong một cách nào đó mà làm minh bạch cho toàn bộ mạng lưới. Nếu chủ sở hữu di chuyển hoặc tiêu đi những coin đó, thì masternode sẽ dừng hoạt động và việc thanh toán sẽ dừng lại.

source: Masternodes are paid by the network for the PrivateSend, InstantSend and governance services they provide. 45% of the block reward is paid out to the masternodes, 45% to miners and 10% to the budget. In practice, half of the reward from a normal block goes to the miner and half to the masternode. Then, every 16,616 blocks (approximately 30.29 days), a superblock is created that contains the entire 10% payout to the budget proposal winners. Masternodes are selected for payment in each block (approximately every 2.6 minutes) from a deterministic masternode list, and moved to the back of the list after payment. As more masternodes are created, the duration between payments increases. If the collateral behind a masternode is spent, or if a masternode stops providing services to the network for more than one hour, it is removed from the list until normal service resumes. In this way, masternodes are given incentive to provide efficient and reliable services to the network.
fr: Les masternodes sont payés par le réseau pour les services PrivateSend, InstantSend et de gouvernance qu'ils fournissent. 45% de la récompense de bloc est versée aux masternodes, 45% aux mineurs et 10% au budget. En pratique, la moitié de la récompense d'un bloc normal va au mineur et l'autre moitié au masternode. Puis, tous les 16616 blocs (soit tous les 30,29 jours environ), un "superbloc" est créé, contenant le versement entier de 10% aux propositions budgétaires gagnantes. Pour le paiement de chaque bloc (toutes les 2,6 minutes environ), les masternodes sont choisis dans une liste déterministe, puis ils sont rétrogradés au début de la file d'attente après avoir été payés. Au fur et à mesure que sont créés de nouveaux masternodes, la durée entre deux paiements augmente. Si la caution d'un masternode est dépensée, ou si un masternode cesse de fournir des services au réseau pendant plus d'une heure, il est retiré de la liste jusqu'à ce que les services normalement attendus reprennent. De cette façon, les masternodes sont incités à fournir des services efficaces et fiables au réseau.
ru: Мастерноды получают плату от сети за обеспечение работы сервисов PrivateSend, InstantSend и управления. 45% награды за блок получают мастерноды, 45% - майнеры и 10% идут в Бюджет. На практике, половина награды за блок идёт майнерам и половина мастернодам. Далее, каждые 16616 блоков (примерно 30,29 дней) создаётся суперблок, который содержит 10% награды за блок, он распределяется на выплаты бюджетным предложениям, получившим одобрение. Мастерноды, которые получат награду выбираются в каждом блоке из детерминированного списка мастернод (примерно каждые 2,6 минуты) и после получения выплаты перемещаются в конец списка. По мере увеличения числа мастернод, растёт и время ожидания выплаты. Если залоговое подтверждение мастерноды будет потрачено или мастернода перестанет обеспечивать работу сервисов в сети на время более часа, то она удаляется из списка до восстановления нормального функционирования. Таким образом, мастерноды получают стимулирование за обеспечение эффективной и надёжной работы сервисов в сети.
vi: Các masternode được mạng lưới trả chông cho những dịch vụ như PrivateSend, InstantSend và dịch vụ quản trị mà chúng cung cấp. 45% Phần thưởng khối sẽ được trả cho các masternode, 45% sẽ được trả cho những người thợ mỏ, và 10% sẽ dùng làm ngân sách. Trong thực tế, một nửa của phần thưởng khối thông thường sẽ được trả cho thợ mỏ và một nửa được trả cho masternode. Sau đó, cứ mỗi 16,616 khối (xấp xỉ 30.29 ngày), một siêu khối sẽ được tạo ra và nó có chứa toàn bộ 10% được trả cho những chủ đề xuất thành công. Các masternode sẽ được chọn để trả thưởng cho mỗi khối (xấp xỉ mỗi 2.6 phút) từ danh sách masternode xác định, và sau đó đợi trở lại danh sách đó sau khi nhận được thanh toán. Càng có nhiều masternode được tạo, khoảng thời gian chờ nhận thanh toán sẽ càng tăng. Nếu khoản tiền đặt cọc của masternode bị chi tiêu, hoặc masternode dừng không cung cấp các dịch vụ cho mạng lưới trong khoảng thời gian hơn 1 giờ đồng hồ, nó sẽ bị loại khỏi danh sách đến khi cung cấp dịch vụ trở lại. Do đó, các masternode có một động lực để cung cấp những dịch vụ hiệu quả và đáng tin cậy cho mạng lưới.

source: Having so many servers holding a full copy of the blockchain and working for the coin can be extremely useful. Thanks to the reward system, there is no risk of not having enough masternodes, and the developers can rely on them quickly deploying any new decentralized feature they want to implement. This is where the true strength of Dash lies - an incentivized system of thousands of distributed servers working 24x7 means that Dash can scale more efficiently and deploy services more quickly than a blockchain run entirely by unpaid volunteers. The more masternodes, the better and safer the Dash network.
fr: Disposer de tant de serveurs comportant un exemplaire complet de la blockchain et opérant pour le réseau peut être extrêmement utile. Grâce au système de récompense, il n'y a aucun risque de ne pas avoir assez de masternodes, et les programmeurs peuvent compter sur eux pour rendre disponible toute nouvelle fonction décentralisée qu'ils souhaitent implémenter. C'est là que siège véritablement toute la puissance de Dash : un système motivé de milliers de serveurs distribués, disponibles 24 heures sur 24 et 7 jours par semaine, signifie que Dash peut changer d'échelle plus efficacement et fournir de nouveaux services plus rapidement qu'une blockchain entièrement opérée par des volontaires non rétribués. Plus il y a de masternodes, plus le réseau Dash est performant et sûr.
ru: Наличие столь большого числа серверов, хранящих полную копию блокчейна и работающих на монету может быть чрезвычайно полезным. Благодаря системе наград, отсутствует риск недостаточного числа мастернод и разработчики, при желении внедрить новые децентрализованные технологий, могут на них полагаться. Именно в этом истинная сила Dash- сеть финансово стимулируемых децентрализованных серверов, работающих 24х7, дающих возможность Dash более эффективно масштабироваться и внедрять функции, чем блокчейны, работающие исключительно на энтузиазме неоплачиваемых добровольцев. Чем больше мастернод, тем лучше и безопаснее сеть Dash.
vi: Việc có nhiều máy chủ lưu giữ toàn bộ bản sao của blockchain và làm việc cho đồng coin làm cho nó trở nên cực kỳ hữu ích. Nhờ có hệ thống phần thường này, làm cho không còn rủi ro do việc thiếu masternode, và do đó các nhà phảt triển có thể dựa vào đó để nhanh chóng triển khai những tính năng phi tập trung mới mà họ muốn thực hiện. Đây thực sự là điểm mạnh của Dash - một hệ thống tạo động lực cho hàng ngàn máy chủ nằm phân tán hoạt động 24x7 có nghĩa là Dash có thể mở rộng một cách hiệu quả hơn và triển khai các dịch vụ nhanh chóng hơn các blockchain mà chạy hoàn toàn bởi những người tình nguyện không được trả công. Càng có nhiều masternode mạng lưới của Dash càng tốt hơn và an toàn hơn.

source: As of November 2018, the Dash network has `over 5000 masternodes located <http://178.254.23.111/~pub/masternode_count.png>`_ in over `45 countries <https://chainz.cryptoid.info/dash/masternodes.dws>`_ and hosted on `over 140 ISPs <http://178.254.23.111/~pub/Dash/masternode_ISPs.html>`_. The block reward is approximately 3.34 Dash, so the selected masternode receives 1.67 Dash per payment or approximately 6 Dash per month. The block reward decreases by 7.14% approximately once per year, so the annual earnings for a masternode owner is approximately 7% of the collateral, and will decrease over time `as calculated here <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. See `this tool <https://dash- news.de/dashtv/#value=1000>`_ to calculate real-time payment rates, and `this site <http://178.254.23.111/~pub/Dash/Dash_Info.html>`_ for various real-time statistics on the masternode network.
fr: Au mois de novembre 2018, le réseau Dash dispose de `plus de 5000 masternodes <http://178.254.23.111/~pub/masternode_count.png>`_ dans plus de `45 pays <https://chainz.cryptoid.info/dash/masternodes.dws>`_ et hébergés par `plus de 140 hébergeurs <http://178.254.23.111/~pub/Dash/masternode_ISPs.html>`_. La récompense de bloc est d'environ 3,34 dashs, donc le masternode choisi reçoit 1,67 dash par paiement, ou environ 6 dashs par mois. La récompense de bloc décroît d'environ 7,14% une fois par an, donc le retour sur investissement annuel d'un opérateur de masternode est d'environ 7% de la caution, et il diminuera avec le temps, `tel que calculé ici <https://docs.google.com/spreadsheets/d /1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. Utilisez `cet outil <https://dash- news.de/dashtv/#value=1000>`_ pour calculer en temps réel les taux de retour, et `ce site <http://178.254.23.111/~pub/Dash/Dash_Info.html>`_ pour différentes statistiques en temps réel sur le réseau des masternodes.
ru: По состоянию на ноябрь 2018 сеть Dash насчитывает `более 5000 мастернод, которые расположены <http://178.254.23.111/~pub/masternode_count.png>`_ в более чем `45 странах <https://chainz.cryptoid.info/dash/masternodes.dws>`_, а их хостинг обеспечивает более `более 140 провайдеров <http://178.254.23.111/~pub/Dash/masternode_ISPs.html>`_. Награда за блок составляет приблизительно 3,34 DASH, таким образом, одна мастернода получает выплату в 1,67 DASH за раз или около 6 DASH в месяц. Награда за блок уменьшается на 7,14% примерно раз в год, таким образом, за год владелец мастерноды зарабатывает примерно 7% от суммы залога, но это значение со временем будет падать, как показано `в подсчётах здесь <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. Для подсчётов наград в реальном времени используйте `этот инструмент <https://dash- news.de/dashtv/#value=1000>`_, и `этот сайт <http://178.254.23.111/~pub/Dash/Dash_Info.html>`_ для получения различной текущей статистики по сети мастернод.
vi: Vào tháng 11 năm 2018, mạng lưới Dash có `hơn 5000 masternode nằm trên <http://178.254.23.111/~pub/masternode_count.png>`_ `hơn 45 quốc gia <https://chainz.cryptoid.info/dash/masternodes.dws>`_ và được giữ ở trên `hơn 140 nhà cung cấp dịch vụ Internet <http://178.254.23.111/~pub/Dash/masternode_ISPs.html>`_. Phần thưởng khối lúc đó xấp xỉ 3.34 Dash, như vậy mỗi masternode được chọn sẽ nhận khoảng 1.67 Dash cho mỗi lần nhận hoặc xấp xỉ 6 Dash mỗi tháng. Phần thưởng khối giảm 7.14% cứ xấp xỉ mỗi năm, như vậy thu nhập hàng năm của mỗi chủ masternode xấp xỉ khoảng 7% của phần đặt cọc, và nó sẽ giảm đi theo thời gian `như trong tính toán sau đây <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. Xem `công cụ này <https://dash- news.de/dashtv/#value=1000>`_ để tính toán tỷ lệ trả thưởng theo thời gian thực, và `trang web này <http://178.254.23.111/~pub/Dash/Dash_Info.html>`_ để có thông tin thống kê theo thời gian của mạng lưới mastenrode.

source: DIP003 Masternode Changes
fr: Nouveautés des masternodes DIP003
ru: Изменения для мастернод DIP003
vi: DIP003 Những thay đổi Masternode

source: Dash 0.13.0 implements DIP003, which introduces several changes to how a Dash masternode is set up and operated. A list of available documentation appears below:
fr: Dash 0.13.0 met en œuvre la DIP003, qui introduit certains changements dans la façon d'installer et de gérer un masternode. Veuillez trouver ci-dessous une liste de la documentation disponible :
ru: В версии Dash 0.13.0 реализовано предложение по улучшению DIP003, в которое внесены несколько изменений по настройке и управлению мастернодой Dash. Список имеющейся документации приведён ниже:
vi: Dash 0.13.0 thực hiện DIP003, nó giới thiệu một số thay đổi cách một masternode của Dash được cài đặt và vận hành. Có một loạt các tài liệu ở trong danh sách dưới đây:

source: `DIP003 Deterministic Masternode Lists <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
fr: `DIP003 Listes de masternodes déterministes <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
ru: `Детерминированные списки мастернод DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
vi: `DIP003 Danh sách Masternode xác định <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__

source: :ref:`dip3-changes` (you are here)
fr: :ref:`dip3-changes` (vous êtes ici)
ru: :ref:`изменения dip3` (вы сейчас на этом этапе)
vi: :ref:`dip3-những thay đổi` (bạn đang ở đây)

source: `Dash 0.13 Upgrade Procedure for Masternodes (legacy documentation) <https://docs.dash.org/en/0.13.0/masternodes/dip3-upgrade.html>`__
fr: :ref:`Procédure de mise à jour Dash 0.13 pour les masternodes (documentation archivée) <dip3-upgrade>`
vi: `Dash 0.13 Các bước nâng cấp cho masternode (tài liệu cập nhật) <https://docs.dash.org/en/0.13.0/masternodes/dip3-upgrade.html>`__

source: :ref:`Full masternode setup guide <masternode-setup>`
fr: :ref:`Guide complet de mise en place d'un masternode <masternode-setup>`
ru: :ref:`Полное руководство по настройке мастерноды <masternode-setup>`
vi: :ref:`Hướng dẫn đầy đủ cách cài đặt masternode <masternode-setup>`

source: :ref:`Information for users of hosted masternodes <hosted-setup>`
fr: :ref:`Information pour les utilisateurs de masternodes hébergés <hosted-setup>`
ru: :ref:`Информация для пользователей мастернод на хостинге <hosted-setup>`
vi: :ref:`Thông tin cho người dùng hoặc dùng dịch vụ lưu trữ masternode <hosted-setup>`

source: :ref:`Information for operators of hosted masternodes <operator-transactions>`
fr: :ref:`Information pour les opérateurs de masternodes hébergés <operator-transactions>`
ru: :ref:`Информация для операторов мастернод на хостинге <operator-transactions>`
vi: :ref:`Thông tin dành cho người vận hành dịch vụ lưu trữ masternode <operator-transactions>

source: Important concepts and changes:
fr: Concepts et nouveautés importantes :
ru: Важные концепции и изменения:
vi: Những khái niệm quan trọng và những thay đổi:

source: It is possible to upgrade an existing masternode in-place without starting a new server and without moving your 1000 DASH collateral.
fr: Il est possible de mettre à jour un masternode déjà existant, directement sur son serveur, sans avoir à mettre en place un nouveau serveur ou à déplacer votre caution de 1000 dashs.
ru: Возможно обновление существующей мастерноды на месте без необходимости запуска нового сервера и без перемещения залога в размере 1000 DASH.
vi: Bạn có thể nâng cấp một masternode tại chỗ mà không cần phải bắt đầu một máy chủ mới và không cần phải di chuyển khoản 1000 DASH đặt cọc.

source: A masternode was previously "started" using the ``masternode start-alias`` command based on a ``masternode.conf`` file. Under DIP003, this file is no longer used, and masternodes are "registered" instead of "started". Masternodes begin offering services when a `ProRegTx <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_ `special transaction <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_ containing a particular key is written to the blockchain.
fr: Auparavant, un masternode était "démarré" au moyen de la commande ``masternode start-alias``, qui se basait sur un fichier ``masternode.conf``. Avec la DIP003, ce fichier n'est plus utilisé, et les masternodes sont "enregistrés" au lieu d'être "démarrés". Les masternodes commencent à offrir leurs services lorsqu'une `transaction spéciale <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_ `ProRegTx <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_, contenant une clé particulière, est écrite sur la blockchain.
ru: Ранее мастернода "запускалась" с использованием команды ``masternode start-alias``, расположенной в файле ``masternode.conf``. После обновления DIP003 этот файл больше не используется и мастерноды теперь "регистрируются", а не "запускаются". Сервисы мастернод начинают работать, если `ProRegTx <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_ `специальная транзакция <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_ содержит конкретный ключ, который записан в блокчейне.
vi: Một masternode trước đó được "khởi động" sửu dụng câu lệnh ``masternode start-alias`` dựa trên một file ``masternode.conf``. Với DIP003, file này không còn được dùng nữa và các masternode được "đăng ký" thay vì được "khởi động". Masternode bắt đầu cung cấp các dịch vụ khi một `ProRegTx <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_ `giao dịch đặc biệt <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_ có chứa một khoá cụ thể được viết vào blockchain.
