Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/masternodes/understanding.po
Languages: fr, ru, vi

source: As before in ``masternode.conf``, the ProRegTx references the transaction id (txid) and index holding the collateral. The IP address and port of the masternode are also defined in this transaction.
fr: Comme c'était le cas avec ``masternode.conf``, la transaction ProRegTx contient une référence à l'identifiant de la transaction (txid) de la caution, et à son index. L'adresse IP et le port du masternode sont également spécifiés dans cette transaction.
ru: Как и раньше, в файле ``masternode.conf``, ProRegTx ссылается на идентификатор (txid) и индекс транзакции, на которой удерживается залог. В этой транзакции также определены IP-адрес и порт мастерноды.
vi: Như trước đây trong ``masternode.conf``, thì ProRegTx tham chiếu đến mã giao dịch (txid) và chỉ mục giữ khoản đặt cọc. Địa chỉ IP và cổng của masternode cũng được định nghĩa trong giao dịch này.

source: The ProRegTx contains 2 Dash addresses (also called public keys) and one BLS public key, which represent 3 different roles in the masternode and define update and voting rights. The keys are:
fr: La transaction ProRegTx spécifie 2 adresses Dash (également appelées clés publiques) et 1 clé publique BLS, qui représentent 3 rôles différents dans le masternode et définissent les droits de mise à jour et de vote. Ces clés sont :
ru: ProRegTx содержит 2 адреса Dash (которые ещё называют публичными ключами) и один публичный ключ BLS, который представляет 3 различных роли в мастерноде и определяет права на обновление и голосование. Ключами являются:
vi: Lệnh ProRegTx có chứa 2 địa chỉ Dash (cũng được gọi là các khoá công khai) và một khoá công khai BLS, chúng đại diện cho 3 vai trò khác nhau trong masternode và xác định quyền nâng cấp và bỏ phiếu. Các khoá đó là:

source: ``ownerKeyAddr``: This is a Dash address (public key) controlled by the masternode owner. It is different from the address used for the collateral. Because the owner uses the private key associated with this address to issue :ref:`ProUpRegTx <update-dip3-config>` transactions, it must be unique for each masternode.
fr: ``ownerKeyAddr`` : il s'agit d'une adresse Dash (clé publique) contrôlée par le propriétaire du masternode. Elle est distincte de l'adresse où est stockée la caution. Le propriétaire utilise la clé privée associée à cette adresse pour émettre des transactions :ref:`ProUpRegTx <update-dip3-config>`, elle doit donc être unique et propre à chaque masternode.
ru: ``ownerKeyAddr``: Это адрес Dash (публичный ключ), который контролируется владельцем мастерноды. Он отличается от адреса, используемого для хранения залога. Так как владелец использует приватный ключ, который связан с этим адресом для проведения транзакций :ref:`ProUpRegTx <update-dip3-config>`, он должен быть уникальным для каждой мастерноды.
vi: ``ownerKeyAddr``: Đây là một địa chỉ Dash (khoá công khai) kiểm soát bởi chủ masternode. Địa chỉ này khác với địa chỉ dùng cho việc đặt cọc. Bởi vì chủ sở hữu sử dụng khoá riêng liên kết với địa chỉ này để thực hiện giao dịch :ref:`ProUpRegTx <update-dip3-config>`, do vậy nó phải là duy nhất cho mỗi masternode.

source: ``operatorPubKey``: This is the BLS public key of the masternode operator. Only the operator is allowed to issue :ref:`ProUpServTx <update-dip3-config>` transactions. Because the operator key is used during live masternode operation to sign masternode-related P2P messages, quorum-related messages and governance trigger votes, the BLS key must be unique for each masternode.
fr: ``operatorPubKey`` : il s'agit de la clé publique BLS de l'opérateur du masternode. Seul l'opérateur est autorisé à émettre des transactions :ref:`ProUpServTx <update-dip3-config>`. La clé de l'opérateur est utilisée au cours des opérations sur le masternode pour signer des messages pair-à-pair relatifs au masternode, des messages relatifs au quorum et aux votes de gouvernance. C'est pourquoi la clé BLS doit être unique et propre à chaque masternode.
ru: ``operatorPubKey``: Это публичный ключ BLS оператора мастерноды. Только оператору разрешено проводить транзакции :ref:`ProUpServTx <update-dip3-config>`. Поскольку ключ оператора используется во время работы мастерноды в реальном времени для подписи P2P-сообщений, связанных с мастернодой, сообщений о кворуме и триггера голосов управления, ключ BLS должен быть уникальным для каждой мастерноды.
vi: ``operatorPubKey``: Đây là khoá công khai BLS của người vận hành masternode. Chỉ có người vận hành mới có thể thực hiện giao dịch :ref:`ProUpServTx <update-dip3-config>`. Bởi vì khoá vận hành được sử dụng trong quá trình vận hành masternode để ký các thông điệp P2P liên quan đến masternode, thông điệp liên quan đến quorum và kích hoạt việc bỏ phiếu quản trị, nên các khoá BLS phải là duy nhất cho mỗi masternode.

source: ``votingKeyAddr``: This is a Dash address (public key) used for proposal voting. Votes signed with the corresponding private key are valid while the masternode is in the registered set.
fr: ``votingKeyAddr`` : il s'agit d'une adresse Dash (clé publique) utilisée pour voter sur les propositions budgétaires. Les votes sont signés avec la clé privée correspondante et sont valides tant que le masternode est inclus dans la liste des masternodes enregistrés.
ru: ``votingKeyAddr``: Это адрес Dash (публичный ключ), который используется для голосований по предложениям. Голоса, подписанные соответствующим приватным ключом, действительны, пока мастернода находится в зарегистрированном наборе.
vi: ``votingKeyAddr``: Đây là một địa chỉ Dash (khoá công khai) được sử dụng cho việc bỏ phiếu đề xuất. Việc bỏ phiếu ký với khoá riêng tương ứng hợp lệ khi masternode còn trong tập các masternode được đăng ký.

source: Masternode payments were previously sent to the address holding the collateral. Under DIP003, the owner should specify a different address to receive payments in the ProRegTx. The owner may optionally specify a non-zero percentage as payment to a separate masternode operator, if applicable.
fr: Les paiements de masternode étaient auparavant envoyés à l'adresse détenant la caution. Avec la DIP003, le propriétaire peut définir dans la transaction ProRegTx une adresse différente de réception des paiements. Le propriétaire peut aussi, facultativement, définir un pourcentage non nul qui sera alloué comme paiement à un opérateur tiers de masternode, si besoin est.
ru: Платежи мастернод раньше отправлялись на адрес, на котором удерживался залог. В версии DIP003 владелец мастерноды должен указать другой адрес для получения платежей ProRegTx. По желанию и, если это приемлемо, владелец может указать ненулевой процент оплаты отдельному оператору мастерноды.
vi: Giao dịch thanh toán masternode trước đây được gửi đến địa chỉ giữ khoản đặt cọc. Với DIP003, chủ sở hữu masternode nên chỉ rõ một địa chỉ khác để nhận thanh toán trong giao dịch ProRegTx. Chủ sở hữu cũng có thể không bắt buộc chỉ ra một số phần trăm khác không để dành riêng thanh toán cho người vận hành masternode, nếu muốn.

source: The masternode configuration can later be updated using ProUpServTx, ProUpRegTx and ProUpRevTx transactions. See `Updating Masternode Information <https://github.com/dashpay/dips/blob/master/dip-0003.md#updating-masternode-information>`_ in DIP003 and :ref:`update-dip3-config` in this documentation for more details.
fr: La configuration de masternode peut être mise à jour ultérieurement au moyen de transactions ProUpServTx, ProUpRegTx et ProUpRevTx. Pour en savoir plus, voir `Mise à jour de la configuration de masternode <https://github.com/dashpay/dips/blob/master/dip-0003.md#updating-masternode-information>`_ dans la DIP003 et :ref:`update-dip3-config` dans la présente documentation.
ru: Конфигурацию мастерноды можно обновить со временем, используя транзакции ProUpServTx, ProUpRegTx и ProUpRevTx. Для получения более подробных сведений смотрите `Обновление информации о мастернодах <https://github.com/dashpay/dips/blob/master/dip-0003.md#updating-masternode-information>`_ в DIP003 и :ref:`update-dip3-config` в этой документации.
vi: Cấu hình masternode sau đó có thể cập nhật bằng việc sử dụng các giao dịch ProUpServTx, ProUpRegTx và ProUpRevTx. Hãy xem `Cập nhật thông tin masternode <https://github.com/dashpay/dips/blob/master/dip-0003.md#updating-masternode-information>`_ trong DIP003 và :ref:`update-dip3-config` trong tài liệu này để biết thêm chi tiết.

source: All functions related to DIP003 will only take effect once Spork 15 is enabled on the network. Until then, it is necessary to set up the masternode following the `old process <https://docs.dash.org/en/0.12.3/masternodes/setup.html>`_ and then work through the `upgrade procedure <https://docs.dash.org/en/0.13.0/masternodes/dip3-upgrade.html>`__. In this state, the masternode will continue to function in compatibility mode, and all DIP003 related functions, such as payments to a separate address or percentage payments to operators, will not yet have any effect. The ``ownerKeyAddr`` and ``votingKeyAddr`` must also be identical until Spork 15 is enabled.
fr: Toutes les fonctions relatives à la DIP003 prendront effet seulement lorsque le Spork 15 sera activé sur le réseau. Avant cette date, il faut mettre en place le masternode en suivant `l'ancienne procédure <https://docs.dash.org/en/0.12.3/masternodes/setup.html>`_ puis en suivant :ref:`la procédure de mise à jour <https://docs.dash.org/en/0.13.0/masternodes/dip3-upgrade.html>`. Pendant cette période de transition, le masternode continuera de fonctionner en mode de compatibilité, et toutes les fonctions relatives à la DIP003, telles que les paiements à une adresse distincte ou le pourcentage des paiements alloué aux opérateurs, ne seront pas encore fonctionnelles. Les clés ``ownerKeyAddr`` et ``votingKeyAddr`` doivent également être identiques d'ici à ce que le Spork 15 soit activé.
vi: Tất cả các chức năng liên quan đến DIP003 sẽ chỉ có hiệu lực sau khi Spork 15 được kích hoạt trên mạng. Trước khi đến lúc đó, thì vẫn cần phải thiết lập masternode theo `quy trình cũ <https://docs.dash.org/vi/0.12.3/masternodes/setup.html>`_ và sau đó tiến hành thông qua `quy trình nâng cấp <https://docs.dash.org/vi/0.13.0/masternodes/dip3-upgrade.html>`__. Trong giai đoạn này, masternode sẽ tiếp tục hoạt động trong chế độ tương thích, và tất cả các tính năng liên quan đến DIP003, sẽ chưa có hiệu lực. Các ``ownerKeyAddr`` và ``votingKeyAddr`` cũng phải giống hệt nhau đến tận khi Spork 15 được kích hoạt.

source: The process of setting up or upgrading a masternode is as follows:
fr: Le processus pour mettre en place ou à jour un masternode est le suivant :
ru: Процесс настройки или обновления мастерноды заключается в следующем:
vi: Tiến trình cài đặt hoặc nâng cấp một masternode là như sau:

source: Set up your server and operating system
fr: Configurez votre serveur et votre système d'exploitation
ru: Настройте свой сервер и операционную систему
vi: Cài đặt máy chủ và hệ điều hành

source: Install the Dash software and synchronize the blockchain
fr: Installez le logiciel Dash et synchronisez-le avec la blockchain
ru: Установите программное обеспечение Dash и синхронизируйте блокчейн
vi: Cài đặt phần mềm Dash và đồng bộ blockchain

source: Generate a BLS key pair and enter the private key on the masternode
fr: Générez une paire de clés BLS et indiquez la clé privée à votre masternode
ru: Сгенерируйте пару BLS-ключей и введите приватный ключ для мастерноды
vi: Sinh một cặp khoá BLS và nhập khoá riêng vào masternode

source: Prepare a ProRegTx transaction
fr: Préparer une transaction ProRegTx
ru: Подготовка транзакции ProRegTx
vi: Chuẩn bị cho một giao dịch ProRegTx

source: Sign the ProRegTx transaction
fr: Signer la transaction ProRegTx
ru: Подписание транзакции ProRegTx
vi: Ký cho giao dịch ProRegTx

source: Submit the signed ProRegTx transaction
fr: Soumettez la transaction ProRegTx signée
ru: Подтвердите подписанную транзакцию ProRegTx
vi: Gửi một giao dịch ProRegTx đã được ký

source: Step 1 can be omitted if you have an existing server. Steps 2 and 3 require direct access to the masternode. Steps 3 and 4 require access to a Dash Wallet (or DMT). Step 5 requires access to the wallet actually holding the collateral. Step 6 requires a Dash balance to pay the transaction fee.
fr: L'étape 1 peut être omise si vous avez déjà un serveur existant. Les étapes 2 et 3 impliquent un accès direct au masternode. Les étapes 3 et 4 impliquent l'accès à un portefeuille Dash (ou à DashMasternodeTool). L'étape 5 implique l'accès au portefeuille qui détient effectivement la caution. L'étape 6 implique d'avoir un solde Dash positif afin de régler les frais de transaction.
ru: Шаг 1 можно пропустить, если у вас есть существующий сервер. Шаги 2 и 3 требуют прямого доступа к мастерноде. Для шагов 3 и 4 требуется доступ к кошельку Dash (или DMT). Шаг 5 требует доступа к кошельку, на котором удерживается залог. Шаг 6 требует информации о балансе Dash для оплаты транзакционных комиссий.
vi: Bước 1 có thể bỏ qua nếu bạn đã có sẵn một máy chủ. Bước 2 và 3 cần truy cập trực tiếp vào masternode. Bước 3 và 4 yêu cầu truy cập đến một ví Dash Wallet (hoặc DMT). Bước 5 cần truy cập đến ví có chứa khoản đặt cọc. Bước 6 cần một số dư Dash để trả cho phí giao dịch.

source: Masternodes vs. mining
fr: Comparaison des masternodes et du minage
ru: Мастерноды и майнинг
vi: Masternodes so với đào coin

source: Dash, like Bitcoin and most other cryptocurrencies, is based on a decentralized ledger of all transactions, known as a blockchain. This blockchain is secured through a consensus mechanism; in the case of both Dash and Bitcoin, the consensus mechanism is Proof of Work (PoW). :ref:`Miners <mining>` attempt to solve difficult problems with specialized computers, and when they solve the problem, they receive the right to add a new block to the blockchain. If all the other people running the software agree that the problem was solved correctly, the block is added to the blockchain and the miner is rewarded.
fr: Dash, comme Bitcoin et la plupart des autres cryptomonnaies, est basé sur un registre décentralisé de toutes les transactions, connu sous le nom de blockchain. Cette blockchain est sécurisée par un mécanisme de consensus ; dans le cas de Dash comme de Bitcoin, le mécanisme de consensus est la preuve de travail (PoW). Les :ref:`mineurs <mining>` travaillent à résoudre des problèmes complexes avec des ordinateurs spécialisés, et, une fois les problèmes résolus, ils reçoivent le droit d'ajouter un nouveau bloc à la blockchain. Si toutes les autres personnes faisant tourner le logiciel s'accordent sur le fait que le problème a été résolu correctement, le bloc est ajouté à la blockchain et le mineur est récompensé.
ru: Dash, ровно как Bitcoin и большинство других криптовалют, основывается на технологии распределённого списка транзакций, называемой блокчейном. Блокчейн защищён через механизм консенсуса; в случае Dash и Bitcoin, этот механизм называется Proof of Work (доказательство выполненной работы). При данном консенсусе :ref:`Miners <mining>` майнеры пытаются решить сложные криптографические задачи, используя специальное программное обеспечение и/или компьютеры. Когда они решают задачу, то получают право добавить новый блок в блокчейн. Если все остальные люди, у которых запущено соответствующее программное обеспечение, согласны с тем, что задача решена верно, то блок добавляется в блокчейн и майнер получает вознаграждение.
vi: Dash, cũng giống như Bitcoin và hầu hết các loại tiền kỹ thuật số, là dựa trên một sổ cái phi tập trung chứa tất cả các giao dịch, được biết là một blockchain. Blockchain này được đảm bảo thông qua một cơ chế đồng thuận; trong trường hợp của cả Dash và Bitcoin, cơ chế đồng thuận đó là Proof of Work (PoW). :ref:`Các thợ mỏ <mining>` cố gắng giải quyết bài toán khó, họ nhận quyền tạo một khối mới vào blockchain. Nếu tất cả những người khác đang chạy phần mềm đó đồng ý rằng bài toán đã dược giải một cách chính xác, khối sẽ được tạo vào blockchain và thợ mỏ đó nhận được phần thưởng.

source: Dash works a little differently from Bitcoin, however, because it has a two-tier network. The second tier is powered by masternodes (Full Nodes), which enable financial privacy (PrivateSend), instant transactions (InstantSend), and the decentralized governance and budget system. Because this second tier is so important, masternodes are also rewarded when miners discover new blocks. The breakdown is as follows: 45% of the block reward goes to the miner, 45% goes to masternodes, and 10% is reserved for the budget system (created by superblocks every month).
fr: Cependant Dash fonctionne de manière légèrement différente de Bitcoin, car il dispose d'un réseau à deux niveaux. Le second niveau est constitué des masternodes (nœuds complets), qui rendent possibles la confidentialité financière (PrivateSend), les transactions instantanées (InstantSend), la gouvernance décentralisée et le système budgétaire. Parce que ce second niveau est d'une grande importance, les masternodes sont aussi récompensés quand les mineurs découvrent de nouveaux blocs. La répartition se fait comme suit : 45% de la récompense de bloc va au mineur, 45% au masternode, et 10% sont réservés au système budgétaire (créés tous les mois par un "superbloc").
ru: Dash работает несколько иначе, чем Bitcoin, причина этого в двухуровневой сети. Второй уровень сети обеспечивается мастернодами (полными нодами), которые предоставляют финансовую анонимность (PrivateSend), мгновенные транзакции (InstantSend) и децентрализованное управление с бюджетной системой. По этим причинам, второй уровень очень важен. В дополнение к этому, мастерноды получают награды, когда майнеры находят новые блоки. Награды распределяются следующим образом: 45% награды за блок идёт майнерам, 45% идёт мастернодам и 10% резервируется для системы Бюджета (эта часть содержится в ежемесячных суперблоках).
vi: Dash hoạt đông khác một chút so với Bitcoin, tuy nhiên, bởi vì nó có mạng lưới hai tầng. Tầng thứ hai được tạo bởi các masternode (các Full node), nó cho phép giao dịch tài chính riêng tư (PrivateSend), giao dịch tức thời (InstantSend), và hệ thống quản trị và cấp vốn phi tập trung. Bởi tầng thứ hai này là rất quan trọng, masternode cũng được trả thưởng khi các thợ mỏ tạo ra những khối mới. Nó chia phần thưởng khối như sau: 45% phần thưởng khối được trả cho thợ mỏ, 45% trả cho masternode và 10% dự trữ lại cho hệ thống ngân sách (được tạo ra bởi các siêu khối cứ mỗi tháng một lần).

source: The masternode system is referred to as Proof of Service (PoSe), since the masternodes provide crucial services to the network. In fact, the entire network is overseen by the masternodes, which have the power to reject improperly formed blocks from miners. If a miner tried to take the entire block reward for themselves or tried to run an old version of the Dash software, the masternode network would orphan that block, and it would not be added to the blockchain.
fr: On parle de preuve de service (PoSe) dans le cas des masternodes, car ils fournissent des services très importants au réseau. De fait, le réseau entier est surveillé par les masternodes, qui ont le pouvoir de rejeter des blocs mal formés par les mineurs. Si un mineur essayait de conserver pour lui la récompense de bloc entière, ou encore de faire tourner une vieille version du logiciel Dash, le réseau des masternodes isolerait ce bloc, et il ne serait pas ajouté à la blockchain.
ru: Система мастернод характеризуется как Proof of Service (PoSe), то есть "доказательство службы", поскольку мастерноды предоставляют жизненно важные услуги для сети. Фактически, мастерноды осуществляют наблюдение за работой всей сети и имеют власть отказать неверно сформированным майнерами блокам. Если бы майнер попробовал забрать всю награду за блок себе или попробовал бы работать на старом программном обеспечении Dash, то сеть мастернод определила бы его блок как орфан, то есть блок-сироту, не подходящий для сети и этот блок не был бы добавлен в блокчейн.
vi: Hệ thống masternode được gọi là Proof of Service (PoSe), từ khi masternode cung cấp những dịch vụ quan trọng cho mạng lưới. Thực ra, toàn bộ mạng lưới được giám sát bởi các masternode, nó có khả năng từ chối những khối được tạo không đúng bởi các thợ mỏ. Nếu một thợ mỏ cố gắng chiếm đoạt toàn bộ phần thưởng khối cho mình hoặc cố gắng chạy một phiên bản cũ của phần mềm Dash, thì mạng lưới masternode sẽ làm cho khối đó trở nên mồ côi, và nó sẽ không được đưa vào blockchain.

source: In short, miners power the first tier, which is the basic sending and receiving of funds and prevention of doublespending. Masternodes power the second tier, which provide the added features that make Dash different from other cryptocurrencies. Masternodes do not mine, and mining computers cannot serve as masternodes. Additionally, each masternode is “secured” by 1000 DASH. Those DASH remain under the sole control of their owner at all times, and can still be freely spent. The funds are not locked in any way. However, if the funds are moved or spent, the associated masternode will go offline and stop receiving rewards.
fr: Pour résumer, les mineurs constituent le premier niveau, qui permet l'envoi et la réception basiques des fonds et empêche la double dépense. Les masternodes constituent le second niveau, qui fournit les fonctionnalités supplémentaires distinguant Dash des autres cryptomonnaies. Les masternodes ne font pas de minage, et les ordinateurs de minage ne peuvent pas faire office de masternodes. De plus, chaque masternode est "sécurisé" par une somme de 1000 dashs. Ces dashs restent sous le contrôle exclusif de leur propriétaire, à tout moment, et peuvent toujours être librement dépensés par lui. Les fonds ne sont verrouillés en aucune manière. Cependant, si les fonds sont déplacés ou dépensés, le masternode associé passera hors ligne et arrêtera de recevoir des récompenses.
ru: Если суммировать, то майнеры представляют собой первый уровень, который ответственнен за получение и отправку средств и предотвращение двойных трат. Мастерноды это второй уровень, предоставляющий возможность использования дополнительных функций, которые и отличают Dash от других криптовалют. Мастерноды не занимаются майнингом, а майнинговые компьютеры не могут работать как мастерноды. Каждая мастернода требует "заблокировать" в ней 1000 DASH. Эти DASH всё время остаются под полным контролем их владельца и их можно потратить в любой момент. Эти средства не заблокированы в полном смысле, тем не менее, если они будут перемещены или потрачены, то соответствующая мастернода перестанет работать и получать награды.
vi: Nói một cách ngắn gọn, các thợ mỏ tạo nên tầng thứ nhất, nó cơ bản là gửi và nhận tiền và ngăn ngừa việc tiêu lặp. Masternode thì tạo nên tầng thứ hai, nó cung cấp những tính năng bổ sung làm cho Dash trở nên khác biệt với các loại tiền điện tử khác. Masternode không đào coin, và các máy đào không thể phục vụ như các masternode. Hơn nữa, mỗi masternode được "đảm bảo" bởi 1000 DASH. Những DASH đó vẫn luôn thuộc quyền quản lý của người chủ nó, và vẫn có thể được tự do chi tiêu. Khoản tiền này không bị khoá theo bất cứ cách thức nào. Tuy nhiên, nếu khoản tiền này được di chuyển hoặc chi tiêu, masternode gắn cùng với nó sẽ không được kích hoạt và sẽ dừng nhận phần thưởng.

source: Payment logic
fr: Processus de paiement
ru: Логика выплат
vi: Logic thanh toán
