Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/index.po
Languages: vi

source: Description of different wallets available to use and spend Dash cryptocurrency
vi: Miêu tả về những ví khác nhau hiện có cho việc sử dụng và chi tiêu tiền số Dash

source: dash, wallet, core, electrum, android, ios, paper, hardware, trezor, ledger, web, recovery, text, sms
vi: dash, ví, core, electrum, android, ios, paper, hardware, trezor, ledger, web, khôi phục, text, sms

source: Wallets
vi: Ví

source: Whenever you are storing objects with a market value, security is necessary. This applies to barter systems as well as economies using currency as a medium of exchange. While banks store balances on a private ledger, cryptocurrencies store balances under unique addresses on a distributed public ledger. The cryptographic private keys to access the balance stored on each public address are therefore the object of value in this system. This section of the documentation discusses different practical methods of keeping these keys safe in wallets, while still remaining useful for day-to-day needs.
vi: Bất cứ khi nào bạn lưu trữ những gì có giá trị trên thị trường thì bảo mật luôn là điều cần thiết. Điều này cũng đúng đối với các hệ thống trao đổi cũng như các nền kinh tế sử dụng đồng tiền như là một phương tiện để trao đổi. Trong khi các ngân hàng lưu trữ số dư tiền trong các sổ cái riêng thì tiền kỹ thuật số lại lưu trữ các số dư dưới các địa chỉ duy nhất trong một sổ cái phân tán công khai. Các khoá riêng trong mã hoá dùng để truy cập số dư được lưu trữ trên mỗi địa chỉ công khai và đó là các đối tượng có giá trong hệ thống này. Phần này của tài liệu sẽ thảo luận về những phương thức thực tế khác nhau trong việc giữ các chìa khoá này một cách an toàn trong các ví, và vẫn đảm bảo tính hữu dụng cho các nhu cầu hàng ngày.

source: For safety, it is not recommended to store significant funds on exchanges or software wallets. If you are holding cryptocurrency worth more than the device you use to store it, you should purchase a :ref:`hardware wallet <hardware-wallets>`.
vi: VÌ sự an toàn, bạn không nên chứa nhiều tiền trên các sàn giao dịch hoặc trên các ví mềm. Nếu bạn giữ tiền số có giá trị nhiều hơn thiết bị mà bạn đang dùng để chứa, thì bạn nên mua một :ref:`ví cứng <hardware-wallets>`.

source: Dash Core Wallet
vi: Ví Dash Core

source: Dash Core Wallet is the full official release of Dash, and supports all Dash features as they are released, including InstantSend and PrivateSend, as well as an RPC console and governance features. Dash Core Wallet (sometimes known as the QT wallet, due to the QT software framework used in development) is a professional or heavy wallet which downloads the full blockchain (several GB in size) and can operate as both a full node or masternode on the network. Because of the requirement to hold a full copy of the blockchain, some time is required for synchronisation when starting the wallet. Once this is done, the correct balances will be displayed and the functions in the wallet can be used. Dash Core Wallet is available for macOS, Linux, Raspberry Pi and Windows.
vi: Ví Dash Core là ví đầy đủ chính thức của Dash, và nó hỗ trợ tất cả các tính năng mà Dash cung cấp, bao gồm InstantSend và PrivateSend, cũng như là cửa sổ lệnh RPC và các tính năng quản trị. Ví Dash Core (đôi khi được biết với tên là ví QT, do sử dụng nền tảng QT để phát triển nên) là ví chuyên nghiệp và nặng, nó sẽ tải toàn bộ blockchain (kích thước vài GB) và hoạt động giống như một full node hoặc masternode trên mạng. Bởi vì nó đòi hỏi phải chứa toàn bộ đầy đủ cả blockchain, nên thường thường nó sẽ đòi hỏi đồng bộ ví mỗi khi khởi động phần mềm ví. Khi việc đồng bộ xong, số dư chính xác sẽ được hiển thị và các chức năng ví mới có thể dùng được. Ví Dash Core có thể hoạt động trên macOS, Linux, Raspberry Pi và Windows.

source: Features:
vi: Các tính năng

source: Wallet encryption
vi: Mã hoá ví

source: Coin control and fee control
vi: Kiểm soát coin và kiểm soát phí

source: QR code generation and address book
vi: Sinh mã QR và sổ địa chỉ

source: Masternode commands and voting
vi: Các lệnh Masternode và việc bỏ phiếu

source: Automated backup
vi: Sao lưu tự động

source: Debug console
vi: Cửa sổ debug

source: Available documentation:
vi: Các tài liệu

source: Dash Electrum Wallet
vi: Vì Dash Electrum

source: Dash Android Wallet
vi: Ví Dash cho Android

source: Dash offers a standalone wallet for Android, with development supported by the Dash budget. The Dash Android Wallet supports advanced Dash features, including contact management and InstantSend. You can scan and display QR codes for quick transfers, backup and restore your wallet, keep an address book of frequently used addresses, pay with NFC, sweep paper wallets and more.
vi: Dash cũng cung cấp một ví độc lập cho Android, với việc phát triển được cấp vốn từ ngân sách của Dash. Ví Dash cho Android hỗ trợ các tính năng tiên tiến của Dash, bao gồm quản lý danh bạ, giao dịch tức thời. Bạn có thể quét và hiển thị mã QR dùng cho việc thực hiện giao dịch nhanh chóng, sao lưu và khôi phục ví, lưu giữ danh bạ các địa chỉ thường xuyên giao dịch, thanh toán với NFC, cũng như quét ví từ ví giấy và những tính năng khác nữa.

source: *Dash Android Wallet*
vi: *Ví Dash cho Android*

source: Dash iOS Wallet
vi: Ví Dash cho iOS

source: Dash offers a standalone wallet for iOS, with development supported by the Dash budget. The official Dash Wallet supports advanced Dash features such as InstantSend sending and receiving. You can also scan and display QR codes for quick transfers and backup your wallet using a secure recovery phrase.
vi: Dash cung cấp một ví độc lập cho iOS, với kinh phí phát triển từ ngân sách của Dash. Ví chính thức này của Dash hỗ trợ những tính năng tiên tiến của Dash như InstantSend cho việc gửi và nhận. Bạn cũng có thể quét và hiển thị mã QR cho việc thực hiện giao dịch nhanh chóng, hay sao lưu và phục hồi ví sử dụng dòng chữ phục hồi.

source: *Dash iOS Wallet*
vi: *Ví Dash cho iOS*

source: Dash Paper Wallet
vi: Ví giấy Dash

source: The `Dash Paper Wallet generator <https://paper.dash.org>`_ allows you to generate, encrypt and secure the keys to a single Dash address on a clean computer without ever connecting to the internet. Perfect for long term secure storage.
vi: `Phần mềm sinh ví Dash trên giấy <https://paper.dash.org>`_ cho phép bạn sinh ra, mã hoá và bảo mật các khoá về một địa chỉ Dash đơn nhất trên một máy tính sách mà không kết nối vào Internet. Nó là cách tuyệt vời cho việc lưu trữ lâu dài một cách an toàn.

source: Hardware Wallets
vi: Các loại ví cứng

source: A hardware wallet is a type of device which stores private keys for a blockchain in a secure hardware device, instead of in a database file such as wallet.dat used with common software wallets. This offers major security advantages over software wallets, as well as practical benefits over paper wallets. To date, there is no verifiable evidence of hardware wallets being compromised by viruses, and they are also immune to keylogger attacks that could be used to steal passwords to unlock the private keys used with software wallets.
vi: Một ví phần cứng là một loại thiết bị lưu trữ khoá riêng của một blockchain trong một thiết bị phần cứng bảo mật, thay vì một file cơ sở dữ liệu như là file wallet.dat trong các phần mềm ví thông thường. Ví cứng mang đến những tính năng bảo mật tiên tiến so với các ví phầm mềm, cũng như những lợi ích thiết thực hơn so với các ví giấy. Cho đến hiện nay, không có những bằng chứng xác thực về việc ví phần cứng bị bẻ khoá bởi virus, và nó cũng miễn nhiễm với các phần mềm theo dõi bàn phím có thể đánh cắp mật khẩu để mở khoá các chìa khoá riêng trong các ví phần mềm.

source: Hardware wallets function by storing your private keys in a protected area of a microcontroller. It is impossible for the private key to leave the device in plain text - only the signed output of the cryptographic hash is ever transmitted to the device interacting with the blockchain, such as your computer or smartphone. Most hardware wallets feature a screen which allows you to independently confirm the address you are sending to is correct.
vi: Các ví phần cứng hoạt động bằng cách lưu khoá riêng của bạn trong một phần được bảo vệ bởi bộ vi điều khiển. Không thể để các khoá riêng của bạn ở trên thiết bị dưới dạng không mã hoá - chỉ đầu ra được ký trên một mã băm mới được truyền tài đến máy tính/điện thoại để tương tác với blockchain. Hầu hết các ví phần cứng đều có màn hình để cho phép bạn xác nhận một cách độc lập địa chỉ mà bạn muốn gửi tiền đến để đảm bảo sự chính xác.

source: This section lists the most common commercial hardware wallets supporting Dash, although some other enthusiast projects may also be available.
vi: Phần này liệt kê hầu hết các ví phần cứng thương mại thông dụng mà hỗ trợ Dash, mặc dù một vài dự án khác của những người nhiều tình cũng có thể có.

source: Trezor Web Wallet
vi: Ví web Trezor

source: Third Party Wallets
vi: Các loại ví của các hãng thứ 3

source: These wallets have been developed by external developers to support Dash. Many third party wallets support multiple different cryptocurrencies at the same time, or integrate instant cryptocurrency exchanges.
vi: Những ví này đã được phát triển bởi những lập trình viên bên ngoài để hỗ trợ cho Dash. Có rất nhiều các ví của các bên thứ ba hỗ trợ nhiều loại tiền số khác nhau tại cùng một thời điểm, hoặc tích hợp sàn giao dịch tực thời.

source: Edge Wallet
vi: Ví Edge

source: Web Wallets
vi: Các ví trên Web

source: Web wallets are services which keep a Dash balance for you, while maintaining control of the private keys on your behalf. Any Dash stored on :ref:`exchanges <exchanges>` falls under this category, but there are also some services able to store Dash for you through simple Google/Facebook login systems. Be extremely careful with web storage, as your Dash is only as secure as the reputation of the company storing it for you. A particular exception is MyDashWallet.org, which provides a secure web interface to the Dash blockchain while leaving you with full control of your private keys.
vi: Ví web là các dịch vụ để giữ số tiền bằng Dash cho bạn trên web, trong khi vẫn kiểm soát các khoá riêng dưới sự cho phép của bạn. Bất kỳ khoản Dash nào được lưu trữ trên :ref:`các sàn giao dịch<exchanges>` cũng nằm trong loại hình này. Tuy nhiên, có những dịch vụ có thể lưu giữ Dash cho bạn thông qua hệ thống đăng nhập bằng tài khoản Google/Facebook. Hãy cực kỳ cẩn thận với việc lưu trữ tiền hay Dash trên web. Bạn chỉ nên để Dash trên web của những công ty danh tiếng. Có một ngoại lệ đặc biệt đó là MyDashWallet.org. Nơi này cung cấp một giao diện web an toàn cho blockchain của Dash trong khi vẫn để cho bạn toàn quyền kiểm soát những khoá riêng của mình.

source: My Dash Wallet
vi: Ví My Dash Wallet

source: Text Wallets
vi: Ví SMS

source: Text wallets (or SMS wallets) allow users without smartphones or internet access to transact in Dash using text messages on simple feature phones. Innovative shortcodes, usually in collaboration with national mobile service providers, make it relatively simple to create transactions to both send and receive Dash.
vi: Ví SMS (hay ví Text) cho phép người dùng mà không có điện thoại thông minh hay Internet có thể truy cập và giao dịch với Dash bằng việc sử dụng các tin nhắn trên điện thoại di động thông thường. Các mã ngắn sáng tạo thường được dùng trong việc phối hợp giữa các mạng điện thoại di động quốc gia, làm cho nó trở nên tương đối đơn giản để tạo các giao dịch cả để gửi và nhận Dash.

source: Wallet Guides
vi: Hướng dẫn sử dụng ví

source: Documentation in this section describes common tasks and questions relating to all wallets.
vi: Tài liệu trong phần này sẽ mô tả những chức năng thông dụng và những câu hỏi liên quan đến các loại ví.
