Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/dashmate-new-host.po
Languages: ru

source: This guide describes how to set up a Dash evolution masternode.
ru: Данное руководство рассказывает как запустить Dash эвоноду

source: Dashmate on a new host
ru: Dashmate на новом хостинге

source: Setup a new node
ru: Создайте новую ноду

source: :ref:`Set up a new server <server-config>`
ru: :ref:`Запуск нового сервера <server-config>`

source: Download and install the `latest dashmate version <https://github.com/dashpay/platform/releases/latest>`__. For more details, refer to the :ref:`install instructions <evonode-setup-install-dashmate>`.
ru: Скачайте и установите `последнюю версию dashmate <https://github.com/dashpay/platform/releases/latest>`__. Для получения более подробной информации обратитесь к :ref:`инструкции по установке <evonode-setup-install-dashmate>`.

source: Sync a full node
ru: Синхронизация полной ноды

source: To minimize downtime, sync the Core blockchain without interrupting the existing node. The easiest way to do this is by syncing a full node and then converting it to an evonode.
ru: Чтобы минимизировать время остановки, синхронизируйте Core блокчейн, не прерывая работу существующей ноды. Самый простой способ сделать это - синхронизировать полную ноду, а затем преобразовать ее в эвоноду.

source: Set up a dashmate full node to sync Core first::
ru: Настройте полную ноду dashmate для синхронизации Core первым::

source: Select the network type and then ``fullnode`` for the node type
ru: Выберите тип сети, а затем ``full-нода`` для типа ноды.

source: Enable the indexes required by Platform and then start dashmate to sync::
ru: Включите индексы, необходимые для платформы, а затем запустите dashmate для синхронизации::

source: Make sure Core is syncing::
ru: Убедитесь, что Core синхронизируется:

source: Set up an evonode
ru: Создайте эвоноду

source: Once Core has finished syncing, reset the configuration and services. Use ``--keep-data`` so the synced data is retained::
ru: После завершения синхронизации Core сбросьте конфигурацию и сервисы. Используйте ``--keep-data``, чтобы синхронизированные данные сохранились::

source: Transfer the IP address to the new node. Alternatively, you can use the :ref:`protx update_service_evo command <dip3-update-service-evonode>` to set a new IP address for your dashmate-based evonode.
ru: Перенесите IP-адрес на новый узел. В качестве альтернативы вы можете использовать команду :ref:`protx update_service_evo command <dip3-update-service-evonode>`, чтобы установить новый IP-адрес для вашей эвоноды на базе dashmate.

source: Set up an evonode::
ru: Создайте эвоноду

source: Select the network type
ru: Выберите тип сети

source: Select ``evolution masternode`` when asked for node type
ru: Выберите ``evolution masternode`` при выборе типа ноды

source: Select ``Yes`` when asked if your masternode is already registered
ru: Выберите ``Yes`` на вопрос, зарегистрирована ли уже ваша мастернода

source: Select ``No`` when asked about importing existing data (the data is already present from the "Sync a full node" steps above)
ru: Выберите ``No`` на вопрос об импорте существующих данных (данные уже присутствуют в результате выполнения шагов «Sync a full node» выше).

source: Import your existing masternode's keys
ru: Импортируйте ключи существующей мастерноды

source: Obtain an SSL certificate. See the :ref:`SSL certificates <evonode-ssl-cert>` section for details.
ru: Получение сертификата SSL. Подробности см. в разделе :ref:`SSL certificates <evonode-ssl-cert>`.

source: Shutdown existing masternode
ru: Выключите существующую мастерноду

source: Shut down your existing server or dashd process
ru: Выключите существующий сервер или процесс dashd

source: If you keep the existing server running, ensure you do not have any startup schedulers configured (systemd, cron, etc.)
ru: Если вы сохраняете существующий сервер, убедитесь, что у вас не настроены планировщики запуска (systemd, cron и т. д.).

source: Start dashmate node
ru: Запустите ноду dashmate

source: Start the node::
ru: Запустите ноду::

source: Make sure the node works properly by running the following status commands::
ru: Убедитесь, что нода работает правильно, выполнив следующие команды проверки статуса::
