Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/dashmate-existing-host.po
Languages: ru

source: This guide describes how to set up a Dash evolution masternode.
ru: Данное руководство рассказывает как запустить Dash эвоноду

source: Dashmate on existing host
ru: Dashmate на существующем хостинге

source: Set up a dashmate node
ru: Запуск dashmate ноды

source: Download and install the `latest dashmate version <https://github.com/dashpay/platform/releases/latest>`__. For more details, refer to the :ref:`install instructions <evonode-setup-install-dashmate>`.
ru: Скачайте и установите `последнюю версию dashmate <https://github.com/dashpay/platform/releases/latest>`__. Для получения более подробной информации обратитесь к :ref:`инструкции по установке <evonode-setup-install-dashmate>`.

source: Set up an evonode::
ru: Создайте эвоноду

source: Select the network type
ru: Выберите тип сети

source: Select ``evolution masternode`` when asked for node type
ru: Выберите ``evolution masternode`` при выборе типа ноды

source: Select ``Yes`` when asked if your masternode is already registered
ru: Выберите ``Yes`` на вопрос, зарегистрирована ли уже ваша мастернода

source: Select ``Yes`` when asked about importing existing data (the data is already present from the "Sync a full node" steps above)
ru: Выберите ``Yes`` на вопрос об импорте существующих данных (данные уже присутствуют в результате выполнения шагов «Sync a full node» выше).

source: Import your existing masternode's keys
ru: Импортируйте ключи существующей мастерноды

source: Obtain an SSL certificate. See the :ref:`SSL certificates <evonode-ssl-cert>` section for details.
ru: Получение сертификата SSL. Подробности см. в разделе :ref:`SSL certificates <evonode-ssl-cert>`.

source: Stop existing dashd
ru: Остановите существующий dashd

source: Stop your existing dashd process
ru: Остановите ваш существующий процесс dashd

source: Make sure you do not have any startup schedulers configured to restart dashd (systemd, cron, etc.)
ru: Убедитесь, что у вас нет планировщиков запуска, настроенных на перезапуск dashd (systemd, cron и т. д.).

source: Start dashmate node
ru: Запустите ноду dashmate

source: Start the node::
ru: Запустите ноду::

source: Make sure the node works properly by running the following status commands::
ru: Убедитесь, что нода работает правильно, выполнив следующие команды проверки статуса::

source: Cleanup old dashd data
ru: Очистите старые данные dashd

source: Once you have confirmed everything is operating correctly, remove the old dashd data from your server to free up storage space.
ru: Убедившись, что все работает правильно, удалите старые данные dashd с сервера, чтобы освободить место для хранения.
