Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/dashmate-upgrade-v0_25.po
Languages: ru

source: This guide describes how to set up a Dash evolution masternode.
ru: Данное руководство рассказывает как запустить Dash эвоноду

source: Upgrade from dashmate v0.25
ru: Обновление с dashmate v0.25

source: Check your current dashmate version to make sure you are on the right path::
ru: Проверьте текущую версию dashmate, чтобы убедиться, что вы на нужном пути::

source: Install the new dashmate version
ru: Установите новую версию dashmate

source: Stop dashmate::
ru: Остановите dashmate::

source: Download and install the `latest dashmate version <https://github.com/dashpay/platform/releases/latest>`__. For more details, refer to the :ref:`install instructions <evonode-setup-install-dashmate>`.
ru: Скачайте и установите `последнюю версию dashmate <https://github.com/dashpay/platform/releases/latest>`__. Для получения более подробной информации обратитесь к :ref:`инструкции по установке <evonode-setup-install-dashmate>`.

source: Reset previous services to ensure compatibility with the new version::
ru: Сбросьте предыдущие сервисы, чтобы обеспечить совместимость с новой версией::

source: Set up SSL certificate
ru: Установите SSL-сертификат

source: There are two ways to set up SSL certificates:
ru: Существует два способа установки SSL-сертификатов:

source: Register for the ZeroSSL service and set your API key. Since ZeroSSL provides an API, dashmate can update your certificates automatically. The free plan only provides 3 free certificates (or 3 renewals of 1 certificate). Other plans require paying with a credit card.
ru: Зарегистрируйтесь в сервисе ZeroSSL и получите свой ключ API. Поскольку ZeroSSL предоставляет API, dashmate может обновлять ваши сертификаты автоматически. Бесплатный тарифный план предоставляет только 3 бесплатных сертификата (или 3 продления 1 сертификата). Другие тарифные планы требуют оплаты кредитной картой.

source: Obtain SSL certificates for your IP address using any available provider and upload certificate files. `SSL Dragon <https://www.ssldragon.com/>`_ and `SuperbitHost <https://www.superbithost.com/ssl-certificates/>`_ are two options that accept cryptocurrency.
ru: Получите SSL-сертификаты для вашего IP-адреса, используя любого доступного провайдера, и загрузите файлы сертификатов. `SSL Dragon <https://www.ssldragon.com/>`_ и `SuperbitHost <https://www.superbithost.com/ssl-certificates/>`_ - два варианта, которые принимают криптовалюту.

source: Choose which option works best for you and follow the relevant steps below to configure dashmate with your certificate.
ru: Выберите наиболее подходящий для вас вариант и выполните следующие шаги, чтобы настроить dashmate с вашим сертификатом.

source: Register on `https://zerossl.com/ <https://zerossl.com/>`_. We recommend not using your personal email address.
ru: Зарегистрируйтесь на сайте `https://zerossl.com/ <https://zerossl.com/>`_. Мы рекомендуем **не** использовать ваш личный адрес электронной почты.

source: Log in and click ``Developer`` on the left sidebar.
ru: Войдите в систему и нажмите ``Разработчик`` на левой боковой панели.

source: Copy your ZeroSSL API key. **Do not create a "New certificate".**
ru: Скопируйте свой API-ключ ZeroSSL. **Не создавайте «Новый сертификат»**.

source: ZeroSSL Developer tab showing the API key
ru: Вкладка ZeroSSL Developer, показывающая ключ API

source: Set your ZeroSSL API key in dashmate::
ru: Установите свой ключ API ZeroSSL в dashmate::

source: Files
ru: Файлы

source: Update the dashmate config::
ru: Обновите конфиг dashmate::

source: Copy ``bundle.crt`` and ``private.key`` to the dashmate home directory ``$HOME/.dashmate/mainnet/platform/gateway/ssl``
ru: Скопируйте ``bundle.crt`` и ``private.key`` в домашнюю директорию dashmate ``$HOME/.dashmate/mainnet/platform/gateway/ssl``

source: Start dashmate node
ru: Запустите ноду dashmate

source: Start the node::
ru: Запустите ноду::

source: Make sure the node works properly by running the following status commands::
ru: Убедитесь, что нода работает правильно, выполнив следующие команды проверки статуса::
