Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/maintenance.po
Languages: it, ru

source: Written and maintained by community member Bertrand256, Dash Masternode Tool (DMT) allows you to start a masternode from all major hardware wallets such as Trezor, Ledger and KeepKey. It also supports functions to vote on proposals and withdraw masternode payments without affecting the collateral transaction.
it: Scritto e gestito dal membro della comunità Bertrand256, Dash Masternode Tool (DMT) ti consente di avviare un masternode da tutti i principali portafogli hardware come Trezor, Ledger e KeepKey. Supporta anche funzioni per votare proposte e ritirare i pagamenti masternode senza influenzare la transazione collaterale.
ru: Программа написана и поддерживается членом сообщества Dash Bertrant256. Dash Masternode Tool (DMT) позволяет осуществлять запуск мастерноды со всех ведущих физических кошельков, таких как Trezor, Ledger и KeepKey. Дополнительно, программа поддерживает функцию голосования по бюджетным предложениям и вывода выплат для мастернод, не затрагивая залоговое подтверждение.

source: DASH Ninja, operated by forum member and Dash Core developer elbereth, offers key statistics on the adoption of different versions of Dash across the masternode network. Several features to monitor governance of the Dash, the masternode payment schedule and the geographic distribution of masternodes are also available, as well as a simple blockchain explorer.
it: DASH Ninja, gestito dal membro del forum e sviluppatore Dash Core elbereth, offre statistiche chiave sull'adozione di diverse versioni di Dash attraverso la rete masternode. Sono inoltre disponibili diverse funzionalità per monitorare la governance del Dash, il calendario dei pagamenti dei masternode e la distribuzione geografica dei masternode, oltre ad un semplice blockchain explorer.
ru: DASH Ninja управляется участником форума и разработчиком Dash Core под именем elbereth. Предлагается ключевая статистика по применению различных версий Dash во всей сети мастернод. Есть несколько функций для наблюдения за управлением Dash, расписанием вылат и географическим распределением мастернод. Доступен простой обозреватель блоков.

source: DashCentral, operated by forum member rango, offers an advanced service to monitor masternodes and vote on budget proposals through an advanced web interface.
it: DashCentral, gestito dal membro del forum Rango, offre un servizio avanzato per monitorare i masternode e votare le proposte di budget attraverso un'interfaccia web avanzata.
ru: DashCentral управляется членом форума под именем rango, на этом портале предлагаются продвинутые сервисы для наблюдения за мастернодами и голосованию по бюджетным предложениям через многофункциональный веб-интерфейс.

source: Dash Masternode Information
it: Informazione sui Dash Masternode
ru: Информация о мастерноде

source: This site, operated by forum member and Dash Core developer crowning, offers a visual representation of many key statistics of the Dash masternode network, including graphs of the total masternode count over time, price information and network distribution.
it: Questo sito, gestito dal membro del forum e dallo sviluppatore Dash Core, offre una rappresentazione visiva di molte statistiche chiave della rete Dash masternode, inclusi grafici del conteggio totale dei masternode nel tempo, informazioni sui prezzi e distribuzione della rete.
ru: Этот сайт управляется членом форума и разработчиком Dash Core под именем crowning. Он предлагает визуализацию различной важной статистики сети мастернод Dash, включая графики общего числа мастернод, информацию по цене и распределение сети.

source: Visit the `GitHub releases page <https://github.com/dashpay/dash/releases>`_ and copy the link to the latest `x86_64-linux-gnu` version. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
it: Visita la `pagina delle versioni di GitHub <https://github.com/dashpay/dash/releases>`_ e copia il collegamento all'ultima versione di `x86_64-linux-gnu`. Torna alla finestra del terminale e inserisci il comando seguente, incollando l'indirizzo dell'ultima versione di Dash Core facendo clic con il pulsante destro del mouse o premendo **Ctrl + V**::

source: Verify the authenticity of your download by checking its detached signature against the public key published by the Dash Core development team. All releases of Dash are signed using GPG with one of the following keys:
it: Verifica l'autenticità del tuo download controllando la sua firma staccata rispetto alla chiave pubblica pubblicata dal team di sviluppo di Dash Core. Tutte le versioni di Dash sono firmate utilizzando GPG con una delle seguenti chiavi:

source: Alexander Block (codablock) with the key ``63A9 6B40 6102 E091``, `verifiable here on Keybase <https://keybase.io/codablock>`__
it: Alexander Block (codablock) con la chiave ``63A9 6B40 6102 E091``, `verificabile qui su Keybase <https://keybase.io/codablock>`__

source: Pasta (pasta) with the key ``5252 7BED ABE8 7984``, `verifiable here on Keybase <https://keybase.io/pasta>`__
it: Pasta (pasta) con la chiave ``5252 7BED ABE8 7984``, `verificabile qui su Keybase <https://keybase.io/pasta>`__

source: A Provider Update Service Transaction (ProUpServTx) is used to update information relating to the operator. An operator can update the IP address and port fields of a masternode entry. If a non-zero ``operatorReward`` was set in the initial ProRegTx, the operator may also set the ``operatorPayoutAddress`` field in the ProUpServTx. If ``operatorPayoutAddress`` is not set and ``operatorReward`` is non-zero, the owner gets the full masternode reward. A ProUpServTx can be created from DMT by clicking the **Update service** button, or from Dash Core using the following syntax::
it: Una transazione del servizio di aggiornamento del fornitore (ProUpServTx) viene utilizzata per aggiornare le informazioni relative all'operatore. Un operatore può aggiornare l'indirizzo IP e i campi della porta di una voce masternode. Se nel ProRegTx iniziale è stato impostato un valore ``operatorReward`` diverso da zero, l'operatore può anche impostare il campo ``operatorPayoutAddress`` nel ProUpServTx. Se ``operatorPayoutAddress`` non è impostato e ``operatorReward`` è diverso da zero, il proprietario riceve l'intero premio masternode. È possibile creare un ProUpServTx da DMT facendo clic sul pulsante **Aggiorna servizio** o da Dash Core utilizzando la seguente sintassi::

source: ``ipAndPort``: IP and port in the form "ip:port"
it: ``ipAndPort``: IP e porta nella forma "ip:port"

source: After v19 hard fork activation, ``protx update_registrar_legacy`` must be used if a legacy scheme BLS key is being used to registrar update a masternode.
it: Dopo l'attivazione dell'hard fork v19, è necessario utilizzare ``protx update_registrar_legacy`` se una chiave BLS con schema legacy viene utilizzata per aggiornare un masternode da parte del registrar.

source: ``payoutAddress``: An updated Dash address for owner payments, or ``""`` to use the last on-chain operator key
it: ``payoutAddress``: un indirizzo Dash aggiornato per i pagamenti del proprietario o ``""`` per utilizzare l'ultima chiave dell'operatore on-chain

source: ``feeSourceAddress`` (optional): An address used to fund ProTx fee. ``PayoutAddress`` will be used if not specified.
it: ``feeSourceAddress`` (facoltativo): un indirizzo utilizzato per finanziare la tariffa ProTx. Se non specificato verrà utilizzato ``PayoutAddress``.

source: `Trezor <https://trezor.io/>`__ operates a `blockchain explorer <https ://dash-bitcore1.trezor.io/>`__ powered by a `Dash fork <https://github.com/dashpay/insight-ui>`__ of `insight <https://insight.is/>`__, an advanced blockchain API tool
it: `Trezor <https://trezor.io/>`__ gestisce un `blockchain explorer <https ://dash-bitcore1.trezor.io/>`__ alimentato da un `Dash fork <https://github.com/dashpay/insight-ui>`__ di `insight <https://insight.is/>`__, uno strumento API blockchain avanzato

source: Masternode.me, operated by Dash community member moocowmoo, offers sequential reports on the price, generation rate, blockchain information and some information on masternodes.
it: Masternode.me, gestito dal membro della comunità Dash moocowmoo, offre rapporti sequenziali su prezzo, tasso di generazione, informazioni sulla blockchain e alcune informazioni sui masternode.
