Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/maintenance.po
Languages: it, ru

source: Maintaining a Dash masternode involves staying up to date with the latest version, voting and handling payments
it: Mantenere un masternode Dash implica rimanere aggiornati con l'ultima versione, votare e gestire i pagamenti
ru: Обслуживание мастерноды Dash включает в себя регулярное обновление до последних версий программного обеспечения, голосование и обработку платежей

source: dash, cryptocurrency, masternode, maintenance, maintain, payments, withdrawal, voting, monitoring, dip3, upgrade, deterministic
it: dash, criptovalute, masternode, manutenzione, mantenere, pagamenti, prelievo, voto, monitoraggio, dip3, aggiornamento, deterministico
ru: dash, криптовалюта, мастернода, обслуживание, обслуживать, платежи, вывод, голосование, мониторинг, dip3, обновление, детерминированный

source: Maintenance
it: Manutenzione
ru: Обслуживание

source: Masternodes require regular maintenance to ensure you do not drop off the payment queue. This includes promptly installing updates to Dash, as well as maintaining the security and performance of the server. In addition, masternodes should vote on proposals and perform other tasks in the interest of the network and the value of the Dash they hold.
it: I Masternode richiedono una manutenzione regolare per assicurarti di non perdere la coda dei pagamenti. Ciò include l'installazione tempestiva degli aggiornamenti su Dash, nonché il mantenimento della sicurezza e delle prestazioni del server. Inoltre, i masternode dovrebbero votare le proposte e svolgere altri compiti nell’interesse della rete e del valore del Dash che detengono.
ru: Мастреноды требуют регулярного обслуживания, это необходимо для того, чтобы не выпасть из очереди на выплату наград. Обслуживание включает в себя своевременное обновление Dash и поддержку уровня безопасности и производительности сервера на должном уровне. Также мастерноды должны голосовать по бюджетным предложениям и выполнять другие задачи в интересах сети и для поддержки стоимости DASH, заложенных в них.

source: Masternode Software Update
it: Aggiornamento del software Masternode
ru: Обновление программного обеспечения мастерноды

source: The Dash Core software requires regular updates in order to remain consistent with the current network consensus. Follow the procedure described below to manually update your masternode. If you are still using the legacy dashman installer, see the legacy update documentation `here <https://docs.dash.org/en/0.15.0/masternodes/maintenance.html#masternode-software-update>`__.
it: Il software Dash Core richiede aggiornamenti regolari per rimanere coerente con l'attuale consenso della rete. Segui la procedura descritta di seguito per aggiornare manualmente il tuo masternode. Se stai ancora utilizzando il programma di installazione legacy del dashman, consulta la documentazione dell'aggiornamento legacy `qui <https://docs.dash.org/en/0.15.0/masternodes/maintenance.html#masternode-software-update>`__.
ru: Программное обеспечение Dash Core требует регулярного обновления, чтобы оставаться в соответствии с текущим сетевым консенсусом. Чтобы вручную обновить свою мастерноду, выполните описанную ниже процедуру. Если вы все еще используете устаревшую программу установки dashman, обратитесь к документации по обновлению устаревшей версии <https://docs.dash.org/en/0.15.0/masternodes/maintenance.html#masternode-software-update>`__.

source: Manual update
it: Aggiornamento manuale
ru: Ручное обновление

source: To update Dash manually, log in to your server using ssh or PuTTY. If your crontab contains an entry to automatically restart dashd, invoke ``crontab -e`` and comment out the appropriate line by adding the ``#`` character. It should look something like this::
it: Per aggiornare Dash manualmente, accedi al tuo server utilizzando ssh o PuTTY. Se il tuo crontab contiene una voce per riavviare automaticamente dashd, richiama ``crontab -e`` e commenta la riga appropriata aggiungendo il carattere ``#``. Dovrebbe assomigliare a qualcosa di simile a questo::
ru: Для обновления Dash вручную, войдите в учётную запись вашего сервера, использовав ssh или PuTTY. Если в вашем файле crontab содержится запись для автоматического перезапуска dashd, запустите ``crontab -e`` и пропишите соответствующую строку добавлением символа ``#``. Это должно выглядеть вот так::

source: Then stop Dash running::
it: Quindi interrompi l'esecuzione di Dash::
ru: После этого остановите работу Dash::

source: Visit the `GitHub releases page <https://github.com/dashpay/dash/releases/latest>`_ and copy the link to the latest `x86_64-linux-gnu` version. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
ru: Посетите `страницу релизов GitHub <https://github.com/dashpay/dash/releases/latest>`_ и скопируйте ссылку в последнюю версию `x86_64-linux-gnu`. Вернитесь в окно терминала и введите следующую команду, вставив адрес в последней версии Dash Core, кликнув правой кнопкой мыши или нажав **Ctrl + V**::

source: Verify the authenticity of your download by checking its detached signature against the public key published by the Dash Core development team. All releases of Dash since 0.16.0 are signed using GPG with the following key:
ru: Убедитесь в подлинности загруженного файла, сверив его подпись с открытым ключом, опубликованным командой разработчиков Dash Core. Все выпуски Dash начиная с v0.16.0 подписываются с помощью GPG следующим ключом:

source: Pasta (pasta) with the key ``5252 7BED ABE8 7984``, `verifiable on Keybase <https://keybase.io/pasta>`__ (`download <https://keybase.io/pasta/pgp_keys.asc>`__)
ru: Pasta, с ключом ``5252 7BED ABE8 7984``, `верифицируемым на Keybase <https://keybase.io/pasta>`__ (`скачать<https://keybase.io/pasta/pgp_keys.asc>`__)

source: Extract the compressed archive and copy the new files to the directory::
it: Estrai l'archivio compresso e copia i nuovi file nella directory::
ru: Распакуйте архив и скопируйте новые файлы в следующую папку::

source: Restart Dash::
it: Riavvia Dash::
ru: Перезапустите Dash::

source: You will see a message reading "Dash Core server starting". The Dash software on the masternode is now updated.
it: Verrà visualizzato il messaggio "Avvio del server Dash Core". Il software Dash sul masternode è ora aggiornato.
ru: Вы увидите сообщение "Запуск сервера Dash Core". Программное обеспечение Dash на мастерноде теперь обновлено.

source: Updating Masternode Information
it: Aggiornamento delle informazioni sul Masternode
ru: Информация по обновлению мастерноды

source: Periodically, it may be necessary to update masternode information if any information relating to the owner or operator changes. Examples may include a change in IP address, change in owner/operator payout address or changes to the nominated voting/operator keys. It is also possible to revoke a masternode's registered status (in the event of a security breach, for example) to force both owner and operator to update their details.
it: Periodicamente potrebbe essere necessario aggiornare le informazioni del masternode nel caso in cui cambino informazioni relative al proprietario o all'operatore. Gli esempi possono includere una modifica dell'indirizzo IP, una modifica dell'indirizzo di pagamento del proprietario/operatore o modifiche alle chiavi di voto/operatore nominate. È anche possibile revocare lo stato di registrazione di un masternode (ad esempio in caso di violazione della sicurezza) per costringere sia il proprietario che l'operatore ad aggiornare i propri dati.
ru: Периодически может возникнуть необходимость обновить информацию о мастерноде, если какие-либо данные о владельце или операторе мастерноды изменились. Например, это может быть IP адрес, изменение адреса выплат владельца/оператора или изменение назначенных для голосующего/оператора ключей. Также есть возможность отозвать зарегистрированный статус мастерноды (например, в случае проблем с безопасностью) для того, чтобы принудить и владельца, и оператора обновить данные.

source: Changing the BLS operator key or creating a new ProTx based on the same collateral transaction will reset your position in the payment queue. Changing your IP address or making changes to the voting or various payout addresses will not reset your position in the payment queue.
it: La modifica della chiave operatore BLS o la creazione di un nuovo ProTx basato sulla stessa transazione collaterale ripristinerà la tua posizione nella coda dei pagamenti. Cambiare il tuo indirizzo IP o apportare modifiche agli indirizzi di voto o ai vari indirizzi di pagamento non ripristinerà la tua posizione nella coda di pagamento.
ru: Смена ключа оператора BLS или создание нового ProTx на основе той же операции обеспечения приведет к сбросу позиции в очереди на выплату. Смена IP-адреса или внесение изменений в адреса голосования или различных выплат не приведет к сбросу позиции в очереди на выплату.

source: The Provider Update Service Transaction (ProUpServTx) is used to update information relating to the operator. An operator can update the IP address and port fields of a masternode entry. For evonodes, they can also update the Platform-related P2P and HTTP ports. If a non-zero ``operatorReward`` was set in the initial ProRegTx, the operator may also set the ``operatorPayoutAddress`` field in the ProUpServTx. If ``operatorPayoutAddress`` is not set and ``operatorReward`` is non-zero, the owner gets the full masternode reward.
ru: Транзакция Provider Update Service Transaction (ProUpServTx) используется для обновления информации, относящейся к оператору. Оператор может обновить поля IP-адреса и порта в записи мастерноды. Для эвонод он также может обновить связанные с платформой порты P2P и HTTP. Если ненулевое значение ``operatorReward`` было установлено в начальном ProRegTx, оператор может также установить поле ``operatorPayoutAddress`` в ProUpServTx. Если ``operatorPayoutAddress`` не задано и ``operatorReward`` ненулевое, владелец получает полное вознаграждение мастерноды.

source: Regular masternodes
ru: Обычные мастерноды

source: A masternode ProUpServTx can be created from DMT by clicking the **Update service** button, or from Dash Core using the following syntax::
ru: ProUpServTx мастерноды можно создать из DMT, нажав кнопку **Обновить сервис**, или из Dash Core, используя следующий синтаксис::

source: Where:
it: Dove:
ru: Где:

source: ``proTxHash``: The transaction id of the initial ProRegTx
it: ``proTxHash``: l'ID della transazione del ProRegTx iniziale
ru: ``proTxHash``: id транзакции изначального ProRegTx

source: ``operatorKey``: The operator BLS private key associated with the registered operator public key
it: ``operatorKey``: la chiave privata BLS dell'operatore associata alla chiave pubblica dell'operatore registrato
ru: ``operatorKey``: BLS приватный ключ оператора, привязанный к зарегистрированному публичному ключу оператора

source: ``operatorPayoutAddress`` (optional): The address used for operator reward payments. Only allowed when the ProRegTx had a non-zero ``operatorReward`` value. Enter ``""`` to use the last on-chain operator payout address, or as a placeholder when specifying a ``feeSourceAddress``.
it: ``operatorPayoutAddress`` (facoltativo): l'indirizzo utilizzato per i pagamenti dei premi dell'operatore. Consentito solo quando ProRegTx aveva un valore "operatorReward" diverso da zero. Inserisci ``""`` per utilizzare l'ultimo indirizzo di pagamento dell'operatore on-chain o come segnaposto quando specifichi un ``feeSourceAddress``.
ru: ``operatorPayoutAddress`` (необязательно): Адрес, используемый для выплат вознаграждений операторам. Допускается только в том случае, если ProRegTx имел ненулевое значение ``operatorReward``. Введите ``""``, чтобы использовать последний адрес выплаты вознаграждения оператора, или в качестве заполнителя при указании ``feeSourceAddress``.

source: ``feeSourceAddress`` (optional): An address used to fund ProTx fee. ``operatorPayoutAddress`` will be used if not specified.
it: ``feeSourceAddress`` (facoltativo): un indirizzo utilizzato per finanziare la tariffa ProTx. Se non specificato verrà utilizzato ``operatorPayoutAddress``.
ru: ``feeSourceAddress`` (по желанию): адрес, использующийся для оплаты комиссии за ProTx. Будет использоваться ``operatorPayoutAddress``, если не указано другое.

source: Example::
it: Esempio::
ru: Пример::

source: The masternode is now removed from the PoSe-banned list, and the IP:port and operator reward addresses are updated.
it: Il masternode è ora rimosso dall'elenco dei soggetti vietati da PoSe e gli indirizzi IP:porta e premio operatore vengono aggiornati.
ru: Теперь мастернода удалена из бан-списка PoSe, а IP:port и адрес награды оператора обновлены.

source: Evonodes
ru: Эвоноды

source: An evonode ProUpServTx can be created from DMT by clicking the **Update service** button, or from Dash Core using the following syntax::
ru: ProUpServTx эвоноды можно создать из DMT, нажав кнопку **Обновить сервис**, или из Dash Core, используя следующий синтаксис::

source: ``platformNodeId``: The Platform node ID derived from Platform P2P public key.
ru: ``platformNodeId``: ID ноды платформы, полученный из публичного ключа P2P платформы.

source: The evonode is now removed from the PoSe-banned list. The IP:port, Platform HTTP and P2P port and operator reward addresses are updated.
ru: Теперь эвонода удалена из списка нод забаненных PoSe. Обновлены IP:порт, HTTP-порт платформы и P2P-порт, а также адреса вознаграждения оператора.

source: A Provider Update Registrar Transaction (ProUpRegTx) is used to update information relating to the owner. An owner can update the operator's BLS public key (e.g. to nominate a new operator), the voting address and their own payout address. A ProUpRegTx can be created from DMT by clicking the **Update operator key**, **Update voting key** or **Update payout addr.** buttons, or from Dash Core using the following syntax::
it: Una transazione di aggiornamento del registrar del provider (ProUpRegTx) viene utilizzata per aggiornare le informazioni relative al proprietario. Un proprietario può aggiornare la chiave pubblica BLS dell'operatore (ad esempio per nominare un nuovo operatore), l'indirizzo di voto e il proprio indirizzo di pagamento. È possibile creare un ProUpRegTx da DMT facendo clic sui pulsanti **Aggiorna chiave operatore**, **Aggiorna chiave di voto** o **Aggiorna indirizzo pagamento**, oppure da Dash Core utilizzando la seguente sintassi:
ru: Регистрационная транзакция обновления информации о провайдере или Provider Update Registrar Transaction (ProUpRegTx) используется для обновления информации, касающейся владельца. Владелец может обновить публичный BLS ключ оператора (например, чтобы назначить нового оператора), адрес голосования и адреса выплат операторов. ProUpRegTx можно создать из DMT, нажав кнопки **Update operator key**, **Update voting key** или **Update payout addr.**, или из Dash Core, используя следующий синтаксис::

source: ``operatorKeyAddr``: An updated BLS public key, or ``""`` to use the last on-chain operator key
it: ``operatorKeyAddr``: una chiave pubblica BLS aggiornata o ``""`` per utilizzare l'ultima chiave dell'operatore sulla catena
ru: ``operatorKeyAddr``: Обновленный BLS публичный ключ или значение ``""`` для использования ключа последнего оператора в цепи.

source: ``votingKeyAddr``: An updated voting key address, or ``""`` to use the last on-chain voting key
it: ``votingKeyAddr``: un indirizzo chiave di voto aggiornato o ``""`` per utilizzare l'ultima chiave di voto sulla catena
ru: ``votingKeyAddr``: обновлённый адрес для ключа голосования или значение ``""`` для использования ключа последнего голосующего в блокчейне.

source: Example to update payout address::
it: Esempio per aggiornare l'indirizzo di pagamento::
ru: Пример обновления адреса выплат::

source: A Provider Update Revocation Transaction (ProUpRevTx) is used by the operator to terminate service or signal the owner that a new BLS key is required. It will immediately put the masternode in the PoSe-banned state. The owner must then issue a ProUpRegTx to set a new operator key. After the ProUpRegTx is mined to a block, the new operator must issue a ProUpServTx to update the service-related metadata and clear the PoSe- banned state (revive the masternode). A ProUpRevTx can be created from DMT by clicking the **Revoke operator** button, or from Dash Core using the following syntax::
it: Una transazione di revoca dell'aggiornamento del provider (ProUpRevTx) viene utilizzata dall'operatore per terminare il servizio o segnalare al proprietario che è necessaria una nuova chiave BLS. Metterà immediatamente il masternode nello stato vietato da PoSe. Il proprietario deve quindi emettere un ProUpRegTx per impostare una nuova chiave operatore. Dopo che ProUpRegTx è stato estratto in un blocco, il nuovo operatore deve emettere un ProUpServTx per aggiornare i metadati relativi al servizio e cancellare lo stato PoSe vietato (ripristinare il masternode). È possibile creare un ProUpRevTx da DMT facendo clic sul pulsante **Revoca operatore** oppure da Dash Core utilizzando la seguente sintassi:
ru: Транзакция отзыва обновления информации о провайдере или Provider Update Revocation Transaction (ProUpRevTx) используется оператором для прекращения услуг или сигнализации владельцу о том, что необходим новый BLS ключ. Данная транзакция немедленно поместит мастерноду в бан PoSe. Владелец должен будет отправить ProUpRegTx для назначения нового ключа оператора. После того как ProUpRegTX будет включена в блок, новый оператор должен будет отправить ProUpServTx для обновления метаданных и исключения из бана PoSe (восстановить мастерноду). ProUpRevTx можно создать из DMT, нажав кнопку **Revoke operator**, или из Dash Core, используя следующий синтаксис::

source: ``reason``: Integer value indicating the revocation `reason <https://github.com/dashpay/dips/blob/master/dip-0003.md#appendix-a-reasons-for-self-revocation-of-operators>`__
it: ``reason``: Valore intero che indica il motivo della revoca <https://github.com/dashpay/dips/blob/master/dip-0003.md#appendix-a-reasons-for-self-revocation-of-operators>`__
ru: ``reason``: целочисленное значение, обозначающее `причину отзыва <https://github.com/dashpay/dips/blob/master/dip-0003.md#appendix-a-reasons-for-self-revocation-of-operators>`__

source: Dashmate troubleshooting
ru: Устранение неисправностей Dashmate

source: If you have trouble with a dashmate-based masternode, use the ``dashmate doctor`` command to collect debug information for troubleshooting. See the :ref:`dashmate page <dashmate-doctor>` for details.
ru: Если у вас возникли проблемы с мастернодой на базе dashmate, используйте команду ``dashmate doctor`` для сбора отладочной информации для устранения неполадок. Подробности см. на :ref:`странице о Dashmate <dashmate-doctor>`.

source: If your masternode fails to provide service to the network in accordance with the current consensus rules, it will receive a :ref:`Proof of Service Ban <proof-of-service>`. If your masternode is in the ``POSE_BANNED`` status, you should check the following settings are configured correctly:
it: Se il tuo masternode non riesce a fornire il servizio alla rete in conformità con le attuali regole di consenso, riceverà un :ref:`Proof of Service Ban <proof-of-service>`. Se il tuo masternode è nello stato ``POSE_BANNED``, dovresti verificare che le seguenti impostazioni siano configurate correttamente:
ru: Если ваш мастернода не может обеспечить обслуживание сети в соответствии с действующими правилами консенсуса, он получит :ref:`Proof of Service Ban <proof-of-service>`. Если ваша мастернода находится в статусе ``POSE_BANNED``, необходимо проверить правильность следующих настроек:

source: Ensure you are running the :ref:`latest version of Dash <masternode-update>`
it: Assicurati di eseguire la :ref:`ultima versione di Dash <masternode-update>`
ru: Убедитесь, что вы используете :ref:`последнюю версию Dash <masternode-update>`.

source: Ensure your masternode has sufficient memory, swap, processing power and hard drive space
it: Assicurati che il tuo masternode disponga di memoria, swap, potenza di elaborazione e spazio sul disco rigido sufficienti
ru: Убедитесь, что мастерноде достаточно памяти, свопа, вычислительной мощности и места на жестком диске

source: Ensure you are fully synced to the `correct blockheight <https://insight.dash.org/insight/>`__, and that you are on the correct chain and not forked off
it: Assicurati di essere completamente sincronizzato con la `corretta altezza del blocco <https://insight.dash.org/insight/>`__ e di essere sulla catena corretta e non biforcato
ru: Убедитесь, что вы полностью синхронизированы с `корректной высотой блока <https://insight.dash.org/insight/>`__, и что вы находитесь в правильной цепочке, а не в вилочном соединении

source: Ensure that a BLS private key is specified using the ``masternodeblsprivkey`` option in the masternode's ``dash.conf`` file
it: Assicurati che sia specificata una chiave privata BLS utilizzando l'opzione ``masternodeblsprivkey`` nel file ``dash.conf`` del masternode
ru: Убедитесь, что закрытый ключ BLS указан с помощью опции ``masternodeblsprivkey`` в файле ``dash.conf`` мастерноды

source: Ensure that the BLS private key on the masternode is unique on the network and not shared with any other masternodes
it: Assicurati che la chiave privata BLS sul masternode sia univoca sulla rete e non condivisa con altri masternode
ru: Убедитесь, что закрытый ключ BLS мастерноды уникален в сети и не используется совместно с другими узлами.

source: Ensure that the BLS private key on the masternode corresponds to the BLS public key registered on the blockchain in the ``ProRegTx`` or ``ProUpRegTx``
it: Assicurarsi che la chiave privata BLS sul masternode corrisponda alla chiave pubblica BLS registrata sulla blockchain nel ``ProRegTx`` o ``ProUpRegTx``
ru: Убедитесь, что закрытый ключ BLS мастерноды соответствует открытому ключу BLS, зарегистрированному на блокчейне в ``ProRegTx`` или ``ProUpRegTx``.

source: Ensure that the ``externalip`` (and ``port`` if using testnet) are specified correctly and not blocked by a firewall or port forwarding service
it: Assicurarsi che ``externalip`` (e ``port`` se si utilizza testnet) siano specificati correttamente e non bloccati da un firewall o da un servizio di port forwarding
ru: Убедитесь, что ``externalip`` (и ``port``, если используется testnet) указаны правильно и не заблокированы брандмауэром или службой переадресации портов
