Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/maintenance.po
Languages: it, ru

source: Once you are certain these settings are correct, you can update your service status on the network and return to the valid set of masternodes by creating a :ref:`ProUpServTx <dip3-update-service>`. Monitor your masternode closely using ``masternode status`` and/or the ``debug.log`` file after restoring service. This information can help you pinpoint the specific misconfiguration that is causing the masternode to be banned. The masternode will be banned again if it continues to fail to provide service.
it: Una volta che sei sicuro che queste impostazioni siano corrette, puoi aggiornare lo stato del tuo servizio sulla rete e tornare al set valido di masternode creando un :ref:`ProUpServTx <dip3-update-service>`. Monitora attentamente il tuo masternode utilizzando ``masternode status`` e/o il file ``debug.log`` dopo aver ripristinato il servizio. Queste informazioni possono aiutarti a individuare la specifica errata configurazione che sta causando il ban del masternode. Il masternode verrà nuovamente bannato se continua a non fornire il servizio.
ru: Убедившись в правильности этих настроек, можно обновить статус обслуживания в сети и вернуться к действительному набору мастернод, создав :ref:`ProUpServTx <dip3-update-service>`. После восстановления обслуживания внимательно следите за состоянием своего мастерноды с помощью ``masternode status`` и/или файла ``debug.log``. Эта информация поможет определить конкретную неправильную конфигурацию, из-за которой мастер-узел был запрещен. Если мастернода продолжает отказываться от обслуживания, он будет снова запрещен.

source: DashCentral voting, verification and monitoring
it: Votazione, verifica e monitoraggio di DashCentral
ru: Голосование, проверки и слежение за мастернодами на DashCentral

source: DashCentral is a community-supported website managed by community member Rango. It has become a *de facto* site for discussion of budget proposals and to facilitate voting from a graphical user interface, but also offers functions to monitor masternodes.
it: DashCentral è un sito Web supportato dalla comunità gestito dal membro della comunità Rango. È diventato un sito *de facto* per la discussione di proposte di budget e per facilitare il voto da un'interfaccia utente grafica, ma offre anche funzioni per monitorare i masternode.
ru: Сайт Dash Central имеет поддержку сообщества и управляется пользователем Rango. Этот сайт стал местом, на котором "де-факто" обсуждаются бюджетные предложения, для чего там предлагается графический интерфейс, но, кроме этого, там можно следить за мастернодами.

source: Adding your masternode to DashCentral
it: Aggiunta del tuo masternode a DashCentral
ru: Добавление вашей мастерноды на Dash Central

source: `Dashcentral <https://www.dashcentral.org/>`_ allows you to vote on proposals from the comfort of your browser. After completing `registration <https://www.dashcentral.org/register>`_, go to the `masternodes <https://www.dashcentral.org/masternodes>`_ page and click the **Add masternode now** button. Enter your collateral address on the following screen:
it: `Dashcentral <https://www.dashcentral.org/>`_ ti consente di votare le proposte comodamente dal tuo browser. Dopo aver completato la `registrazione <https://www.dashcentral.org/register>`_, vai alla pagina `masternodes <https://www.dashcentral.org/masternodes>`_ e fai clic su **Aggiungi masternode adesso* *pulsante. Inserisci l'indirizzo del tuo collaterale nella schermata seguente:
ru: `Dashcentral <https://www.dashcentral.org/>`_ позволяет вам голосовать по бюджетным предложениям прямо из браузера. После завершения `регистрации <https://www.dashcentral.org/register>`_, пройдите на страницу `мастерноды <https://www.dashcentral.org/masternodes>`_ и нажмите кнопку **Add masternode now**. Введите адрес, на котором находится залоговое подтверждение на этом экране:

source: Adding a masternode to DashCentral
it: Aggiunta di un masternode a DashCentral
ru: Добавление мастерноды на Dash Central

source: Click **Add masternode**. Your masternode has now been added to DashCentral.
it: Fai clic su **Aggiungi masternode**. Il tuo masternode è stato ora aggiunto a DashCentral.
ru: Нажмите **Add masternode**. Теперь ваша мастернода добавлена на DashCentral.

source: Enabling voting from DashCentral
it: Abilitazione della votazione da DashCentral
ru: Включение системы голосования из Dash Central

source: Click **Edit** under **Voting privkeys** to enter your masternode private key to enable voting through the DashCentral web interface. Enter a voting passphrase (not the same as your login password, but equally important to remember!) and enter the private key (the same key you used in the dash.conf file on your masternode) on the following screen:
it: Fai clic su **Modifica** in **Chiavi private di voto** per inserire la chiave privata masternode per abilitare la votazione tramite l'interfaccia web di DashCentral. Inserisci una passphrase di voto (non uguale alla password di accesso, ma altrettanto importante da ricordare!) e inserisci la chiave privata (la stessa chiave che hai utilizzato nel file dash.conf sul tuo masternode) nella seguente schermata:
ru: Нажмите **Edit** под **Voting privkeys** и введите приватный ключ вашей мастерноды для подключения голосования через веб-интерфейс DashCentral. Введите кодовую фразу для голосования (она отличается от вашего пароля для входа на сайт и её также важно помнить!) и введите приватный ключ (тот же самый ключ, что вы использовали в файле dash.conf вашей мастерноды) на этом экране:

source: Adding voting privkeys to DashCentral
it: Aggiunta delle chiavi private di voto a DashCentral
ru: Добавление приватных ключей для голосования на Dash Central

source: It is important to note that the private key to start your masternode is unrelated to the private keys to the collateral address storing your 1000 DASH. These keys can be used to issue commands on behalf of the masternode, such as voting, but cannot be used to access the collateral. The keys are encrypted on your device and never stored as plain text on DashCentral servers. Once you have entered the key, click **Store encrypted voting privkeys on server**. You can now vote on proposals from the DashCentral web interface.
it: È importante notare che la chiave privata per avviare il tuo masternode non è correlata alle chiavi private dell'indirizzo collaterale in cui è memorizzato il tuo 1000 DASH. Queste chiavi possono essere utilizzate per impartire comandi per conto del masternode, come il voto, ma non possono essere utilizzate per accedere al collaterale. Le chiavi vengono crittografate sul tuo dispositivo e non vengono mai archiviate come testo normale sui server DashCentral. Una volta inserita la chiave, fare clic su **Memorizza le chiavi private di voto crittografate sul server**. Ora puoi votare le proposte dall'interfaccia web di DashCentral.
ru: Важно обратить внимание на то, что приватный ключ для запуска мастерноды не имеет отношения к приватным ключам адреса с залоговым подтверждением в 1000 DASH. Эти ключи могут использоваться для отдачи команд от имени мастерноды, например, на голосование и не могут использоваться для доступа к залоговому подтверждению. Эти ключи зашифрованы на вашем устройстве и не хранятся в текстовом формате на серверах DashCentral. Как только вы ввели ключ, нажмите **Store encrypted voting privkeys on server**. Теперь вы можете голосовать по бюджетным предложениям из веб-интерфейса DashCentral.

source: Verifying ownership
it: Verifica della proprietà
ru: Подтверждение владения

source: You can also issue a message from your address to verify ownership of your masternode to DashCentral. Click **Unverified** under **Ownership** and the following screen will appear:
it: Puoi anche inviare un messaggio dal tuo indirizzo per verificare la proprietà del tuo masternode a DashCentral. Fai clic su **Non verificato** in **Proprietà** e verrà visualizzata la seguente schermata:
ru: Вы можете создать сообщение из своего адреса для подтверждения владения мастернодой для DashCentral. Нажмите **Unverified** под **Ownership** и появится следующий экран:

source: Verifying ownership of your masternode to DashCentral
it: Verifica la proprietà del tuo masternode su DashCentral
ru: Подтверждение владения мастернодой для DashCentral

source: Instructions on how to sign your collateral address using a software wallet appear. If you are using a hardware wallet other than Trezor, you will need to use the DMT app to sign the address. If you are using the Trezor hardware wallet, go to your `Trezor wallet <https://wallet.trezor.io/>`_, copy the collateral address and click **Sign & Verify**. The following screen will appear, where you can enter the message provided by DashCentral and the address you wish to sign:
it: Vengono visualizzate le istruzioni su come firmare il tuo indirizzo di garanzia utilizzando un wallet software. Se utilizzi un wallet hardware diverso da Trezor, dovrai utilizzare l'app DMT per firmare l'indirizzo. Se stai utilizzando il wallet hardware Trezor, vai al tuo `wallet Trezor <https://wallet.trezor.io/>`_, copia l'indirizzo del collaterale e fai clic su **Firma e verifica**. Apparirà la seguente schermata, dove potrai inserire il messaggio fornito da DashCentral e l'indirizzo che desideri firmare:
ru: Инструкция по подписи адреса с залоговым подтверждением через программу, связанную с кошельком. Если вы используете физический кошелёк, отличный от Trezor, то необходимо использовать приложение DMT для подписи адреса. Если вы используете физический кошелёк Trezor, то зайдите `в него <https://wallet.trezor.io/>`_, скопируйте адрес суммы с залоговым подтверждением и нажмите **Sign & Verify**. Далее появится экран, где вы можете ввести сообщение, предоставленное Dash Central и адрес, который вы хотите подписать:

source: Signing a message from the Trezor Wallet
it: Firma un messaggio dal Wallet Trezor
ru: Подпись сообщения из кошелька Trezor

source: Click **Sign**, confirm on your Trezor device and enter your PIN to sign the message. A message signature will appear in the **Signature** box. Copy this signature and paste it into the box on DashCentral and click **Verify ownership**. Verification is now complete.
it: Fai clic su **Firma**, conferma sul tuo dispositivo Trezor e inserisci il PIN per firmare il messaggio. Nella casella **Firma** verrà visualizzata la firma del messaggio. Copia questa firma e incollala nella casella su DashCentral e fai clic su **Verifica proprietà**. La verifica è ora completa.
ru: Нажмите **Sign**, подтвердите ваш Trezor и введите PIN для подписи сообщения. Подпись сообщения появится в окне **Signature**. Скопируйте эту подпись, вставьте её в окно на DashCentral и нажмите **Verify ownership**. Процедура подтверждения завершена.

source: Masternode ownership has been successfully verified
it: La proprietà del Masternode è stata verificata con successo
ru: Владение мастернодой было успешно подтверждено

source: Installing the DashCentral monitoring script
it: Installazione dello script di monitoraggio DashCentral
ru: Установка скрипта наблюдения за мастернодой DashCentral

source: DashCentral offers a service to monitor your masternode, automatically restart dashd in the event of a crash and send email in the event of an error. Go to the `Account settings <https://www.dashcentral.org/account/edit>`_ page and generate a new API key, adding a PIN to your account if necessary. Scroll to the following screen:
it: DashCentral offre un servizio per monitorare il tuo masternode, riavviare automaticamente dashd in caso di arresto anomalo e inviare e-mail in caso di errore. Vai alla pagina `Impostazioni account <https://www.dashcentral.org/account/edit>`_ e genera una nuova chiave API, aggiungendo un PIN al tuo account se necessario. Scorrere fino alla schermata seguente:
ru: DashCentral предлагает сервис для наблюдения за вашей мастернодой, автоматический перезапуск dashd в случае отключения и отправку письма по e-mail в случае ошибки. Пройдите на страницу `Account settings <https://www.dashcentral.org/account/edit>`_ и создайте новый ключ API, добавив к своему профилю PIN, при необходимости. Проследуйте на этот экран:

source: Setting up the DashCentral monitoring script
it: Configurazione dello script di monitoraggio DashCentral
ru: Настройка скрипта наблюдения DashCentral

source: Copy the link to the current version of the dashcentral script by right- click and selecting **Copy link address**. Open PuTTY and connect to your masternode, then type::
it: Copia il collegamento alla versione corrente dello script dashcentral facendo clic con il pulsante destro del mouse e selezionando **Copia indirizzo collegamento**. Apri PuTTY e connettiti al tuo masternode, quindi digita::
ru: Скопируйте ссылку на текущую версию скрипта dashcentral, нажав правой кнопкой мыши и выбрав **Copy link address**. Откройте PuTTY, присоединитесь к своей мастерноде и напечатайте::

source: Replace the link with the current version of dashcentral-updater as necessary. Decompress the archive using the following command::
it: Sostituisci il collegamento con la versione corrente di dashcentral-updater, se necessario. Decomprimere l'archivio utilizzando il seguente comando::
ru: Заместите ссылку ссылкой с текущей версией dashcentral-updater, если необходимо. Разархивируйте архив, используя следующую команду:

source: View your masternode configuration details by typing::
it: Visualizza i dettagli di configurazione del tuo masternode digitando::
ru: Подробную информацию о конфигурации вашей мастерноды можно увидеть напечатав::

source: Copy the values for ``rpcuser`` and ``rpcpassword``. Then edit the dashcentral configuration by typing::
it: Copia i valori per ``rpcuser`` e ``rpcpassword``. Quindi modifica la configurazione di dashcentral digitando::
ru: Скопируйте значения для ``rpcuser` и ``rpcpassword``. Далее, отредактируйте конфигурацию dashcentral, написав:

source: Replace the values for ``api_key``, your masternode collateral address, ``rpc_user``, ``rpc_password``, ``daemon_binary`` and ``daemon_datadir`` according to your system. A common configuration, where ``lwhite`` is the name of the Linux user, may look like this:
it: Sostituisci i valori per ``api_key``, il tuo indirizzo collaterale masternode, ``rpc_user``, ``rpc_password``, ``daemon_binary`` e ``daemon_datadir`` in base al tuo sistema. Una configurazione comune, dove ``lwhite`` è il nome dell'utente Linux, potrebbe assomigliare a questa:
ru: Замените значения ``api_key``, адреса залогового подтверждения вашей мастерноды, ``rpc_user``, ``rpc_password``, ``daemon_binary`` и ``daemon_datadir`` в соответствии с вашей системой. Чаще всего, конфигурация выглядит следующим образом, где ``lwhite`` это имя пользователя Linux:

source: DashCentral updater configuration file
it: File di configurazione dell'aggiornamento DashCentral
ru: Конфигурационный файл DashCentral updater

source: Press **Ctrl + X** to exit, confirm you want save with **Y** and press **Enter**. Test your configuration by running the dashcentral script, then check the website. If it was successful, you will see that an update has been sent::
it: Premi **Ctrl + X** per uscire, conferma che vuoi salvare con **Y** e premi **Invio**. Testa la tua configurazione eseguendo lo script dashcentral, quindi controlla il sito web. Se ha avuto successo, vedrai che è stato inviato un aggiornamento:
ru: Нажмите **Ctrl + X** для выхода, подтвердите, что хотите сохранить, нажав **Y** , далее нажмите **Enter**. Протестируйте свою конфигурацию, запустив скрипт dashcentral, затем проверьте сайт. Если всё прошло успешно, вы увидете, что было отправлено обновление::

source: Manually testing the DashCentral updater
it: Testare manualmente il programma di aggiornamento DashCentral
ru: Тестирование DashCentral updater вручную

source: DashCentral updater has successfully sent data to the DashCentral site
it: Il programma di aggiornamento DashCentral ha inviato con successo i dati al sito DashCentral
ru: DashCentral updater успешно отправил данные на сайт DashCentral

source: Once you have verified your configuration is working, we can edit the crontab on your system to schedule the dcupdater script to run every 2 minutes. This allows the system to give you early warning in the event of a fault and will even restart the dashd daemon if it hangs or crashes. This is an effective way to make sure you do not drop off the payment queue. Type the following command::
it: Dopo aver verificato che la configurazione funzioni, possiamo modificare il crontab sul tuo sistema per programmare l'esecuzione dello script dcupdater ogni 2 minuti. Ciò consente al sistema di avvisarti tempestivamente in caso di guasto e di riavviare anche il demone dashd se si blocca o si blocca. Questo è un modo efficace per assicurarti di non perdere la coda di pagamento. Digitare il seguente comando::
ru: Как только вы убедились, что ваша конфгурация работает, то можно отредактировать crontab вашей системы для задачи расписания работы скрипта dcupdater каждые 2 минуты. Это позволит системе выдать вам раннее предупреждение в случае неполадок и перезапустит dash daemon в случае его зависания или прекращения работы. Это эффективный способ обрести уверенность в том, что вы не выпадите из очереди на выплаты. Напечатайте следующую команду::

source: Select an editor if necessary and add the following line at the end of your crontab, replacing lwhite with your username on your system::
it: Seleziona un editor se necessario e aggiungi la seguente riga alla fine del tuo crontab, sostituendo lwhite con il tuo nome utente sul tuo sistema:
ru: Выберите редактор, если необходимо, и добавьте следующую строку в конец вашего crontab, заменив lwhite на ваше имя пользователя в вашей системе::

source: Editing crontab to run the DashCentral updater automatically
it: Modifica crontab per eseguire automaticamente il programma di aggiornamento DashCentral
ru: Редактирование crontad для автоматического запуска DashCentral updater

source: Press **Ctrl + X** to exit, confirm you want save with **Y** and press **Enter**. The dcupdater script will now run every two minutes, restart dashd whenever necessary and email you in the event of an error.
it: Premi **Ctrl + X** per uscire, conferma che vuoi salvare con **Y** e premi **Invio**. Lo script dcupdater verrà ora eseguito ogni due minuti, riavvierà dashd quando necessario e ti invierà un'e-mail in caso di errore.
ru: Нажмите **Ctrl + X** для выхода, подтвердите, что хотите сохранить, нажав **Y** , далее нажмите **Enter**. Теперь скрипт dcupdater будет запускаться каждые 2 минуты, перезапускать dashd, когда это будет необходимо и отправлять вам e-mail в случае ошибки.

source: Masternode monitoring tools
it: Strumenti di monitoraggio di Masternode
ru: Интсрументы за наблюдением за мастернодой

source: Several sites operated by community members are available to monitor key information and statistics relating to the masternode network.
it: Sono disponibili diversi siti gestiti dai membri della comunità per monitorare informazioni chiave e statistiche relative alla rete masternode.
ru: Некоторые сайты, управляемые членами сообщества Dash, могут использоваться для слежения за ключевой информацией и статистикой, относящейся к сети мастернод.

source: Block Explorers
it: Block Explorer
ru: Обозреватели блоков

source: Since Dash is a public blockchain, it is possible to use block explorers to view the balances of any Dash public address, as well as examine the transactions entered in any given block. Each unique transaction is also searchable by its txid. A number of block explorers are available for the Dash network.
it: Poiché Dash è una blockchain pubblica, è possibile utilizzare i block explorer per visualizzare i saldi di qualsiasi indirizzo pubblico Dash, nonché esaminare le transazioni inserite in un dato blocco. Ogni transazione unica è ricercabile anche in base al suo txid. Sono disponibili numerosi block explorer per la rete Dash.
ru: Поскольку Dash является публичным блокчейном, то для просмотра балансов публичных адресов Dash возможно использование обозревателей блоков. Также возможно исследовать транзакции в любом блоке. Каждая уникальная транзакция доступна к поиску через txid. Для сети Dash существует несколько обозревателей блоков.

source: `Blockchair <https://blockchair.com/dash>`__ offers a block explorer with detailed visualizations to analyse the Dash blockchain.
it: `Blockchair <https://blockchair.com/dash>`__ offre un block explorer con visualizzazioni dettagliate per analizzare la blockchain di Dash.
ru: `Blockchair <https://blockchair.com/dash>`__ предлагает обозреватель блоков с подробными визуальными данными для анализа блокчейна Dash.

source: `CryptoID <https://chainz.cryptoid.info/>`__ offers a `Dash blockchain explorer <https://chainz.cryptoid.info/dash/>`__ and a `function <https://chainz.cryptoid.info/dash/masternodes.dws>`__ to view and map Dash masternodes.
it: `CryptoID <https://chainz.cryptoid.info/>`__ offre un `Dash blockchain explorer <https://chainz.cryptoid.info/dash/>`__ e una `funzione <https://chainz.cryptoid.info/dash/masternodes.dws>`__ per visualizzare e mappare i masternode Dash.
ru: `CryptoID <https://chainz.cryptoid.info/>`__ предлагает `Dash blockchain explorer <https://chainz.cryptoid.info/dash/>`__ и `функцию <https://chainz.cryptoid.info/dash/masternodes.dws>`__ для просмотра местоположения мастернод Dash.

source: `BitInfoCharts <https://bitinfocharts.com>`_ offers a `page <https://bitinfocharts.com/dash/>`_ of price statistics and information and a `blockchain explorer <https://bitinfocharts.com/dash/explorer/>`__.
it: `BitInfoCharts <https://bitinfocharts.com>`_ offre una `pagina <https://bitinfocharts.com/dash/>`_ di statistiche e informazioni sui prezzi e un `blockchain explorer <https://bitinfocharts.com/dash/explorer/>`__.
ru: `BitInfoCharts <https://bitinfocharts.com>`_ предлает `страницу <https://bitinfocharts.com/dash/>`_ со статистикой по ценам и `обозреватель блоков <https://bitinfocharts.com/dash/explorer/>`__.

source: `CoinCheckup <https://coincheckup.com/coins/dash/charts>`__ offers a range of statistics and data on most blockchains, including Dash.
it: `CoinCheckup <https://coincheckup.com/coins/dash/charts>`__ offre una gamma di statistiche e dati sulla maggior parte delle blockchain, inclusa Dash.
ru: `CoinCheckup <https://coincheckup.com/coins/dash/charts>`__ предоставляет ряд статистических данных и информации по большинству блокчейнов, включая Dash.

source: `Dash.org <https://www.dash.org/>`__ includes a blockchain explorer at `explorer.dash.org <https://explorer.dash.org/insight/>`__ and `insight.dash.org <https://insight.dash.org/insight/>`__.
it: `Dash.org <https://www.dash.org/>`__ include un blockchain explorer su `explorer.dash.org <https://explorer.dash.org/insight/>`__ e `insight.dash.org <https://insight.dash.org/insight/>`__.
ru: `Dash.org <https://www.dash.org/>`__ включает в себя обозреватели блокчейна по адресу `explorer.dash.org <https://explorer.dash.org/insight/>`__ и `insight.dash.org <https://insight.dash.org/insight/>`__.
