Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup-testnet.po
Languages: it, ru

source: This address can also be used as the **voting key address** (``votingKeyAddr``). Alternatively, you can specify an address provided to you by your chosen voting delegate, or simply generate a new voting key address as follows::
it: Questo indirizzo può essere utilizzato anche come **indirizzo chiave di voto** (``votingKeyAddr``). In alternativa, puoi specificare un indirizzo fornito dal delegato votante prescelto o semplicemente generare un nuovo indirizzo chiave di voto come segue::
ru: Этот адрес также может быть использован в качестве **адреса ключа голосования** (``votingKeyAddr``). В качестве альтернативы можно указать адрес, предоставленный Вам выбранным Вами делегатом голосования, или просто сгенерировать новый адрес ключа голосования следующим образом::

source: Then either generate or choose an existing address to receive the **owner's masternode payouts** (``payoutAddress``). It is also possible to use an address external to the wallet::
it: Quindi genera o scegli un indirizzo esistente per ricevere i **pagamenti del masternode del proprietario** (``payoutAddress``). E' possibile utilizzare anche un indirizzo esterno al wallet::
ru: Затем либо сгенерируйте, либо выберите из существующих второй адрес для получения **платежей владельца мастерноды** (``payoutAddress``). Также возможно использовать адрес внешнего кошелька::

source: You can also optionally generate and fund another address as the **transaction fee source** (``feeSourceAddress``). If you selected an external payout address, you must specify a fee source address.
it: Puoi anche opzionalmente generare e finanziare un altro indirizzo come **fonte della commissione di transazione** (``feeSourceAddress``). Se hai selezionato un indirizzo di pagamento esterno, devi specificare un indirizzo di origine della commissione.
ru: При желании можно сгенерировать и пополнить другой адрес в качестве **источника комиссии за транзакцию** (``feeSourceAddress``). Если выбран внешний адрес выплаты, то необходимо указать адрес источника комиссии.

source: Either the payout address or fee source address must have enough balance to pay the transaction fee, or the ``register_prepare`` transaction will fail.
it: L'indirizzo di pagamento o l'indirizzo di origine della commissione deve avere un saldo sufficiente per pagare la commissione di transazione, altrimenti la transazione "register_prepare" fallirà.
ru: Либо адрес выплаты, либо адрес источника комиссии должны иметь достаточный баланс для оплаты комиссии за транзакцию, иначе транзакция ``register_prepare`` завершится неудачей.

source: The private keys to the owner and fee source addresses must exist in the wallet submitting the transaction to the network. If your wallet is protected by a password, it must now be unlocked to perform the following commands. Unlock your wallet for 5 minutes::
it: Le chiavi private del proprietario e gli indirizzi della fonte delle commissioni devono essere presenti nel portafoglio che invia la transazione alla rete. Se il tuo portafoglio è protetto da password, ora deve essere sbloccato per eseguire i seguenti comandi. Sblocca il tuo portafoglio per 5 minuti::
ru: Приватные ключи владельца и адреса источника оплаты комиссии должны присутствовать в кошельке, отправляющем транзакцию в сеть. Если ваш кошелёк защищён паролем, то для выполнения указанных команд его необходимо разблокировать. Разблокируйте свой кошелёк на 5 минут::

source: We will now prepare an unsigned ProRegTx special transaction using the ``protx register_prepare`` command. This command has the following syntax::
it: Ora prepareremo una transazione speciale ProRegTx senza segno utilizzando il comando ``protx Register_prepare``. Questo comando ha la seguente sintassi::
ru: Сейчас мы подготовим неподписанную специальную ProRegTx-транзакцию, использовав команду ``protx register_prepare``. Эта команда имеет следующий синтаксис::

source: After v19 hard fork activation, ``protx register_prepare_legacy`` must be used if a legacy scheme BLS key is being used to register a masternode. It's recommended to instead generate a new basic scheme BLS key where possible. This can be done by following the :ref:`Generate a BLS key pair <testnet-bls-generation>` instructions.
it: Dopo l'attivazione dell'hard fork v19, è necessario utilizzare ``protx Register_prepare_legacy`` se viene utilizzata una chiave BLS con schema legacy per registrare un masternode. Si consiglia invece di generare una nuova chiave BLS dello schema di base, ove possibile. Questo può essere fatto seguendo le istruzioni :ref:`Genera una coppia di chiavi BLS <testnet-bls-generation>`.
ru: После активации хард форка v19 необходимо использовать ``protx register_prepare_legacy'', если для регистрации мастерноды используется BLS-ключ старой схемы. Вместо этого рекомендуется по возможности сгенерировать новый ключ BLS базовой схемы. Это можно сделать, следуя инструкции :ref:`Generate a BLS key pair <testnet-bls-generation>`.

source: Open a text editor such as notepad to prepare this command. Replace each argument to the command as follows:
it: Apri un editor di testo come Blocco note per preparare questo comando. Sostituisci ogni argomento del comando come segue:
ru: Откройте текстовый редактор, например Блокнот и подготовьте эту команду. Замените каждый аргумент команды следующим образом:

source: ``collateralHash``: The txid of the 1000 Dash collateral funding transaction
it: ``collateralHash``: il txid della transazione di finanziamento collaterale 1000 Dash
ru: ``collateralHash``: txid транзакции залогового финансирования на 1000 DASH

source: ``collateralIndex``: The output index of the 1000 Dash funding transaction
it: ``collateralIndex``: l'indice di output della transazione di finanziamento 1000 Dash
ru: ``collateralIndex``: Индекс выхода транзакции финансирования на 1000 DASH

source: ``ipAndPort``: Masternode IP address and port, in the format ``x.x.x.x:yyyy``
it: ``ipAndPort``: Indirizzo IP e porta del Masternode, nel formato ``x.x.x.x:yyyy``
ru: ``ipAndPort``: IP-адрес и порт мастерноды в формате ``x.x.x.x:yyyy``

source: ``ownerKeyAddr``: The new Dash address generated above for the owner/voting address
it: ``ownerKeyAddr``: il nuovo indirizzo Dash generato sopra per l'indirizzo del proprietario/voto
ru: ``ownerKeyAddr``: Сгенерированный выше новый адрес Dash для владельца/голосования

source: ``operatorPubKey``: The BLS public key generated above (or provided by your hosting service)
it: ``operatorPubKey``: la chiave pubblica BLS generata sopra (o fornita dal tuo servizio di hosting)
ru: ``operatorPubKey``: Публичный BLS-ключ, сгенерированный выше (или предоставленный хостинг-сервисом)

source: ``votingKeyAddr``: The new Dash address generated above, or the address of a delegate, used for proposal voting
it: ``votingKeyAddr``: il nuovo indirizzo Dash generato sopra, o l'indirizzo di un delegato, utilizzato per la votazione della proposta
ru: ``votingKeyAddr``: Новый адрес Dash, сгенерированный выше или адрес делегата, используемый для голосования по предложениям

source: ``operatorReward``: The percentage of the block reward allocated to the operator as payment
it: ``operatorReward``: La percentuale del premio in blocco assegnato all'operatore come pagamento
ru: ``operatorReward``: Процент награды за блок, который выделен оператору в качестве оплаты

source: ``payoutAddress``: A new or existing Dash address to receive the owner's masternode rewards
it: ``payoutAddress``: un indirizzo Dash nuovo o esistente per ricevere i premi masternode del proprietario
ru: ``payoutAddress``: Новый или существующий адрес Dash для получения платежей от владельца мастерноды

source: ``feeSourceAddress``: An (optional) address used to fund ProTx fee. ``payoutAddress`` will be used if not specified.
it: ``feeSourceAddress``: un indirizzo (facoltativo) utilizzato per finanziare la tariffa ProTx. Se non specificato verrà utilizzato ``payoutAddress``.
ru: ``feeSourceAddress``: (Необязательный) адрес, используемый для финансирования комиссий ProTx. Если не указан, то будет использоваться ``payoutAddress``.

source: Note that the operator is responsible for :ref:`specifying their own reward <dip3-update-service>` address in a separate ``update_service`` transaction if you specify a non-zero ``operatorReward``. The owner of the masternode collateral does not specify the operator's payout address.
it: Tieni presente che l'operatore è responsabile di :ref:`specificare il proprio indirizzo di ricompensa <dip3-update-service>` in una transazione ``update_service`` separata se specifichi un ``operatorReward`` diverso da zero. Il proprietario della garanzia masternode non specifica l'indirizzo di pagamento dell'operatore.
ru: Обратите внимание, что оператор несёт ответственность за указание адреса, на который будет начисляться :ref:`его собственная награда <dip3-update-service>` в отдельной транзакции ``update_service`` в случае, если вы укажете отличную от нуля награду ``operatorReward``. Владелец залогового подтверждения не указывает адрес для выплаты оператору.

source: Example (remove line breaks if copying)::
it: Esempio (rimuovere le interruzioni di riga durante la copia)::
ru: Пример (удалите разрывы строк при копировании)::

source: Next we will use the ``collateralAddress`` and ``signMessage`` fields to sign the transaction, and the output of the ``tx`` field to submit the transaction.
it: Successivamente utilizzeremo i campi ``collateralAddress`` e ``signMessage`` per firmare la transazione e l'output del campo ``tx`` per inviare la transazione.
ru: Теперь используем поля ``collateralAddress`` и ``signMessage`` для подписания транзакции и поле выхода ``tx`` для отправления транзакции.

source: Sign the ProRegTx transaction
it: Firma la transazione ProRegTx
ru: Подпишите транзакцию ProRegTx

source: We will now sign the content of the ``signMessage`` field using the private key for the collateral address as specified in ``collateralAddress``. Note that no internet connection is required for this step, meaning that the wallet can remain disconnected from the internet in cold storage to sign the message. In this example we will again use Dash Core, but it is equally possible to use the signing function of a hardware wallet. The command takes the following syntax::
it: Ora firmeremo il contenuto del campo ``signMessage`` utilizzando la chiave privata per l'indirizzo del collaterale come specificato in ``collateralAddress``. Tieni presente che per questo passaggio non è necessaria alcuna connessione Internet, il che significa che il wallet può rimanere disconnesso da Internet nella cella frigorifera per firmare il messaggio. In questo esempio utilizzeremo nuovamente Dash Core, ma è ugualmente possibile utilizzare la funzione di firma di un wallet hardware. Il comando assume la seguente sintassi::
ru: Теперь подпишем содержимое поля ``signMessage`` используя приватный ключ для залогового адреса, указанный в ``collateralAddress``. Обратите внимание, что для выполнения этого шага не требуется интернет-соединение, что значит, что для подписи сообщения кошелёк может оставаться отключённым от интернета в состоянии холодного хранилища. В этом примере мы снова используем Dash Core, но в равной степени возможно использовать функцию подписи аппаратного кошелька. Команда имеет следующий синтаксис::

source: Example::
it: Esempio::
ru: Пример::

source: Submit the signed message
it: Invia il messaggio firmato
ru: Подтвердите подписанное сообщение

source: We will now submit the ProRegTx special transaction to the blockchain to register the masternode. This command must be sent from a Dash Core wallet holding a balance on either the ``feeSourceAddress`` or ``payoutAddress``, since a standard transaction fee is involved. The command takes the following syntax::
it: Ora invieremo la transazione speciale ProRegTx alla blockchain per registrare il masternode. Questo comando deve essere inviato da un wallet Dash Core che contiene un saldo su "feeSourceAddress" o "payoutAddress", poiché è coinvolta una commissione di transazione standard. Il comando assume la seguente sintassi::
ru: Теперь мы отправим в блокчейн специальную транзакцию ProRegTx для регистрации мастерноды. Эта команда должна быть отправлена с кошелька Dash Core, имеющего баланс на ``feeSourceAddress`` или ``payoutAddress``, поскольку в этом случае взимается стандартная комиссия за транзакцию. Команда имеет следующий синтаксис::

source: Where:
it: Dove:
ru: Где:

source: ``tx``: The serialized transaction previously returned in the ``tx`` output field from the ``protx register_prepare`` command
it: ``tx``: La transazione serializzata precedentemente restituita nel campo di output ``tx`` dal comando ``protx Register_prepare``
ru: ``tx``: Сериализованная транзакция, ранее возвращённая в поле выхода ``tx`` из ``protx register_prepare``

source: ``sig``: The message signed with the collateral key from the ``signmessage`` command
it: ``sig``: il messaggio firmato con la chiave collaterale dal comando ``signmessage``
ru: ``sig``: Сообщение, подписанное залоговым ключом с помощью команды ``signmessage``

source: Your masternode is now registered and will appear on the Deterministic Masternode List after the transaction is mined to a block. You can view this list on the **Masternodes -> DIP3 Masternodes** tab of the Dash Core wallet, or in the console using the command ``protx list valid``, where the txid of the final ``protx register_submit`` transaction identifies your masternode.
it: Il tuo masternode è ora registrato e apparirà nell'elenco dei Masternode deterministici dopo che la transazione sarà stata estratta in un blocco. Puoi visualizzare questo elenco nella scheda **Masternodes -> DIP3 Masternodes** del wallet Dash Core o nella console utilizzando il comando ``protx list valid``, dove il txid del file finale ``protx Register_submit`` la transazione identifica il tuo masternode.
ru: Теперь ваша мастернода зарегистрирована и появится в списке детерминированных мастернод после того, как транзакция будет добыта в блок. Просмотреть этот список можно на вкладке **Masternodes -> DIP3 Masternodes** кошелька Dash Core или в консоли с помощью команды ``protx list valid``, где txid финальной транзакции ``protx register_submit`` идентифицирует ваш masternode.

source: Manual installation
it: Installazione Manuale
ru: Ручная установка

source: **The manual installation guide is currently a work in progress.**
it: **La guida all'installazione manuale è attualmente in fase di elaborazione.**
ru: **Руководство по установке в настоящее время находится в стадии разработки.

source: This guide describes how to manually download and install the components of your Dash masternode under Ubuntu Linux 22.04 LTS "Jammy Jellyfish" assuming you have a non-root user named ``dash``. You will need to manually adjust apt commands if using a different distro.
it: Questa guida descrive come scaricare e installare manualmente i componenti del tuo masternode Dash sotto Ubuntu Linux 22.04 LTS "Jammy Jellyfish" presupponendo che tu abbia un utente non root chiamato ``dash``. Dovrai regolare manualmente i comandi apt se usi una distribuzione diversa.
ru: В этом руководстве описана ручная загрузка и установка компонентов мастерноды Dash в Ubuntu Linux 22.04 LTS "Jammy Jellyfish" при условии, что у Вас есть пользователь не root с именем ``dash``. При использовании другого дистрибутива потребуется вручную настроить команды apt.

source: Core services
it: Servizi Core
ru: Core сервисы

source: Prepare your environment for installing keys through GPG::
it: Prepara il tuo ambiente per l'installazione delle chiavi tramite GPG::
ru: Подготовьте среду к установке ключей через GPG::

source: Tor is an internet relay system designed to preserve anonymity on the internet. Install Tor as follows::
it: Tor è un sistema di inoltro Internet progettato per preservare l'anonimato su Internet. Installa Tor come segue::
ru: Tor - это система интернет-ретрансляции, предназначенная для сохранения анонимности в Интернете. Установите Tor следующим образом::

source: Dash Core
it: Core Dash

source: Dash Core is a fork of Bitcoin Core and is responsible for all consensus and communication relating to the base blockchain. Download Dash Core as follows::
it: Dash Core è un fork di Bitcoin Core ed è responsabile di tutto il consenso e la comunicazione relativa alla blockchain di base. Scarica Dash Core come segue::
ru: Dash Core является форком Bitcoin Core и отвечает за все консенсусы и коммуникации, связанные с базовым блокчейном. Загрузить Dash Core можно следующим образом::

source: Verify the authenticity of your download by checking its detached signature against the public key published by the Dash Core development team. All releases of Dash are signed using GPG with the following key:
it: Verifica l'autenticità del tuo download controllando la sua firma staccata rispetto alla chiave pubblica pubblicata dal team di sviluppo di Dash Core. Tutte le versioni di Dash sono firmate utilizzando GPG con la seguente chiave:
ru: Убедитесь в подлинности загруженного файла, сверив его подпись с открытым ключом, опубликованным командой разработчиков Dash Core. Все выпуски Dash подписываются с помощью GPG следующим ключом:

source: Pasta (pasta) with the key ``5252 7BED ABE8 7984``, `verifiable here on Keybase <https://keybase.io/pasta>`__
it: Pasta (pasta) con la chiave ``5252 7BED ABE8 7984``, `verificabile qui su Keybase <https://keybase.io/pasta>`__
ru: Pasta с ключом ``5252 7BED ABE8 7984``, ``верифицируемым здесь на Keybase <https://keybase.io/pasta>`__

source: Extract the compressed archive and copy the necessary files to the directory::
it: Estrai l'archivio compresso e copia i file necessari nella directory::
ru: Распакуйте сжатый архив и скопируйте необходимые файлы в каталог::

source: Create a working directory for Dash Core::
it: Crea una directory di lavoro per Dash Core::
ru: Создайте рабочий каталог для Dash Core::

source: Configure Dash Core::
it: Configura Dash Core::
ru: Конфигурация Dash Core::

source: Optionally replace the ``rpcuser`` and ``rpcpassword`` fields with your own values. Leave the ``masternodeblsprivkey`` field commented out for now. Configure Dash Core to start as a service::
it: Facoltativamente, sostituisci i campi ``rpcuser`` e ``rpcpassword`` con i tuoi valori. Lasciare commentato il campo ``masternodeblsprivkey`` per ora. Configura Dash Core per l'avvio come servizio::
ru: По желанию замените поля ``rpcuser`` и ``rpcpassword`` своими значениями. Поле ``masternodeblsprivkey`` пока оставьте закомментированным. Настройте Dash Core на запуск в качестве службы::

source: Start Dash Core::
it: Avvia Dash Core::
ru: Запустите Dash Core

source: Verify Dash Core is running::
it: Verifica che Dash Core sia in esecuzione::
ru: Убедитесь, что Dash Core работает::

source: Use the following command to monitor sync status::
it: Utilizzare il seguente comando per monitorare lo stato di sincronizzazione::
ru: Для контроля статуса синхронизации используйте следующую команду::

source: When synchronisation is complete, you should see the following response::
it: Una volta completata la sincronizzazione, dovresti vedere la seguente risposta::
ru: По завершении синхронизации вы увидите следующий ответ::

source: Platform services
it: Servizi della Platform
ru: Сервисы платформы

source: Next, we will install the Dash Platform services. Start with installing JavaScript dependencies::
it: Successivamente, installeremo i servizi Dash Platform. Inizia con l'installazione delle dipendenze JavaScript::
ru: Далее мы установим сервисы платформы Dash. Начнем с установки JavaScript зависимостей::

source: Followed by Rust dependencies::
it: Seguito dalle dipendenze di Rust::
ru: Далее следуют Rust-зависимости::

source: And Go dependencies::
it: Dipendenze di And Go::
ru: И зависимости Go::

source: Drive is a replicated state machine for Dash Platform. Download Drive as follows::
it: Drive è una macchina a stati replicata per Dash Platform. Scarica Drive come segue::
ru: Drive представляет собой реплицируемую машину состояний для Dash Platform. Загрузить Drive можно следующим образом::

source: Configure Drive::
it: Configura Drive::
ru: Конфигурация Drive::

source: Start Drive::
it: Avvia Drive::
ru: Запустить Drive::

source: Verify Drive is running by checking for a time value under ``uptime``::
it: Verifica che Drive sia in esecuzione controllando il valore temporale in ``uptime``::
ru: Убедитесь, что Drive работает, проверив значение времени в поле ``uptime``::

source: Tenderdash is a fork of Tendermint and is the blockchain implementation used by Dash Platform. As binaries are not yet published, you will need to build from source. Build and install Tenderdash as follows::
it: Tenderdash è un fork di Tendermint ed è l'implementazione blockchain utilizzata da Dash Platform. Dato che i binari non sono ancora stati pubblicati, dovrai compilarli dal sorgente. Costruisci e installa Tenderdash come segue::
ru: Tenderdash является форком Tendermint и представляет собой реализацию блокчейна, используемого платформой Dash. Поскольку бинарные файлы еще не опубликованы, вам придется собирать из исходных текстов. Соберите и установите Tenderdash следующим образом::

source: Initialize Tenderdash::
it: Inizializza Tenderdash::
ru: Инициализация Tenderdash::

source: Several files will be generated in the ``~/.tenderdash`` directory. Modify the configuration with the following commands::
it: Verranno generati diversi file nella directory ``~/.tenderdash``. Modificare la configurazione con i seguenti comandi::
ru: В каталоге ``~/.tenderdash`` будет сгенерировано несколько файлов. Измените конфигурацию с помощью следующих команд::

source: Configure Tenderdash to start as a service::
it: Configura Tenderdash per l'avvio come servizio::
ru: Конфигурируйте Tenderdash на запуск в качестве сервиса::

source: Ensure Dash Core is fully synced and start Tenderdash::
it: Assicurati che Dash Core sia completamente sincronizzato e avvia Tenderdash::
ru: Убедитесь, что Dash Core полностью синхронизирован, и запустите Tenderdash::

source: Verify Tenderdash is running::
it: Verifica che Tenderdash sia in esecuzione::
ru: Убедитесь, что Tenderdash работает::

source: DAPI provides masternode services over the JSON RPC and gRPC protocols. Start DAPI as follows::
it: DAPI fornisce servizi masternode sui protocolli JSON RPC e gRPC. Avviare DAPI come segue::
ru: DAPI предоставляет услуги мастерноды по протоколам JSON RPC и gRPC. Запустите DAPI следующим образом::

source: Modify the configuration with the following commands::
it: Modificare la configurazione con i seguenti comandi::
ru: Измените конфигурацию с помощью следующих команд::

source: Start DAPI::
it: Avvia DAPI::
ru: Запустить DAPI::

source: Start the transaction filter stream::
it: Avvia il flusso del filtro delle transazioni::
ru: Запуск потока фильтрации транзакций::

source: Envoy
it: Inviato
