Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup-testnet.po
Languages: it, ru

source: This guide describes how to set up a Dash masternode with evo services.
it: Questa guida descrive come configurare un masternode Dash con i servizi evo.
ru: В данном руководстве описывается настройка мастерноды Dash с сервисами evo.

source: dash, guide, masternodes, trezor, dip3, setup, bls
it: dash, guide, masternodes, trezor, dip3, configura, bls
ru: dash, руководство, мастерноды, trezor, dip3, настройка, bls

source: Testnet Setup
it: Configurazione Testnet
ru: Testnet настройка

source: Setting up a masternode with support for evo services requires a basic understanding of Linux and blockchain technology, as well as an ability to follow instructions closely. It also requires regular maintenance and careful security, particularly if you are not storing your Dash on a hardware wallet. There are some decisions to be made along the way, and optional extra steps to take for increased security.
it: La configurazione di un masternode con supporto per i servizi evo richiede una conoscenza di base della tecnologia Linux e blockchain, nonché la capacità di seguire attentamente le istruzioni. Richiede inoltre una manutenzione regolare e un'attenta sicurezza, in particolare se non conservi il tuo Dash su un wallet hardware. Ci sono alcune decisioni da prendere lungo il percorso e passaggi aggiuntivi facoltativi da intraprendere per una maggiore sicurezza.
ru: Настройка и запуск ноды поддерживающей evo сервисы подразумевают наличие базового понимания Linux и технологии блокчейн, а также способности внимательно следовать инструкциям. Этот процесс также требует регулярного обслуживания и тщательной защиты, особенно если вы не храните DASH на аппаратном кошельке. Во время настройки необходимо будет принять некоторые решения и дополнительные меры для повышения безопасности.

source: Commercial :ref:`masternode hosting services <masternode-hosting>` are available if you prefer to delegate day-to-day operation of your masternode to a professional operator. When using these hosting services, you retain full control of the 1000 DASH collateral and pay an agreed percentage of your reward to the operator. It is also possible to delegate your voting keys to a representative, see the :ref:`governance documentation <delegating-votes>` for more information.
it: Commerciali :ref:`servizi di hosting masternode ` sono disponibili se preferisci delegare la gestione quotidiana del tuo masternode a un operatore professionale. Quando utilizzi questi servizi di hosting, mantieni il pieno controllo della garanzia 1000 DASH e paghi all'operatore una percentuale concordata della tua ricompensa. È anche possibile delegare le proprie chiavi di voto a un rappresentante, consultare la :ref:`documentazione sulla governance` per ulteriori informazioni.
ru: Если вы предпочитаете делегировать повседневную работу вашей мастерноды профессиональному оператору, то для этого существуют коммерческие :ref:`сервисы хостинга мастернод <masternode-hosting>`. Используя такие сервисы хостинга, вы сохраняете полный контроль над залогом в 1000 DASH и выплачиваете согласованный процент от вашего вознаграждения оператору. Также можно делегировать представителю ваши ключи для голосования, для получения дополнительной информации смотрите :ref:`документацию по управлению: <delegating-votes>`.

source: Before you begin
it: Prima di iniziare
ru: Прежде чем начать

source: This guide assumes you are setting up a single testnet masternode for the first time. If you are updating a masternode, see :ref:`here <masternode-update>` instead. You will need:
it: Questa guida presuppone che tu stia configurando un singolo masternode testnet per la prima volta. Se stai aggiornando un masternode, vedi invece :ref:`qui `. Avrai bisogno:
ru: В этом руководстве предполагается, что вы настраиваете одну мастерноду в тестовой сети и делаете это впервые. Если вы обновляете мастерноду, то вместо этой смотрите информацию :ref:`здесь <masternode-update>`. Вам понадобится:

source: A wallet to store your Dash, preferably a hardware wallet, although Dash Core wallet is also supported
it: Un wallet per conservare il tuo Dash, preferibilmente un wallet hardware, sebbene sia supportato anche il wallet Dash Core
ru: Кошелёк для хранения DASH, предпочтительно аппаратный кошелёк, хотя кошелёк Dash Core также поддерживается

source: A Linux server, preferably a Virtual Private Server (VPS)
it: Un server Linux, preferibilmente un server privato virtuale (VPS)
ru: Сервер Linux, предпочтительно виртуальный выделенный сервер (VPS)

source: For information about hosted masternodes, see the documentation listed below:
it: Per informazioni sui masternode ospitati, consultare la documentazione elencata di seguito:
ru: Информацию о размещенных мастернодах см. в документации, приведенной ниже:

source: :ref:`Information for users of hosted masternodes <hosted-setup>`
it: :ref:`Informazioni per gli utenti di masternodes ospitati <hosted-setup>`
ru: :ref:`Информация для пользователей активных мастернод <hosted-setup>`

source: :ref:`Information for operators of hosted masternodes <operator-transactions>`
it: :ref:`Informazioni per gli utenti di masternodes ospitati <operator-transactions>`
ru: :ref:`Информация для операторов активных мастернод <operator-transactions>`

source: This documentation describes the commands as if they were entered in the Dash Core GUI by opening the console from **Window > Console**, but the same result can be achieved on a masternode by entering the same commands and adding the prefix ``~/.dashcore/dash-cli`` to each command.
it: Questa documentazione descrive i comandi come se fossero stati immessi nella GUI Dash Core aprendo la console da **Finestra > Console**, ma lo stesso risultato può essere ottenuto su un masternode inserendo gli stessi comandi e aggiungendo il prefisso ``~ /.dashcore/dash-cli`` a ciascun comando.
ru: В данной документации описаны команды, которые вводятся в графическом интерфейсе Dash Core путем открытия консоли из команды **Window > Console**, но тот же результат может быть достигнут на мастерноде путем ввода тех же команд и добавления префикса ``~/.dashcore/dash-cli`` к каждой команде.

source: Server configuration
it: Configurazione del server
ru: Конфигурация сервера

source: Proper server configuration is essential to successful masternode operation for both security and performance reasons. Refer to the :hoverxref:`Server configuration <server-config>` page for details on preparing your server to host a masternode.
it: La corretta configurazione del server è essenziale per il successo del funzionamento del masternode sia per motivi di sicurezza che di prestazioni. Fai riferimento alla pagina :hoverxref:`Configurazione del server <server-config>` per i dettagli su come preparare il tuo server per ospitare un masternode.
ru: Правильная конфигурация сервера необходима для успешной работы мастерноды как с точки зрения безопасности, так и с точки зрения производительности. Подробную информацию о подготовке сервера к размещению masternode см. на странице :hoverxref:`Конфигурация сервера <server-config>`.

source: Send the collateral
it: Invia il collaterale
ru: Отправьте залог

source: A Dash address with a single unspent transaction output (UTXO) of exactly 1000 DASH is required to operate a masternode. Once it has been sent, various keys regarding the transaction must be extracted for later entry in a configuration file and registration transaction as proof to write the configuration to the blockchain so the masternode can be included in the deterministic list. A masternode can be registered from a hardware wallet or the official Dash Core wallet, although a hardware wallet is highly recommended to enhance security and protect yourself against hacking. This guide will describe the steps for both hardware wallets and Dash Core.
it: Per far funzionare un masternode è necessario un indirizzo Dash con un singolo output di transazione non speso (UTXO) esattamente di 1000 DASH. Una volta inviato, è necessario estrarre varie chiavi relative alla transazione per il successivo inserimento in un file di configurazione e registrazione della transazione come prova per scrivere la configurazione sulla blockchain in modo che il masternode possa essere incluso nella lista deterministica. Un masternode può essere registrato da un wallet hardware o dal wallet ufficiale Dash Core, sebbene un wallet hardware sia altamente raccomandato per migliorare la sicurezza e proteggersi dagli attacchi hacker. Questa guida descriverà i passaggi sia per i wallet hardware che per Dash Core.
ru: Для работы с мастернодой необходим адрес Dash с одним неизрасходованным транзакционным выходом (UTXO), равным ровно 1000 DASH. После того, как он был отправлен, необходимо извлечь различные ключи, касающиеся транзакции, для последующей записи в файл конфигурации и регистрации транзакции в качестве доказательства записи конфигурации в блокчейн, чтобы мастерноду можно было добавить в детерминированный список. Мастернода может быть зарегистрирована из аппаратного кошелька или официального кошелька Dash Core, хотя настоятельно рекомендуется использовать аппаратный кошелёк для повышения безопасности и защиты от взлома. В этом руководстве будут описаны шаги настройки запуска как с аппаратного кошелька, так и из кошелька Dash Core.

source: Option 1: Holding collateral in a hardware wallet
it: Opzione 1: conservare la garanzia in un portafoglio hardware
ru: Вариант 1: Обеспечение в аппаратном кошельке

source: Set up your Trezor using the Trezor wallet at https://wallet.trezor.io/ and send a test transaction to verify that it is working properly. For help on this, see :ref:`this guide <hardware-trezor>` - you may also choose to (carefully!) `add a passphrase <https://blog.trezor.io/passphrase-the-ultimate-protection-for-your-accounts-3a311990925b>`_ to your Trezor to further protect your collateral. Create a new account in your Trezor wallet by clicking **Add account**. Then click the **Receive** tab and send exactly 1000 DASH to the address displayed. If you are setting up multiple masternodes, send 1000 DASH to consecutive addresses within the same new account. You should see the transaction as soon as the first confirmation arrives, usually within a few minutes.
it: Configura il tuo Trezor utilizzando il wallet Trezor su https://wallet.trezor.io/ e invia una transazione di prova per verificare che funzioni correttamente. Per assistenza in merito, consulta :ref:`questa guida <hardware-trezor>` - puoi anche scegliere (con attenzione!) `aggiungere una passphrase <https://blog.trezor.io/passphrase-the-ultimate-protection-for-your-accounts-3a311990925b>`_ al tuo Trezor per proteggere ulteriormente la tua garanzia. Crea un nuovo account nel tuo wallet Trezor facendo clic su **Aggiungi account**. Quindi fai clic sulla scheda **Ricevi** e invia esattamente 1000 DASH all'indirizzo visualizzato. Se stai configurando più masternode, invia 1000 DASH a indirizzi consecutivi all'interno dello stesso nuovo account. Dovresti vedere la transazione non appena arriva la prima conferma, solitamente entro pochi minuti.
ru: Настройте свой Trezor с помощью кошелька Trezor по адресу https://wallet.trezor.io/ и отправьте тестовую транзакцию, чтобы убедиться в его работоспособности. Помощь в этом вопросе см. в :ref:`в этом гайде <hardware-trezor>` - вы также можете (осторожно!) `добавить парольную фразу <https://blog.trezor.io/passphrase-the-ultimate-protection-for-your-accounts-3a311990925b>`_ к вашему Trezor для дополнительной защиты вашего залога. Создайте новый счет в кошельке Trezor, нажав **Add account**. Затем перейдите на вкладку **Receive** и отправьте на указанный адрес ровно 1000 DASH. Если вы создаете несколько мастернод, отправьте 1000 DASH на последовательные адреса в рамках одного нового счета. Вы увидите транзакцию, как только придет первое подтверждение, обычно в течение нескольких минут.

source: Trezor Wallet Receive tab showing successfully received collateral of 1000 DASH
it: Scheda Ricevi di Trezor Wallet che mostra il collaterale ricevuto con successo di 1000 DASH
ru: Вкладка Receive из кошелька Trezor, в которой отображается успешно переведённый залог в размере 1000 DASH

source: Once the transaction appears, click the QR code on the right to view the transaction on the blockchain. Keep this window open as we complete the following steps, since we will soon need to confirm that 15 confirmations exist, as shown in the following screenshot.
it: Una volta visualizzata la transazione, fai clic sul codice QR a destra per visualizzare la transazione sulla blockchain. Mantieni questa finestra aperta mentre completiamo i passaggi successivi, poiché presto dovremo confermare che esistono 15 conferme, come mostrato nello screenshot seguente.
ru: Когда транзакция появится, кликните на QR-код справа, чтобы увидеть транзакцию в блокчейне. Не закрывайте это окно, пока выполняете дальнейшие шаги, поскольку скоро нам понадобится подтвердить, что существует 15 подтверждений транзакции, как показано на скриншоте ниже.

source: Trezor blockchain explorer showing 15 confirmations for collateral transfer
it: Trezor blockchain explorer che mostra 15 conferme per il trasferimento di garanzie
ru: Блокчейн обозреватель Trezor показывает, что прошло 15 подтверждений перевода

source: While we are waiting for 15 confirmations, download the latest version of the Dash Masternode Tool (DMT) from the GitHub releases page `here <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Unzip and run the file. The following window appears.
it: Mentre aspettiamo 15 conferme, scarica l'ultima versione di Dash Masternode Tool (DMT) dalla pagina delle versioni di GitHub `qui <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Decomprimere ed eseguire il file. Viene visualizzata la seguente finestra.
ru: Во время ожидания завершения 15 подтверждений, загрузите последнюю версию Dash Masternode Tool (DMT) со страницы релизов GitHub `здесь <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Распакуйте и запустите файл. Появится следующее окно.

source: Dash Masternode Tool startup screen
it: Schermata di avvio di Dash Masternode Tool
ru: Экран запуска Dash Masternode Tool

source: Click the third button from the left **Check Dash Network Connection** in the top left corner of the main window to verify that the connection is working. Then connect your Trezor device and click the next button **Test Hardware Wallet Connection** to verify the Trezor connection is working.
it: Fai clic sul terzo pulsante da sinistra **Verifica connessione di rete Dash** nell'angolo in alto a sinistra della finestra principale per verificare che la connessione funzioni. Quindi collega il tuo dispositivo Trezor e fai clic sul pulsante successivo **Test connessione hardware Wallet** per verificare che la connessione Trezor funzioni.
ru: Кликните третью кнопку слева **Check Dash Network Connection** в верхнем левом углу главного окна, чтобы убедиться, что соединение работает. Затем соединитесь с вашим устройством Trezor и кликните следующую кнопку **Test Hardware Wallet Connection**, чтобы убедиться, что соединение с Trezor работает.

source: Dash Masternode Tool successful connection confirmations
it: Conferma di connessione riuscita col Dash Masternode Tool
ru: Подтверждения успешного соединения Dash Masternode Tool

source: We will now use DMT to enter some basic information about the masternode and extract the transaction ID. Carry out the following sequence of steps as shown in this screenshot:
it: Utilizzeremo ora DMT per inserire alcune informazioni di base sul masternode ed estrarre l'ID della transazione. Eseguire la seguente sequenza di passaggi come mostrato in questa schermata:
ru: Теперь мы воспользуемся DMT для ввода основной информации о мастерноде2йце и извлечения идентификатора транзакции. Сначала нажмите кнопку **add a new one** или нажмите **MN actions** и выберите **Add New Masternode Entry...**. Выполните следующую последовательность действий, как показано на скриншоте:

source: Dash Masternode Tool configuration steps
it: Step per configurare Dash Masternode Tool
ru: Шаги настройки Dash Masternode Tool

source: Click the **New** button.
it: Fare clic sul pulsante **Nuovo**.
ru: Кликните на кнопку **New**.

source: Enter a name for your masternode. The host name you specified for your VPS above is a good choice.
it: Inserisci un nome per il tuo masternode. Il nome host specificato sopra per il tuo VPS è una buona scelta.
ru: Введите имя вашей мастерноды. Имя хоста, которое вы указали для VPS выше, является хорошим вариантом.

source: Enter the IP address of your masternode. This was given to you by the VPS provider when you set up the server. Then enter the TCP port number. This should be 19999.
it: Inserisci l'indirizzo IP del tuo masternode. Questo ti è stato fornito dal provider VPS quando hai configurato il server. Quindi inserisci il numero della porta TCP. Dovrebbe essere il 19999.
ru: Введите IP-адрес вашей ноды. Его вы получили от вашего VPS-провайдера во время настройки сервера. Затем введите номер TCP-порта, должен быть использован порт 19999.

source: Click **Locate collateral** to view unused collateral funding transactions available on the connected hardware wallet. Select the address to which you sent 1000 Dash and click **Apply**. The **Collateral address**, **path**, **Collateral TX hash** and **index** fields should be filled automatically.
it: Fai clic su **Trova garanzie** per visualizzare le transazioni di finanziamento delle garanzie non utilizzate disponibili sul wallet hardware connesso. Seleziona l'indirizzo a cui hai inviato 1000 Dash e fai clic su **Applica**. I campi **Indirizzo collaterale**, **percorso**, **Hash TX collaterale** e **indice** devono essere compilati automaticamente.
ru: Нажмите **Locate collateral**, чтобы просмотреть неиспользованные операции по финансированию залога, доступные на подключенном аппаратном кошельке. Выберите адрес, на который был отправлено обеспечение в 1000 Dash, и нажмите **Apply**. Поля **Collateral address**, **path**, **Collateral TX hash** и **index** заполнятся автоматически.

source: Dash Masternode Tool with masternode configuration
it: Dash Masternode Tool con configurazione Masternode
ru: Dash Masternode Tool с конфигурацией ноды

source: Leave DMT open and continue with the next step: :ref:`installing Dash Core on your VPS <testnet-masternode-setup-install>`.
it: Lascia aperto DMT e continua con il passaggio successivo: :ref:`installazione di Dash Core sul tuo VPS <testnet-masternode-setup-install>`.
ru: Оставьте DMT открытым и далее выполните следующий шаг: :ref:`установка Dash Core на вашем VPS <testnet-masternode-setup-install>`.

source: Option 2: Holding collateral in Dash Core wallet
it: Opzione 2: detenere il collaterale nel wallet Dash Core
ru: Вариант 2: Обеспечение в кошельке Dash Core

source: Open Dash Core wallet and wait for it to synchronize with the network. It should look like this when ready:
it: Apri il wallet Dash Core e attendi che si sincronizzi con la rete. Dovrebbe assomigliare a questo quando è pronto:
ru: Откройте кошелёк Dash Core и дождитесь пока он синхронизируется с сетью. По завершении это должно выглядеть вот так:

source: Fully synchronized Dash Core wallet
it: Wallet Dash Core completamente sincronizzato
ru: Полностью синхрониируйте кошелёк Dash Core

source: Click **Window > Console** to open the console. Type the following command into the console to generate a new Dash address for the collateral::
it: Fai clic su **Finestra > Console** per aprire la console. Digita il seguente comando nella console per generare un nuovo indirizzo Dash per il materiale collaterale::
ru: Кликните **Окно > Консоль**, чтобы открыть консоль. Чтобы сгенерировать новый адрес для обеспечения, введите в консоль эту команду::

source: Take note of the collateral address, since we will need it later. The next step is to secure your wallet (if you have not already done so). First, encrypt the wallet by selecting **Settings > Encrypt wallet**. You should use a strong, new password that you have never used somewhere else. Take note of your password and store it somewhere safe or you will be permanently locked out of your wallet and lose access to your funds. Next, back up your wallet file by selecting **File > Backup Wallet**. Save the file to a secure location physically separate to your computer, since this will be the only way you can access our funds if anything happens to your computer. For more details on these steps, see :ref:`here <dashcore-backup>`.
it: Prendi nota dell'indirizzo collaterale, poiché ne avremo bisogno in seguito. Il prossimo passo è proteggere il tuo wallet (se non l'hai già fatto). Innanzitutto, crittografa il portafoglio selezionando **Impostazioni > Crittografa wallet**. Dovresti utilizzare una password nuova e complessa che non hai mai utilizzato altrove. Prendi nota della tua password e conservala in un posto sicuro, altrimenti rimarrai permanentemente bloccato fuori dal tuo wallet e perderai l'accesso ai tuoi fondi. Successivamente, esegui il backup del file del tuo wallet selezionando **File > Backup wallet**. Salva il file in un luogo sicuro fisicamente separato dal tuo computer, poiché questo sarà l'unico modo per accedere ai nostri fondi se succede qualcosa al tuo computer. Per ulteriori dettagli su questi passaggi, vedere :ref:`qui `.
ru: Обратите внимание на адрес обеспечения, так как позже он нам понадобится. Следующим шагом является защита вашего кошелька (если вы до сих пор этого не сделали). Сначала зашифруйте кошелёк щёлкнув **Настройки > Зашифровать кошелёк**. Необходимо использовать новый и сильный пароль, который вы нигде не использовали ранее. Запишите свой пароль и сохраните его в безопасном месте, в противном случае доступ к кошельку окажется заблокированным навсегда и вы потеряете доступ к своим средствам. Следующим шагом сделайте резервную копию файла вашего кошелька выбрав **Файл > Сделать резервную копию кошелька**. Сохраните файл в безопасном месте, физически отдельном от вашего компьютера, так это будет единственный вариант доступа к ваши средствам, если с вашим компьютером что-то случится. Для получения более детальной информации по этим шагам смотрите :ref:`здесь <dashcore-backup>`.
