Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup-evonode.po
Languages: it, ru

source: Now send exactly 4000 DASH in a single transaction to the new address you generated in the previous step. This may be sent from another wallet, or from funds already held in your current wallet. Once the transaction is complete, view the transaction in a `blockchain explorer <https://insight.dash.org/insight/>`_ by searching for the address. You will need 15 confirmations before you can register the masternode, but you can continue with the next step at this point already: generating your masternode operator key.
it: Ora invia esattamente 4000 DASH in un'unica transazione al nuovo indirizzo che hai generato nel passaggio precedente. Questo può essere inviato da un altro wallet o da fondi già detenuti nel tuo wallet attuale. Una volta completata la transazione, visualizza la transazione in un `blockchain explorer <https://insight.dash.org/insight/>`_ cercando l'indirizzo. Avrai bisogno di 15 conferme prima di poter registrare il masternode, ma a questo punto puoi già procedere con il passaggio successivo: generare la tua chiave operatore masternode.
ru: Теперь одиночной транзакцией отправьте сумму, точно равную 4000 DASH на адрес учётной записи, который вы сгенерировали во время выполнения предыдущего шага. Эти деньги можно отправить как с другого кошелька, так и со средств, которые находятся на вашем текущем кошельке. Когда транзакция будет совершена, найдите её по адресу в `обозревателе блокчейна <https://insight.dash.org/insight/>`_ и наблюдайте за ней. Прежде чем вы сможете зарегестрировать мастерноду, понадобится 15 подтверждений этой транзакции, но настройку на этом этапе можно продолжать, перейдя на следующий шаг: генерацию ключа оператора мастерноды.

source: Masternode Installation
it: Installazione Masternode
ru: Установка мастерноды

source: The following options are available for installing Dash masternode software:
it: Sono disponibili le seguenti opzioni per l'installazione del software Dash masternode:
ru: Для установки программного обеспечения мастернодs Dash доступны следующие варианты:

source: :ref:`Dashmate installation (recommended) <evonode-setup-install-dashmate>`
it: :ref:`Installazione Dashmate (consigliata) <evonode-setup-install-dashmate>`
ru: :ref:`Установка Dashmate (рекомендуется) <evonode-setup-install-dashmate>`

source: :ref:`Manual installation <evonode-setup-install-manual>`
it: :ref:`Installazione manuale <evonode-setup-install-manual>`
ru: :ref:`Ручная установка <evonode-setup-install-manual>`

source: Dashmate installation
it: installazione Dashmate
ru: Установка dashmate

source: Dashmate is a universal tool designed to help you set up and run Dash nodes in a containerized environment. It is based on Docker technology and features an interactive setup command. Dashmate handles the installation of Dash Core, as well as all dependencies and supporting services. See this :ref:`dashmate documentation <dashmate>` for more information.
it: Dashmate è uno strumento universale progettato per aiutarti a configurare ed eseguire i nodi Dash in un ambiente containerizzato. Si basa sulla tecnologia Docker e presenta un comando di configurazione interattivo. Dashmate gestisce l'installazione di Dash Core, nonché tutte le dipendenze e i servizi di supporto. Consulta questa :ref:`documentazione dashmate <dashmate>` per ulteriori informazioni.
ru: Dashmate - это универсальный инструмент, предназначенный для настройки и запуска нод Dash в контейнерной среде. Он основан на технологии Docker и содержит интерактивную команду настройки. Dashmate выполняет установку Dash Core, а также всех зависимостей и вспомогательных сервисов. Более подробную информацию см. здесь :ref:`документация dashmate<dashmate>`.

source: Open PuTTY or a console again and connect to the server using the username and password you just created for your new, non-root user. Begin by installing dashmate dependencies::
it: Apri nuovamente PuTTY o una console e connettiti al server utilizzando il nome utente e la password che hai appena creato per il tuo nuovo utente non root. Inizia installando le dipendenze di Dashmate::
ru: Снова откройте PuTTY или консоль и подключитесь к серверу, используя имя пользователя и пароль, которые вы только что создали для нового пользователя, не являющегося пользователем root. Начните с установки зависимостей dashmate::

source: Install dashmate::
it: Installa dashmate::
ru: Установите dashmate::

source: Alternative installation options are available on the :hoverxref:`dashmate page <dashmate-install>`.
it: Opzioni di installazione alternative sono disponibili nella :hoverxref:`dashmate page <dashmate-install>`.
ru: Альтернативные варианты установки доступны на :hoverxref:`странице dashmate <dashmate-install>`.

source: Continue with the :ref:`Registration step <register-evonode>` to setup the collateral, keys and construct the ProTx transaction required to enable your masternode.
it: Continua con il :ref:`Passaggio di registrazione <register-evonode>` per impostare il collaterale, le chiavi e costruire la transazione ProTx richiesta per abilitare il tuo masternode.
ru: Продолжите выполнение :ref:`шага регистрация <register-evonode>` для настройки обеспечения, ключей и создания транзакции ProTx, необходимой для активации вашей мастерноды.

source: Manual installation
it: Installazione Manuale
ru: Ручная установка

source: Dash Platform will include multiple services that must be configured properly for an Evolution masternode to operate correctly. A :ref:`dashmate-based installation <evonode-setup-install-dashmate>` is recommended to ensure your configuration is functional.
it: Dash Platform includerà più servizi che devono essere configurati correttamente affinché un masternode Evolution funzioni correttamente. Si consiglia un :ref:`installazione basata su dashmate <evonode-setup-install-dashmate>` per garantire che la configurazione sia funzionale.
ru: Платформа Dash включает в себя множество сервисов, которые должны быть правильно сконфигурированы для корректной работы эвоноды. Для обеспечения работоспособности конфигурации рекомендуется использовать :ref:`установку основанную на dashmate <evonode-setup-install-dashmate>`.

source: Dash Core
it: Core Dash

source: To manually download and install the components of your Dash Evolution masternode, visit the `GitHub releases page <https://github.com/dashpay/dash/releases>`_ and copy the link to the latest version appropriate for your CPU architecture, e.g. ``x86_64-linux-gnu``. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl+ V**::
it: Per scaricare e installare manualmente i componenti del tuo masternode Dash Evolution, visita la `pagina delle versioni di GitHub <https://github.com/dashpay/dash/releases>`_ e copia il collegamento all'ultima versione appropriata per la tua architettura della CPU, per esempio. ``x86_64-linux-gnu``. Torna alla finestra del terminale e inserisci il comando seguente, incollando l'indirizzo dell'ultima versione di Dash Core facendo clic con il pulsante destro del mouse o premendo **Ctrl+ V**::
ru: Чтобы вручную загрузить и установить компоненты эвоноды, посетите страницу релизов на `GitHub <https://github.com/dashpay/dash/releases>`_ и скопируйте ссылку на последнюю версию, соответствующую архитектуре вашего процессора, например, ``x86_64-linux-gnu``. Вернитесь в окно терминала и введите следующую команду, вставив в нее адрес последней версии Dash Core, щелкнув правой кнопкой мыши или нажав **Ctrl+ V**::

source: Verify the authenticity of your download by checking its detached signature against the public key published by the Dash Core development team. All releases of Dash are signed using GPG with one of the following keys:
it: Verifica l'autenticità del tuo download controllando la sua firma staccata rispetto alla chiave pubblica pubblicata dal team di sviluppo di Dash Core. Tutte le versioni di Dash sono firmate utilizzando GPG con una delle seguenti chiavi:
ru: Убедитесь в подлинности загруженного файла, сверив его подпись с открытым ключом, опубликованным командой разработчиков Dash Core. Все выпуски Dash подписываются с помощью GPG одним из следующих ключей:

source: Alexander Block (codablock) with the key ``63A9 6B40 6102 E091``, `verifiable here on Keybase <https://keybase.io/codablock>`__
it: Alexander Block (codablock) con la chiave ``63A9 6B40 6102 E091``, `verificabile qui su Keybase <https://keybase.io/codablock>`__
ru: Александр Блок (codablock) с ключом ``63A9 6B40 6102 E091``, ``верифицируемый здесь на Keybase <https://keybase.io/codablock>`__

source: Pasta (pasta) with the key ``5252 7BED ABE8 7984``, `verifiable here on Keybase <https://keybase.io/pasta>`__
it: Pasta (pasta) con la chiave ``5252 7BED ABE8 7984``, `verificabile qui su Keybase <https://keybase.io/pasta>`__
ru: Pasta с ключом ``5252 7BED ABE8 7984``, ``верифицируемым здесь на Keybase <https://keybase.io/pasta>`__

source: Create a working directory for Dash, extract the compressed archive and copy the necessary files to the directory::
it: Crea una directory di lavoro per Dash, estrai l'archivio compresso e copia i file necessari nella directory:
ru: Создайте рабочую папку для Dash, извлеките туда архив и скопируйте необходимые файлы в эту папку::

source: Create a configuration file using the following command::
it: Crea un file di configurazione utilizzando il seguente comando::
ru: С помощью следующей команды создайте файл настроек::

source: An editor window will appear. We now need to create a configuration file specifying several variables. Copy and paste the following text to get started, then replace the variables specific to your configuration as follows::
it: Apparirà una finestra dell'editor. Ora dobbiamo creare un file di configurazione specificando diverse variabili. Copia e incolla il seguente testo per iniziare, quindi sostituisci le variabili specifiche della tua configurazione come segue:
ru: Появится окно редактора. Теперь нам нужно создать конфигурационный файл, в котором будут описаны некоторые параметры. Для начала, скопируйте и вставьте в него следующий текст, а затем замените параметры на те, которые удовлетвоярют вашей конфигурации::

source: Replace the fields marked with ``XXXXXXX`` as follows:
it: Sostituisci i campi contrassegnati con ``XXXXXXX`` come segue:
ru: Замените все поля с ``XXXXXXX`` следующим образом::

source: ``rpcuser``: enter any string of numbers or letters, no special characters allowed
it: ``rpcuser``: inserisci qualsiasi stringa di numeri o lettere, non sono ammessi caratteri speciali
ru: ``rpcuser``: введите любой набор цифр или букв, без специальных символов

source: ``rpcpassword``: enter any string of numbers or letters, no special characters allowed
it: ``rpcpassword``: inserisci qualsiasi stringa di numeri o lettere, non sono ammessi caratteri speciali
ru: ``rpcpassword``: введите любой набор цифр или букв, без специальных символов

source: ``externalip``: this is the IP address of your VPS
it: ``externalip``: questo è l'indirizzo IP del tuo VPS
ru: ``externalip``: это IP-адрес вашего VPS

source: Leave the ``masternodeblsprivkey`` field commented out for now. The result should look something like this:
it: Lasciare commentato il campo ``masternodeblsprivkey`` per ora. Il risultato dovrebbe assomigliare a questo:
ru: Поле ``masternodeblsprivkey`` пока оставим закомментированным. Результат должен выглядеть примерно так:

source: Entering key data in dash.conf on the masternode
it: Immissione dei dati chiave in dash.conf sul masternode
ru: Ввод ключевых данных в dash.conf для мастерноды

source: Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. You can now start running Dash on the masternode to begin synchronization with the blockchain::
it: Premi **Ctrl + X** per chiudere l'editor e **Y** e **Invio** salvano il file. Ora puoi iniziare a eseguire Dash sul masternode per iniziare la sincronizzazione con la blockchain::
ru: Нажмите **Ctrl + X** и закройте редактор, а затем нажмите **Y** и **Enter**, чтобы сохранить файл. Теперь вы можете запустить Dash в режиме мастерноды и начать синхронизацию с блокчейном::

source: You will see a message reading **Dash Core server starting**.
it: Verrà visualizzato il messaggio **Server Dash Core in avvio**.
ru: На экране появится сообщение **Запуск сервера Dash Core**.

source: Add dashd to crontab to make sure it runs every minute to check on your masternode::
it: Aggiungi dashd a crontab per assicurarti che venga eseguito ogni minuto per controllare il tuo masternode::
ru: Добавьте dashd в crontab, чтобы он запускался каждую минуту для проверки вашей мастерноды::

source: Choose nano as your editor and enter the following lines at the end of the file::
it: Scegli nano come editor e inserisci le seguenti righe alla fine del file::
ru: В качестве редактора выберите nano и в конце файла введите следующие строки::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. We now need to wait for 15 confirmations of the collateral transaction to complete, and wait for the blockchain to finish synchronizing on the masternode. You can use the following commands to monitor progress::
it: Premi Invio per assicurarti che ci sia una riga vuota alla fine del file, quindi premi **Ctrl + X** per chiudere l'editor e **Y** e **Invio** salvano il file. Ora dobbiamo attendere il completamento di 15 conferme della transazione collaterale e attendere che la blockchain finisca di sincronizzarsi sul masternode. È possibile utilizzare i seguenti comandi per monitorare l'avanzamento:
ru: Нажмите Enter, чтобы убедиться, что в конце файла есть пустая строка, затем нажмите **Ctrl + X**, чтобы закрыть редактор, а затем **Y** и **Enter**, чтобы сохранить файл. Теперь для залоговой транзакции, чтобы она считалась завершённой, следует дождаться 15 подтверждений сети, а также дождаться пока мастернода завершит процес синхронизации с блокчейном. Для мониторинга за процессом можно использовать следующие команды::

source: When synchronisation is complete, you should see the following response::
it: Una volta completata la sincronizzazione, dovresti vedere la seguente risposta::
ru: По завершении синхронизации вы увидите следующий ответ::

source: Register your masternode
it: Registra il tuo masternode
ru: Зарегистрируйте вашу мастерноду

source: The keys required for the different masternode roles are described briefly under :ref:`mn-concepts` in this documentation.
it: Le chiavi richieste per i diversi ruoli masternode sono descritte brevemente in :ref:`mn-concepts` in questa documentazione.
ru: Ключи, необходимые для различных ролей мастерноды, кратко описаны в разделе :ref:`mn-concepts` данной документации.

source: Option 1: Registering from a hardware wallet
it: Opzione 1: registrazione da un wallet hardware
ru: Способ 1: Регистрация в аппаратном кошельке

source: Go back to DMT and ensure that all fields from the previous step are still filled out correctly. Click **Generate new** for the private keys required for the masternode:
it: Torna a DMT e assicurati che tutti i campi del passaggio precedente siano ancora compilati correttamente. Fai clic su **Genera nuovo** per le chiavi private richieste per il masternode:
ru: Вернитесь в DMT и убедитесь, что все поля предыдущего шага заполнены правильно. Нажмите кнопку **Генерировать новые** для приватных ключей, необходимых для мастерноды

source: Owner private key
it: Chiave privata del proprietario
ru: Приватный ключ владельца

source: Operator private key
it: Chiave privata dell'operatore
ru: Приватный ключ оператора

source: Voting private key
it: Chiave privata di voto
ru: Приватный ключ голосования

source: Platform Node private key (evonodes only)
it: Chiave privata del nodo della Platform (solo evonodes)
ru: Приватный ключ ноды платформы (только для эвонод)

source: For evonodes, click the button beside the **Platform P2P port** and **Platform HTTP port** fields to set the default values.
it: Per gli evonode, fare clic sul pulsante accanto ai campi **Porta P2P Platform** e **Porta HTTP Platform** per impostare i valori predefiniti.
ru: Для эвонод нажмите кнопку рядом с полями **P2P-порт для платформы** и **HTTP-порт для платформы**, чтобы установить значения по умолчанию.

source: Click **Apply changes** when these fields have been set.
it: Fai clic su **Applica modifiche** una volta impostati questi campi.
ru: После заполнения этих полей нажмите кнопку **Применить изменения**.

source: Dash Masternode Tool ready to register a new masternode
it: Dash Masternode Tool pronto per registrare un nuovo masternode
ru: Dash Masternode Tool готов к регистрации новой мастерноды

source: Then click **MN actions** and select **Register masternode**. Optionally specify a different **Payout address** and/or **Operator reward**, then click **Continue**. Select **Remote Dash RPC Node (automatic method)**. (For details about using your own local RPC node, see the `Dash Masternode Tool documentation <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__.) Confirm the following two messages:
it: Quindi fai clic su **Azioni MN** e seleziona **Registra masternode**. Facoltativamente, specifica un diverso **Indirizzo di pagamento** e/o un **Premio per l'operatore**, quindi fai clic su **Continua**. Seleziona **Nodo RPC Dash remoto (metodo automatico)**. (Per dettagli sull'utilizzo del proprio nodo RPC locale, consultare la `documentazione dello strumento Dash Masternode <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>` __.) Confermare i due messaggi seguenti:
ru: Затем нажмите **Действия с МН** и выберите **Регистрация мастерноды**. По желанию укажите другой **Адрес выплаты** и/или **Вознаграждение оператора**, затем нажмите **Продолжить**. Выберите **Отдаленный RPC-узел Dash (автоматический метод)**. (Подробнее об использовании собственного локального RPC-узла см. в документации по инструменту `Dash Masternode Tool` <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__). Подтвердите следующие два сообщения:

source: Dash Masternode Tool confirmation dialogs to register a masternode
it: Dash Masternode Tool finestre di dialogo di conferma per registrare un masternode
ru: Запрашивающие подтверждение диалоги в Dash Masternode Tool для регистрации мастерноды

source: Complete server configuration
it: Configurazione completa del server
ru: Завершение конфигурации сервера

source: At this point the masternode registration is complete, but the BLS private key must be added to the server so it can become operational. The BLS key allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner, as we just did above.
it: A questo punto la registrazione del masternode è completa, ma è necessario aggiungere la chiave privata BLS al server affinché possa diventare operativo. La chiave BLS consente al masternode di monitorare la blockchain per le transazioni Pro*Tx rilevanti e farà sì che inizi a fungere da masternode quando il ProRegTx firmato viene trasmesso dal proprietario, come abbiamo appena fatto sopra.
ru: На этом регистрация мастерноды завершена, но необходимо добавить приватный ключ BLS на сервер, чтобы он мог начать работу. Ключ BLS позволяет мастерноде следить за блокчейном на предмет соответствующих транзакций Pro*Tx, и она начнет работать в качестве мастерноды, когда подписанная ProRegTx будет транслироваться владельцем, как мы только что сделали выше.

source: Take note of your BLS private key and then proceed with the relevant instructions below based on which :ref:`Software Installation option <evonode-setup-install>` you are using.
it: Prendi nota della tua chiave privata BLS e procedi con le istruzioni pertinenti di seguito in base a quale :ref:`Opzione di installazione del software<evonode-setup-install>` stai utilizzando.
ru: Запишите свой приватный ключ BLS и выполните следующие инструкции в зависимости от того, какой вариант установки программного обеспечения 1 вы используете.

source: For dashmate-based masternodes, enter the BLS private key during the initial dashmate setup process. Run the dashmate setup wizard on your server::
it: Per i masternode basati su Dashmate, inserisci la chiave privata BLS durante il processo di configurazione iniziale di Dashmate. Esegui la procedura guidata di configurazione di Dashmate sul tuo server::
ru: Для мастернод на базе dashmate введите приватный ключ BLS в процессе начальной настройки dashmate. Запустите мастер настройки dashmate на вашем сервере::

source: Select the network and masternode type. Select **Yes** when asked if your masternode is already registered since this was done earlier in the section.
it: Seleziona la rete e il tipo di masternode. Seleziona **Sì** quando ti viene chiesto se il tuo masternode è già registrato poiché ciò è stato fatto in precedenza nella sezione.
ru: Выберите сеть и тип мастерноды. Выберите **Yes** в ответ на вопрос, зарегистрирована ли уже ваша мастернода, поскольку это было сделано ранее в данном разделе.

source: Enter the **BLS private key** and the **Platform node key** from DMT when requested by dashmate.
it: Inserisci la **chiave privata BLS** e la **chiave del nodo Platform** da DMT quando richiesto da dashmate.
ru: Введите **приватный BLS ключ** и **ключ ноды платформы** из DMT по запросу dashmate.

source: Dashmate will automatically detect the external IP address and select the default ports for the network you are setting up. You can modify these values if necessary for a specific reason, but typically the defaults should be used.
it: Dashmate rileverà automaticamente l'indirizzo IP esterno e selezionerà le porte predefinite per la rete che stai configurando. È possibile modificare questi valori se necessario per un motivo specifico, ma in genere è necessario utilizzare i valori predefiniti.
ru: Dashmate автоматически определит внешний IP-адрес и выберет порты по умолчанию для настраиваемой сети. При необходимости можно изменить эти значения, но, как правило, следует использовать значения по умолчанию.

source: Once the dashmate wizard has completed successfully, start your node as follows::
it: Una volta completata correttamente la procedura guidata di Dashmate, avvia il tuo nodo come segue::
ru: После успешного завершения работы мастера dashmate запустите ноду следующим образом::

source: You can manage your masternode status, configuration, and running state entirely from within dashmate. See the dashmate :hoverxref:`node operation documentation <dashmate-node-operation>` for details.
it: Puoi gestire lo stato, la configurazione e lo stato di esecuzione del tuo masternode interamente da Dashmate. Consulta la documentazione sul funzionamento del nodo dashmate :hoverxref:<dashmate-node-operation>`per i dettagli.
ru: Вы можете управлять статусом, конфигурацией и рабочим состоянием мастерноды полностью из dashmate. Подробности см. в документе dashmate :hoverxref:`документация по работе с нодами <dashmate-node-operation>`.

source: Manual
it: Manuale
ru: Ручной

source: For manual installations, log in to your masternode using ``ssh`` or PuTTY and edit the configuration file as follows::
it: Per le installazioni manuali, accedi al tuo masternode utilizzando ``ssh`` o PuTTY e modifica il file di configurazione come segue:
ru: Для ручной установки войдите в свою мастерноду с помощью ``sh`` или PuTTY и отредактируйте конфигурационный файл следующим образом::
