Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup-evonode.po
Languages: it, ru

source: ``ipAndPort``: Masternode IP address and port, in the format ``x.x.x.x:yyyy``
it: ``ipAndPort``: Indirizzo IP e porta del Masternode, nel formato ``x.x.x.x:yyyy``
ru: ``ipAndPort``: IP-адрес и порт мастерноды в формате ``x.x.x.x:yyyy``

source: ``ownerKeyAddr``: The new Dash address generated above for the owner/voting address
it: ``ownerKeyAddr``: il nuovo indirizzo Dash generato sopra per l'indirizzo del proprietario/voto
ru: ``ownerKeyAddr``: Сгенерированный выше новый адрес Dash для владельца/голосования

source: ``operatorPubKey``: The BLS public key :hoverxref:`generated above <evonode-bls-generation>` (or provided by your hosting service)
it: ``operatorPubKey``: la chiave pubblica BLS :hoverxref:`generata sopra " (o fornita dal tuo servizio di hosting)
ru: ``operatorPubKey``: Публичный BLS-ключ, :hoverxref:`сгенерированный выше <evonode-bls-generation>` (или предоставленный хостинг-сервисом)

source: ``votingKeyAddr``: The new Dash address generated above, or the address of a delegate, used for proposal voting
it: ``votingKeyAddr``: il nuovo indirizzo Dash generato sopra, o l'indirizzo di un delegato, utilizzato per la votazione della proposta
ru: ``votingKeyAddr``: Новый адрес Dash, сгенерированный выше или адрес делегата, используемый для голосования по предложениям

source: ``operatorReward``: The percentage of the block reward allocated to the operator as payment
it: ``operatorReward``: La percentuale del premio in blocco assegnato all'operatore come pagamento
ru: ``operatorReward``: Процент награды за блок, который выделен оператору в качестве оплаты

source: ``payoutAddress``: A new or existing Dash address to receive the owner's masternode rewards
it: ``payoutAddress``: un indirizzo Dash nuovo o esistente per ricevere i premi masternode del proprietario
ru: ``payoutAddress``: Новый или существующий адрес Dash для получения платежей от владельца мастерноды

source: ``platformNodeID``: Platform P2P node ID :hoverxref:`generated above <evonode-generate-platform-node-id>`
it: ``platformNodeID``: ID nodo Platform P2P :hoverxref:`generato sopra <evonode-generate-platform-node-id>`
ru: ``platformNodeID``: Идентификатор P2P-узла платформы :hoverxref:`генерируется выше 1`

source: ``platformP2PPort``: TCP port of Dash Platform peer-to-peer communication between nodes. Must be 26656 for mainnet.
it: ``platformP2PPort``: porta TCP della comunicazione peer-to-peer della Platform Dash tra i nodi. Deve essere 26656 per la rete principale.
ru: ``platformP2PPort``: TCP-порт одноранговой связи Dash Platform между узлами. Для основной сети должен быть равен 26656.

source: ``platformHTTPPort``: TCP port of Platform HTTP/API interface. Must be 443 for mainnet.
it: ``platformHTTPPort``: porta TCP dell'interfaccia HTTP/API della Platform. Deve essere 443 per mainnet.
ru: ``platformHTTPPort``: TCP-порт HTTP/API-интерфейса платформы. Для основной сети должен быть равен 443.

source: ``feeSourceAddress``: An (optional) address used to fund ProTx fee. ``payoutAddress`` will be used if not specified.
it: ``feeSourceAddress``: un indirizzo (facoltativo) utilizzato per finanziare la tariffa ProTx. Se non specificato verrà utilizzato ``payoutAddress``.
ru: ``feeSourceAddress``: (Необязательный) адрес, используемый для финансирования комиссий ProTx. Если не указан, то будет использоваться ``payoutAddress``.

source: Note that the operator is responsible for :ref:`specifying their own reward <dip3-update-service>` address in a separate ``update_service`` transaction if you specify a non-zero ``operatorReward``. The owner of the masternode collateral does not specify the operator's payout address.
it: Tieni presente che l'operatore è responsabile di :ref:`specificare il proprio indirizzo di ricompensa <dip3-update-service>` in una transazione ``update_service`` separata se specifichi un ``operatorReward`` diverso da zero. Il proprietario della garanzia masternode non specifica l'indirizzo di pagamento dell'operatore.
ru: Обратите внимание, что оператор несёт ответственность за указание адреса, на который будет начисляться :ref:`его собственная награда <dip3-update-service>` в отдельной транзакции ``update_service`` в случае, если вы укажете отличную от нуля награду ``operatorReward``. Владелец залогового подтверждения не указывает адрес для выплаты оператору.

source: Example (remove line breaks if copying)::
it: Esempio (rimuovere le interruzioni di riga durante la copia)::
ru: Пример (удалите разрывы строк при копировании)::

source: Next we will use the ``collateralAddress`` and ``signMessage`` fields to sign the transaction, and the output of the ``tx`` field to submit the transaction.
it: Successivamente utilizzeremo i campi ``collateralAddress`` e ``signMessage`` per firmare la transazione e l'output del campo ``tx`` per inviare la transazione.
ru: Теперь используем поля ``collateralAddress`` и ``signMessage`` для подписания транзакции и поле выхода ``tx`` для отправления транзакции.

source: Sign the ProRegTx transaction
it: Firma la transazione ProRegTx
ru: Подпишите транзакцию ProRegTx

source: We will now sign the content of the ``signMessage`` field using the private key for the collateral address as specified in ``collateralAddress``. Note that no internet connection is required for this step, meaning that the wallet can remain disconnected from the internet in cold storage to sign the message. In this example we will again use Dash Core, but it is equally possible to use the signing function of a hardware wallet. The command takes the following syntax::
it: Ora firmeremo il contenuto del campo ``signMessage`` utilizzando la chiave privata per l'indirizzo del collaterale come specificato in ``collateralAddress``. Tieni presente che per questo passaggio non è necessaria alcuna connessione Internet, il che significa che il wallet può rimanere disconnesso da Internet nella cella frigorifera per firmare il messaggio. In questo esempio utilizzeremo nuovamente Dash Core, ma è ugualmente possibile utilizzare la funzione di firma di un wallet hardware. Il comando assume la seguente sintassi::
ru: Теперь подпишем содержимое поля ``signMessage`` используя приватный ключ для залогового адреса, указанный в ``collateralAddress``. Обратите внимание, что для выполнения этого шага не требуется интернет-соединение, что значит, что для подписи сообщения кошелёк может оставаться отключённым от интернета в состоянии холодного хранилища. В этом примере мы снова используем Dash Core, но в равной степени возможно использовать функцию подписи аппаратного кошелька. Команда имеет следующий синтаксис::

source: Example::
it: Esempio::
ru: Пример::

source: Submit the signed message
it: Invia il messaggio firmato
ru: Подтвердите подписанное сообщение

source: We will now submit the ProRegTx special transaction to the blockchain to register the masternode. This command must be sent from a Dash Core wallet holding a balance on either the ``feeSourceAddress`` or ``payoutAddress``, since a standard transaction fee is involved. The command takes the following syntax::
it: Ora invieremo la transazione speciale ProRegTx alla blockchain per registrare il masternode. Questo comando deve essere inviato da un wallet Dash Core che contiene un saldo su "feeSourceAddress" o "payoutAddress", poiché è coinvolta una commissione di transazione standard. Il comando assume la seguente sintassi::
ru: Теперь мы отправим в блокчейн специальную транзакцию ProRegTx для регистрации мастерноды. Эта команда должна быть отправлена с кошелька Dash Core, имеющего баланс на ``feeSourceAddress`` или ``payoutAddress``, поскольку в этом случае взимается стандартная комиссия за транзакцию. Команда имеет следующий синтаксис::

source: Where:
it: Dove:
ru: Где:

source: ``tx``: The serialized transaction previously returned in the ``tx`` output field from the ``protx register_prepare_hpmn`` command
it: ``tx``: la transazione serializzata precedentemente restituita nel campo di output ``tx`` dal comando ``protx Register_prepare_hpmn``
ru: ``tx``: Последовательная транзакция, ранее возвращенная в поле вывода ``tx`` командой ``protx register_prepare_hpmn``.

source: ``sig``: The message signed with the collateral key from the ``signmessage`` command
it: ``sig``: il messaggio firmato con la chiave collaterale dal comando ``signmessage``
ru: ``sig``: Сообщение, подписанное залоговым ключом с помощью команды ``signmessage``

source: Your masternode is now registered and will appear on the Deterministic Masternode List after the transaction is mined to a block. You can view this list on the **Masternodes** tab of the Dash Core wallet, or in the console using the command ``protx list valid``, where the txid of the final ``protx register_submit`` transaction identifies your masternode.
it: Il tuo masternode è ora registrato e apparirà nell'elenco dei Masternode deterministici dopo che la transazione sarà stata estratta in un blocco. Puoi visualizzare questo elenco nella scheda **Masternodes** del wallet Dash Core o nella console utilizzando il comando ``protx list valid``, dove il txid della transazione finale ``protx Register_submit`` identifica il tuo masternode .
ru: Теперь ваша мастернода зарегистрирована и появится в списке детерминированных мастернод после того, как транзакция будет добыта в блок. Просмотреть этот список можно на вкладке **Masternodes** кошелька Dash Core или в консоли с помощью команды ``protx list valid``, где txid финальной транзакции ``protx register_submit`` идентифицирует вашу мастерноду.

source: At this point you can go back to your terminal window and monitor your masternode by entering ``~/.dashcore/dash-cli masternode status`` or using the **Refresh status** function in DMT.
it: A questo punto puoi tornare alla finestra del terminale e monitorare il tuo masternode inserendo ``~/.dashcore/dash-cli masternode status`` o utilizzando la funzione **Aggiorna stato** in DMT.
ru: В этот момент вы можете вернуться в окно терминала и проконтролировать состояние своей ноды, введя ``~/.dashcore/dash-cli masternode status`` или воспользовавшись функцией **Refresh status** в DMT.

source: Output::
ru: На выходе::
