Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup-testnet.po
Languages: it, ru

source: Envoy is a gRPC service proxy for cloud-native applications. As it is responsible for TLS termination, you will need to obtain a TLS certificate for your public IP address before configuring Envoy. You can do this independently using a provider of your choice, or use ZeroSSL to obtain a free certificate. Visit https://app.zerossl.com/certificate/new and enter your public IP address, select HTTP File Upload as the verification method and then download the auth file. Place the contents of this file in the ``/var/www/html/.well-known/pki-validation/`` directory with the original filename on your server and serve it using nginx as follows::
it: Envoy è un proxy del servizio gRPC per applicazioni native del cloud. Poiché è responsabile della terminazione TLS, dovrai ottenere un certificato TLS per il tuo indirizzo IP pubblico prima di configurare Envoy. Puoi farlo in autonomia utilizzando un provider di tua scelta, oppure utilizzare ZeroSSL per ottenere un certificato gratuito. Visita https://app.zerossl.com/certificate/new e inserisci il tuo indirizzo IP pubblico, seleziona Caricamento file HTTP come metodo di verifica, quindi scarica il file di autenticazione. Inserisci il contenuto di questo file nella directory ``/var/www/html/.well-known/pki-validation/`` con il nome file originale sul tuo server e servilo utilizzando nginx come segue::
ru: Envoy - это прокси-сервис gRPC для облачных приложений. Поскольку он отвечает за завершение TLS, перед настройкой Envoy необходимо получить TLS-сертификат для вашего публичного IP-адреса. Вы можете сделать это самостоятельно, воспользовавшись услугами выбранного вами провайдера, или использовать ZeroSSL для получения бесплатного сертификата. Посетите сайт https://app.zerossl.com/certificate/new и введите свой публичный IP-адрес, выберите в качестве метода проверки HTTP File Upload, а затем загрузите файл auth. Поместите содержимое этого файла в каталог ``/var/www/html/.well-known/pki-validation/`` с оригинальным именем файла на вашем сервере и обслуживайте его с помощью nginx следующим образом::

source: Click the link shown in Step 3 of the ZeroSSL interface and verify that the contents of the auth file are displayed in your browser. Complete validation in ZeroSSL and download the bundle file in ``.zip`` format. Extract it on your local computer, and copy the contents of the ``certificate.crt`` followed by ``ca_bundle.crt`` one after the other into the bundle file at the following location on the remote node::
it: Fare clic sul collegamento mostrato nel passaggio 3 dell'interfaccia ZeroSSL e verificare che il contenuto del file di autenticazione sia visualizzato nel browser. Completa la convalida in ZeroSSL e scarica il file del bundle in formato ``.zip``. Estrailo sul tuo computer locale e copia il contenuto di ``certificate.crt`` seguito da ``ca_bundle.crt`` uno dopo l'altro nel file bundle nella seguente posizione sul nodo remoto:
ru: Перейдите по ссылке, указанной в шаге 3 интерфейса ZeroSSL, и убедитесь, что содержимое файла auth отображается в браузере. Завершите проверку в ZeroSSL и скачайте файл пакета в формате ``.zip``. Распакуйте его на локальном компьютере и скопируйте последовательно содержимое файла ``certificate.crt``, а затем ``ca_bundle.crt`` в файл bundle в следующее место на удаленном узле::

source: Then copy the contents of ``private.key`` into the following location on the remote node::
it: Quindi copia il contenuto di ``private.key`` nella seguente posizione sul nodo remoto:
ru: Затем скопируйте содержимое файла ``private.key`` в следующее место на удаленном узле::

source: Remove nginx and the temporary auth file as follows:
it: Rimuovi nginx e il file di autenticazione temporaneo come segue:
ru: Удалите nginx и временный файл auth следующим образом:

source: Install Envoy as follows::
it: Installa Envoy come segue::
ru: Установите Envoy следующим образом::

source: Configure Envoy as follows::
it: Configura Envoy come segue::
ru: Настройте Envoy следующим образом::

source: Configure Envoy to start as a service::
it: Configura Envoy per l'avvio come servizio::
ru: Конфигурируйте Envoy на запуск в качестве сервиса::

source: Start Envoy::
it: Avvia Envoy::
ru: Запустить Envoy::

source: Verify Envoy is running::
it: Verifica che Envoy sia in esecuzione::
ru: Убедитесь, что Envoy работает::

source: Finishing up
it: Sta terminando
ru: Завершение

source: Ensure services managed by ``pm2`` start on reboot::
it: Assicurati che i servizi gestiti da ``pm2`` vengano avviati al riavvio::
ru: Убедитесь, что сервисы, управляемые ``pm2``, запускаются при перезагрузке::

source: Copy and paste the resulting command to ensure PM2 restarts processes on boot::
it: Copia e incolla il comando risultante per garantire che PM2 riavvii i processi all'avvio::
ru: Скопируйте и вставьте полученную команду, чтобы обеспечить перезапуск процессов PM2 при загрузке::

source: At this point you can safely log out of your server by typing ``exit``. Congratulations! Your masternode is now running.
it: A questo punto puoi tranquillamente disconnetterti dal tuo server digitando ``exit``. Congratulazioni! Il tuo masternode è ora in esecuzione.
ru: На этом этапе можно безопасно совершить выход из сервера, набрав ``exit``. Поздравляем! Ваша мастернода теперь работает.

source: Developer installation
it: Installazione dello sviluppatore

source: Developers requiring a local masternode can get started quickly by starting dashmate and providing a private key containing collateral directly. Install dependencies if necessary (Docker, NodeJS, NPM, Github CLI). Windows, macOS and Linux are supported, the following example shows how to install dependencies under Ubuntu 20.04 LTS.::
it: Gli sviluppatori che richiedono un masternode locale possono iniziare rapidamente avviando Dashmate e fornendo direttamente una chiave privata contenente il materiale collaterale. Installa le dipendenze se necessario (Docker, NodeJS, NPM, Github CLI). Sono supportati Windows, macOS e Linux, l'esempio seguente mostra come installare le dipendenze in Ubuntu 20.04 LTS.::
ru: Разработчики, которым требуется локальный мастернод, могут быстро приступить к работе, запустив dashmate и напрямую предоставив закрытый ключ, содержащий обеспечение. При необходимости установите зависимости (Docker, NodeJS, NPM, Github CLI). Поддерживаются Windows, macOS и Linux, в следующем примере показана установка зависимостей под Ubuntu 20.04 LTS.::

source: Generate a new Dash address for temporary use using `this script <https://repl.it/@strophy/Generate-Dash-Address>`__ or the ``getnewaddress`` and ``dumpprivkey`` RPC commands in `Dash Core <https://www.dash.org/downloads>`__ in testnet mode. Go to https://testnet-faucet.dash.org/ and request 1000+ tDash to your new address using the promo code 'masternode'. Then download and initialize dashmate as follows::
it: Genera un nuovo indirizzo Dash per uso temporaneo utilizzando `questo script <https://repl.it/@strophy/Generate-Dash-Address>`__ o i comandi RPC ``getnewaddress`` e ``dumpprivkey`` in `Dash Core <https://www.dash.org/downloads>`__ in modalità testnet. Vai su https://testnet-faucet.dash.org/ e richiedi 1000+ tDash al tuo nuovo indirizzo utilizzando il codice promozionale "masternode". Quindi scarica e inizializza Dashmate come segue::
ru: Сгенерируйте новый адрес Dash для временного использования с помощью `этого скрипта <https://repl.it/@strophy/Generate-Dash-Address>`__ или RPC-команд ``getnewaddress`` и ``dumpprivkey`` в `Dash Core <https://www.dash.org/downloads>`__ в режиме testnet. Перейдите на сайт https://testnet-faucet.dash.org/ и запросите 1000+ tDash на свой новый адрес, используя промокод 'masternode'. Затем загрузите и инициализируйте dashmate следующим образом::

source: If you are using Windows, you will need to change the path for two log files. Modify the example below with a log path of your choosing::
it: Se utilizzi Windows, dovrai modificare il percorso di due file di registro. Modifica l'esempio seguente con un percorso di registro a tua scelta::
ru: Если вы используете Windows, то вам необходимо изменить путь к двум файлам журнала. Измените приведенный ниже пример, указав путь к журналу по своему усмотрению::

source: Register your masternode on the network as follows::
it: Registra il tuo masternode sulla rete come segue:
ru: Зарегистрируйте свою мастерноду в сети следующим образом::

source: Wait until sync and registration are complete. Then start the masternode::
it: Attendi il completamento della sincronizzazione e della registrazione. Quindi avvia il masternode::
ru: Дождитесь завершения синхронизации и регистрации. Затем запустите мастерноду::

source: Your masternode is now providing service on the following local ports::
it: Il tuo masternode ora fornisce il servizio sulle seguenti porte locali::
ru: Теперь ваша мастернода предоставляет услуги на следующих локальных портах::

source: Note that platform sync will take some time after core sync is complete. You can monitor progress with ``dashmate status platform`` or use ``dashmate --help`` to view other commands.
it: Tieni presente che la sincronizzazione della piattaforma richiederà del tempo dopo il completamento della sincronizzazione principale. Puoi monitorare i progressi con "dashmate status platform" o utilizzare "dashmate --help" per visualizzare altri comandi.
ru: Обратите внимание, что синхронизация платформы займет некоторое время после завершения синхронизации core. Вы можете следить за ходом выполнения команды ``dashmate status platform`` или использовать ``dashmate --help`` для просмотра других команд.

source: Output::
ru: На выходе::
