Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup-testnet.po
Languages: it, ru

source: Now send exactly 1000 DASH in a single transaction to the new address you generated in the previous step. This may be sent from another wallet, or from funds already held in your current wallet. Once the transaction is complete, view the transaction in a `blockchain explorer <https://testnet-insight.dash.org/insight/>`_ by searching for the address. You will need 15 confirmations before you can register the masternode, but you can continue with the next step at this point already: generating your masternode operator key.
it: Ora invia esattamente 1000 DASH in un'unica transazione al nuovo indirizzo che hai generato nel passaggio precedente. Questo può essere inviato da un altro wallet o da fondi già detenuti nel tuo wallet attuale. Una volta completata la transazione, visualizza la transazione in un `blockchain explorer <https://testnet-insight.dash.org/insight/>`_ cercando l'indirizzo. Avrai bisogno di 15 conferme prima di poter registrare il masternode, ma a questo punto puoi già procedere con il passaggio successivo: generare la tua chiave operatore masternode.
ru: Теперь одиночной транзакцией отправьте сумму, точно равную 1000 DASH на адрес учётной записи, который вы сгенерировали во время выполнения предыдущего шага. Эти деньги можно отправить как с другого кошелька, так и со средств, которые находятся на вашем текущем кошельке. Когда транзакция будет совершена, найдите её по адресу в `обозревателе блокчейна <https://testnet-insight.dash.org/insight/>`_ и наблюдайте за ней. Прежде чем вы сможете зарегестрировать мастерноду, понадобится 15 подтверждений этой транзакции, но настройку на этом этапе можно продолжать, перейдя на следующий шаг: генерацию ключа оператора мастерноды.

source: Masternode Installation
it: Installazione Masternode
ru: Установка мастерноды

source: The following tools are available for installing a Dash masternode:
it: Sono disponibili i seguenti strumenti per l'installazione di un masternode Dash:
ru: Для установки мастерноды Dash доступны следующие инструменты:

source: :ref:`dashmate installation <testnet-masternode-setup-install-dashmate>`
it: :ref:`installazione Dashmate <testnet-masternode-setup-install-dashmate>`
ru: :ref:`Установка dashmate <testnet-masternode-setup-install-dashmate>`

source: :ref:`Manual installation <testnet-masternode-setup-install-manual>`
it: :ref:` installazione Manuale <testnet-masternode-setup-install-manual>`
ru: :ref:`Ручная установка <testnet-masternode-setup-install-manual>`

source: `Dash Masternode Zeus <https://github.com/kxcd/Masternode-Zeus>`__ (does not yet support platform services)
it: `Dash Masternode Zeus <https://github.com/kxcd/Masternode-Zeus>`__ (non supporta ancora i servizi della platform)
ru: `Dash Masternode Zeus <https://github.com/kxcd/Masternode-Zeus>`__ (пока не поддерживает сервисы платформы)

source: dashmate installation
it: installazione dashmate
ru: Установка dashmate

source: ``dashmate`` replaces the `dashman <https://github.com/moocowmoo/dashman/>`__ masternode installer by moocowmoo. dashmate is based on Docker technology and features an interactive setup command and the ability to manage multiple node configs and multiple networks. It handles the installation of Dash Core and Tenderdash, as well as all dependencies and supporting services. Full dashmate documentation is available `here <https://github.com/dashpay/platform/tree/master/packages/dashmate#readme>`__.
it: ``dashmate`` sostituisce il programma di installazione `dashman <https://github.com/moocowmoo/dashman/>`__ masternode con moocowmoo. dashmate si basa sulla tecnologia Docker e presenta un comando di configurazione interattivo e la capacità di gestire più configurazioni di nodi e più reti. Gestisce l'installazione di Dash Core e Tenderdash, nonché tutte le dipendenze e i servizi di supporto. La documentazione completa di Dashmate è disponibile `qui <https://github.com/dashpay/platform/tree/master/packages/dashmate#readme>`__.
ru: ``dashmate`` заменяет инсталлятор masternode `dashman <https://github.com/moocowmoo/dashman/>`__ от moocowmoo. Dashmate основан на технологии Docker, имеет интерактивную команду установки и возможность управления несколькими конфигурациями узлов и несколькими сетями. Он выполняет установку Dash Core и Tenderdash, а также всех зависимостей и вспомогательных сервисов. Полная документация по dashmate доступна `здесь <https://github.com/dashpay/platform/tree/master/packages/dashmate#readme>`__.

source: Installation as root user is not supported or recommended.
it: L'installazione come utente root non è supportata né consigliata.
ru: Установка от имени пользователя root не поддерживается и не рекомендуется.

source: Open PuTTY or a console again and connect using the username and password you just created for your new, non-root user. Begin by installing dashmate dependencies::
it: Apri nuovamente PuTTY o una console e connettiti utilizzando il nome utente e la password che hai appena creato per il tuo nuovo utente non root. Inizia installando le dipendenze di Dashmate::
ru: Снова откройте PuTTY или консоль и подключитесь, используя имя пользователя и пароль, которые вы только что создали для нового пользователя, не являющегося пользователем root. Начните с установки зависимостей dashmate::

source: Install dashmate::
it: Installa dashmate::
ru: Установите dashmate::

source: Run the interactive setup wizard::
it: Esegui la procedura guidata di configurazione interattiva::
ru: Запустите интерактивный мастер настройки::

source: You will be prompted to select a network, node type, IP address and BLS private key. Enter this information or accept the detected/generated defaults. Start your node as follows::
it: Ti verrà richiesto di selezionare una rete, un tipo di nodo, un indirizzo IP e una chiave privata BLS. Immettere queste informazioni o accettare le impostazioni predefinite rilevate/generate. Avvia il tuo nodo come segue::
ru: Вам будет предложено выбрать сеть, тип узла, IP-адрес и закрытый ключ BLS. Введите эту информацию или примите обнаруженные/генерируемые значения по умолчанию. Запустите узел следующим образом::

source: You can manage your masternode status, configuration, and running state entirely from within dashmate. See the documentation `here <https://github.com/dashpay/platform/blob/master/packages/dashmate/README.md>`__ or use the built-in help system to learn more:
it: Puoi gestire lo stato, la configurazione e lo stato di esecuzione del tuo masternode interamente da Dashmate. Consulta la documentazione `qui <https://github.com/dashpay/platform/blob/master/packages/dashmate/README.md>`__ o utilizza il sistema di guida integrato per saperne di più:
ru: Вы можете управлять статусом, конфигурацией и рабочим состоянием своей мастерноды полностью из dashmate. Для получения дополнительной информации обратитесь к документации <https://github.com/dashpay/platform/blob/master/packages/dashmate/README.md>`__ или воспользуйтесь встроенной справочной системой:

source: dashmate displaying a range of status output
it: Dashmate visualizza una gamma di output di stato
ru: dashmate отображает диапазон состояния выхода

source: You can check the status of your masternode using the various ``dashmate status`` commands as follows::
it: Puoi controllare lo stato del tuo masternode utilizzando i vari comandi ``dashmate status`` come segue:
ru: Проверить состояние мастерноды можно с помощью различных команд ``dashmate status`` следующим образом::

source: Continue with the :ref:`Registration step <testnet-register-masternode>` to setup the collateral, keys and construct the ProTx transaction required to enable your masternode.
it: Continua con il :ref:`Passaggio di registrazione ` per impostare il collaterale, le chiavi e costruire la transazione ProTx richiesta per abilitare il tuo masternode.
ru: Продолжайте выполнять :ref:`Шаги установки <testnet-register-masternode>` для создания обеспечения, ключей и создания транзакции ProTx, необходимой для включения вашей мастерноды.

source: Masternode Update
it: Aggiornamento Masternode
ru: Обновление мастернод

source: You can use ``dashmate`` to update minor versions of the software on your masternode as follows::
it: Puoi utilizzare ``dashmate`` per aggiornare le versioni minori del software sul tuo masternode come segue::
ru: Вы можете использовать ``dashmate`` для обновления минорных версий программного обеспечения на вашей мастерноде следующим образом::

source: Adding the following ``git`` and ``npm`` commands optionally also ensures you are using the latest stable version of dashmate::
it: L'aggiunta facoltativa dei seguenti comandi ``git`` e ``npm`` garantisce inoltre l'utilizzo dell'ultima versione stabile di dashmate::
ru: Добавление следующих команд ``git`` и ``npm`` по желанию также гарантирует, что вы используете последнюю стабильную версию dashmate::

source: Adding the following command will drop all data from Dash Platform (necessary if Platform has been wiped) and restart with the latest version::
it: L'aggiunta del seguente comando eliminerà tutti i dati dalla Dash Platform (necessario se la Platform è stata cancellata) e si riavvierà con la versione più recente::
ru: Добавление следующей команды приведет к удалению всех данных из Dash Platform (это необходимо, если Platform была стерта) и перезапуску с последней версией::

source: Masternode registration
it: Registrazione del masternode
ru: Регистрация мастерноды

source: The three keys required for the different masternode roles are described briefly under :ref:`mn-concepts` in this documentation.
it: Le tre chiavi richieste per i diversi ruoli masternode sono descritte brevemente in :ref:`mn-concepts` in questa documentazione.
ru: Три ключа, необходимые для различных ролей мастерноды, кратко описаны в разделе :ref:`mn-concepts` данной документации.

source: Option 1: Registering from a hardware wallet
it: Opzione 1: registrazione da un wallet hardware
ru: Способ 1: Регистрация из аппаратного кошелька

source: Go back to DMT and ensure that all fields from the previous step are still filled out correctly. Click **Generate new** for the three private keys required for a masternode:
it: Torna a DMT e assicurati che tutti i campi del passaggio precedente siano ancora compilati correttamente. Fai clic su **Genera nuovo** per le tre chiavi private richieste per un masternode:
ru: Возвращайтесь назад в DMT и убедитесь, что все поля из предыдущего шага остались заполнены правильно. Кликните **Generate new**, чтобы сгенерировать три приватных ключа, которые необходимы для мастерноды:

source: Owner private key
it: Chiave privata del proprietario
ru: Приватный ключ владельца

source: Operator private key (generate new or use private key generated by dashmate)
it: Chiave privata dell'operatore (genera una nuova o usa la chiave privata generata da dashmate)
ru: Закрытый ключ оператора (сгенерировать новый или использовать закрытый ключ, сгенерированный dashmate)

source: Voting private key
it: Chiave privata di voto
ru: Приватный ключ голосования

source: Dash Masternode Tool ready to register a new masternode
it: Dash Masternode Tool pronto per registrare un nuovo masternode
ru: Dash Masternode Tool готов к регистрации новой мастерноды

source: Then click **Register masternode**. Optionally specify a different **Payout address** and/or **Operator reward**, then click **Continue**. Select **Remote Dash RPC Node (automatic method)**. (See `here <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__ for documentation on using your own local RPC node.) and confirm the following two messages:
it: Quindi fare clic su **Registra masternode**. Facoltativamente, specifica un diverso **Indirizzo di pagamento** e/o un **Premio per l'operatore**, quindi fai clic su **Continua**. Seleziona **Nodo RPC Dash remoto (metodo automatico)**. (Vedi `qui <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__ per la documentazione sull'utilizzo del tuo nodo RPC locale.) e conferma i seguenti due messaggi:
ru: Затем нажмите кнопку **Register masternode**. По желанию укажите другой **Payout address** и/или **Operator reward**, затем нажмите **Продолжить**. Выберите **Remote Dash RPC Node (автоматический метод)**. (Документацию по использованию собственного локального RPC-узла см. здесь <https://github.com/Bertrand256/dash-masternode-tool/blob/master/doc/config-connection-direct.md>`__) и подтвердите следующие два сообщения:

source: Dash Masternode Tool confirmation dialogs to register a masternode
it: Dash Masternode Tool finestre di dialogo di conferma per registrare un masternode
ru: Запрашивающие подтверждение диалоги в Dash Masternode Tool для регистрации мастерноды

source: The public key will be used in following steps. The private key must be entered in the configuration on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner (final step below). If you are using the BLS key generated by ``dashmate setup``, this information is already configured for your masternode. If you generated your own BLS key pair, edit the dashmate configuration as follows::
it: La chiave pubblica verrà utilizzata nei passaggi successivi. La chiave privata deve essere inserita nella configurazione sul masternode. Ciò consente al masternode di monitorare la blockchain per le transazioni Pro*Tx rilevanti e lo farà iniziare a fungere da masternode quando il ProRegTx firmato verrà trasmesso dal proprietario (passaggio finale di seguito). Se stai utilizzando la chiave BLS generata da ``dashmate setup``, queste informazioni sono già configurate per il tuo masternode. Se hai generato la tua coppia di chiavi BLS, modifica la configurazione del dashmate come segue:
ru: Открытый ключ будет использоваться на следующих шагах. Закрытый ключ должен быть введен в конфигурацию на мастерноде. Это позволит мастерноде следить за блокчейном на предмет соответствующих Pro*Tx-транзакций и начнет выполнять функции мастерноды, когда подписанная ProRegTx будет транслироваться владельцем (последний шаг ниже). Если вы используете BLS-ключ, сгенерированный командой ``dashmate setup'', то эта информация уже настроена для вашей мастерноды. Если же вы сгенерировали собственную пару BLS-ключей, отредактируйте конфигурацию dashmate следующим образом::

source: At this point you can go back to your terminal window and monitor your masternode by entering ``dashmate status`` or using the **Get status** function in DMT.
it: A questo punto puoi tornare alla finestra del tuo terminale e monitorare il tuo masternode inserendo ``dashmate status`` o utilizzando la funzione **Get status** in DMT.
ru: В этот момент вы можете вернуться в окно терминала и проконтролировать состояние своей ноды, введя ``dashmate status`` или воспользовавшись функцией **Get status** в DMT.

source: You can now safely log out of your server by typing ``exit``. Congratulations! Your masternode is now running.
it: Ora puoi uscire in sicurezza dal tuo server digitando ``exit``. Congratulazioni! Il tuo masternode è ora in esecuzione.
ru: Теперь можно спокойно выйти из сервера, набрав ``exit``. Поздравляем! Ваша мастернода запущена.

source: Option 2: Registering from Dash Core wallet
it: Opzione 2: registrazione dal wallet Dash Core
ru: Способ 2: Регистрация из кошелька Dash Core

source: Identify the funding transaction
it: Identificare la transazione di finanziamento
ru: Идентификация транзакции финансирования

source: If you used an address in Dash Core wallet for your collateral transaction, you now need to find the txid of the transaction. Click **Window > Console** and enter the following command::
it: Se hai utilizzato un indirizzo nel wallet Dash Core per la transazione collaterale, ora devi trovare il txid della transazione. Fai clic su **Finestra > Console** e inserisci il seguente comando::
ru: Если для совершения залоговой транзакции вы использовали адрес кошелька Dash Core, то теперь необходимо найти txid этой транзакции. Кликните **Окно > Консоль** и введите следующую команду::

source: This should return a string of characters similar to the following::
it: Questo dovrebbe restituire una stringa di caratteri simile alla seguente::
ru: Консоль должна вернуть строку символов, аналогичную этой::

source: The first long string is your ``collateralHash``, while the last number is the ``collateralIndex``.
it: La prima stringa lunga è il tuo ``collateralHash``, mentre l'ultimo numero è il ``collateralIndex``.
ru: Первая длинная строка - это ``хеш вашей транзакции``, последние цифры в ней - это ``индекс обеспечения``.

source: Generate a BLS key pair
it: Genera una coppia di chiavi BLS
ru: Генерация пары BLS-ключей

source: A public/private BLS key pair is required to operate a masternode. The private key is specified on the masternode itself, and allows it to be included in the deterministic masternode list once a provider registration transaction with the corresponding public key has been created.
it: Per utilizzare un masternode è necessaria una coppia di chiavi BLS pubblica/privata. La chiave privata è specificata sul masternode stesso, e permette di inserirlo nella lista deterministica dei masternode una volta creata una transazione di registrazione del provider con la corrispondente chiave pubblica.
ru: Для работы мастерноды требуется пара открытый/закрытый ключ BLS. Закрытый ключ указывается на самой ноде и позволяет включить его в детерминированный список узлов после создания транзакции регистрации провайдера с соответствующим открытым ключом.

source: If you are using a hosting service, they may provide you with their public key, and you can skip this step. If you are hosting your own masternode or have agreed to provide your host with the BLS private key, you can use the BLS key generated by the ``dashmate setup`` command. Alternatively, you can generate a BLS public/private keypair in Dash Core by clicking **Window > Console** and entering the following command::
it: Se stai utilizzando un servizio di hosting, potrebbero fornirti la loro chiave pubblica e puoi saltare questo passaggio. Se stai ospitando il tuo masternode o hai accettato di fornire al tuo host la chiave privata BLS, puoi utilizzare la chiave BLS generata dal comando "dashmate setup". In alternativa, puoi generare una coppia di chiavi pubblica/privata BLS in Dash Core facendo clic su **Finestra > Console** e immettendo il seguente comando::
ru: Если вы пользуетесь услугами хостинга, они могут предоставить вам свой открытый ключ, и вы можете пропустить этот шаг. Если вы размещаете свой собственную мастернод или согласились предоставить хостеру закрытый ключ BLS, вы можете использовать ключ BLS, сгенерированный командой ``dashmate setup``. В качестве альтернативы можно сгенерировать пару открытый/закрытый ключ BLS в Dash Core, нажав **Window > Console** и введя следующую команду::

source: **These keys are NOT stored by the wallet or dashmate and must be kept secure, similar to the value provided in the past by the** ``masternode genkey`` **command.**
it: **Queste chiavi NON vengono archiviate dal portafoglio o dashmate e devono essere mantenute al sicuro, in modo simile al valore fornito in passato dal** comando ``masternode genkey`` **.**
ru: **Эти ключи НЕ сохраняются в кошельке или dashmate должны храниться в безопасном месте, как и значение, предоставленное в одном из предыдущих шагов после выполнения** ``masternode genkey`` **команды.**

source: Add the private key to your masternode configuration
it: Aggiungi la chiave privata alla configurazione del tuo masternode
ru: Добавьте приватный ключ в конфигурацию вашей мастерноды

source: The public key will be used in following steps. The private key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner (final step below). If you are using the BLS key generated by ``dashmate setup``, this information is already configured for your masternode. If you generated your own BLS key pair, edit the dashmate configuration as follows::
it: La chiave pubblica verrà utilizzata nei passaggi successivi. La chiave privata deve essere inserita nel file ``dash.conf`` sul masternode. Ciò consente al masternode di monitorare la blockchain per le transazioni Pro*Tx rilevanti e lo farà iniziare a fungere da masternode quando il ProRegTx firmato verrà trasmesso dal proprietario (passaggio finale di seguito). Se stai utilizzando la chiave BLS generata da ``dashmate setup``, queste informazioni sono già configurate per il tuo masternode. Se hai generato la tua coppia di chiavi BLS, modifica la configurazione del dashmate come segue:
ru: Открытый ключ будет использоваться на следующих шагах. Закрытый ключ должен быть добавлен в ``dash.conf`` на мастерноде. Это позволит мастерноде следить за блокчейном на предмет соответствующих Pro*Tx-транзакций и начнет выполнять функции мастерноды, когда подписанная ProRegTx будет транслироваться владельцем (последний шаг ниже). Если вы используете BLS-ключ, сгенерированный командой ``dashmate setup'', то эта информация уже настроена для вашей мастерноды. Если же вы сгенерировали собственную пару BLS-ключей, отредактируйте конфигурацию dashmate следующим образом::

source: We will now prepare the transaction used to register the masternode on the network.
it: Ora prepareremo la transazione utilizzata per registrare il masternode sulla rete.
ru: Теперь мы подготовим транзакцию, используемую для регистрации мастерноды в сети.

source: Prepare a ProRegTx transaction
it: Preparare una transazione ProRegTx
ru: Подготовка транзакции ProRegTx

source: A pair of BLS keys for the operator were already generated above, and the private key was entered on the masternode. The public key is used in this transaction as the ``operatorPubKey``.
it: In precedenza è stata già generata una coppia di chiavi BLS per l'operatore e la chiave privata è stata inserita nel masternode. La chiave pubblica viene utilizzata in questa transazione come ``operatorPubKey``.
ru: Пара BLS-ключей для оператора уже была сгенерирована выше, а закрытый ключ был введен на мастер-узле. Открытый ключ используется в данной транзакции в качестве ``operatorPubKey``.

source: First, we need to get a new, unused address from the wallet to serve as the **owner key address** (``ownerKeyAddr``). This is not the same as the collateral address holding 1000 Dash. Generate a new address as follows::
it: Innanzitutto, dobbiamo ottenere un nuovo indirizzo non utilizzato dal wallet che funga da **indirizzo della chiave del proprietario** (``ownerKeyAddr``). Questo non è lo stesso dell'indirizzo collaterale che contiene 1000 Dash. Genera un nuovo indirizzo come segue::
ru: Во-первых, нам необходимо получить из кошелька новый, неиспользуемый адрес, который будет служить **адресом ключа владельца** (``ownerKeyAddr``). Это не то же самое, что адрес обеспечения, на котором хранится 1000 Dash. Сгенерируйте новый адрес следующим образом::
