Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/setup-evonode.po
Languages: it, ru

source: The editor appears with the existing masternode configuration. Add or uncomment this lines in the file, replacing the key with your BLS private key generated above::
it: L'editor appare con la configurazione del masternode esistente. Aggiungi o rimuovi il commento da queste righe nel file, sostituendo la chiave con la chiave privata BLS generata sopra::
ru: При открытии существующей конфигурации мастерноды откроется редактор. В конце файла добавьте следующую строку(раскомментируйте), заменив ключ на приватный BLS-ключ, который был сгенерирован выше::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. Note that providing a ``masternodeblsprivkey`` enables masternode mode, which will automatically force the ``txindex=1``, ``peerbloomfilters=1``, and ``prune=0`` settings necessary to provide masternode service. We now need to restart the masternode for this change to take effect. Enter the following commands, waiting a few seconds in between to give Dash Core time to shut down::
it: Premi Invio per assicurarti che ci sia una riga vuota alla fine del file, quindi premi **Ctrl + X** per chiudere l'editor e **Y** e **Invio** salvano il file. Tieni presente che fornire una ``masternodeblsprivkey`` abilita la modalità masternode, che forzerà automaticamente le impostazioni ``txindex=1``, ``peerbloomfilters=1`` e ``prune=0`` necessarie per fornire il servizio masternode. Ora dobbiamo riavviare il masternode affinché questa modifica abbia effetto. Inserisci i seguenti comandi, aspettando qualche secondo per dare a Dash Core il tempo di spegnersi::
ru: Нажмите клавишу Enter, чтобы убедиться, что в конце файла осталась пустая строка, затем нажмите **Ctrl + X** для закрытия редактора и **Y** и **Enter** для сохранения файла. Обратите внимание, что предоставление ``masternodeblsprivkey`` включает режим masternode, что автоматически приводит к установке параметров ``txindex=1``, ``peerbloomfilters=1`` и ``prune=0``, необходимых для обеспечения работы мастерноды. Теперь нам необходимо перезапустить мастерноду, чтобы это изменение вступило в силу. Введите следующие команды, подождав несколько секунд между ними, чтобы дать Dash Core время на завершение работы::

source: At this point you can monitor your masternode by entering ``~/.dashcore/dash-cli masternode status`` or using the **Refresh status** function in DMT. The final result should appear as follows:
it: A questo punto puoi monitorare il tuo masternode inserendo ``~/.dashcore/dash-cli masternode status`` o utilizzando la funzione **Aggiorna stato** in DMT. Il risultato finale dovrebbe apparire come segue:
ru: На этом этапе вы можете наблюдать за своей мастернодой введя ``~/.dashcore/dash-cli masternode status`` или используя функцию **Refresh status** в DMT. Конечный результат должен быть таким, как показано ниже:

source: dash-cli masternode status output showing successfully registered masternode
it: Output dello stato del masternode dash-cli che mostra il masternode registrato correttamente
ru: Статус мастерноды dash-cli, который сообщает об успешно зарегистрированной мастерноде

source: At this point you can safely log out of your server by typing ``exit``. Congratulations! Your masternode is now running.
it: A questo punto puoi tranquillamente disconnetterti dal tuo server digitando ``exit``. Congratulazioni! Il tuo masternode è ora in esecuzione.
ru: На этом этапе можно безопасно совершить выход из сервера, набрав ``exit``. Поздравляем! Ваша мастернода теперь работает.

source: Option 2: Registering from dashmate
it: Opzione 2: registrazione da Dashmate
ru: Способ 2: Регистрация в dashmate

source: For mainnet masternodes, it highly is recommended to :ref:`store the collateral on a hardware wallet <evonode-send-collateral-hardware>` and use the Dash Masternode Tool to register as described in :ref:`Option 1: Registering from a hardware wallet <register-evonode-hardware>`.
it: Per i masternode della rete principale, si consiglia vivamente di :ref:`memorizzare il materiale collaterale su un wallet hardware <evonode-send-collateral-hardware>` e utilizzare lo strumento Dash Masternode per registrarsi come descritto in :ref:`Opzione 1: registrazione da un wallet hardware <register-evonode-hardware>`.
ru: Для мастернод основной сети настоятельно рекомендуется :ref:`хранить обеспечение на аппаратном кошельке <evonode-send-collateral-hardware>` и использовать Dash Masternode Tool для регистрации, как описано в :ref:`Вариант 1: Регистрация с аппаратного кошелька <register-evonode-hardware>`.

source: Dashmate can assist with masternode registration by requesting the parameters necessary to construct a valid protx command that can be sent from Dash Core. This option is most useful for setting up testnet masternodes where the collateral is stored in Dash Core rather than a hardware wallet.
it: Dashmate può assistere con la registrazione del masternode richiedendo i parametri necessari per costruire un comando protx valido che può essere inviato da Dash Core. Questa opzione è molto utile per impostare masternode testnet in cui il collaterale è archiviato in Dash Core anziché in un wallet hardware.
ru: Dashmate может помочь в регистрации мастернод, запросив параметры, необходимые для создания корректной команды protx, которая может быть отправлена из Dash Core. Эта опция наиболее полезна для настройки мастернод тестовой сети, где обеспечение хранится в Dash Core, а не в аппаратном кошельке.

source: Collect required information
it: Raccogli le informazioni richieste
ru: Сбор необходимой информации

source: Prior to running the dashmate setup wizard you should obtain the :hoverxref:`collateral transaction info <evonode-mn-outputs>` and the owner, voting, and payout addresses for the new evonode. For example, use Dash Core to generate the addresses as described in the :hoverxref:`Get masternode addresses section <evonode-get-addresses>`.
it: Prima di eseguire la procedura guidata di configurazione di Dashmate è necessario ottenere :hoverxref:`informazioni sulla transazione collaterale<evonode-mn-outputs>` e gli indirizzi del proprietario, della votazione e dei pagamenti per il nuovo evonode. Ad esempio, utilizza Dash Core per generare gli indirizzi come descritto nella sezione :hoverxref:`Ottieni indirizzi masternode <evonode-get-addresses>`.
ru: Перед запуском мастера настройки dashmate необходимо получить :hoverxref:`информация o транзакции обеспечения <evonode-mn-outputs>` и адреса владельца, голосования и выплат для новой эвоноды. Например, используйте Dash Core для генерации адресов, как описано в разделе :hoverxref:`Получение адресов мастернод <evonode-get-addresses>`.

source: Run the setup wizard
it: Esegui la procedura guidata di configurazione
ru: Запустите мастер настройки

source: To begin masternode setup, run ``dashmate setup`` to start the interactive wizard::
it: Per iniziare la configurazione del masternode, esegui ``dashmate setup`` per avviare la procedura guidata interattiva:
ru: Чтобы начать настройку мастерноды, выполните команду ``dashmate setup`` для запуска интерактивного мастера::

source: You will be prompted to select a network, node type, IP address and BLS private key. When setting up an unregistered masternode, you will also be prompted for the collateral transaction information and owner, voting, and payout addresses.
it: Ti verrà richiesto di selezionare una rete, un tipo di nodo, un indirizzo IP e una chiave privata BLS. Quando imposti un masternode non registrato, ti verranno richieste anche le informazioni sulla transazione collaterale e gli indirizzi del proprietario, del voto e dei pagamenti.
ru: Вам будет предложено выбрать сеть, тип ноды, IP-адрес и приватныйключ BLS. При настройке незарегистрированной мастерноды вам также будет предложено ввести информацию о транзакции залога и адреса владельца, голосования и выплат.

source: Enter the requested information or accept the detected/generated defaults. For an example showing all steps of the setup wizard, refer to the :hoverxref:`dashmate section <dashmate-wizard-walkthrough>`.
it: Immettere le informazioni richieste o accettare i valori predefiniti rilevati/generati. Per un esempio che mostra tutti i passaggi della procedura guidata di configurazione, fare riferimento alla sezione :hoverxref:`dashmate <dashmate-wizard-walkthrough>`.
ru: Введите запрашиваемую информацию или примите найденные/ сгенерированные значения по умолчанию. Пример, показывающий все шаги мастера настройки, приведен в разделе :hoverxref:`секция dashmate <dashmate-wizard-walkthrough>`.

source: Submit the ProRegTx
it: Invia il ProRegTx
ru: Отправить ProRegTx

source: The dashmate wizard will output a command you can use to submit the provider registration special transaction that registers the masternode on the network. Copy the provided protx command and run it using dash-cli or the Dash Core console.
it: La procedura guidata di Dashmate genererà un comando che puoi utilizzare per inviare la transazione speciale di registrazione del provider che registra il masternode sulla rete. Copia il comando protx fornito ed eseguilo utilizzando dash-cli o la console Dash Core.
ru: Мастер dashmate выдаст команду, которую можно использовать для отправки специальной транзакции регистрации провайдера, регистрирующей мастерноду в сети. Скопируйте предоставленную команду protx и запустите ее с помощью dash-cli или консоли Dash Core.

source: Registration command
it: Comando di registrazione
ru: Команда регистрации

source: Start the node
it: Avvia il nodo
ru: Запустите ноду

source: Option 3: Registering from Dash Core wallet
it: Opzione 3: registrazione dal wallet Dash Core
ru: Способ 3: Регистрация в кошельке Dash Core

source: This option can be used without installing any applications other than Dash Core; however, it requires the most technical skill.
it: Questa opzione può essere utilizzata senza installare applicazioni diverse da Dash Core; tuttavia, richiede l'abilità più tecnica.
ru: Этот вариант может быть использован без установки каких-либо приложений, кроме Dash Core, однако он требует некоторых технических навыков.

source: Identify the funding transaction
it: Identificare la transazione di finanziamento
ru: Идентификация транзакции финансирования

source: If you used an address in Dash Core wallet for your collateral transaction, you now need to find the txid of the transaction. Click **Window > Console** and enter the following command::
it: Se hai utilizzato un indirizzo nel wallet Dash Core per la transazione collaterale, ora devi trovare il txid della transazione. Fai clic su **Finestra > Console** e inserisci il seguente comando::
ru: Если для совершения залоговой транзакции вы использовали адрес кошелька Dash Core, то теперь необходимо найти txid этой транзакции. Кликните **Окно > Консоль** и введите следующую команду::

source: This should return a string of characters similar to the following::
it: Questo dovrebbe restituire una stringa di caratteri simile alla seguente::
ru: Консоль должна вернуть строку символов, аналогичную этой::

source: The first long string is your ``collateralHash``, while the last number is the ``collateralIndex``.
it: La prima stringa lunga è il tuo ``collateralHash``, mentre l'ultimo numero è il ``collateralIndex``.
ru: Первая длинная строка - это ``хеш вашей транзакции``, последние цифры в ней - это ``индекс обеспечения``.

source: Generate a BLS key pair
it: Genera una coppia di chiavi BLS
ru: Генерация пары BLS-ключей

source: A public/private BLS key pair is required to operate a masternode. The private key is specified on the masternode itself, and allows it to be included in the deterministic masternode list once a provider registration transaction with the corresponding public key has been created.
it: Per utilizzare un masternode è necessaria una coppia di chiavi BLS pubblica/privata. La chiave privata è specificata sul masternode stesso, e permette di inserirlo nella lista deterministica dei masternode una volta creata una transazione di registrazione del provider con la corrispondente chiave pubblica.
ru: Для работы мастерноды требуется пара открытый/закрытый ключ BLS. Закрытый ключ указывается на самой ноде и позволяет включить его в детерминированный список узлов после создания транзакции регистрации провайдера с соответствующим открытым ключом.

source: If you are using a hosting service, they may provide you with their public key, and you can skip this step. If you are hosting your own masternode or have agreed to provide your host with the BLS private key, generate a BLS public/private keypair in Dash Core by clicking **Tools > Console** and entering the following command::
it: Se stai utilizzando un servizio di hosting, potrebbero fornirti la loro chiave pubblica e puoi saltare questo passaggio. Se stai ospitando il tuo masternode o hai accettato di fornire al tuo host la chiave privata BLS, genera una coppia di chiavi pubblica/privata BLS in Dash Core facendo clic su **Strumenti > Console** e inserendo il seguente comando::
ru: Если вы пользуетесь услугами хостинга, они могут предоставить вам свой открытый ключ, и вы можете пропустить этот шаг. Если вы размещаете свой собственную мастернод или согласились предоставить хостеру закрытый ключ BLS, можно сгенерировать пару открытый/закрытый ключ BLS в Dash Core, нажав **Window > Tools** и введя следующую команду::

source: **These keys are NOT stored by the wallet and must be backed up and kept secure.**
it: **Queste chiavi NON vengono archiviate nel wallet e devono essere sottoposte a backup e mantenute al sicuro.**
ru: **Эти ключи НЕ хранятся в кошельке, их необходимо сохранить и хранить в безопасности.**

source: Add the private key to your masternode configuration
it: Aggiungi la chiave privata alla configurazione del tuo masternode
ru: Добавьте приватный ключ в конфигурацию вашей мастерноды

source: The public key will be used in following steps. The private key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner (final step below). Log in to your masternode using ``ssh`` or PuTTY and edit the configuration file as follows::
it: La chiave pubblica verrà utilizzata nei passaggi successivi. La chiave privata deve essere inserita nel file ``dash.conf`` sul masternode. Ciò consente al masternode di monitorare la blockchain per le transazioni Pro*Tx rilevanti e lo farà iniziare a fungere da masternode quando il ProRegTx firmato verrà trasmesso dal proprietario (passaggio finale di seguito). Accedi al tuo masternode utilizzando ``ssh`` o PuTTY e modifica il file di configurazione come segue:
ru: Публичный ключ будет использоваться в следующих шагах. Приватный BLS-ключ необходимо внести в файл ``dash.conf`` мастерноды. Это позволит мастерноде следить за блокчейном и выявлять в нём релевантные транзакции Pro*Tx, а также заставит ноду начать выполнять функции мастерноды, после того, как подписанная владельцем транзакция ProRegTx начнёт транслироваться в сеть (последний шаг ниже). Войдите в учётную запись своей мастерноды, используя ``ssh`` или PuTTY и отредактируйте конфигурационный файл, как показано ниже::

source: The editor appears with the existing masternode configuration. Add or uncomment this line in the file, replacing the key with your BLS private key generated above::
it: L'editor appare con la configurazione del masternode esistente. Aggiungi o rimuovi il commento da questa riga nel file, sostituendo la chiave con la chiave privata BLS generata sopra::
ru: При открытии существующей конфигурации мастерноды откроется редактор. В конце файла добавьте следующую строку (раскомментируйте), заменив ключ на приватный BLS-ключ, который был сгенерирован выше::

source: Generate a Platform Node ID
it: Genera un ID nodo Platform
ru: Генерация ID ноды платформы

source: The following command will generate new P2P key using Tenderdash and display it on the screen::
it: Il seguente comando genererà una nuova chiave P2P utilizzando Tenderdash e la visualizzerà sullo schermo::
ru: Следующая команда сгенерирует новый P2P-ключ с помощью Tenderdash и выведет его на экран::

source: Save the value contained in the ``id`` field for use as your ``platformNodeID``.
it: Salva il valore contenuto nel campo ``id`` per utilizzarlo come ``platformNodeID``.
ru: Сохраните значение, содержащееся в поле ``id``, для использования в качестве ``platformNodeID``.

source: Alternatively, the following commands can be used generate P2P key, save it to `privkey.pem`, and generate ``platformNodeID`` in hex format::
it: In alternativa, è possibile utilizzare i seguenti comandi per generare la chiave P2P, salvarla in `privkey.pem` e generare ``platformNodeID`` in formato esadecimale:
ru: В качестве альтернативы можно использовать следующие команды: сгенерировать P2P-ключ, сохранить его в файле `privkey.pem` и сгенерировать ``platformNodeID`` в HEX формате::

source: The platform node ID will be used in following steps. We will now prepare the transaction used to register the masternode on the network.
it: L'ID del nodo della Platform verrà utilizzato nei passaggi seguenti. Ora prepareremo la transazione utilizzata per registrare il masternode sulla rete.
ru: Идентификатор ноды платформы будет использоваться в последующих шагах. Теперь мы подготовим транзакцию, используемую для регистрации мастерноды в сети.

source: Get masternode addresses
it: Ottieni gli indirizzi masternode
ru: Получение адресов мастернод

source: Owner address
it: Indirizzo del proprietario
ru: Адрес владельца

source: First, we need to get a new, unused address from the wallet to serve as the **owner key address** (``ownerKeyAddr``). This is not the same as the collateral address holding 4000 Dash. Generate a new address as follows::
it: Innanzitutto, dobbiamo ottenere un nuovo indirizzo non utilizzato dal wallet che funga da **indirizzo della chiave del proprietario** (``ownerKeyAddr``). Questo non è lo stesso dell'indirizzo collaterale che contiene 4000 Dash. Genera un nuovo indirizzo come segue::
ru: Во-первых, нам необходимо получить из кошелька новый, неиспользуемый адрес, который будет служить **адресом ключа владельца** (``ownerKeyAddr``). Это не то же самое, что адрес обеспечения, на котором хранится 4000 Dash. Сгенерируйте новый адрес следующим образом::

source: Voting address
it: Indirizzo di voto
ru: Адрес голосующего

source: This address can also be used as the **voting key address** (``votingKeyAddr``). Alternatively, you can specify an address provided to you by your chosen voting delegate, or simply generate a new voting key address as follows::
it: Questo indirizzo può essere utilizzato anche come **indirizzo chiave di voto** (``votingKeyAddr``). In alternativa, puoi specificare un indirizzo fornito dal delegato votante prescelto o semplicemente generare un nuovo indirizzo chiave di voto come segue::
ru: Этот адрес также может быть использован в качестве **адреса ключа голосования** (``votingKeyAddr``). В качестве альтернативы можно указать адрес, предоставленный Вам выбранным Вами делегатом голосования, или просто сгенерировать новый адрес ключа голосования следующим образом::

source: Payout address
it: Indirizzo di pagamento
ru: Адрес для выплат

source: Then either generate or choose an existing address to receive the **owner's masternode payouts** (``payoutAddress``). It is also possible to use an address external to the wallet::
it: Quindi genera o scegli un indirizzo esistente per ricevere i **pagamenti del masternode del proprietario** (``payoutAddress``). E' possibile utilizzare anche un indirizzo esterno al wallet::
ru: Затем либо сгенерируйте, либо выберите из существующих второй адрес для получения **платежей владельца мастерноды** (``payoutAddress``). Также возможно использовать адрес внешнего кошелька::

source: Fee source address
it: Commissione dell'indirizzo sorgente
ru: Адрес источника комиссии

source: You can also optionally generate and fund another address as the **transaction fee source** (``feeSourceAddress``). If you selected an external payout address, you must specify a fee source address.
it: Puoi anche opzionalmente generare e finanziare un altro indirizzo come **fonte della commissione di transazione** (``feeSourceAddress``). Se hai selezionato un indirizzo di pagamento esterno, devi specificare un indirizzo di origine della commissione.
ru: При желании можно сгенерировать и пополнить другой адрес в качестве **источника комиссии за транзакцию** (``feeSourceAddress``). Если выбран внешний адрес выплаты, то необходимо указать адрес источника комиссии.

source: Either the payout address or fee source address must have enough balance to pay the transaction fee, or the ``register_prepare_hpmn`` transaction will fail.
it: L'indirizzo di pagamento o l'indirizzo di origine della commissione deve avere un saldo sufficiente per pagare la commissione di transazione, altrimenti la transazione ``register_prepare_hpmn`` fallirà.
ru: Либо адрес выплаты, либо адрес источника комиссии должны иметь достаточный баланс для оплаты комиссии за транзакцию, иначе транзакция ``register_prepare_hpmn`` завершится неудачей.

source: Key access
it: Chiave di accesso
ru: Доступ к ключам

source: The private keys to the owner and fee source addresses must exist in the wallet submitting the transaction to the network. If your wallet is protected by a password, it must now be unlocked to perform the following commands. Unlock your wallet for 5 minutes::
it: Le chiavi private del proprietario e gli indirizzi della fonte delle commissioni devono essere presenti nel portafoglio che invia la transazione alla rete. Se il tuo portafoglio è protetto da password, ora deve essere sbloccato per eseguire i seguenti comandi. Sblocca il tuo portafoglio per 5 minuti::
ru: Приватные ключи владельца и адреса источника оплаты комиссии должны присутствовать в кошельке, отправляющем транзакцию в сеть. Если ваш кошелёк защищён паролем, то для выполнения указанных команд его необходимо разблокировать. Разблокируйте свой кошелёк на 5 минут::

source: Prepare a ProRegTx transaction
it: Preparare una transazione ProRegTx
ru: Подготовка транзакции ProRegTx

source: We will now prepare an unsigned ProRegTx special transaction using the ``protx register_prepare_hpmn`` command. This command has the following syntax::
it: Ora prepareremo una transazione speciale ProRegTx non firmata utilizzando il comando ``protx Register_prepare_hpmn``. Questo comando ha la seguente sintassi::
ru: Теперь подготовим беззнаковую специальную транзакцию ProRegTx с помощью команды ``protx register_prepare_hpmn``. Эта команда имеет следующий синтаксис::

source: Open a text editor such as notepad to prepare this command. Replace each argument to the command as follows:
it: Apri un editor di testo come Blocco note per preparare questo comando. Sostituisci ogni argomento del comando come segue:
ru: Откройте текстовый редактор, например Блокнот и подготовьте эту команду. Замените каждый аргумент команды следующим образом:

source: ``collateralHash``: The txid of the 4000 Dash collateral funding transaction
it: ``collateralHash``: il txid della transazione di finanziamento collaterale 4000 Dash
ru: ``collateralHash``: txid транзакции залогового финансирования на 4000 DASH

source: ``collateralIndex``: The output index of the 4000 Dash funding transaction
it: ``collateralIndex``: l'indice di output della transazione di finanziamento 4000 Dash
ru: ``collateralIndex``: Индекс выхода транзакции финансирования на 4000 DASH
