Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/understanding.po
Languages: it, ru

source: Step 1 can be omitted if you have an existing server. Steps 2 and 3 require direct access to the masternode. Steps 3 and 4 require access to a Dash Wallet (or DMT). Step 5 requires access to the wallet actually holding the collateral. Step 6 requires a Dash balance to pay the transaction fee.
it: Il passaggio 1 può essere omesso se disponi di un server esistente. I passaggi 2 e 3 richiedono l'accesso diretto al masternode. I passaggi 3 e 4 richiedono l'accesso a un Dash Wallet (o DMT). Il passaggio 5 richiede l'accesso al wallet che detiene effettivamente la garanzia. Il passaggio 6 richiede un saldo Dash per pagare la commissione di transazione.
ru: Шаг 1 можно пропустить, если у вас есть существующий сервер. Шаги 2 и 3 требуют прямого доступа к мастерноде. Для шагов 3 и 4 требуется доступ к кошельку Dash (или DMT). Шаг 5 требует доступа к кошельку, на котором удерживается залог. Шаг 6 требует информации о балансе Dash для оплаты транзакционных комиссий.

source: Masternodes vs. mining
it: Masternode vs. mining
ru: Мастерноды и майнинг

source: Dash, like Bitcoin and most other cryptocurrencies, is based on a decentralized ledger of all transactions, known as a blockchain. This blockchain is secured through a consensus mechanism; in the case of both Dash and Bitcoin, the consensus mechanism is Proof of Work (PoW). :ref:`Miners <mining>` attempt to solve difficult problems with specialized computers, and when they solve the problem, they receive the right to add a new block to the blockchain. If all the other people running the software agree that the problem was solved correctly, the block is added to the blockchain and the miner is rewarded.
it: Dash, come Bitcoin e la maggior parte delle altre criptovalute, si basa su un registro decentralizzato di tutte le transazioni, noto come blockchain. Questa blockchain è protetta attraverso un meccanismo di consenso; nel caso sia di Dash che di Bitcoin, il meccanismo di consenso è Proof of Work (PoW). :ref:`I minatori <mining>` tentano di risolvere problemi difficili con computer specializzati e, quando risolvono il problema, ricevono il diritto di aggiungere un nuovo blocco alla blockchain. Se tutte le altre persone che gestiscono il software concordano sul fatto che il problema è stato risolto correttamente, il blocco viene aggiunto alla blockchain e il minatore viene ricompensato.
ru: Dash, ровно как Bitcoin и большинство других криптовалют, основывается на технологии распределённого списка транзакций, называемой блокчейном. Блокчейн защищён через механизм консенсуса; в случае Dash и Bitcoin, этот механизм называется Proof of Work (доказательство выполненной работы). При данном консенсусе :ref:`Miners <mining>` майнеры пытаются решить сложные криптографические задачи, используя специальное программное обеспечение и/или компьютеры. Когда они решают задачу, то получают право добавить новый блок в блокчейн. Если все остальные люди, у которых запущено соответствующее программное обеспечение, согласны с тем, что задача решена верно, то блок добавляется в блокчейн и майнер получает вознаграждение.

source: Dash works a little differently from Bitcoin, however, because it has a two-tier network. The second tier is powered by masternodes (Full Nodes), which enable financial privacy (CoinJoin), instant transactions (InstantSend), and the decentralized governance and budget system. Because this second tier is so important, masternodes are also rewarded when miners discover new blocks. The breakdown is as follows: 80% of the block subsidy is split between the miner and a masternode per the distribution found :ref:`here <block-reward-reallocation>`, while 20% is reserved for the budget system (created by superblocks every month).
it: Dash funziona in modo leggermente diverso da Bitcoin, tuttavia, perché ha una rete a due livelli. Il secondo livello è alimentato da masternode (Full Nodes), che consentono la privacy finanziaria (CoinJoin), transazioni istantanee (InstantSend) e il sistema di governance e budget decentralizzato. Poiché questo secondo livello è così importante, i masternode vengono ricompensati anche quando i miner scoprono nuovi blocchi. La ripartizione è la seguente: l'80% del sussidio del blocco è suddiviso tra il miner e un masternode secondo la distribuzione trovata :ref:`qui <block-reward-reallocation>`, mentre il 20% è riservato al sistema di budget (creato dai superblocchi ogni mese).
ru: Однако Dash работает несколько иначе, чем Bitcoin, поскольку имеет двухуровневую сеть. На втором уровне работают мастерноды (Полные ноды), которые обеспечивают конфиденциальность финансовых операций (CoinJoin), мгновенные транзакции (InstantSend), а также децентрализованную систему управления и бюджета. Поскольку этот второй уровень так важен, мастерноды также получают вознаграждение, когда майнеры открывают новые блоки. Вознаграждение распределяется следующим образом: 80% вознаграждения за блок делится между майнером и мастернодой в соответствии с распределением, приведенным :ref:`тут<block-reward-reallocation>`, а 20% предназначается для бюджетной системы (создается суперблоками каждый месяц).

source: The masternode system is referred to as Proof of Service (PoSe), since the masternodes provide crucial services to the network. In fact, the entire network is overseen by the masternodes, which have the power to reject improperly formed blocks from miners. If a miner tried to take the entire block reward for themselves or tried to run an old version of the Dash software, the masternode network would orphan that block, and it would not be added to the blockchain.
it: Il sistema masternode viene definito Proof of Service (PoSe), poiché i masternode forniscono servizi cruciali alla rete. L’intera rete, infatti, è supervisionata dai masternode, che hanno il potere di respingere i blocchi formati in modo improprio dai miner. Se un minatore provasse a prendere per sé l’intero premio del blocco o tentasse di eseguire una vecchia versione del software Dash, la rete masternode renderebbe orfano quel blocco e non verrebbe aggiunto alla blockchain.
ru: Система мастернод характеризуется концепцией Proof of Service (PoSe) -доказательство службы, поскольку мастерноды предоставляют жизненно важные услуги для сети. Фактически, мастерноды осуществляют наблюдение за работой всей сети и наделены властью отказывать неверно сформированным майнерами блокам. Если бы майнер попытался забрать всю награду за блок себе или запустить старую версию программного обеспечения Dash, то сеть мастернод определила бы его блок как "сиротский" и он не был бы добавлен в блокчейн.

source: In short, miners power the first tier, which is the basic sending and receiving of funds and prevention of doublespending. Masternodes power the second tier, which provide the added features that make Dash different from other cryptocurrencies. Masternodes do not mine, and mining computers cannot serve as masternodes. Additionally, each masternode is “secured” by DASH collateral. Those DASH remain under the sole control of their owner at all times, and can still be freely spent. The funds are not locked in any way. However, if the funds are moved or spent, the associated masternode will go offline and stop receiving rewards.
it: In breve, i miner alimentano il primo livello, ovvero l’invio e la ricezione di fondi e la prevenzione della doppia spesa. I Masternodes alimentano il secondo livello, che fornisce le funzionalità aggiuntive che rendono Dash diverso dalle altre criptovalute. I masternode non eseguono operazioni di mining e i computer di mining non possono fungere da masternode. Inoltre, ogni masternode è “protetto” dal collaterale DASH. Questi DASH rimangono sempre sotto il controllo esclusivo del proprietario e possono ancora essere spesi liberamente. I fondi non sono bloccati in alcun modo. Tuttavia, se i fondi vengono spostati o spesi, il masternode associato andrà offline e smetterà di ricevere premi.
ru: Если говорить кратко, то майнеры обеспечивают работу первого уровня, на котором происходит основная отправка и получение средств, а также предотвращение двойных расходов. На втором уровне работают мастерноды, которые обеспечивают дополнительные возможности, отличающие Dash от других криптовалют. Мастерноды не майнят, и майнинговые компьютеры не могут выступать в качестве мастернод. Кроме того, каждый мастернода "обеспечен" залогом DASH. Эти DASH всегда остаются под контролем их владельца и могут быть свободно потрачены. Средства никак не блокируются. Однако если эти средства будут перемещены или потрачены, то связанный с ними мастернод перейдет в автономный режим и перестанет получать вознаграждение.

source: Payment logic
it: Logica di pagamento
ru: Логика выплат

source: Masternodes payments all originate on the Core chain. The Core chain pays out 62.5% of the masternode portion of Core block rewards. The remaining 37.5% is put into the :term:`credit pool` and used for evonode rewards on Platform. Masternodes and evonodes also receive a portion of transaction fees on the Core chain, while evonodes receive all fees from Platform.
ru: Все выплаты мастернод исходят из основного блокчейна. Core-чейн выплачивает 62,5% от доли вознаграждения мастернод, которая полагается за добычу блока. Оставшиеся 37,5% помещаются в :term:`credit пул` и используются для вознаграждения эвонод в рамках Платформы. Мастерноды и эвоноды также получают часть комиссии за транзакции в основном блокчейне, в то время как эвоноды получают все комиссии собираемые платформой.

source: Because the reward distribution percentages are fixed, the number of evonodes is expected to stabilize around a fixed number based on the total number of masternodes (considering the current number of ~3850 Masternodes, ~450 evonodes are expected). This is because if there are more than that fixed number of evonodes, running a regular MN will be more profitable than running an evonode, and hosts will convert their evonodes into MNs.
it: Poiché le percentuali di distribuzione della ricompensa sono fisse, si prevede che il numero di evonode si stabilizzi attorno a un numero fisso basato sul numero totale di masternode (considerando il numero attuale di ~3850 Masternode, si prevedono ~450 evonode). Questo perché se il numero di evonodi è superiore a quello prefissato, l'esecuzione di un normale MN sarà più redditizia rispetto all'esecuzione di un evonode e gli host convertiranno i propri evonodi in MN.
ru: Поскольку процент распределения вознаграждения фиксирован, ожидается, что количество эвонодов стабилизируется вокруг фиксированного числа, зависящего от общего числа мастернод (учитывая текущее число мастернод ~3850, ожидается ~450 эвонод). Это связано с тем, что если число evonodes превышает фиксированное, то работа обычного MN будет более выгодной, чем работа evonode, и хосты будут преобразовывать свои evonodes в MN.

source: Reward reallocation
ru: Распределение вознаграждения

source: Since the masternode reward reallocation hard fork activated in August 2024 at `block 2128896 <https://insight.dash.org/insight/block/0000000000000009a9696da93d3807eb14eb00a4ff449206d689156a21b27f26>`_, part of the coinbase masternode subsidy is moved into the :term:`credit pool` each time a block is mined. Now, evonodes receive a single reward per payment cycle on the Core chain instead of rewards from four sequential blocks, as in Dash Core v19/v20.
ru: С момента активации хардфорка, связанного с перераспределением вознаграждения мастернод в августе 2024 года на `блоке 2128896 <https://insight.dash.org/insight/block/0000000000000009a9696da93d3807eb14eb00a4ff449206d689156a21b27f26>`_, часть вознаграждения мастернод от coinbase перемещается в :term:`credit пул` каждый раз, когда добывается блок. Поэтому сейчас эвоноды получают одно вознаграждение в течение цикла выплат в основном блокчейне, вместо 4 наград из 4 последовательных блоков, как это было в Dash Core v19/v20.

source: Masternode payment frequency and payment amount have both been affected by this fork, as described in the following sections. Although masternodes initially saw a significant drop in rewards, a market-driven point of equilibrium between regular masternodes and evonodes is expected where rewards are similar to what they were before the fork.
ru: Как описано в следующих разделах, этот форк повлиял на частоту и размер выплат мастернод. Хотя вначале вознаграждения мастернод значительно снизились, ожидается наступление рыночного равновесия между обычными мастернодами и эвонодами, тогда их вознаграждения станут такими же, как до хардфорка.

source: Until the network reaches a point of equilibrium, the number of masternodes and evonodes is expected to fluctuate. As more masternodes are converted to evonodes, payment frequency (and therefore rewards) on the Core chain will continue to increase. See the `Evonode FAQ <https://www.dash.org/hpmn-faq/>`_, `DIP28 <https://github.com/dashpay/dips/blob/master/dip-0028.md>`_, and the `proposal approving evonodes <https://www.dashcentral.org/p/EVO-DECISION-4K-HPMN>`_ for more information.
ru: Пока сеть не достигнет точки равновесия, количество мастернод и эвонод будет колебаться. По мере преобразования большего количества мастернод в эвоноды частота платежей (и, соответственно, вознаграждений) в цепочке Core будет увеличиваться. Дополнительную информацию см. в `Evonode FAQ <https://www.dash.org/hpmn-faq/>`_, `DIP28 <https://github.com/dashpay/dips/blob/master/dip-0028.md>`_, и `proposal approving evonodes <https://www.dashcentral.org/p/EVO-DECISION-4K-HPMN>`_.

source: Payment frequency
ru: Частота выплат

source: The frequency of Core chain masternode payments has increased as fewer payments are made per cycle. Around the time of the hard fork, the network had approximately 2600 enabled masternodes and approximately 175 enabled evonodes. This resulted in a reduction from 3330 payments per cycle (``2600 + (175 * 4)``) before the fork to only 2775 (``2600 + 175``) after the fork. See the following table for the outcomes of this change.
ru: Частота выплат мастернод Core блокчейна увеличилась, так как за цикл производится меньше выплат. Во время хард форка в сети было около 2600 включенных мастернод и около 175 включенных эвонод. Это привело к сокращению выплат с 3330 за цикл (``2600 + (175 * 4)``) до форка до всего 2775 (``2600 + 175``) после форка. Результаты этого изменения приведены в следующей таблице.

source: Pre-fork
ru: До форка

source: Post-fork
ru: После форка

source: Difference
ru: Разница

source: Outcome
ru: Результат

source: Payment (blocks)
ru: Выплата (Блоки)

source: More frequent payment
ru: Более частые выплаты

source: Payment (days)
ru: Выплаты (Дни)

source: Payments / year
ru: Выплаты / год

source: More payments
ru: Больше выплат

source: Payment amount
ru: Размер выплаты

source: The increased payment frequency is balanced against the reduction per-block payment amount on the Core chain. This reduction resulted from the moving of some funds to the credit pool for Dash Platform. The table below compares the miner, credit pool, and Core chain masternode payments from a `block immediately before <https://insight.dash.org/insight/block/000000000000001bd1f5eeb2277b1adc87a616a9f55a9af2dd5ea46b05c05870>`_ the hard fork with the `block immediately after it <https://insight.dash.org/insight/block/0000000000000009a9696da93d3807eb14eb00a4ff449206d689156a21b27f26>`_.
ru: Увеличение частоты выплат уравновешивается снижением размера выплаты за один блок в основном блокчейне. Это уменьшение произошло в результате перемещения части средств в credit пул для Платформы Dash. В приведенной ниже таблице сравниваются выплаты майнерам, Credit пулу и Мастернодам из `блока непосредственно перед <https://insight.dash.org/insight/block/000000000000001bd1f5eeb2277b1adc87a616a9f55a9af2dd5ea46b05c05870>`_ хард форком и `блока сразу после него <https://insight.dash.org/insight/block/0000000000000009a9696da93d3807eb14eb00a4ff449206d689156a21b27f26>`_.

source: Category
ru: Категория

source: Pre-Fork
ru: До форка

source: Post-Fork
ru: После форка

source: Miner
ru: Майнер

source: No change
ru: Без изменений

source: Credit pool
ru: Credit пул

source: **Total**
ru: **Итого**

source: As more masternodes are converted to evonodes, payment frequency will increase, and the difference between overall pre-fork and post-fork rewards per year on the Core chain will decrease.
ru: По мере того как все больше мастернод будут преобразовываться в эвоноды, частота выплат будет расти, а разница между общим вознаграждением до и после форка в год в Coreчейне будет уменьшаться.

source: Core block rewards
ru: Core Вознаграждения

source: Since Dash version 0.13.0, masternode payments are entirely deterministic and based on a simple list sort algorithm. Dash version 0.13.0 implemented `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ which defines two sets of masternodes.
it: A partire dalla versione 0.13.0 di Dash, i pagamenti masternode sono interamente deterministici e basati su un semplice algoritmo di ordinamento delle liste. La versione 0.13.0 di Dash ha implementato `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ che definisce due set di masternode.
ru: Начиная с версии Dash 0.13.0, расчеты с мастернодами полностью детерминированы и основаны на простом алгоритме сортировки списка. В Dash версии 0.13.0 реализована функция `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_, определяющая два набора мастернод.

source: The full set, which contains all registered masternodes that have not spent their collateral funding transactions.
it: Il set completo, che contiene tutti i masternode registrati che non hanno speso le loro transazioni di finanziamento collaterale.
ru: Полный набор, который содержит все зарегистрированные мастерноды, не потратившие своё залоговое подтверждение.

source: The valid set, a subset of the full set which contains all masternodes which are not marked as Proof of Service (PoSe) banned.
it: Il set valido, un sottoinsieme del set completo che contiene tutti i masternode che non sono contrassegnati come Proof of Service (PoSe) vietati.
ru: Допустимый набор является подмножеством полного набора, который содержит все мастерноды, у которых нет метки бана Proof of Service (PoSe).

source: Each masternode in the set of valid masternodes, identified by its registration transaction ID, is associated with the block at which it was last paid. If it has never received payment or was banned for failing to meet the PoSe requirements, then the block at which it was first registered or at which service was restored is used instead. The list is sorted in ascending order by this block height and ProRegTx hash (as a tie breaker in case two masternodes were registered in the same block), and the first entry is selected for payment.
it: Ogni masternode dell'insieme dei masternode validi, identificato dal suo ID di transazione di registrazione, è associato al blocco in cui è stato pagato l'ultimo. Se non ha mai ricevuto il pagamento o è stato bannato per non aver soddisfatto i requisiti PoSe, verrà utilizzato il blocco in cui è stato registrato per la prima volta o in cui è stato ripristinato il servizio. L'elenco è ordinato in ordine crescente in base all'altezza del blocco e all'hash ProRegTx (come elemento decisivo nel caso in cui due masternode siano stati registrati nello stesso blocco) e la prima voce viene selezionata per il pagamento.
ru: Каждая мастернода в наборе допустимых мастернод имеет свой ID, присвоенный ей при регистрационной транзакции и ассоциируется с блоком, в котором мастернодой последний раз была получена выплата. Если мастернода ни разу не получала выплату или была заблокирована за несоблюдение требований PoSe, то вместо блока последней выплаты используется блок, в котором мастернода была впервые зарегистрирована или в котором была восстановлена блокирования. Список сортируется в порядке возрастания по высоте блока и хешу ProRegTx (в качестве идентификатора для случаев, когда две мастерноды были зарегистрированы в одном блоке), и выплата отравляется первой записи в нём.

source: The Core block reward rules apply uniformly to regular masternodes and evonodes. Each are paid once per payment cycle and receive the same block subsidy amount.
ru: Правила вознаграждения за блок в основном блокчейне одинаково применяются к обычным мастернодам и эвонодам. Они выплачиваются один раз за платежный цикл и получают одинаковую награду за каждый блокблок.

source: Platform rewards
ru: Вознаграждения платформы

source: Evonode rewards are based on participation in Platform consensus. Specifically, evonodes are paid for the blocks they propose while in the active validator set. At the end of each Platform epoch (9.125 days), block rewards are paid to the masternode identities associated with the participating evonodes.
ru: Вознаграждение эвонод основано на участии в консенсусе платформы. В частности, эвоноды получают вознаграждение за блоки, которые они предлагают, находясь в числе активных валидаторов. В конце каждой эпохи платформы (~9,125 дня) вознаграждения за блоки выплачиваются личностям мастернод, связанным с участвовавшими эвонодами.

source: Proof of Service
ru: Доказательство предоставления услуги

source: Proof of Service (PoSe) is a scoring system used to determine if a masternode is providing network services in good faith. A number of metrics are involved in the calculation, so it is not possible to game the system by causing masternodes to be PoSe banned for failing to respond to ping requests by e.g. a DDoS attack just prior to payment. Each failure to provide service results in an increase in the PoSe score relative to the maximum score, which is equal to the number of registered masternodes. If the score reaches the number of registered masternodes, a PoSe ban is enacted and the masternode must be repaired to ensure it provides reliable service and registered in the list again using a :ref:`ProUpServTx <dip3-update-service>`. The current scoring rules as of Dash 0.14 are:
it: Proof of Service (PoSe) è un sistema di punteggio utilizzato per determinare se un masternode fornisce servizi di rete in buona fede. Nel calcolo sono coinvolte numerose metriche, quindi non è possibile ingannare il sistema facendo sì che i masternode vengano bannati da PoSe per non aver risposto alle richieste ping, ad es. un attacco DDoS subito prima del pagamento. Ogni mancata erogazione del servizio comporta un incremento del punteggio PoSe rispetto al punteggio massimo, pari al numero di masternode registrati. Se il punteggio raggiunge il numero di masternode registrati, viene emanato un divieto PoSe e il masternode deve essere riparato per garantire che fornisca un servizio affidabile e registrato nuovamente nell'elenco utilizzando un :ref:`ProUpServTx `. Le attuali regole di punteggio a partire da Dash 0.14 sono:
ru: Proof of Service (PoSe) - это балловая система, в рамках которой определяется, находится ли мастернода на хорошем счету в сети и предоставляет ли качественные услуги. В этом расчёте участвует множество характеристик, поэтому невозможно обмануть систему, подставив мастерноду под бан по несоответствию требований PoSe - например, из-за того, что мастернода не отвечает на запросы, потому что подверглась DDOS-атаке прямо перед осуществлением платежа. Каждое непредоставление услуги повышает количество баллов в PoSe по отношению к максимальному количеству баллов, которое равно количеству зарегистрированных мастернод. Если чьи-либо баллы достигают количества зарегистрированных мастернод, происходит бан PoSe, а мастернода должна будет перенастроиться, чтобы предоставлять сети надёжные услуги, и снова зарегистрироваться в списке через :ref:`ProUpServTx <dip3-update-service>`. На текущий момент правила начисления баллов в Dash 0.14 таковы:
