Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/understanding.po
Languages: it, ru

source: Explanation of how Dash masternodes work in theory and practice to support InstantSend, CoinJoin and governance
it: Spiegazione di come funzionano i masternode Dash in teoria e pratica per supportare InstantSend, CoinJoin e governance
ru: Объяснение теоретических и практических принципов работы мастернод Dash при обеспечении функций InstantSend, CoinJoin и управления Dash DAO.

source: dash, masternodes, hosting, linux, payment, instantsend, coinjoin, privatesend, governance, quorum, evolution, bls,
it: dash, masternodes, hosting, linux, pagamenti, instantsend, coinjoin, privatesend, governance, quorum, evolution, bls,
ru: dash, мастерноды, хостинг, linux, платежи, instantsend, coinjoin, privatesend, управление, кворум, evolution, bls

source: Understanding Masternodes
it: Comprendere i Masternode
ru: Основы мастернод

source: Overview
it: Panoramica
ru: Общий обзор

source: Masternodes, once unique to the Dash network, are now becoming popular as the technology is forked into other blockchains. This section of the documentation describes the principles and mechanisms of masternodes and the services they provide to the Dash network specifically.
it: I Masternodes, un tempo esclusivi della rete Dash, stanno ora diventando popolari man mano che la tecnologia viene forcata in altre blockchain. Questa sezione della documentazione descrive i principi e i meccanismi dei masternode e i servizi che forniscono specificamente alla rete Dash.
ru: Мастерноды когда-то были уникальной особенностью сети Dash, но сейчас приобрели они популярность и в других криптовалютах, так как технология перешла в другие блокчейны посредством форка. Данная документация объясняет принципы и механизмы работы мастернод и той работы, которую они выполняют для сети Dash.

source: Simply put, a masternode is a server with a full copy of the Dash blockchain, which guarantees a certain minimum level of performance and functionality to perform certain tasks related to block validation, as well as InstantSend and CoinJoin, as the and instant transaction and privacy features in Dash are called. The masternodes are paid for this service, using a concept known as Proof of Service. This is in addition to the Proof of Work done by miners to secure the blockchain. Masternodes are also allowed to vote on :ref:`governance and funding proposals <governance>`, with each masternode receiving one vote (yes/no/abstain) on each proposal submitted to the system.
it: In poche parole, un masternode è un server con una copia completa della blockchain di Dash, che garantisce un certo livello minimo di prestazioni e funzionalità per eseguire determinate attività relative alla convalida dei blocchi, così come InstantSend e CoinJoin, come la transazione istantanea e la privacy. vengono chiamate le funzionalità in Dash. I masternode vengono pagati per questo servizio, utilizzando un concetto noto come Proof of Service. Ciò si aggiunge alla Proof of Work svolta dai miner per proteggere la blockchain. I masternode possono anche votare su :ref:`proposal di governance e finanziamento <governance>`, e ciascun masternode riceve un voto (sì/no/astenuto) su ogni proposal presentata al sistema.
ru: Проще говоря, мастернода это сервер с полной копией блокчейна Dash, в котором обеспечена необходимая производительность и функционал для гарантированного выполнения определённых задач по подтверждению блоков и поддержке InstantSend и CoinJoin - так в Dash называются технологии, обеспечивающие мгновенные и при этом, приватные транзакции, соответственно. За эту работу мастерноды получают плату, используя концепцию Proof of Service /«доказательство службы»/. Это концепция работает в дополнение к Proof of Work /«доказательство выполненной работы»/, применимой к майнерам, обеспечивающим безопасность блокчейна. Так же мастерноды могут голосовать по вопросам :ref:`governance /управления и бюджетным предложениям <governance>`, при этом, каждая мастернода имеет право на один голос (да/нет/воздержался) по каждому предложению, поданному в систему.

source: Anyone can run a masternode. The objective is to have enough decentralization to ensure that no single person controls a significant fraction of the masternodes. However, to avoid bloating the network with unnecessary masternodes or encouraging reckless operators, there is one condition that needs to be fulfilled: proof of ownership of DASH collateral. The coins don't need to be in the masternode, but they need to be kept in a certain way that is transparent to the entire network. If the owner moves or spends those coins, the masternode stops working and payment ceases.
it: Chiunque può eseguire un masternode. L’obiettivo è avere una decentralizzazione sufficiente per garantire che nessuna singola persona controlli una frazione significativa dei masternode. Tuttavia, per evitare di gonfiare la rete con masternode non necessari o di incoraggiare operatori sconsiderati, c’è una condizione che deve essere soddisfatta: la prova della proprietà delle garanzie DASH. Non è necessario che le monete siano nel masternode, ma devono essere conservate in un certo modo che sia trasparente per l'intera rete. Se il proprietario sposta o spende quelle monete, il masternode smette di funzionare e il pagamento cessa.
ru: Запустить мастерноду может каждый. Смысл этого в обеспечении достаточного уровня децентрализации для предотвращения возможности одного человека контролировать значительную часть мастернод. тем не менее, для предотвращения появления излишнего количества мастернод и появления безответственных владельцев мастернод, существует обязательное требование: наличие Dash. Эти монеты необходимо хранить определённым образом, который прозрачен для всей сети. Если владелец переместит или потратит эти монеты, то мастернода прекратит свою работу и выплаты прекратятся.

source: Masternodes are paid by the network for the InstantSend, CoinJoin and governance services they provide. 20% of the block subsidy goes to the budget with the remaining 80% split between miners and masternodes per this :ref:`block reward reallocation table <block-reward-reallocation>`. Then, every 16,616 blocks (approximately 30.29 days), a superblock is created that contains the entire 20% payout to the budget proposal winners. Masternodes are selected for payment in each block (approximately every 2.6 minutes) from a deterministic masternode list, and moved to the back of the list after payment. As more masternodes are created, the duration between payments increases. If the collateral behind a masternode is spent, or if a masternode stops providing services to the network for more than one hour, it is removed from the list until normal service resumes. In this way, masternodes are given incentive to provide efficient and reliable services to the network.
it: I Masternode vengono pagati dalla rete per i servizi InstantSend, CoinJoin e di governance che forniscono. Il 20% del sussidio per il blocco va al budget con il restante 80% suddiviso tra miner e masternode secondo questa :ref:`tabella di riallocazione delle ricompense dei blocchi <block-reward-reallocation>`. Quindi, ogni 16.616 blocchi (circa 30,29 giorni), viene creato un superblocco che contiene l'intero pagamento del 20% ai vincitori della proposta di budget. I masternode vengono selezionati per il pagamento in ciascun blocco (circa ogni 2,6 minuti) da un elenco deterministico di masternode e spostati in fondo all'elenco dopo il pagamento. Man mano che vengono creati più masternode, la durata tra i pagamenti aumenta. Se la garanzia dietro un masternode viene esaurita, o se un masternode smette di fornire servizi alla rete per più di un'ora, viene rimosso dall'elenco fino al ripristino del normale servizio. In questo modo, i masternode vengono incentivati a fornire servizi efficienti e affidabili alla rete.
ru: Мастерноды получают от сети вознаграждение за предоставляемые ими услуги InstantSend, CoinJoin и управление. 20% вознаграждения за блок идет в бюджет, а остальные 80% распределяются между майнерами и мастернодами в соответствии с этой :ref:`таблицей перераспределения вознаграждения за блок 1`. Затем, каждые 16 616 блоков (примерно 30,29 дня), создается суперблок, содержащий все 20% выплат победителям бюджетных предложений. Мастерноды выбираются для выплаты в каждом блоке (примерно каждые 2,6 минуты) из детерминированного списка мастернод, а после выплаты перемещаются в конец списка. По мере создания большего числа мастернод длительность промежутка между выплатами увеличивается. Если залог за мастер-узел израсходован или если мастер-узел перестал обслуживать сеть более чем на один час, он удаляется из списка до возобновления нормального обслуживания. Таким образом, мастерноды получают стимул для эффективного и надежного обслуживания сети.

source: Having so many servers holding a full copy of the blockchain and working for the coin can be extremely useful. Thanks to the reward system, there is no risk of not having enough masternodes, and the developers can rely on them quickly deploying any new decentralized feature they want to implement. This is where the true strength of Dash lies - an incentivized system of thousands of distributed servers working 24x7 means that Dash can scale more efficiently and deploy services more quickly than a blockchain run entirely by unpaid volunteers. The more masternodes, the better and safer the Dash network.
it: Avere così tanti server che contengono una copia completa della blockchain e lavorano per la moneta può essere estremamente utile. Grazie al sistema di ricompensa, non c'è il rischio di non avere abbastanza masternode e gli sviluppatori possono fare affidamento su di loro per implementare rapidamente qualsiasi nuova funzionalità decentralizzata che desiderano implementare. È qui che risiede la vera forza di Dash: un sistema incentivato di migliaia di server distribuiti che funzionano 24 ore su 24, 7 giorni su 7 significa che Dash può scalare in modo più efficiente e distribuire servizi più rapidamente di una blockchain gestita interamente da volontari non retribuiti. Più masternode, migliore e più sicura sarà la rete Dash.
ru: Наличие столь большого числа серверов, хранящих полную копию блокчейна и работающих на монету может быть чрезвычайно полезным. Благодаря системе наград, отсутствует риск недостаточного числа мастернод и разработчики, при желении внедрить новые децентрализованные технологий, могут на них полагаться. Именно в этом истинная сила Dash- сеть финансово стимулируемых децентрализованных серверов, работающих 24х7, дающих возможность Dash более эффективно масштабироваться и внедрять функции, чем блокчейны, работающие исключительно на энтузиазме неоплачиваемых добровольцев. Чем больше мастернод, тем лучше и безопаснее сеть Dash.

source: As of July 2024, the Dash network has `over 3000 masternodes located <http://178.254.23.111/~pub/masternode_count.png>`_ in `over 20 countries <https://chainz.cryptoid.info/dash/#!network>`_ and hosted on `over 140 ISPs <http://178.254.23.111/~pub/Dash/masternode_ISPs.html>`_. The block reward is approximately 1.9 Dash, so the selected masternode receives 1.4 Dash per payment or approximately 6.5 Dash per month. The block reward decreases by 7.14% approximately once per year, so the annual earnings for a masternode owner is approximately 7% of the collateral, and will decrease over time `as calculated here <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. See `this tool <https://dash- news.de/dashtv/#value=1000>`_ to calculate real-time payment rates, and `this site <http://178.254.23.111/~pub/Dash/Dash_Info.html>`_ for various real-time statistics on the masternode network.
ru: По состоянию на июль 2024 года сеть Dash насчитывает более 3000 мастернод, расположенных <http://178.254.23.111/~pub/masternode_count.png>`_ в более чем 20 странах <https://chainz.cryptoid.info/dash/#!network>`_ и размещенных на более чем 140 интернет-провайдерах <http://178.254.23.111/~pub/Dash/masternode_ISPs.html>`_. Вознаграждение за блок составляет примерно 1,9 Dash, поэтому выбранная мастернода получает 1,4 Dash за платеж или примерно 6,5 Dash в месяц. Вознаграждение за блок уменьшается на 7,14 % примерно раз в год, поэтому годовой заработок владельца мастерноды составляет примерно 7 % от суммы залога и будет уменьшаться со временем `как подсчитано здесь <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. Смотрите `этот инструмент <https://dash- news.de/dashtv/#value=1000>`_ для расчета % выплат в реальном времени, а также `этот сайт <http://178.254.23.111/~pub/Dash/Dash_Info.html>`_ для получения различной статистики по сети мастернод в реальном времени.

source: Evolution Masternodes (evonodes)
it: Evolution Masternode (evonodes)
ru: Эволюционные мастерноды (Эвоноды)

source: Evolution Masternodes (evonodes) are a subset of masternodes that have been created to host Dash Platform. Evonodes are similar to regular masternodes, but have these differences:
ru: Эволюционные мастерноды (Evonodes) - это подмножество мастернод, созданных для хостинга Dash Platform. Эвоноды похожи на обычные мастерноды, но имеют следующие отличия:

source: Masternode
ru: Мастернода

source: Evolution Masternode
ru: Эвонода

source: Collateral
it: Collaterale
ru: Залог

source: Service(s)
ru: Сервис(ы)

source: Only Dash Core
it: Solo Dash Core
ru: Только Dash Core

source: Both Dash Core and Platform
it: Sia Dash Core che Platform
ru: Как Dash Core, так и Platform

source: Voting Weight
it: Peso del voto
ru: Вес голоса

source: 1 (collateral amount / 1000)
ru: 1 (размер обеспечения / 1000)

source: 4 (collateral amount / 1000)
ru: 4 (размер обеспечения / 1000)

source: Evonodes also have :hoverxref:`higher hardware requirements <mn-hardware-reqs-table>` than regular masternodes due to the additional Dash Platform services they host. See `DIP28 <https://github.com/dashpay/dips/blob/master/dip-0028.md>`_ for more information about evonodes.
ru: Эвоноды также имеют :hoverxref:`более высокие требования к аппаратному обеспечению <mn-hardware-reqs-table>`, чем обычные мастерноды, из-за дополнительных сервисов Dash Platform, которые они хостят. Дополнительную информацию об эвонодах смотрите в `DIP28 <https://github.com/dashpay/dips/blob/master/dip-0028.md>`_.

source: Masternode Concepts
it: Concetti di Masternode
ru: Концепты мастернод

source: A list of available documentation appears below:
it: Di seguito è riportato l'elenco della documentazione disponibile:
ru: Ниже приведен список доступной документации:

source: `DIP003 Deterministic Masternode Lists <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
it: `DIP003 Elenchi masternode deterministici <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
ru: `Детерминированные списки мастернод DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__

source: :ref:`Full masternode setup guide <masternode-setup>`
it: :ref:`Guida completa alla configurazione di masternode <masternode-setup>`
ru: :ref:`Полное руководство по настройке мастерноды <masternode-setup>`

source: :ref:`Information for users of hosted masternodes <hosted-setup>`
it: :ref:`Informazioni per gli utenti di masternodes ospitati <hosted-setup>`
ru: :ref:`Информация для пользователей активных мастернод <hosted-setup>`

source: :ref:`Information for operators of hosted masternodes <operator-transactions>`
it: :ref:`Informazioni per gli utenti di masternodes ospitati <operator-transactions>`
ru: :ref:`Информация для операторов активных мастернод <operator-transactions>`

source: Important concepts:
it: Concetti importanti:
ru: Важные концепции:

source: Masternodes are "registered" and begin offering services when a `ProRegTx <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_ `special transaction <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_ containing a particular key is written to the blockchain.
it: I Masternode sono "registrati" e iniziano a offrire servizi quando una `ProRegTx <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_ `transazione speciale < https://github.com/dashpay/dips/blob/master/dip-0002.md>`_ contenente una chiave particolare viene scritta sulla blockchain.
ru: Мастерноды "регистрируются" и начинают предоставлять услуги, когда в блокчейн записывается `ProRegTx <https://github.com/dashpay/dips/blob/master/dip-0003.md#registering-a-masternode-proregtx>`_ `специальная транзакция <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_, содержащая определенный ключ.

source: The ProRegTx references the transaction id (txid) and index holding the collateral. The IP address and port of the masternode are also defined in this transaction.
it: ProRegTx fa riferimento all'ID della transazione (txid) e all'indice che detiene la garanzia. In questa transazione vengono definiti anche l'indirizzo IP e la porta del masternode.
ru: ProRegTx ссылается на идентификатор транзакции (txid) и индекс, содержащий залог. IP-адрес и порт центрального узла также определяются в этой транзакции.

source: The ProRegTx contains 2 Dash addresses (also called public keys) and one BLS public key, which represent 3 different roles in the masternode and define update and voting rights. The keys are:
it: ProRegTx contiene 2 indirizzi Dash (chiamati anche chiavi pubbliche) e una chiave pubblica BLS, che rappresentano 3 diversi ruoli nel masternode e definiscono i diritti di aggiornamento e voto. Le chiavi sono:
ru: ProRegTx содержит 2 адреса Dash (которые ещё называют публичными ключами) и один публичный ключ BLS, который представляет 3 различных роли в мастерноде и определяет права на обновление и голосование. Ключами являются:

source: ``ownerKeyAddr``: This is a Dash address (public key) controlled by the masternode owner. It is different from the address used for the collateral. Because the owner uses the private key associated with this address to issue :ref:`ProUpRegTx <update-dip3-config>` transactions, it must be unique for each masternode.
it: ``ownerKeyAddr``: questo è un indirizzo Dash (chiave pubblica) controllato dal proprietario del masternode. È diverso dall'indirizzo utilizzato per la garanzia. Poiché il proprietario utilizza la chiave privata associata a questo indirizzo per emettere transazioni :ref:`ProUpRegTx <update-dip3-config>`, deve essere univoca per ciascun masternode.
ru: ``ownerKeyAddr``: Это адрес Dash (публичный ключ), который контролируется владельцем мастерноды. Он отличается от адреса, используемого для хранения залога. Так как владелец использует приватный ключ, который связан с этим адресом для проведения транзакций :ref:`ProUpRegTx <update-dip3-config>`, он должен быть уникальным для каждой мастерноды.

source: ``operatorPubKey``: This is the BLS public key of the masternode operator. Only the operator is allowed to issue :ref:`ProUpServTx <update-dip3-config>` transactions. Because the operator key is used during live masternode operation to sign masternode-related P2P messages, quorum-related messages and governance trigger votes, the BLS key must be unique for each masternode.
it: ``operatorPubKey``: Questa è la chiave pubblica BLS dell'operatore masternode. Solo l'operatore può emettere transazioni :ref:`ProUpServTx <update-dip3-config>`. Poiché la chiave dell'operatore viene utilizzata durante l'operazione live del masternode per firmare i messaggi P2P relativi al masternode, i messaggi relativi al quorum e i voti di attivazione della governance, la chiave BLS deve essere univoca per ciascun masternode.
ru: ``operatorPubKey``: Это публичный ключ BLS оператора мастерноды. Только оператору разрешено проводить транзакции :ref:`ProUpServTx <update-dip3-config>`. Поскольку ключ оператора используется во время работы мастерноды в реальном времени для подписи P2P-сообщений, связанных с мастернодой, сообщений о кворуме и триггера голосов управления, ключ BLS должен быть уникальным для каждой мастерноды.

source: ``votingKeyAddr``: This is a Dash address (public key) used for proposal voting. Votes signed with the corresponding private key are valid while the masternode is in the registered set.
it: ``votingKeyAddr``: questo è un indirizzo Dash (chiave pubblica) utilizzato per la votazione delle proposal. I voti firmati con la chiave privata corrispondente sono validi mentre il masternode è nel set registrato.
ru: ``votingKeyAddr``: Это адрес Dash (публичный ключ), который используется для голосований по предложениям. Голоса, подписанные соответствующим приватным ключом, действительны, пока мастернода находится в зарегистрированном наборе.

source: Masternode owners should specify an address different from the collateral to receive payments in the ProRegTx. The owner may optionally specify a non-zero percentage as payment to a separate masternode operator, if applicable.
it: I proprietari di Masternode dovrebbero specificare un indirizzo diverso da quello della garanzia per ricevere i pagamenti nel ProRegTx. Il proprietario può facoltativamente specificare una percentuale diversa da zero come pagamento a un operatore masternode separato, se applicabile.
ru: Владельцы мастернод должны указать в ProRegTx адрес, отличный от залогового, для получения платежей. Владелец может опционально указать ненулевой процент в качестве платежа отдельному оператору мастерноды, если это возможно.

source: The masternode configuration can later be updated using ProUpServTx, ProUpRegTx and ProUpRevTx transactions. See `Updating Masternode Information <https://github.com/dashpay/dips/blob/master/dip-0003.md#updating-masternode-information>`_ in DIP003 and :ref:`update-dip3-config` in this documentation for more details.
it: La configurazione del masternode può essere successivamente aggiornata utilizzando le transazioni ProUpServTx, ProUpRegTx e ProUpRevTx. Vedi `Aggiornamento delle informazioni su Masternode <https://github.com/dashpay/dips/blob/master/dip-0003.md#updating-masternode-information>`_ in DIP003 e :ref:`update-dip3-config` in questa documentazione per maggiori dettagli.
ru: Конфигурацию мастерноды можно обновить со временем, используя транзакции ProUpServTx, ProUpRegTx и ProUpRevTx. Для получения более подробных сведений смотрите `Обновление информации о мастернодах <https://github.com/dashpay/dips/blob/master/dip-0003.md#updating-masternode-information>`_ в DIP003 и :ref:`update-dip3-config` в этой документации.

source: The process of setting up or upgrading a masternode is as follows:
it: Il processo di configurazione o aggiornamento di un masternode è il seguente:
ru: Процесс настройки или обновления мастерноды заключается в следующем:

source: Set up your server and operating system
it: Configura il tuo server e il tuo sistema operativo
ru: Настройте свой сервер и операционную систему

source: Install the Dash software and synchronize the blockchain
it: Installa il software Dash e sincronizza la blockchain
ru: Установите программное обеспечение Dash и синхронизируйте блокчейн

source: Generate a BLS key pair and enter the private key on the masternode
it: Genera una coppia di chiavi BLS e inserisci la chiave privata sul masternode
ru: Сгенерируйте пару BLS-ключей и введите приватный ключ для мастерноды

source: Prepare a ProRegTx transaction
it: Preparare una transazione ProRegTx
ru: Подготовка транзакции ProRegTx

source: Sign the ProRegTx transaction
it: Firma la transazione ProRegTx
ru: Подпишите транзакцию ProRegTx

source: Submit the signed ProRegTx transaction
it: Invia la transazione ProRegTx firmata
ru: Подтвердите подписанную транзакцию ProRegTx
