Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/masternodes/understanding.po
Languages: it, ru

source: Failure to participate in `DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__\ = 66% punishment
it: Mancata partecipazione a `DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__\ = 66% di punizione
ru: Проблемы при участии в `DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__\ = 66% наказания

source: Each subsequent block reduces PoSe score by 1
it: Ogni blocco successivo riduce il punteggio PoSe di 1
ru: Каждый последующий блок снижает количество баллов PoSe на 1

source: Quorum selection
it: La cui selezione
ru: Выбор кворума

source: In past versions of Dash, quorums of 10 masternodes were formed spontaneously to lock InstantSend transactions. As of Dash 0.14, quorums are deterministically formed, contain more masternodes and remain alive for a longer period of time. While they remain responsible for InstantSend transactions, the locking mechanism has changed to automatically attempt locks on most network transactions according to the requirements described :ref:`here <is-broadcast>`. Masternodes are now also responsible for more network consensus functions, such as :ref:`ChainLocks <chainlocks>`. Masternode quorums are formed through a process of `distributed key generation <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__. Failure to participate in DKG will eventually result in a PoSe ban as described above.
it: Nelle versioni precedenti di Dash, si formavano spontaneamente quorum di 10 masternode per bloccare le transazioni InstantSend. A partire dalla versione 0.14, i quorum sono formati in modo deterministico, contengono più masternode e rimangono attivi per un periodo di tempo più lungo. Pur rimanendo responsabili delle transazioni InstantSend, il meccanismo di blocco è stato modificato per tentare automaticamente di bloccare la maggior parte delle transazioni di rete in base ai requisiti descritti :ref:`qui <is-broadcast>`. I Masternode ora sono anche responsabili di più funzioni di consenso della rete, come :ref:`ChainLocks <chainlocks>`. I quorum Masternode vengono formati attraverso un processo di `generazione di chiavi distribuite <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__. La mancata partecipazione al DKG comporterà eventualmente il divieto di PoSe come descritto sopra.
ru: В прошлых версиях Dash кворумы из 10 мастернод формировались спонтанно для блокировки транзакций InstantSend. Начиная с версии Dash 0.14, кворумы формируются детерминированно, содержат большее количество мастернод и сохраняют свою активность в течение более длительного времени. Хотя они по-прежнему отвечают за транзакции InstantSend, механизм блокировки изменился и теперь автоматически пытается заблокировать большинство сетевых транзакций в соответствии с требованиями, описанными :ссылка:`здесь <is-broadcast>`. Теперь мастерноды отвечают и за другие функции сетевого консенсуса, такие как :ref:`ChainLocks <chainlocks>`. Кворумы мастернод формируются в процессе `распределенной генерации ключей` <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__. Неучастие в DKG в конечном итоге приведет к PoSe бану, как описано выше.

source: Masternode requirements
it: Requisiti del masternode
ru: Требования к мастернодам

source: DASH collateral: Hosting a masternode requires a large amount of DASH collateral. Arguably the hardest part. Dash can be obtained from exchanges such as Poloniex, Bittrex, Kraken and LiveCoin. Shapeshift's service is also an excellent way.
ru: Обеспечение DASH: Размещение мастерноды требует большого количества DASH-залога. Пожалуй, это самое сложное. Dash можно получить на таких биржах, как Poloniex, Bittrex, Kraken и LiveCoin. Отличным способом является также сервис Shapeshift.

source: A server or VPS running Linux: Most recent guides use Ubuntu 22.04 LTS. We recommend VPS services such as Vultr and DigitalOcean, although any decent provider will do.
ru: Сервер или VPS под управлением Linux: В большинстве последних руководств используется Ubuntu 22.04 LTS. Мы рекомендуем такие VPS-сервисы, как Vultr и DigitalOcean, хотя подойдет любой достойный провайдер.

source: A dedicated IP address: These usually come with the VPS/server.
it: Un indirizzo IP dedicato: solitamente viene fornito con il VPS/server.
ru: Выделенный IP адрес: обычно они прилагаются к VPS/серверу.

source: In addition to the DASH held in collateral, masternodes also have minimum hardware requirements. For Dash versions 20.0 and higher, these requirements are as follows:
it: Oltre ai DASH conservati in garanzia, i masternode hanno anche requisiti hardware minimi. Per le versioni Dash 20.0 e successive, questi requisiti sono i seguenti:
ru: Помимо DASH, находящегося в обеспечении, к мастернодам предъявляются также минимальные требования к аппаратному обеспечению. Для версий Dash 20.0 и выше эти требования следующие:

source: Regular masternodes
ru: Обычные мастерноды

source: Minimum
it: Minimo
ru: Минимальные

source: Recommended
it: Raccomandato
ru: Рекомендованные

source: CPU
ru: ЦПУ

source: 2x 2 GHz
ru: 2x 2 ГГц

source: 3x 2 GHz
ru: 3x 2 ГГц

source: RAM
ru: Оперативная память

source: 4 GB + 2 GB swap
ru: 4 Гб + 2 Гб swap

source: 8 GB + 4 GB swap
ru: 8 Гб + 4 Гб swap

source: Disk
it: Disco
ru: Место на жёстком диске

source: 60 GB
ru: 60 Гб

source: 80 GB
ru: 80 Гб

source: Network
it: Rete
ru: Сеть

source: 750 GB/mth
ru: 750 Гб/мес

source: 1 TB/mth
ru: 1 Тб/мес

source: Evonodes
ru: Эвоноды

source: Evonodes have higher hardware requirements since they host Dash Platform services along with Dash Core. To support the network effectively, the following requirements are recommended:
ru: К Evonodes предъявляются более высокие требования к железу, поскольку на них размещаются сервисы Dash Platform и Dash Core. Для эффективной поддержки сети рекомендуются следующие требования:

source: 4x 2.4 GHz
ru: 4x 2.4 ГГц

source: 8 GB + 2 GB swap
ru: 8 Гб + 2 Гб swap

source: 200 GB
ru: 200 Гб

source: Masternode bandwidth use varies and will grow as the network does.
ru: Использование пропускной способности мастернод варьируется и будет расти по мере развития сети.

source: As of September 2023, the Dash network has `almost 3500 masternodes located <http://178.254.23.111/~pub/masternode_count.png>`_ in `19 countries <https://chainz.cryptoid.info/dash/#!network>`_ and hosted on `over 140 ISPs <http://178.254.23.111/~pub/Dash/masternode_ISPs.html>`_. The block reward is approximately 2.310 Dash, so the selected masternode receives 1.344 Dash per payment or approximately 6 Dash per month. The block reward decreases by 7.14% approximately once per year, so the annual earnings for a masternode owner is approximately 7% of the collateral, and will decrease over time `as calculated here <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. See `this tool <https://dash- news.de/dashtv/#value=1000>`_ to calculate real-time payment rates, and `this site <http://178.254.23.111/~pub/Dash/Dash_Info.html>`_ for various real-time statistics on the masternode network.
it: A settembre 2023, la rete Dash ha `quasi 3500 masternode situati <http://178.254.23.111/~pub/masternode_count.png>`_ in `19 paesi <https://chainz.cryptoid.info/dash/#!network>`_ e ospitato su `oltre 140 ISP <http://178.254.23.111/~pub/Dash/masternode_ISPs.html>`_. La ricompensa per blocco è di circa 2.310 Dash, quindi il masternode selezionato riceve 1.344 Dash per pagamento o circa 6 Dash al mese. La ricompensa del blocco diminuisce del 7,14% circa una volta all'anno, quindi il guadagno annuale per un proprietario di masternode è circa il 7% della garanzia, e diminuirà nel tempo `come calcolato qui <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. Vedi `questo strumento <https://dash- news.de/dashtv/#value=1000>`_ per calcolare le tariffe di pagamento in tempo reale e `questo sito <http://178.254.23.111/~pub/Dash/Dash_Info.html>`_ per varie statistiche in tempo reale sulla rete masternode.

source: Evolution Masternodes (evonodes) are a subset of masternodes that have been created to host Dash Platform. An evonode is a lot like a regular masternode with the following differences:
it: I Masternode Evolution (evonode) sono un sottoinsieme di masternode creati per ospitare la Platform Dash. Un evonode è molto simile a un normale masternode con le seguenti differenze:

source: 4000 DASH (4X the collateral for normal masternodes)
it: 4000 DASH (4 volte la garanzia per i normali masternode)

source: Specs
it: Specifiche

source: Lesser than evonode
it: Meno di un evonode

source: Higher than normal masternodes
it: Masternode superiori al normale

source: Service
it: Servizi

source: 1 node gets 1 vote
it: 1 node ottiene 1 vote

source: Has 4 times the voting power of a normal masternode
it: Ha 4 volte il potere di voto di un normale masternode

source: Evonode Payment Logic
it: Logica di pagamento di Evonode

source: Evonodes will receive 100% of the fees generated from Platform and 37.5% of the masternode portion of Core block rewards. Regular MNs will receive the remaining 62.5% of the masternode portion of Core block rewards and 0% of Platform fees.
it: Gli Evonode riceveranno il 100% delle commissioni generate dalla Platform e il 37,5% della porzione masternode dei premi del blocco Core. I MN regolari riceveranno il restante 62,5% della porzione masternode dei premi del blocco Core e lo 0% delle commissioni della Platform.

source: DASH collateral: Hosting a master node requires a large amount of DASH collateral. Arguably the hardest part. Dash can be obtained from exchanges such as Poloniex, Bittrex, Kraken and LiveCoin. Shapeshift's service is also an excellent way.
it: Garanzia DASH: ospitare un nodo master richiede una grande quantità di garanzia DASH. Probabilmente la parte più difficile. Dash può essere ottenuto da scambi come Poloniex, Bittrex, Kraken e LiveCoin. Anche il servizio di Shapeshift è un ottimo modo.

source: A server or VPS running Linux: Most recent guides use Ubuntu 20.04 LTS. We recommend VPS services such as Vultr and DigitalOcean, although any decent provider will do. Generally an instance with low to average specifications will do, although performance requirements will increase according to this roadmap.
it: Un server o VPS con Linux: le guide più recenti utilizzano Ubuntu 20.04 LTS. Consigliamo servizi VPS come Vultr e DigitalOcean, anche se qualsiasi fornitore decente andrà bene. Generalmente andrà bene un'istanza con specifiche medio-basse, anche se i requisiti prestazionali aumenteranno in base a questa tabella di marcia.

source: Masternode bandwidth use ranges between 600-900 GB per month and will grow as the network does.
it: L'utilizzo della larghezza di banda di Masternode varia tra 600-900 GB al mese e crescerà insieme alla rete.

source: The exact hardware requirements for Dash Evolution masternodes have yet to be determined, although some pointers can be taken from the `roadmap <https://www.dash.org/roadmap/>`_ and this `blog post <https://medium.com/@eduffield222/how-to-enabling-on-chain-scaling-2ffab5997f8b>`_. It should be possible to run Dash masternodes on normal VPS servers until the block size reaches approximately 20 MB, after which custom hardware such as GPUs and eventually ASICs may be required.
it: Gli esatti requisiti hardware per i masternode di Dash Evolution devono ancora essere determinati, sebbene alcuni suggerimenti possano essere presi dalla `roadmap <https://www.dash.org/roadmap/>`_ e da questo `blog post <https://medium.com/@eduffield222/how-to-enabling-on-chain-scaling-2ffab5997f8b>`_. Dovrebbe essere possibile eseguire i masternode Dash sui normali server VPS fino a quando la dimensione del blocco non raggiunge circa 20 MB, dopodiché potrebbe essere necessario hardware personalizzato come GPU ed eventualmente ASIC.
