Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/paper.po
Languages: ar, de, es, fr, it, ru, zh_cn

source: If you decide that you need the additional security of a password for this address, click **Paper Wallet**. A different address/key pair will appear. To create an encrypted wallet, select **BIP38 Encrypt?** and enter a passphrase. Tick the box **Hide Art?** and change to **1** the field **Addresses to Generate** and then click on **Generate**. A new wallet will be generated where the private key (WIF) is encrypted using the password you specified, resulting in a BIP38 key. You now need both this BIP38 key and the password to control funds on the address, so be sure to click **Print** and store both safely. If you are unsure about how to use BIP38 encryption, it is highly recommended to test the workflow with a low amount of Dash before storing significant funds on an encrypted paper wallet. If you forget the password or lose the encrypted key, you will permanently lose access to your funds.
ar: إذا قررت أنك بحاجة إلى الأمان الإضافي لكلمة المرور لهذا العنوان ، فانقر فوق **Paper Wallet**. سيظهر عنوان / زوج مختلف. لإنشاء محفظتك المشفرة ، اختر **BIP38 Encrypt؟** وأدخل عبارة المرور. ضع علامة في المربع **إخفاء الفن؟** وتغيير إلى **1** الحقل **عناوين لإنشاء** ثم انقر فوق **إنشاء**. سيتم إنشاء محفظة جديدة حيث يتم تشفير المفتاح الخاص (WIF) باستخدام كلمة المرور التي حددتها ، مما يؤدي إلى مفتاح BIP38. أنت الآن بحاجة إلى مفتاح BIP38 وكلمة المرور للتحكم في الأموال على العنوان ، لذا تأكد من النقر فوق **طباعة** وتخزينهما بأمان. إذا كنت غير متأكد من كيفية استخدام تشفير BIP38 ، فمن المستحسن بشدة اختبار سير العمل باستخدام كمية قليلة من داش قبل تخزين أموال كبيرة على محفظة ورقية مشفرة. إذا نسيت كلمة المرور أو فقدت المفتاح المشفر ، فستفقد الوصول إلى أموالك بشكل دائم.
de: Wenn Sie die zusätzliche Sicherheit eines Passworts für diese Adresse benötigen, klicken Sie auf **Paper Wallet**. Es erscheint ein anderes Adress-/Schlüsselpaar. Um eine verschlüsselte Wallet zu erstellen, wählen Sie **BIP38 Encrypt?** und geben Sie eine Passwort ein. Markieren Sie das Kästchen **Hide Art?* und ändern Sie in **1** das Feld **Addresses to Generate** und klicken Sie dann auf **Generate**. Es wird eine neue Wallet generiert, in der der private Schlüssel (WIF) mit dem von Ihnen angegebenen Passwort verschlüsselt wird, was zu einem BIP38-Schlüssel führt. Sie brauchen nun sowohl diesen BIP38-Schlüssel als auch das Passwort, um das Guthaben auf der Adresse zu kontrollieren, also klicken Sie unbedingt auf **Drucken** und speichern Sie beide sicher. Wenn Sie sich nicht sicher sind, wie Sie die BIP38-Verschlüsselung verwenden sollen, ist es sehr empfehlenswert, den Workflow mit einer geringen Menge an Dash zu testen, bevor Sie beträchtliche Summen auf einer verschlüsselten Paper-Wallet speichern. Wenn Sie das Passwort vergessen oder den verschlüsselten Schlüssel verlieren, verlieren Sie dauerhaft den Zugriff auf Ihr Guthaben.
es: Si decides que necesitas la seguridad adicional de una contraseña para esta dirección, haz click en **Billetera de papel**. Aparecerá un nuevo par diferente de dirección/clave. Para crear una billetera encriptada, selecciona **BIP38 ¿Encriptar?** e ingresa una contraseña. Marca la casilla **Ocultar arte?** y cámbiala a **1** el campo **Direcciones para generar** y luego haz click en **Generar**. Se generará una nueva billetera en la que la llave privada (WIF) se encripta con la contraseña que especificaste, lo que da como resultado una llave BIP38. Ahora necesitas tanto esta clave BIP38 como la contraseña para controlar los fondos en la dirección, así que asegúrate de hacer click en **Imprimir** y almacenar ambas de forma segura. Si no estás seguro acerca de cómo usar la encriptación BIP38, se recomienda enfáticamente probar el flujo de trabajo con una cantidad baja de Dash antes de almacenar fondos significativos en una billetera de papel emcriptada. Si olvidas la contraseña o pierde la llave encriptada, perderás permanentemente el acceso a tus fondos.
fr: Si vous estimez qu'il vous faut une sécurité supplémentaire sous forme de mot de passe pour cette adresse, cliquez sur **Portefeuille papier**. Une paire différente adresse/clé sera affichée. Pour créer un portefeuille chiffré, sélectionnez **Chiffrage BIP38 ?** puis tapez une phrase de passe. Cochez la case **Enlever l'image ?** et mettez **1** dans le champ **Adresses à générer**, puis cliquez sur **Générer**. Un nouveau portefeuille sera généré, dont la clé privée (WIF) sera chiffrée avec le mot de passe que vous avez choisi, ce qui donne une clé BIP38. Désormais vous aurez besoin à la fois de cette clé BIP38 et du mot de passe pour contrôler les fonds à l'adresse en question, donc assurez-vous de cliquer sur **Imprimer** et de stocker les deux de manière sûre. Si vous ne savez pas trop comment fonctionne le chiffrage BIP38, il est hautement recommandé d'essayer la procédure avec un faible montant de dashs, avant de stocker des montants significatifs sur un portefeuille papier chiffré. Si vous oubliez le mot de passe ou perdez la clé chiffrée, vous perdrez l'accès à vos fonds pour toujours.
it: Se decidi di aver bisogno della sicurezza aggiuntiva di una password per questo indirizzo, fai clic su **Paper Wallet**. Apparirà un indirizzo/coppia chiave diversa. Per creare un wallet crittografato, seleziona **BIP38 Encrypt?** e inserisci una passphrase. Spunta la casella **Nascondi arte?** e cambia in **1** il campo **Indirizzi da generare** e poi clicca su **Genera**. Verrà generato un nuovo portafoglio in cui la chiave privata (WIF) viene crittografata utilizzando la password specificata, ottenendo una chiave BIP38. Ora avrai bisogno sia della chiave BIP38 che della password per controllare i fondi sull'indirizzo, quindi assicurati di fare clic su **Stampa** e di conservarli entrambi in modo sicuro. Se non sei sicuro su come utilizzare la crittografia BIP38, ti consigliamo vivamente di testare il flusso di lavoro con una quantità ridotta di Dash prima di archiviare fondi significativi su un paper wallet crittografato. Se dimentichi la password o perdi la chiave crittografata, perderai definitivamente l'accesso ai tuoi fondi.
ru: Если вы решите, что необходимо дополнительно защитить пароль для этого адреса, нажмите **Paper Wallet**. Появится другая пара адреса/пароля. Для создания зашифрованного кошелька, выберите **BIP38 Encrypt?** и введите кодовую фразу. Поставьте галку в поле**Hide Art?** и измените на **1** значение поля **Addresses to Generate**, далее нажмите **Generate**.Будет создан новый кошелёк, в котором приватный ключ (WIF) будет зашифрован указанным вами паролем, в результате вы получите BIP38 ключ. Теперь для контроля за средствами на адресе вам нужен будет BIP38 ключ и пароль, поэтому убедитесь, что вы нажали **Print** и храните их в безопасном месте. Если вы не до конца разобрались в использовании BIP38 шифрования, то, прежде чем настраивать хранение крупных средств на зашифрованном кошельке, рекомендуем вам попробовать прогнать весь процесс, используя небольшое количество Dash. Если вы забудете пароль или потеряете код шифрования, то средства будут утеряны навсегда.
zh_cn: 如果您决定需要此地址的密码的附加安全性，请单击 **纸钱包** 。一个不同的地址/密钥对将会出现。若要创建加密钱包，请选择 **BIP38 Encrypt?** 并输入密码。勾选方框 **Hide Art?** ，并更改为 **1** 字段 **要生成地址** ，然后单击 **生成** 。一个新的钱包将被生成，使用您指定的密码加密该钱包中的私钥（WIF），从而生成一个BIP 38密钥。现在您需要这个BIP 38密钥和密码来控制地址上的资金，所以请确保单击 **打印** 并将BIP38密钥和密码安全地存储起来。如果您不确定如何使用BIP 38加密，强烈建议您在加密的纸钱包上存储大量资金之前，先用少量的达世币测试工作流。如果您忘记密码或丢失了加密的密钥，您将永远无法获得您的资金。

source: A Dash WIF address can be easily identified because it always begins with "7". A BIP38 format encrypted key can be identified because it always begins with "6P". See `here <https://bitcoinpaperwallet.com/bip38 -password-encrypted-wallets/>`_ to learn more about BIP38.
ar: يمكن تحديد عنوان داس بسهولة لأنه يبدأ دائمًا بـ "7". يمكن تعريف مفتاح BIP38 الذي تم تشفيره لأنه يبدأ دائمًا بـ "6P". أنظر `هنا <https://bitcoinpaperwallet.com/bip38 -password-encrypted-wallets/>`_ لتعلم المزيد عن BIP38.
de: Eine Dash WIF Adresse kann dadurch identifiziert werden, dass sie mit einer "7" beginnt. Ein mit BIP38 verschlüsselter Key kann dadurch identifiziert werden, dass er mit "6P" beginnt. `Hier <https://bitcoinpaperwallet.com/bip38 -password-encrypted-wallets/>`_ kannst du mehr über BIP38 erfahren.
es: Una dirección Dash WIF se puede identificar fácilmente porque siempre comienza con "7". Se puede identificar una llave cifrada de formato BIP38 porque siempre comienza con "6P". Consulta `aquí <https://bitcoinpaperwallet.com/bip38 -password-encrypted-wallets/>`_ para obtener más información sobre BIP38.
fr: Une adresse Dash au format WIF peut être facilement reconnue : elle commence toujours par "7". Une clé chiffrée au format BIP38 peut être reconnue car elle commence toujours par "6P". Voir `ici <https://bitcoinpaperwallet.com/bip38 -password-encrypted-wallets/>`_ pour en savoir plus sur BIP38.
it: Un indirizzo Dash WIF può essere facilmente identificato perché inizia sempre con "7". Una chiave crittografata in formato BIP38 può essere identificata perché inizia sempre con "6P". Vedi `qui <https://bitcoinpaperwallet.com/bip38 -password-encrypted-wallets/>`_ per saperne di più su BIP38.
ru: WIF адрес Dash легко опознать, так как он всегда начинается на "7". Формат BIP38 легко опознать, так как он всегда начинается на "6P". Более подробая информация о BIP38 `здесь <https://bitcoinpaperwallet.com/bip38 -password-encrypted-wallets/>`_.
zh_cn: 达世币 WIF地址很容易被识别，因为它总是以"7"开头。BIP 38格式的加密密钥可以被识别，因为它总是以"6P"开头。查看 `此处 <https://bitcoinpaperwallet.com/bip38 -password-encrypted-wallets/>`_ 来了解更多关于BIP 38的信息。

source: Encrypted paper wallet generated using Dash Paper Wallet Generator
ar: محفظة ورقية مشفرة تم إنشاؤها باستخدام محفظة داش الورقية
de: Verschlüsselte Paper-Wallet mit dem Dash Paper Wallet Generator erstellt
es: Billetera de papel encriptada generada usando el generador de billeteras de papel de Dash
fr: Portefeuille papier chiffré, généré par le générateur de portefeuille papier Dash
it: Paper wallet crittografato generato utilizzando Dash Paper Wallet Generator
ru: Шифрование бумажного кошелька, используя Dash Paper Wallet Generator
zh_cn: 使用达世币纸钱包生成器生成加密的纸钱包

source: Sending to a paper wallet and viewing the balance
ar: إرسال إلى محفظة ورقية وعرض الرصيد
de: Senden an eine Paper-Wallet und Anzeigen der Kontostände
es: Enviar a una billetera de papel y ver el saldo
fr: Envoyer des fonds à un portefeuille papier et consulter le solde
it: Invio a un paper wallet e visualizzazione del saldo
ru: Отправка средств на бумажный кошелёк и проверка баланса
zh_cn: 发送到纸钱包并查看余额

source: You can send Dash to a paper wallet address in the same way as to any other Dash address. See the documentation for your wallet if you do not know how to do this. For this example, 0.05 Dash (minus transaction fee) has been sent to the paper wallet address. Anyone with knowledge of the public address is able to see the balance of the wallet using a block explorer, but only someone with knowledge of the private key can access the funds. You can make as many deposits and send as many coins to the same address as you’d like. Just make sure you test your wallet with small amounts first to learn how it works.
ar: يمكنك إرسال داش إلى عنوان محفظة ورقي بنفس طريقة أي عنوان داش آخر. راجع وثائق محفظتك إذا كنت لا تعرف كيفية القيام بذلك. في هذا المثال ، تم إرسال 0.05 داش (رسوم المعاملة ناقص) إلى عنوان المحفظة الورقية. يمكن لأي شخص لديه معرفة بالعنوان العام رؤية رصيد المحفظة باستخدام مستكشف كتلة ، ولكن فقط شخص لديه معرفة بالمفتاح الخاص يمكنه الوصول إلى الأموال. يمكنك إجراء العديد من الإيداعات وإرسال العديد من العملات إلى نفس العنوان الذي تريده. فقط تأكد من اختبار محفظتك بكميات صغيرة أولاً لمعرفة كيفية عملها.
de: Man kann Dash an eine Paper-Wallet senden wie an jede andere Dash-Adresse. Lesen Sie die Dokumentation Ihrer Wallet, wenn Sie nicht wissen, wie das geht. Für dieses Beispiel wurden 0,05 Dash (abzüglich Transaktionsgebühr) an die Adresse der Paper-Wallet gesendet. Jeder, der die öffentliche Adresse kennt, kann mit einem Block-Explorer den Kontostand der Wallet einsehen, aber nur jemand, der den privaten Schlüssel kennt, kann auf das Guthaben zugreifen. Sie können so viele Einzahlungen tätigen und so viele Coins an dieselbe Adresse senden, wie Sie möchten.Sie sollten Ihre Wallet zunächst mit kleinen Mengen testen, um zu lernen, wie es funktioniert.
es: Puedes enviar Dash a una dirección de billetera de papel de la misma manera que a cualquier otra dirección de Dash. Consulta la documentación de tu billetera si no sabes cómo hacerlo. Para este ejemplo, se han enviado 0.05 Dash (menos la comisión de transacción) a la dirección de la billetera de papel. Cualquier persona con conocimiento de la dirección pública puede ver el saldo de la billetera usando un explorador de bloques, pero solo alguien con conocimiento de la llave privada puede acceder a los fondos. Puedes hacer tantos depósitos y enviar tantas monedas a la misma dirección como desees. Simplemente asegúrate de probar tu billetera con pequeñas cantidades primero para aprender cómo funciona.
fr: Vous pouvez envoyer des dashs à une adresse de portefeuille papier de la même manière qu'à n'importe quelle autre adresse Dash. Veuillez consulter la documentation de votre portefeuille si vous ne savez pas le faire. Dans cet exemple, 0,05 dash (moins les frais de transaction) ont été envoyés à l'adresse du portefeuille papier. Toute personne connaissant l'adresse publique peut consulter le solde du portefeuille avec un explorateur de blocs, mais seul quelqu'un connaissant la clé privée peut accéder aux fonds. Vous pouvez faire autant de dépôts et envoyer autant d'argent à la même adresse que vous le souhaitez. Assurez-vous simplement de tester votre portefeuille avec des montants faibles au début, pour apprendre comment tout cela fonctionne.
it: Puoi inviare Dash all'indirizzo di un paper wallet allo stesso modo di qualsiasi altro indirizzo Dash. Consulta la documentazione del tuo wallet se non sai come farlo. Per questo esempio, 0,05 Dash (meno la commissione di transazione) sono stati inviati all'indirizzo del paper wallet. Chiunque sia a conoscenza dell’indirizzo pubblico è in grado di vedere il saldo del wallet utilizzando un block explorer, ma solo chi conosce la chiave privata può accedere ai fondi. Puoi effettuare tutti i depositi e inviare tutte le monete che desideri allo stesso indirizzo. Assicurati solo di testare prima il tuo wallet con piccoli importi per scoprire come funziona.
ru: Вы можете отправить Dash на бумажный кошелёк точно так же как и на любой другой адрес Dash. Если вы не знаете, как это делать, то обратитесь к документации к кошельку. В этом примере 0,05 DASH (за минусом комиссии за транзакцию) были отправлены на адрес бумажного кошелька. Любой, кто знает публичный адрес сможет увидеть баланс кошелька через Block Explorer, но только тот, у кого есть приватный ключ, сможет получить к ним доступ. На один и тот же адрес можно отправлять сколько угодно монет любое количество раз. Просто, для начала, разберитесь с работой кошелька, используя небольшие суммы.
zh_cn: 您可以用与任何其他达世币地址相同的方式将达世币发送到纸钱包地址。如果您不知道如何将达世币发送到纸钱包地址，请参阅钱包的文档介绍。对于本例，0.05个达世币 (减去交易费) 已被发送到纸钱包地址。任何了解公共地址的人都可以使用区块浏览器查看钱包的余额，但是只有知道私钥的人才能获得资金。您可以如您所愿的存储更多，并将大量的币发送到相同的地址。只要确保您先用少量的币来测试您的纸钱包，以了解它是如何工作的。

source: Viewing the balance of the paper wallet using the Dash Block Explorer at explorer.dash.org
ar: رؤية رصيد المحفة الورقية من explorer.dash.org
de: Das Gesamtguthaben einer Paper Wallet kann jederzeit über den Dash Block Explorer auf explorer.dash.org eingesehen werden.
es: Ver el saldo de la billetera de papel usando el explorador de bloques de Dash en explorer.dash.org
fr: Affichage du solde du portefeuille papier au moyen de l'explorateur de blocs Dash à l'adresse explorer.dash.org
it: Visualizzazione del saldo del paper wallet utilizzando Dash Block Explorer su explorer.dash.org
ru: Просмотр баланса бумажного кошелька, используя Dash Block Explorer на explorer.dash.org
zh_cn: 在 explorer.dash.org 上使用达世币区块浏览器来查看纸钱包的余额

source: Spending from a paper wallet
ar: الإىسال من المحفظة الورقية
de: Mit einer Paper Wallet bezahlen
es: Gastar desde una billetera de papel
fr: Dépenser depuis un portefeuille papier
it: Spesa da un paper wallet
ru: Расходование средств с бумажного кошелька
zh_cn: 从纸钱包中发送

source: In order to access the funds stored on the paper wallet address, you will need the following:
ar: للوصول إلى الأموال المخزنة على عنوان المحفظة الورقية ، ستحتاج إلى ما يلي:
de: Um das Guthaben einer Paper Wallet zu verwenden, benötigst du folgendes:
es: Para acceder a los fondos almacenados en la dirección de la billetera de papel, necesitarás lo siguiente:
fr: Pour accéder aux fonds stockés à l'adresse de votre portefeuille papier, vous aurez besoin de ceci :
it: Per accedere ai fondi memorizzati sull'indirizzo del paper wallet, avrai bisogno di quanto segue:
ru: Для получения доступа к средствам адреса на бумажном кошельке, необходимо сделать следующее:
zh_cn: 为了控制存储在纸钱包地址上的资金，您需要下列内容：

source: The public address
ar: العناوين العامة
de: Den Public Key
es: La dirección pública
fr: L'adresse publique
it: L'indirizzo pubblico
ru: Публичный адрес
zh_cn: 公共地址

source: The private key in WIF
ar: المفتاح الخاص في WIF
de: Den Private Key als WIF
es: La llave privada en WIF
fr: La clé privée au format WIF
it: La chiave privata in WIF
ru: Приватный ключ в формате WIF
zh_cn: WIF中的私钥

source: If you encrypted the wallet, you will additionally need the following to convert the BIP38 key into the WIF key:
ar: إذا قمت بتشفير المحفظة ، فستحتاج إلى ما يلي أيضًا لتحويل المفتاح BIP38 إلى مفتاح WIF:
de: Folgendes ist nötig, um den BIP38 Key in einen WIF Key umzuwandeln, falls die Wallet verschlüsselt wurde:
es: Si encriptaste la billetera, también necesitarás lo siguiente para convertir la llave BIP38 en la llave WIF:
fr: Si vous aviez chiffré le portefeuille, vous aurez en plus besoin des éléments suivants pour convertir la clé BIP38 en clé WIF :
it: Se hai crittografato il wallet, avrai inoltre bisogno di quanto segue per convertire la chiave BIP38 nella chiave WIF:
ru: Если вы зашифровали кошелёк, то для преобразования BIP38 ключа в WIF ключ, дополнительно необходимо сделать следующее:
zh_cn: 如果您对钱包进行了加密，您将额外需要以下内容以将BIP38密钥转换为WIF密钥：

source: The encrypted private key in BIP38 format
ar: المفتاح الخاص المشفر بتنسيق BIP38
de: Den verschlüsselten Private Key im BIP38 Format
es: La llave privada encriptada en formato BIP38
fr: La clé privée chiffrée au format BIP38
it: La chiave privata crittografata in formato BIP38
ru: Зашифрованный приватный ключ в формате BIP38
zh_cn: BIP 38格式的加密私钥

source: The passphrase you used to encrypt the key
ar: عبارة المرور التي استخدمتها لتشفير المفتاح
de: Das Passwort, mit dem der Schlüssel verschlüsselt wurde
es: La contraseña que usaste para encriptar la llave
fr: La phrase de passe que vous aviez utilisée pour chiffrer la clé
it: La passphrase utilizzata per crittografare la chiave
ru: Кодовая фраза, которую вы использовали для шифрования кошелька
zh_cn: 您用来加密密钥的密码

source: Optional: Decrypt BIP38 key to WIF
ar: اختياري: فك تشفير مفتاح BIP38 إلى WIF
de: Optional: BIP38 Key entschlüsseln, um den WIF Key zu erhalten
es: Opcional: Desencriptar la llave BIP38 para WIF
fr: Facultatif : déchiffrer la clé WIP38 en WIF
it: Facoltativo: decrittografare la chiave BIP38 in WIF
ru: По желанию: дешифровка BIP38 ключа в WIF
zh_cn: 可选项：将BIP 38密钥解密到WIF

source: If you encrypted your paper wallet, you will first need to decrypt the BIP38 key. You can skip this step if your private key was not encrypted.
ar: إذا قمت بتشفير محفظتك الورقية ، فستحتاج أولاً إلى فك تشفير المفتاح BIP38. يمكنك تخطي هذه الخطوة إذا لم يكن مفتاحك الخاص مشفرًا.
de: Falls die Paper Wallet verschlüsselt wurde, musst du zuerst den BIP38 Key entschlüsseln. Diesen Schritt kannst du überspringen, falls der Private Key nicht verschlüsselt wurde.
es: Si encriptaste tu billetera de papel, primero deberás desencriptar la llave BIP38. Puedes omitir este paso si tu llave privada no fue encriptada.
fr: Si vous aviez chiffré votre portefeuille papier, vous devrez d'abord déchiffrer la clé BIP38. Vous pouvez sauter cette étape si votre clé privée n'avait pas été chiffrée.
it: Se hai crittografato il tuo paper wallet, dovrai prima decrittografare la chiave BIP38. Puoi saltare questo passaggio se la tua chiave privata non è stata crittografata.
ru: Если вы зашифровали свой бумажный кошелёк, то в первую очередь, вам необходимо дешифровать BIP38 ключ. Вы можете пропустить этот шаг, если ваш приватный ключ не зашифрован.
zh_cn: 如果您对您的纸钱包进行了加密，您将首先需要解密BIP 38密钥。如果您的私钥未被加密，则您可以跳过此步骤。
