Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/paper.po
Languages: ar, de, es, fr, it, ru, zh_cn

source: Using the generator at https://paper.dash.org
de: Den Generator auf https://paper.dash.org verwenden
es: Usando el generador en https://paper.dash.org
fr: Avec le générateur à l'adresse https://paper.dash.org
it: Utilizzando il generatore su https://paper.dash.org
ru: Можно использовать генератор на https://paper.dash.org
zh_cn: 在 https://paper.dash.org 上使用生成器

source: Using the generator at https://walletgenerator.net/?currency=Dash
ar: باستخدام مولد في https://walletgenerator.net/?currency=Dash
de: Den Generator auf https://walletgenerator.net/?currency=Dash verwenden
es: Usando el generador en https://walletgenerator.net/?currency=Dash
fr: Avec le générateur à l'adresse https://walletgenerator.net/?currency=Dash
it: Utilizzando il generatore su https://walletgenerator.net/?currency=Dash
ru: Можно использовать генератор на https://walletgenerator.net/?currency=Dash
zh_cn: 在 https://walletgenerator.net/?currency=Dash 上使用生成器

source: Offline using the Dash Paper Wallet source code from GitHub at https://github.com/dashpay/paper.dash.org/releases/latest
ar: وضع عدم الاتصال باستخدام شفرة مصدر محفظة داش الورقية https://github.com/dashpay/paper.dash.org/releases/latest
de: GitHub-Quellcode auf https://github.com/dashpay/paper.dash.org/releases/latest, um die Dash Paper Wallet offline zu erstellen
es: Sin conexión usando el código fuente de la billetera de papel de Dash en GitHub en https://github.com/dashpay/paper.dash.org/releases/latest
fr: Hors ligne, en utilisant le code source du portefeuille papier Dash disponible sur GitHub à l'adresse https://github.com/dashpay/paper.dash.org/releases/latest
it: Offline utilizzando il codice sorgente Dash Paper Wallet da GitHub all'indirizzo https://github.com/dashpay/paper.dash.org/releases/latest
ru: Оффлайн, используя код Dash Paper Wallet с GitHub по адресу https://github.com/dashpay/paper.dash.org/releases/latest
zh_cn: 在 https://github.com/dashpay/paper.dash.org/releases/latest 离线使用GitHub的达世币纸钱包源代码

source: Offline using the same code which powers both sites, by viewing the `GitHub project <https://github.com/MichaelMure/WalletGenerator.net>`_ or `downloading directly <https://github.com/MichaelMure/WalletGenerator.net/archive/master.zip>`_
ar: غير متصل باستخدام نفس الرمز الذي يعمل على كلا الموقعين ، من خلال عرض `مشروع جيتب <https://github.com/MichaelMure/WalletGenerator.net>`_ أو `التحميل مباشرة <https://github.com/MichaelMure/WalletGenerator.net/archive/master.zip>`_
de: Der Code, der auf beiden Seiten verwendet wird, kann auf `GitHub <https://github.com/MichaelMure/WalletGenerator.net>`_ eingesehen oder `direkt heruntergeladen <https://github.com/MichaelMure/WalletGenerator.net/archive/master.zip>`_ werden
es: Sin conexión usando el mismo código que alimenta ambos sitios, viendo el `Proyecto de GitHub <https://github.com/MichaelMure/WalletGenerator.net>`_ o `descargando directamente <https://github.com/MichaelMure/WalletGenerator.net/archive/master.zip>`_
fr: Hors ligne, en utilisant le même code source à la base des deux sites, en consultant le `projet GitHub <https://github.com/MichaelMure/WalletGenerator.net>`_ ou en `le téléchargeant directement <https://github.com/MichaelMure/WalletGenerator.net/archive/master.zip>`_
it: Offline utilizzando lo stesso codice che alimenta entrambi i siti, visualizzando il `progetto GitHub <https://github.com/MichaelMure/WalletGenerator.net>`_ o `scaricando direttamente <https://github.com/MichaelMure/WalletGenerator.net/archive/master.zip>`_
ru: Оффлайн, используя код, на котором работают оба сайта `GitHub project <https://github.com/MichaelMure/WalletGenerator.net>`_ или `скачав напрямую <https://github.com/MichaelMure/WalletGenerator.net/archive/master.zip>`_
zh_cn: 通过查看 `GitHub 项目 <https://github.com/MichaelMure/WalletGenerator.net>`_ 或者 `直接下载 <https://github.com/MichaelMure/WalletGenerator.net/archive/master.zip>`_，离线使用支持两个网站的相同代码

source: Since the source code for all three options is largely similar, this guide will use https://paper.dash.org as an example. The websites listed here run entirely in your web browser without sending any of the data generated to an external server, but the most secure option is to download the wallet generator and run it on a computer with a freshly installed operating system that is not connected to the internet.
de: Da der Quellcode aller drei Optionen ähnlich ist, verwendet diese Anleitung https://paper.dash.org als Beispiel. Die Seiten generieren die Keys direkt im Internetbrowser und senden keine Daten an einen externen Server. Am sichersten ist es allerdings, die Software herunterzuladen und über einen unberührten PC zu starten, der nicht mit dem Internet verbunden ist.
es: Como el código fuente de las tres opciones es similar, esta guía usará como ejemplo https://paper.dash.org. Los sitios web enumerados aquí se ejecutan completamente en tu navegador web sin enviar ninguno de los datos generados a un servidor externo, pero la opción más segura es descargar el generador de billetera y ejecutarlo en una computadora con un sistema operativo recién instalado que no está conectada a La Internet.
fr: Comme le code source pour ces trois options est largement identique, ce guide utilisera https://paper.dash.org comme exemple. Les sites web répertoriés ici tournent entièrement dans votre navigateur Internet, sans envoyer les données générées à un serveur externe ; cependant l'option la plus sûre est de télécharger le générateur de portefeuille et de le lancer sur un ordinateur tournant sous un système d'exploitation récemment installé, non connecté à Internet.
it: Poiché il codice sorgente per tutte e tre le opzioni è in gran parte simile, questa guida utilizzerà https://paper.dash.org come esempio. I siti web elencati qui funzionano interamente nel tuo browser web senza inviare nessuno dei dati generati a un server esterno, ma l'opzione più sicura è scaricare il generatore di wallet ed eseguirlo su un computer con un sistema operativo appena installato che non è connesso a Internet.
ru: Поскольку исходные коды для всех трёх вариантов, по большей части, одинаковы, используйте руководство на https://paper.dash.org как пример. Сайты, находящиеся здесь в списке полностью работают в браузере без отправки каких-либо данных на внешний сервер, но самым безопасным будет скачать генератор кошелька и запустить его на компьютере с новоустановленной операционной системой и не соединённом с интернетом.
zh_cn: 由于这三个选项的源代码在很大程度上是相似的，因此本指南将使用 https://paper.dash.org 作为示例。此处列出的网站完全在您的web浏览器中运行，而不向外部服务器发送任何生成的数据，但最安全的选项是下载钱包生成器，并在没有连接到互联网的新安装操作系统的计算机上运行。

source: This guide is based on the guide available from https://walletgenerator.net. Please donate if you find this project useful!
de: Diese Anleitung basiert auf der Anleitung von https://walletgenerator.net. Falls du das Projekt für unterstützenswert hältst, kannst du den Betreibern dort eine kleine Spende zukommen lassen!
es: Esta guía se basa en la guía disponible de https://walletgenerator.net. Por favor, realiza una donación si encuentras útil este proyecto
fr: Ce guide est basé sur le guide disponible à l'adresse https://walletgenerator.net. Veuillez y faire un don si vous le trouvez utile !
it: Questa guida si basa sulla guida disponibile su https://walletgenerator.net. Per favore fai una donazione se trovi utile questo progetto!
ru: Это руководство основано на руководстве, доступном на https://walletgenerator.net. Если вы сочтёте данный проект полезным, то пожертвуйте на него средства!
zh_cn: 本指南以 https://walletgenerator.net 提供的指南为基础。如果您觉得这个项目有用，欢迎捐款！

source: Address generation
ar: مولد العناوين
de: Adressen generieren
es: Generación de direcciones
fr: Génération d'adresse
it: Generazione di indirizzi
ru: Создание адреса
zh_cn: 地址生成

source: Go to https://paper.dash.org in your web browser (or open index.html if you downloaded the wallet generator). Select your language and choose Dash as the currency if necessary. The following screen will appear:
de: Rufe https://paper.dash.org über deinen Browser auf (oder öffne index.html, wenn du den Wallet Generator heruntergeladen hast). Wähle eine Sprache aus und setze den Generator auf Dash. Das folgende Bild wird nun erscheinen:
es: Ve a https://paper.dash.org en tu navegador web (o abre index.html si ya descargaste el generador de billeteras). Selecciona tu idioma y elije Dash como moneda si es necesario. La siguiente pantalla aparecerá:
fr: Allez à l'adresse https://paper.dash.org dans votre navigateur Internet (ou bien ouvrez le fichier index.html si vous avez téléchargé le générateur de portefeuille). Choisissez votre langue puis choisissez Dash comme monnaie si nécessaire. L'écran suivant apparaît :
it: Vai su https://paper.dash.org nel tuo browser web (o apri index.html se hai scaricato il generatore di wallet). Seleziona la tua lingua e scegli Dash come valuta, se necessario. Apparirà la seguente schermata:
ru: Зайдите на https://paper.dash.org в вашем браузере (или откройте index.html, если скачали генератор кошелька). Выберите язык и выберите Dash в качестве валюты, если необходимо. Появится следующий экран:
zh_cn: 转到您Web浏览器中的 https://paper.dash.org (如果您下载了钱包生成器，则打开index.html)。选择您的语言，并在必要时选择达世币作为货币。以下屏幕将出现：

source: The Dash Paper Wallet Generator at paper.dash.org
ar: محفزة داش الورقية في paper.dash.org
de: Der Dash Paper Wallet Generator von paper.dash.org
es: El generador de billeteras de papel Dash en paper.dash.org
fr: Le générateur de portefeuille papier Dash à l'adresse paper.dash.org
it: Il generatore di paper wallet Dash su paper.dash.org
ru: Dash Paper Wallet Generator на paper.dash.org
zh_cn: 在 paper.dash.org 上的达世币纸钱包生成器

source: Some random data is required to ensure the generated address and key are unique. Move our mouse around and/or type random characters into the text box until the process reaches 100% and the following screen appears:
ar: هناك حاجة إلى بعض البيانات العشوائية لضمان أن العنوان والمفتاح اللذين يتم إنشاؤهما يكونان فريدين. حرك الماوس حول و / أو اكتب أحرفًا عشوائية في مربع النص حتى تصل العملية إلى 100٪ وتظهر الشاشة التالية:
de: Einige willkürliche Daten werden benötigt, um sicherzustellen, dass die generierte Adresse und der Schlüssel einmalig sind. Bewegen Sie die Maus und/oder geben Sie zufällige Zeichen in das Textfeld ein, bis der Prozess 100% erreicht hat und der folgende Bildschirm erscheint:
es: Se requieren algunos datos aleatorios para garantizar que la dirección y la llave generadas sean únicas. Mueve nuestro mouse alrededor y/o escribe caracteres aleatorios en el cuadro de texto hasta que el proceso llegue al 100% y aparezca la siguiente pantalla:
fr: Des données aléatoires sont exigées pour garantir que l'adresse générée et sa clé soient uniques. Bougez votre souris au hasard et/ou tapez des caractères au hasard dans le champ dédié, jusqu'à ce que la barre de progression atteigne 100% et que l'écran suivant s'affiche :
it: Sono necessari alcuni dati casuali per garantire che l'indirizzo e la chiave generati siano univoci. Muovi il mouse e/o digita caratteri casuali nella casella di testo finché il processo non raggiunge il 100% e viene visualizzata la seguente schermata:
ru: Для того, чтобы добиться уникальности созданного адреса и ключа, необходимо ввести некоторый случайный набор данных. Подвигайте мышью и/или напечатайте случайные символы в поле для текста, до тех пор пока прогресс не достигнет 100% и не появится следующий экран:
zh_cn: 需要一些随机数据以确保生成的地址和私钥是唯一的。移动鼠标，并/或在文本框中键入随机字符，直到进程达到100%，以下屏幕将显示：

source: Generating randomness for the Dash Paper Wallet Generator
ar: توليد العشوائية لمولد المحفظة داش الورق
de: Zufallsgenerierung für den Dash Paper-Wallet Generator
es: Generando aleatoriedad para el generador de billeteras de papel de Dash
fr: Génération d'aléatoire sur le générateur de portefeuille papier Dash
it: Generazione di casualità per il generatore di paper wallet Dash
ru: Создание случайного набора данных для Dash Paper Wallet Generator
zh_cn: 达世币纸钱包生成器的生成随机性

source: A Dash address and private key generated using Dash Paper Wallet Generator
ar: عنوان داش ومفتاح خاص تم إنشاؤه باستخدام توليد محفظة داش الورقية
de: Eine Dash-Adresse und ein privater Schlüssel, die mit dem Dash Paper-Wallet Generator generiert wurden.
es: Una dirección de Dash y una llave privada generadas usando el generador de billeteras de papel de Dash
fr: Une adresse Dash et sa clé privée générées avec le générateur de portefeuille papier Dash
it: Un indirizzo Dash e una chiave privata generati utilizzando Dash Paper Wallet Generator
ru: Адрес Dash и приватный ключ, созданный в Dash Paper Wallet Generator
zh_cn: 使用达世币纸钱包生成器生成的达世币地址和私钥

source: Once your public address and private key (shown in Wallet Import Format or WIF) are visible on the **Single Wallet** tab, you should immediately click **Print** to print the data and store it securely. If you leave the page without somehow recording the dash address and private key, all data will be irretrievably lost, together with any funds you have sent to the address.
ar: بمجرد ظهور عنوانك العام ومفتاحك الخاص (كما هو موضح في إستراد المحفظة الممسوحة أو WIF) في علامة **محفظة واحدة** ، يجب أن تنقر على الفور **طباعة** لطباعة البيانات وتخزينها بأمان. إذا تركت الصفحة دون تسجيل عنوان الشرطة والمفتاح الخاص بطريقة ما ، فستفقد جميع البيانات إلى غير رجعة ، بالإضافة إلى أي أموال ترسلها إلى العنوان.
de: Sobald Ihre öffentliche Adresse und Ihr privater Schlüssel (im Wallet Import Format oder WIF) auf der Registerkarte **Single Wallet** sichtbar sind, sollten Sie sofort auf **Print** klicken, um die Daten zu drucken und sicher zu speichern. Wenn Sie die Seite verlassen, ohne irgendwie die Dash-Adresse und den privaten Schlüssel festzuhalten, gehen alle Daten unwiederbringlich verloren, zusammen mit allen Guthaben, die Sie an die Adresse geschickt haben.
es: Una vez que tu dirección pública y llave privada (que se muestran en Formato de importación de billetera o WIF) estén visibles en la pestaña **Billetera individual**, debes hacer clic inmediatamente en **Imprimir** para imprimir los datos y almacenarlos de forma segura. Si abandonas la página sin registrar de alguna manera la dirección de Dash y la llave privada, se perderán irremediablemente todos los datos, junto con los fondos que hayas enviado a la dirección.
fr: Une fois votre adresse publique et sa clé privée (affichée au format Wallet Import, WIF) visibles dans l'onglet **Portefeuille unique**, vous devriez cliquer sans attendre sur **Imprimer** pour imprimer les données et les stocker en sécurité. Si vous fermez la page sans avoir noté d'une façon ou d'une autre l'adresse Dash et sa clé privée, toutes les données seront perdues de manière irréversible, tout comme tous les fonds que vous aurez pu envoyer à cette adresse.
it: Una volta che il tuo indirizzo pubblico e la chiave privata (mostrati nel formato di importazione del portafoglio o WIF) sono visibili nella scheda **Wallet singolo**, devi immediatamente fare clic su **Stampa** per stampare i dati e archiviarli in modo sicuro. Se lasci la pagina senza registrare in qualche modo l'indirizzo del dash e la chiave privata, tutti i dati andranno irrimediabilmente persi, insieme a tutti i fondi che hai inviato a quell'indirizzo.
ru: Как только ваш публичный адрес и приватный ключ (которые показываются в формате Wallet Import Format или WIF) станут видны в окне **Single Wallet**, необходимо немедленно нажать **Print** для распечатки данных и убрать распечатку в безопасное место. Если вы покинете страницу, по какой-либо причине не записав адрес или приватный ключ, то все данные, ровно как и любые средства, которые будут отправлены на этот адрес, станут безвозвратно утеряны.
zh_cn: 一旦您的公共地址和私钥 (以钱包导入格式或WIF显示) 在 **单个钱包** 选项卡上可见，您应该立即单击 **打印** 来打印数据并将其安全地存储起来。如果您离开页面时没有以某种方式记录达世币地址和私钥，所有数据和您已发送到该地址的任何资金将会丢失且无法挽回。

source: Encryption
ar: تشفير
de: Verschlüsselung
es: Encriptación
fr: Chiffrage
it: Crittografia
ru: Шифрование
zh_cn: 加密

source: The information shown on the **Single Wallet** tab does not have a passphrase and is not encrypted. You can print this paper wallet as it is and use it, but it is not protected from being stolen if someone finds it. You should keep it safe the same way you would jewels or cash.
ar: لا تحتوي المعلومات المعروضة في علامة **محفظة واحدة** على عبارة مرور وهي غير مشفرة. يمكنك طباعة هذه المحفظة الورقية كما هي واستخدامها ، ولكنها ليست محمية من السرقة إذا وجدها شخص ما. يجب عليك أن تحافظ على سلامته بنفس الطريقة التي ترغبين فيها في المجوهرات أو المال.
de: Die auf der Registerkarte **Single Wallet** angezeigten Informationen haben keine Passwörter und sind nicht verschlüsselt. Sie können diese Paper-Wallet ausdrucken und verwenden, aber sie ist nicht vor Diebstahl geschützt, wenn jemand sie findet. Sie sollten es sicher aufbewahren, genauso wie Juwelen oder Bargeld.
es: La información que se muestra en la pestaña **Billetera individual** no tiene una contraseña y no está encriptada. Puedes imprimir esta billetera de papel tal como está y usarla, pero no está protegida de ser robada si alguien la encuentra. Debes mantenerla segura de la misma manera que lo harías con las joyas o el efectivo.
fr: L'information affichée dans l'onglet **Portefeuille unique** n'a pas de phrase de passe et elle n'est pas chiffrée. Vous pouvez imprimer ce portefeuille papier tel quel et l'utiliser, mais il n'est pas protégé contre le vol si quelqu'un tombe dessus. Il vous faut le garder en sécurité de la même manière que vous le feriez pour des bijoux ou de l'argent liquide.
it: Le informazioni mostrate nella scheda **Wallet singolo** non hanno una passphrase e non sono crittografate. Puoi stampare questo paper wallet così com'è e usarlo, ma non è protetto dal furto se qualcuno lo trova. Dovresti tenerlo al sicuro nello stesso modo in cui faresti con i gioielli o i contanti.
ru: Инофрмация, показываемая в окне **Single Wallet** не имеет кодовой фразы и не зашифрована. Вы можете распечатать этот кошелёк как есть и использовать его, но он не будет защищён в случае кражи или, если его кто-нибудь найдёт. Его следует хранить в безопасном месте, как драгоценности или наличность.
zh_cn: 显示在 **单个钱包** 选项卡上的信息没有密码，也没有被加密。您可以打印这个纸钱包的原样并使用它，但是如果有人发现了纸钱包，它将不会被保护以防止被偷。您应该像保护珠宝和现金一样保护纸钱包的安全。
