Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/paper.po
Languages: ar, de, es, fr, it, ru, zh_cn

source: Guides to secure paper wallets for Dash cryptocurrency
ar: أدلة لتأمين محافظ عملة داش
de: Anleitung zum Erstellen einer Dash Paper Wallet
es: Guías para asegurar billeteras de papel para la criptomoneda Dash
fr: Guides pour des portefeuilles papier sûrs pour la cryptomonnaie Dash
it: Guide per proteggere i paper wallet per la criptovaluta Dash
ru: Руководства по безопасному использованию бумажных кошельков криптовалюты Dash
zh_cn: 用于达世币纸钱包的安全指南

source: dash, paper, wallet, encryption
ar: داش ، ورقة ، محفظة ، تشفير
de: dash, paper, wallet, verschlüsselung
es: dash, papel, billetera, encriptación
fr: dash, papier, portefeuille, chiffrage
it: dash, paper, wallet, crittografia
ru: dash, бумажный, кошелёк, шифрование
zh_cn: 达世币，纸，钱包，加密

source: Introduction
ar: المقدمة
de: Einleitung
es: Introducción
it: Introduzione
ru: Введение
zh_cn: 介绍

source: A paper wallet is a method of storing a private key to access funds stored on a single address. It can be generated on a computer that has never been connected to the internet, and printed out for air-gapped offline storage. As such, they are suitable for storing large amounts of Dash, but care must be taken not to lose the private key, since there is no way of recovering funds if it is ever lost. To use the key, it must be imported or "swept" into an online wallet and should not be used again. Paper wallets are extremely secure but somewhat inconvenient for everyday use compared to hardware wallets, which also offer a high degree of security.
ar: المحفظة الورقية هي طريقة لتخزين مفتاح خاص للوصول إلى الأموال المخزنة على عنوان واحد. يمكن إنشاؤه على جهاز كمبيوتر لم يتم توصيله بالإنترنت على الإطلاق ، وطباعته للتخزين دون اتصال بالإنترنت. على هذا النحو ، فهي مناسبة لتخزين كميات كبيرة من داش ، ولكن يجب الحرص على عدم فقدان المفتاح الخاص ، حيث لا توجد وسيلة لاستعادة الأموال إذا فقدت من أي وقت مضى. لاستخدام المفتاح ، يجب استيراده أو "اجتاحته" في محفظة عبر الإنترنت ويجب عدم استخدامه مرة أخرى. تعتبر حافظات الورق آمنة للغاية ، ولكنها غير مناسبة إلى حد ما للاستخدام اليومي مقارنةً بمحفظة الأجهزة ، والتي توفر درجة عالية من الأمان أيضًا.
de: Ein Paper-Wallet ist eine Methode zum Speichern des privaten Schlüssels, um Zugriff auf sein Guthaben zu erhalten, das auf einer einzigen Adresse gespeichert ist. Sie kann auf einem Computer erzeugt werden, der noch nie mit dem Internet verbunden war, und für die Offline-Speicherung ausgedruckt werden. Als solche sind sie für die Speicherung großer Mengen von Dash geeignet, aber es muss darauf geachtet werden, dass der private Schlüssel nicht verloren geht, da es keine Möglichkeit gibt, Guthaben zurückzuerhalten, wenn es jemals verloren geht. Um den Schlüssel zu verwenden, muss er in eine Online-Wallet importiert oder "gekehrt" ("swept") werden und sollte nicht mehr verwendet werden. Paper-Wallets sind extrem sicher, aber im Vergleich zu Hardware-Wallets, die auch ein hohes Maß an Sicherheit bieten, etwas unpraktisch für den täglichen Gebrauch.
es: Una billetera de papel es un método de almacenamiento de una llave privada para acceder a los fondos almacenados en una sola dirección. Se puede generar en una computadora que nunca se ha conectado a Internet, y se puede imprimir para el almacenamiento fuera de línea. Como tales, son adecuadas para almacenar grandes cantidades de Dash, pero se debe tener cuidado de no perder la llave privada, ya que no hay forma de recuperar los fondos si se pierde esta llave privada. Para usar la llave, se debe importar en una billetera en línea y no se debe volver a usar. Las billeteras de papel son extremadamente seguras pero un tanto inconvenientes para el uso diario en comparación con las billeteras de hardware, que también ofrecen un alto grado de seguridad.
fr: Un portefeuille papier est un moyen de stocker une clé privée et d'accéder à des fonds placés à une adresse unique. Il peut être généré sur un ordinateur n'ayant jamais été connecté à Internet, puis être imprimé en vue d'un stockage hors ligne sûr. En tant que tel, un portefeuille papier est adapté au stockage d'un montant important de dashs, mais tous les soins doivent être pris pour ne pas perdre la clé privée, car il n'y aura aucun moyen de récupérer les fonds si elle est perdue. La clé, pour être utilisée, doit être importée ou “balayée" dans un portefeuille en ligne, puis ne jamais être réutilisée. Les portefeuilles papier sont extrêmement sûrs mais assez peu pratiques pour une utilisation de tous les jours, comparés aux portefeuilles matériels qui offrent aussi un haut niveau de sécurité.
it: Un paper wallet è un metodo per archiviare una chiave privata per accedere ai fondi archiviati su un singolo indirizzo. Può essere generato su un computer che non è mai stato connesso a Internet e stampato per l'archiviazione offline con air gap. In quanto tali, sono adatti per archiviare grandi quantità di Dash, ma bisogna fare attenzione a non perdere la chiave privata, poiché non c'è modo di recuperare i fondi in caso di smarrimento. Per utilizzare la chiave, è necessario importarla o "trascinarla" in un wallet online e non deve essere utilizzata nuovamente. I paper wallet sono estremamente sicuri ma un po’ scomodi per l’uso quotidiano rispetto ai wallet hardware, che offrono anch’essi un elevato grado di sicurezza.
ru: Бумажный кошелёк это метод хранения приватного ключа, дающего доступ к средствам, хранящимся на определённом адресе. Он может быть создан на компьютере, который никогда не был присоединён к интернету и потом распечатан для хранения в изолированном месте. Благодаря этой возможности, его можно использовать для хранения большого количества DASH, но необходимо принять соответствующие меры предосторожности, чтобы не потерять такой ключ, поскольку при его утере, восстановление невозможно. Для использования ключа, его необходимо импортировать или ввести в кошелёк, присоединённый к интернету и никогда более не использовать. Бумажные кошельки очень безопасны, но неудобны для повседневного использования, по сравнению с физическими кошельками, тоже предлагающими высокую степень защиты.
zh_cn: 纸钱包是一种存储私钥以访问存储在单个地址上资金的方法。它可以在一台从未连接到互联网的计算机上生成，并打印出来用于气隙离线存储。因此，它们适合储存大量的达世币，但必须注意不要丢失私钥，因为一旦私钥丢失，就无法收回资金。要使用该私钥，必须将其导入或 "扫描" 到在线钱包中，并且不该重复使用。与同样提供了高度安全性的硬件钱包相比，纸钱包极其安全，但日常使用却有些不方便。

source: Paper wallets use random user and machine input to create a set of keys/addresses which you then print. You can never regenerate a paper wallet once you turn off the machine. What you print is all you get. For this reason, paper wallets are somewhat vulnerable and require special care because they can get damaged, lost, destroyed or stolen. Even if you encrypt them with BIP38 (which you should), a sufficiently motivated adversary (e.g. robbery/home invasion) could bypass this encryption using the proverbial "$5 wrench attack".
ar: تستخدم محافظ الأوراق مستخدمًا عشوائيًا وإدخالًا آليًا لإنشاء مجموعة من المفاتيح / العناوين التي تطبعها بعد ذلك. لا يمكنك أبدًا إعادة إنشاء محفظة الورق بمجرد إيقاف تشغيل الجهاز. ما تطبعه هو كل ما تحصل عليه. ولهذا السبب ، فإن المحافظ الورقية معرضة إلى حد ما وتتطلب رعاية خاصة لأنها قد تتعرض للتلف أو الضياع أو التدمير أو السرقة. حتى إذا قمت بتشفيرها مع BIP38 (وهو ما يجب عليك) ، يمكن أن يتخطى الخصم ذو الدوافع الكافية (على سبيل المثال ، عمليات السطو / الغزو المنزلي) هذا التشفير مستخدمًا "هجوم 5 دولارات".
de: Paper Wallets verwenden zufällige Eingaben von Nutzern und Maschinen, um eine Reihe von Schlüsseln/Adressen zu generieren, die dann ausgedruckt werden können. Der Generator kann niemals zweimal die gleiche Paper Wallet erstellen. Wenn eine Paper Wallet nicht ausgedruckt wird, kann sie nicht wiederhergestellt werden. Daher sind Paper Wallets anfällig und bedürfen einer besonderen Sorgfalt, damit sie nicht beschädigt, verloren, zerstört oder gestohlen werden. Auch wenn du sie mit BIP38 verschlüsselst (was du machen solltest), könnte ein Angreifer (z.B. ein Einbrecher) diese Verschlüsselung durch die "$5 Wrench-Attack" umgehen.
es: Las billeteras de papel usan la entrada aleatoria del usuario y la máquina para crear un conjunto de llaves/direcciones que luego puedes imprimir. Nunca podrás regenerar una billetera de papel una vez que apagas la máquina. Lo que imprimes es todo lo que tendrás. Por esta razón, las billeteras de papel son algo vulnerables y requieren cuidados especiales porque pueden dañarse, perderse, destruirse o ser robadas. Incluso si las encriptas con BIP38 (lo que deberías hacer), un adversario suficientemente motivado (por ejemplo, robo/invasión de hogar) podría eludir este cifrado utilizando el proverbial "ataque de llave de 5 $".
fr: Les portefeuilles papier utilisent des entrées aléatoires venues de l'utilisateur ou de la machine, afin de créer un jeu de clés et d'adresses que vous pourrez ensuite imprimer. Vous ne pourrez jamais générer à nouveau le même portefeuille papier une fois la machine éteinte. Ce que vous imprimez sera tout ce que vous aurez. Pour cette raison, les portefeuilles papier sont assez vulnérables et demandent une attention spécifique car ils peuvent être abîmés, perdus, détruits ou volés. Même si vous les chiffrez avec BIP38 (ce que vous devriez faire), un adversaire suffisamment motivé (par exemple un cambrioleur, ou un intrus à domicile) pourrait contourner ce chiffrage au moyen de la célèbre "attaque à la clé à molette".
it: I paper wallet utilizzano l'input casuale dell'utente e della macchina per creare un set di chiavi/indirizzi che poi stampi. Non è mai possibile rigenerare un paper wallet una volta spenta la macchina. Ciò che stampi è tutto ciò che ottieni. Per questo motivo i paper wallet sono piuttosto vulnerabili e richiedono cure particolari perché possono danneggiarsi, perdersi, essere distrutti o rubati. Anche se li crittografi con BIP38 (cosa che dovresti), un avversario sufficientemente motivato (ad esempio rapina/invasione domestica) potrebbe aggirare questa crittografia usando il proverbiale "attacco con chiave inglese da $ 5".
ru: Бумажный кошелёк использует произвольный ввод данных от пользователя и компьютера для создания ключа/адреса, которые потом распечатываются. Вы не можете воссоздать такой же кошелёк, когда выключите компьютер. То, что будет распечатано на бумаге это единственные данные, которые вы получите. По этой причине, бумажные кошельки несколько уязвимы и с ними надо аккуратно обращаться, так как их можно повредить, потерять, они могут юыть уничтожены или украдены. Даже если вы зашифруете их с помощью BIP38 (что и необходимо сделать), то всё равно достаточно мотивированный злоумышленник (например, в случа кражи или проникновения в дом) может обойти шифрование используя так называемую "атаку 5-ти долларовым гаечным ключом".
zh_cn: 纸钱包使用随机的用户和计算机输入来创建一组密钥/地址，然后您将它打印出来。一旦您关闭计算机，您就永远不可能再生成一个纸钱包。您所打印出来的东西就是您的全部。因此，纸钱包有些脆弱，需要特别照顾，因为它们可能被损坏、丢失、毁坏或被盗。即使您用BIP 38（您应该使用的）对纸钱包进行加密，一个动机充足的对手 (例如抢劫/入室侵害) 可以利用俗话说的“5美元扳手攻击”绕过这种加密。

source: The $5 wrench attack. Credit: xkcd.com
ar: هجوم $ 5. الائتمان: xkcd.com
de: Die $5 Wrench-Attacke. Credit: xkcd.com
es: El ataque con llave de 5 $. Crédito: xkcd.com
fr: L'attaque à la clé à molette. Source : xkcd.com
it: L'attacco con la chiave inglese da 5 dollari. Credito: xkcd.com
ru: Атака гаечным ключом за 5$. Выражаем признательность xkcd.com
zh_cn: 5美元扳手攻击。认证：xkcd.com

source: Nevertheless, together with appropriate planning, paper wallets are a highly convenient and user-friendly way to store Dash long term.
ar: ومع ذلك ، فبالإضافة إلى التخطيط الملائم ، تعد المحفظة الورقية طريقة سهلة الاستخدام وسهلة الاستخدام لتخزين داش على المدى الطويل
de: Dennoch sind Paper-Wallets zusammen mit einer entsprechenden Planung eine sehr bequeme und benutzerfreundliche Möglichkeit, Dash langfristig zu lagern.
es: Sin embargo, junto con la planificación adecuada, las billeteras de papel son una forma muy conveniente y fácil de usar para almacenar Dash a largo plazo.
fr: Quoi qu'il en soit, avec un plan approprié, les portefeuilles papier sont un moyen hautement pratique et simple d'utilisation de stocker des dashs sur le long terme.
it: Tuttavia, insieme ad un'adeguata pianificazione, i paper wallet sono un modo estremamente conveniente e facile da usare per conservare Dash a lungo termine.
ru: Тем не менее, при должном планировании, бумажные кошельки это очень удобный и лёгкий в использовании способ долгосрочного хранения Dash.
zh_cn: 尽管如此，纸钱包与适当的计划相结合，就是一种非常方便的、用户极易掌握的长期存储达世币的方式。

source: Security
ar: الحماية
de: Sicherheit
es: Seguridad
fr: Sécurité
it: Sicurezza
ru: Безопасность
zh_cn: 安全性

source: While you can create a paper wallet using a machine that is connected to the internet, wallets that will be used to store significant funds should be generated using an offline computer running a single-use operating system to ensure that all generated data will be permanently wiped from memory once the process is complete.
ar: على الرغم من أنه يمكنك إنشاء محفظة ورقية باستخدام جهاز متصل بالإنترنت ، إلا أنه يجب إنشاء المحافظ التي سيتم استخدامها لتخزين أموال كبيرة باستخدام جهاز كمبيوتر غير متصل يعمل بنظام تشغيل يستخدم مرة واحدة للتأكد من أنه سيتم مسح جميع البيانات التي تم إنشاؤها بشكل دائم من الذاكرة بمجرد اكتمال العملية.
de: Sie können zwar ein Paper-Wallet mit einem mit dem Internet verbundenen Gerät erstellen, aber die Wallets, die für die Speicherung größerer Guthaben verwendet werden, sollten mit einem Offline-Computer mit einem Single-Use-Betriebssystem erstellt werden, um sicherzustellen, dass alle erzeugten Daten nach Abschluss des Prozesses dauerhaft aus dem Speicher gelöscht werden.
es: Si bien puedes crear una billetera de papel con una máquina que esté conectada a Internet, las billeteras que se usarán para almacenar fondos significativos se deben generar usando una computadora fuera de línea que ejecute un sistema operativo de uso único para garantizar que todos los datos generados se borren permanentemente de la memoria una vez que el proceso se haya completado.
fr: Même si vous pouvez créer un portefeuille papier avec un ordinateur qui a déjà été connecté à Internet, les portefeuilles qui serviront à stocker des fonds d'un montant important devraient être générés par un ordinateur hors ligne, tournant sous un système d'exploitation à usage unique, pour garantir que toutes les données générées soient effacées de la mémoire de manière permanente, une fois la procédure terminée.
it: Sebbene sia possibile creare un paper wallet utilizzando una macchina connessa a Internet, i wallet che verranno utilizzati per archiviare fondi significativi dovrebbero essere generati utilizzando un computer offline che esegue un sistema operativo monouso per garantire che tutti i dati generati vengano cancellati in modo permanente dalla memoria una volta completato il processo.
ru: Вы можете создать бумажный кошелёк используя компьютер, подключённый к интернету, но кошельки, которые предусмотрены для хранения крупных сумм следует создавать используя компьютер, который не подключен к интернету, с операционной системой, установленной для однократного использования. Это необходимо, чтобы удостовериться в том, что все данные будут навсегда удалены из памяти по завершению процесса.
zh_cn: 当您可以使用连接到互联网的计算机创建纸钱包时，将用于存储大量资金的钱包应该使用运行单用操作系统的离线计算机生成，以确保一旦创建过程完成，所有生成的数据都将被从内存中永久删除。

source: A simple method of doing this is to burn a live Linux CD. `Ubuntu Desktop <https://ubuntu.com/download/desktop>`_ is recommended because it will have the most drivers and is simple to use, while `Tails <https://tails.boum.org/>`_ and `Kali Linux <https://www.kali.org/downloads/>`_ are popular choices for extremely strong security. Booting from an actual CD is most secure since it is mounted read-only, but a USB stick is generally fine as well. Both laptops and desktops can be used if you can ensure that all networking hardware is disabled when you get to the stage of actually generating your keys.
fr: Une méthode simple pour faire cela est de graver un "live CD" Linux. `Ubuntu Desktop <https://www.ubuntu.com/download/desktop>`_ est recommandé car il dispose de tous les pilotes et est simple d'emploi, tandis que `Tails <https://tails.boum.org/>`_ et `Kali Linux <https://www.kali.org/downloads/>`_ sont des choix communs pour une sécurité extrêmement forte. Démarrer l'ordinateur depuis un véritable CD est le plus sûr, car le CD est monté en lecture seule, mais une clé USB fait en général aussi bien l'affaire. Des ordinateurs portables ou de bureau peuvent être utilisés si vous êtes sûr que tout le matériel de réseau est désactivé quand vous atteignez l'étape de génération effective des clés.
it: Un metodo semplice per farlo è masterizzare un CD Linux live. `_ Ubuntu Desktop <https://ubuntu.com/download/desktop>`_ è consigliato perché avrà il maggior numero di driver ed è semplice da usare, mentre `Tails <https://tails.boum.org/>`_ e `Kali Linux <https://www.kali.org/downloads/>`_ sono scelte popolari per una sicurezza estremamente elevata. L'avvio da un vero CD è più sicuro poiché è montato in sola lettura, ma generalmente va bene anche una chiavetta USB. È possibile utilizzare sia laptop che desktop se è possibile garantire che tutto l'hardware di rete sia disabilitato quando si arriva alla fase di generazione effettiva delle chiavi.
ru: Самым простым методом будет записать CD диск с Linux. Рекомендуется `Ubuntu Desktop <https://ubuntu.com/download/desktop>`_ , так как у этого дистрибутива есть большинство драйверов и он прост в использовании, так же есть `Tails <https://tails.boum.org/>`_ и `Kali Linux <https://www.kali.org/downloads/>`_ , они популярны из-за своей высокой защищенности. Загрузка с CD это наиболее безопасный способ, так как информация с них только считывается, но не записывается. Использование USB флешки тоже подойдёт. Можно использовать настольные компьютеры и ноутбуки, но на этапе создания ключей необходимо убедиться, что всё сетевое оборудование отключено.

source: Boot from the CD and download/install your tools (or download them ahead of time to a USB drive). Disconnect from the internet, generate your keys/addresses/printouts, and power off the machine. You are now the only person with access to these addresses.
ar: قم بالتمهيد من القرص المضغوط وقم بتنزيل / تثبيت الأدوات (أو تنزيلها مسبقًا إلى محرك أقراص USB). قطع الاتصال بالإنترنت ، قم بإنشاء المفاتيح / العناوين / المطبوعات ، وقم بإيقاف تشغيل الجهاز. أنت الآن الشخص الوحيد الذي يمكنه الوصول إلى هذه العناوين.
de: Booten Sie von der CD und downloaden / installieren Sie Ihre Tools (oder laden Sie sie vorzeitig auf ein USB-Laufwerk herunter). Trennen Sie die Verbindung zum Internet, erstellen Sie Ihre Schlüssel/Adressen/Ausdrucke und schalten Sie das Gerät aus. Sie sind nun die einzige Person, die Zugriff auf diese Adressen hat.
es: Arranca desde el CD y descarga/instala tus herramientas (o descárgalas con anticipación a una unidad USB). Desconéctate de Internet, genera tus llaves/direcciones/impresiones, y apaga la máquina. Ahora eres la única persona con acceso a estas direcciones.
fr: Démarrez l'ordinateur depuis le CD puis téléchargez ou installez vos outils (ou téléchargez-les à l'avance sur une clé USB). Déconnectez-vous d'Internet, générez vos clés, vos adresses et vos impressions, puis éteignez la machine. Vous êtes désormais la seule personne ayant accès à ces adresses.
it: Avvia dal CD e scarica/installa i tuoi strumenti (o scaricali prima su un'unità USB). Disconnettiti da Internet, genera chiavi/indirizzi/stampe e spegni la macchina. Ora sei l'unica persona con accesso a questi indirizzi.
ru: Произведите загрузку с CD и скачайте/установите необходимые инструменты (или скачайте их заранее на USB-флешку). Отключите соединение с интернетом, создайте свои ключи/адресы/распечатки и выключите компьютер. Теперь только вы имеете доступ к этим адресам.
zh_cn: 从CD引导并下载/安装您的工具（或提前下载到USB驱动器）。断开与互联网的连接，生成您的密钥/地址/打印，并关闭计算机。您现在是唯一可以访问这些地址的人。

source: Death plan
ar: خطة الموت
es: Plan de muerte
fr: Plan post-mortem
it: Piano di morte
ru: Смертельный план
zh_cn: 遗书计划

source: Whichever type of cold storage you choose, make a plan to pass on the necessary data to regenerate the keys to your loved ones in the event of an accident - it will happen to us all eventually. Write down your paper wallet BIP38 decryption password or brain wallet passphrase. Then write down instructions on how to use it, and keep them separate with a clear procedure on how they can be accessed when necessary.
ar: أيا كان نوع التخزين البارد الذي تختاره ، ضع خطة لتمرير البيانات الضرورية لتجديد مفاتيح أحبائك في حال وقوع حادث - سيحدث لنا جميعًا في النهاية. قم بتدوين كلمة السر الخاصة بك في المحفظة الورقية BIP38 أو كلمة مرور المحفظة في المخ. ثم قم بتدوين التعليمات حول كيفية استخدامها ، والاحتفاظ بها منفصلة مع إجراء واضح حول كيفية الوصول إليها عند الضرورة.
de: Egal für welche Art von Cold-Storage Sie sich entscheiden, planen Sie die Weitergabe der notwendigen Daten zur Wiederherstellung der Schlüssel an Ihre Lieben im Falle eines Unfalls - es wird uns allen passieren. Schreiben Sie sich Ihr Paper-Wallet BIP38 Entschlüsselungspasswort oder Brain-Wallet Passwort auf. Dann schreiben Sie Anweisungen zur Benutzung auf und halten Sie sie getrennt mit einem klaren Vorgehen, wie sie bei Bedarf aufgerufen werden können.
es: Cualquiera que sea el tipo de almacenamiento en frío que elijas, haz un plan para transmitir los datos necesarios a tus seres queridos para que puedan regenerar las llaves en caso de un accidente - nos sucederá a todos eventualmente. Escribe tu contraseña para desencriptar tu billetera de papel BIP38. A continuación, escribe las instrucciones sobre cómo usarla y mantenlas separadas con un procedimiento claro sobre cómo acceder a ellas cuando sea necesario.
fr: Quel que soit le type de "chambre froide" que vous choisissez, prévoyez un plan de transmission des données nécessaires pour regénérer les clés, à l'attention de vos proches, dans l'éventualité d'un accident — lequel finit toujours par arriver à chacun de nous. Écrivez quelque part le mot de passe de déchiffrage BIP38 de votre portefeuille papier, ou votre phrase de passe de portefeuille mémoire. Puis écrivez des instructions d'utilisation, et gardez-les séparément, avec une procédure claire sur la façon d'y accéder si nécessaire.
it: Qualunque sia il tipo di cold storage che scegli, pianifica di trasmettere i dati necessari per rigenerare le chiavi ai tuoi cari in caso di incidente: prima o poi succederà a tutti. Annota la password di decrittazione BIP38 del tuo paper wallet o la passphrase del wallet cerebrale. Quindi annota le istruzioni su come utilizzarlo e tienile separate con una procedura chiara su come accedervi quando necessario.
ru: Какой тип холодного хранилища вы бы не выбрали, необходимо продумать, как при несчастном случае с вами передать вашим близким данные, необходимые для восстановления ключей. В конце концов, все мы смертны. Запишите на бумаге пароль дешифрования BIP38 или кодовую фразу мнемонического кошелька. Затем запишите инструкции, как его использовать и храните эти инструкции раздельно с пояснениями по доступу к ним.
zh_cn: 无论您选择哪种类型的冷存储，都要制定一项计划，以在发生事故时将再生成密钥的必要数据传递给您所爱的人 - 这种事情最终会发生在我们所有人身上。写下您的纸钱包BIP 38解密密码或您大脑中的钱包密码。然后写下关于如何使用密码的说明，并将密码和说明分开，在必要的时候留下清晰的过程解释如何访问钱包。

source: Tools
ar: الأدوات
de: Werkzeuge
es: Herramietas
fr: Outils
it: Strumenti
ru: Инструменты
zh_cn: 工具

source: A Dash paper wallet can be generated in several ways.
ar: يمكن إنشاء محفظة ورق داش بعدة طرق.
de: Eine Dash Paper-Wallet kann auf verschiedene Arten erstellt werden.
es: Una billetera de papel de Dash se puede generar de varias maneras.
fr: Un portefeuille papier Dash peut être créé de différentes façons.
it: Un paper wallet Dash può essere generato in diversi modi.
ru: Бумажный кошелёк можно создать несколькими способами.
zh_cn: 达世币纸钱包可以以多种方式生成。
