Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/paper.po
Languages: ar, de, es, fr, it, ru, zh_cn

source: Go to the **Wallet Details** tab, enter the encrypted key in the **Enter Private Key** field and click **View Details**. You will be asked to **Enter BIP38 Passphrase** in the field. Enter the passphrase and click **Decrypt BIP38**. A range of information derived from the key will appear, the information required to access the funds on the public address appears under **Private Key WIF**. Copy the Private Key WIF and use it in the next step.
ar: انتقل إلى علامة التبويب **تفاصيل المحفظة** ، وأدخل المفتاح المشفر في الحقل **إدخال مفتاح خاص** وانقر فوق **عرض التفاصيل**. سيُطلب منك إدخال **عبارة BIP38** في الحقل. أدخل عبارة المرور وانقر فوق **فك تشفير BIP38**. ستظهر مجموعة من المعلومات المشتقة من المفتاح ، تظهر المعلومات المطلوبة للوصول إلى الأموال على العنوان العام تحت **المفتاح الخاص WIF**. انسخ المفتاح الخاص WIF واستخدمه في الخطوة التالية.
de: Öffne die **Wallet Details** Registerkarte, trage den verschlüsselten Key in das Feld **Enter Private Key** ein und klicke auf **View Details**. Nun musst du das Passwort in das Feld mit der Aufschrift **Enter BIP38 Passphrase** eintragen und auf **Decrypt BIP38** klicken. Hierdurch werden verschiedene Informationen angezeigt, die zu dem Key gehören. Um auf das Guthaben zuzugreifen ist die Zeichenfolge unter **Private Key WIF** von Bedeutung. Kopiere den WIF Private Key und verwende ihn im nächsten Schritt.
es: Ve a la pestaña **Detalles de la billetera**, ingresa la clave encriptada en el campo **Introducir llave privada** y haz clic en **Ver detalles**. Se te pedirá que **Ingreses contraseña BIP38** en el campo. Ingresa la contraseña y haz clic en **Desencriptar BIP38**. Aparecerá un rango de información derivada de la llave, la información requerida para acceder a los fondos en la dirección pública aparece en **Llave privada WIF**. Copia la llave privada WIF y úsala en el siguiente paso.
fr: Allez sur l'onglet **Détails du portefeuille**, saisissez la clé chiffrée dans le champ **Saisissez la clé chiffrée** puis cliquez sur **Afficher les détails**. Il vous sera demandé d'**Entrer la phrase de passe BIP38** dans le champ. Tapez la phrase de passe puis cliquez sur **Déchiffrer BIP38**. Une série d'informations dérivées de la clé s'affichera. Les informations nécessaires pour accéder aux fonds stockés à l'adresse publique apparaissent sous **Clé privée WIF**. Copiez la clé privée WIF et utilisez-la à l'étape suivante.
it: Vai alla scheda **Dettagli wallet**, inserisci la chiave crittografata nel campo **Inserisci chiave privata** e fai clic su **Visualizza dettagli**. Ti verrà chiesto di **Inserire la passphrase BIP38** nel campo. Inserisci la passphrase e fai clic su **Decrittografa BIP38**. Appariranno una serie di informazioni derivate dalla chiave, le informazioni necessarie per accedere ai fondi sull'indirizzo pubblico appaiono sotto **Chiave privata WIF**. Copia la chiave privata WIF e utilizzala nel passaggio successivo.
ru: Зайдите в окно **Wallet Details**, введите зашифрованный ключ в поле **Enter Private Key** и нажмите **View Details**. Появится запрос **Enter BIP38 Passphrase** в поле. Введите кодовую фразу и нажмите **Decrypt BIP38**. Появятся данные, извлечённые из ключа, а информация, необходимая для доступа к средствам на публичном адресе появится под **Private Key WIF**. Скопируйте приватный ключ WIF и используйте его в следющем шаге.
zh_cn: 转到 **钱包详细信息** 选项卡，在 **输入私钥** 字段中输入加密的密钥，并单击 **查看详细信息** 。您将被要求在字段中 **输入BIP38密码** 。输入密码并单击 **解密BIP38**。从密钥派生的一系列信息将出现，获得公共地址上的资金所需要的信息将出现在 **私钥WIF** 下面。复制私钥WIF，并在下一步骤中使用。

source: Dash Paper Wallet Generator displaying information derived from an encrypted private key
ar: مولد محفظة داش الورقية يعرض معلومات مستمدة من مفتاح خاص مشفر
de: Der Dash Paper Wallet Generator zeigt Informationen an, die zu dem verschlüsselten Private Key gehören
es: El generador de billeteras de papel de Dash muestra información derivada de una llave privada encriptada
fr: Le générateur de portefeuille papier Dash affichant l'information dérivée d'une clé privée chiffrée
it: Dash Paper Wallet Generator che visualizza informazioni derivate da una chiave privata crittografata
ru: Dash Paper Wallet Generator показывает информацию, извлечённую из зашифрованного приватного ключа
zh_cn: 达世币纸钱包生成器显示从加密私钥派生的信息

source: Importing the private key to your live wallet
ar: استيراد المفتاح الخاص إلى محفظتك المباشرة
de: Den Private Key in die Wallet importieren
es: Importar la llave privada a tu billetera viva
fr: Importation de la clé privée dans votre portefeuille logiciel
it: Importazione della chiave privata nel tuo wallet attivo
ru: Импортирование приватного ключа в работающий кошелёк
zh_cn: 把私钥导入您的实时钱包中

source: When you are ready to spend the balance on the paper wallet, you will need to import the private key used to control the address printed on the wallet into another Dash wallet that is connected to the internet. We will use the Dash Core Wallet in this example, although Dash Electrum and mobile wallets are also supported. Open Dash Core Wallet, click **Settings** and **Unlock Wallet**. Enter your wallet passphrase. Then click **Tools > Console**. The console appears. Enter the following command::
it: Quando sarai pronto a spendere il saldo sul wallet di carta, dovrai importare la chiave privata utilizzata per controllare l'indirizzo stampato sul wallet in un altro portafoglio Dash connesso a Internet. In questo esempio utilizzeremo il wallet Dash Core, sebbene siano supportati anche Dash Electrum e i wallet mobili. Apri Dash Core Wallet, fai clic su **Impostazioni** e **Sblocca Wallet**. Inserisci la passphrase del tuo wallet. Quindi fare clic su **Strumenti > Console**. Viene visualizzata la console. Immettere il seguente comando::
ru: Когда вы захотите начать расходовать баланс бумажного кошелька, необходимо будет импортировать приватный ключ, использующийся для контроля распечатанного адреса в другой кошелёк Dash, присоединённый к интернету. Для примера, мы используем кошелёк Dash Core, но так же есть поддержка Dash Electrum и мобильных кошельков. Откройте кошелёк Dash Core, нажмите **Settings** и **Unlock Wallet**. Введите кодовую фразу кошелька. Затем нажмите **Tools** и выберите **Debug Console**. Когда появится консоль, введите следующую команду::

source: Dash Core Wallet importing a private key
ar: محفظة داش كور تستورد مفتاحًا خاصًا
de: Einen Private Key in die Dash Core Wallet importieren
es: Importar una llave privada a tu billetera Dash Core
fr: Le portefeuille logiciel Dash Core important une clé privée
it: Dash Core Wallet importa una chiave privata
ru: Кошелёк Dash Core импортирует приватный ключ
zh_cn: Dash Core钱包导入私钥

source: This process requires rescanning the entire downloaded blockchain for transactions involving this address, and will therefore take some time. Be patient. Once the process is complete, any transactions involving the imported address will appear in your list of transactions. If you use Coin Control, you can also enable or disable the address for spending there.
ar: تتطلب هذه العملية إعادة فحص بلوكشين الذي تم تنزيله بالكامل للمعاملات التي تتضمن هذا العنوان ، وبالتالي ستستغرق بعض الوقت. كن صبورا. بمجرد اكتمال العملية ، ستظهر أي معاملات تتضمن العنوان المدرج في قائمة المعاملات الخاصة بك. إذا كنت تستخدم عملة التحكم ، يمكنك أيضًا تمكين أو تعطيل عنوان الإنفاق هناك.
de: Der Prozess setzt voraus, dass die gesamte Blockchain erneut nach der involvierten Adresse durchsucht wird. Dieser Vorgang wird daher einige Zeit in Anspruch nehmen. Sobald der Vorgang abgeschlossen wurde, werden alle Transaktionen, welche die importierte Adresse involvieren, in der Transaktionsliste angezeigt werden. Über Coin Control kannst du die Adresse für Zahlungen aktivieren oder deaktivieren.
es: Este proceso requiere una nueva exploración de toda la cadena de bloques descargada para las transacciones que involucran esta dirección, y por lo tanto tomará un tiempo. Se paciente. Una vez que el proceso esté completo, cualquier transacción que involucre la dirección importada aparecerá en tu lista de transacciones. Si usas Coin Control, también puedes habilitar o deshabilitar la dirección para gastar allí.
fr: Cette procédure demande de passer en revue la blockchain entière pour identifier les transactions impliquant l'adresse donnée, et cela prendra donc un certain temps. Soyez patient. Une fois la procédure terminée, toutes les transactions impliquant l'adresse importée apparaîtront dans la liste de vos transactions. Si vous utilisez la fonction de Contrôle des pièces, vous pouvez aussi activer ou désactiver l'adresse pour dépenser ou non depuis elle.
it: Questo processo richiede la scansione dell'intera blockchain scaricata per le transazioni che coinvolgono questo indirizzo e richiederà quindi del tempo. Essere pazientare. Una volta completato il processo, tutte le transazioni che coinvolgono l'indirizzo importato verranno visualizzate nell'elenco delle transazioni. Se usi Coin Control, puoi anche abilitare o disabilitare l'indirizzo per effettuare acquisti lì.
ru: Этот процесс потребует пересканирования всего скачанного блокчейна для транзакций, включающих в себя этот адрес, поэтому потребуется время. Потерпите. Когда процесс завершится, все трананзакции на/с этого адреса появятся в списке транзакций. Если вы используете Coin Control, то там можно включить или выключить возможность траты средств с этого адреса.
zh_cn: 此过程需要对涉及此地址的交易重新扫描整个下载的区块链，因此需要花费一些时间。耐心点。一旦此过程完成，涉及导入地址的任何交易将出现在您的交易列表中。如果您使用货币控制控制，您还可以启用或禁用交易正在支出的地址。

source: Paper wallet address successfully imported into Dash Core Wallet from WIF private key
ar: تم استيراد عنوان محفظة الورق بنجاح إلى محفظة داش كور من مفتاح WIF الخاص
de: Paper Wallet erfolgreich und mit Hilfe des WIF Private Key in die Dash Core Wallet importiert
es: La dirección de la billetera de papel se importó correctamente en la billetera Dash Core desde la llave privada WIF
fr: Adresse de portefeuille papier importée avec succès dans le portefeuille logiciel Dash Core depuis une clé privée WIF
it: Indirizzo del paper wallet importato correttamente nel wallet Dash Core dalla chiave privata WIF
ru: Адрес из бумажного кошелька удачно импортирован в кошелёк Dash Core из приватного ключа WIF
zh_cn: 从WIF私钥成功导入Dash Core钱包的纸钱包地址

source: Since the paper wallet public address still holds the funds, it can also be imported again into a second wallet if it is not destroyed. It is recommended to transfer the balance from the paper wallet to an internal wallet address or another address where you have exclusive control over the private key. This will prevent a third party from obtaining unauthorised access to the same address from the paper wallet before you do. You can then spend your balance as usual.
ar: بما أن العنوان العام للحقيبة الورقية لا يزال يحتفظ بالأموال ، يمكن أيضًا استيراده مرة أخرى في محفظة ثانية إذا لم يتم إتلافه. يوصى بتحويل الرصيد من المحفظة الورقية إلى عنوان محفظة داخلي أو عنوان آخر حيث يكون لديك سيطرة حصرية على المفتاح الخاص. سيؤدي ذلك إلى منع طرف ثالث من الحصول على وصول غير مصرح به إلى العنوان نفسه من المحفظة الورقية قبل قيامك بذلك. يمكنك حينئذٍ إنفاق رصيدك كالمعتاد.
de: Da die Adresse, die zu der Paper Wallet gehört, immer noch die Kontrolle über das Guthaben hat, kann dieses auche in eine weitere Wallet importiert werden, falls das Papier nicht zerstört wird. Daher wird empfohlen, dass der Inhalt einer Paper Wallet an eine andere Adresse übertragen wird, über die nur du die volle Kontrolle hast. Hierdurch kann ein Dritter nicht auf dem selben Weg Zugriff auf dein Guthaben erhalten. Dein Guthaben kannst du somit wie gehabt verwenden.
es: Dado que la dirección pública de la billetera de papel aún conserva los fondos, también se puede importar nuevamente a una segunda billetera si no se destruye. Se recomienda transferir el saldo de la billetera de papel a una dirección de billetera interna u otra dirección donde tengas control exclusivo sobre la llave privada. Esto evitará que un tercero obtenga acceso no autorizado a la misma dirección de la billetera de papel antes que tu. Puedes gastar tu saldo como de costumbre.
fr: Puisque l'adresse publique du portefeuille papier contient encore les fonds, elle peut toujours être importée dans un second portefeuille si elle n'est pas détruite. Il est recommandé de transférer le solde du portefeuille papier vers une adresse interne du portefeuille logiciel, ou vers une autre adresse dont vous avez le contrôle exclusif de la clé privée. Cela empêchera une tierce partie d'accéder sans autorisation à la même adresse de portefeuille papier avant vous. Vous pourrez ensuite dépenser votre solde comme d'habitude.
it: Poiché l'indirizzo pubblico del paper wallet conserva ancora i fondi, può anche essere importato nuovamente in un secondo wallet se non viene distrutto. Si consiglia di trasferire il saldo dal paper wallet all'indirizzo di un wallet interno o a un altro indirizzo in cui si ha il controllo esclusivo sulla chiave privata. Ciò impedirà a terzi di ottenere l'accesso non autorizzato allo stesso indirizzo dal paper wallet prima di te. Potrai quindi spendere il tuo saldo come al solito.
ru: Поскольку публичный адрес кошелька до сих пор хранит средства, то, если он не был уничтожен, его можно снова импортировать в другой кошелёк. Рекомендуется перевести средства из бумажного кошелька во внутренний кошелёк или на другой адрес, где доступом к приватному ключу владеете только вы. Это предотвратит несанкционированный доступ третьих лиц прежде вас, к которому же адресу бумажного кошелька, что имеете и вы. После этих действий вы сможете распоряжаться балансом как обычно.
zh_cn: 因为纸钱包的公共地址仍然持有资金，如果不销毁该公共地址，它也可以被再次导入到第二个钱包中。建议将余额从纸钱包转移到内部钱包地址或其他您对私钥有独占控制权的地址中。这将阻止第三方在您之前从纸钱包中获得对相同地址的未经授权的访问。然后您可以像往常一样支出您的余额。

source: Once the paper wallet is empty and you are sure it will not be receiving any further deposits, you can destroy the paper.
ar: بمجرد أن تصبح المحفظة الورقية فارغة وكنت متأكداً من أنها لن تتلقى أي ودائع أخرى ، يمكنك تدمير الورقة.
de: Sobald die Paper Wallet geleert wurde und du dir sicher bist, dass sie nicht wieder aufgeladen wird, kannst du das Papier zerstören.
es: Una vez que la billetera de papel está vacía y estás seguro de que no recibirá más depósitos, puede destruir el papel.
fr: Une fois le portefeuille papier vidé, et une fois que vous êtes sûr que son adresse publique ne recevra plus jamais aucun autre dépôt, vous pouvez détruire le papier.
it: Una volta che il paper wallet è vuoto e sei sicuro che non riceverà ulteriori depositi, puoi distruggere la carta.
ru: Как только средств на бумажном кошельке не останется и поступления новых средств не будет ожидаться, его можно уничтожить.
zh_cn: 一旦纸钱包中的余额被花光，并且您确信该纸钱包不会收到任何进一步的存款，您就可以毁掉这张纸。
