Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/recovery.po
Languages: ar, de, es, fr, it, ru

source: In most cases, if you selected a strong password and have forgotten or lost it, there is practically no hope of recovery. The encryption used by the Dash wallets is extremely strong by design, and a well-chosen password should defeat most brute force cracking attempts. If you can recall some details of the password, particularly its length or sequences of characters that may be included, then brute force password cracking techniques may be worth attempting. Several services exist to do this, or you can attempt it yourself. Because Dash Core is based on Bitcoin Core, most approaches to apply brute force to crack a Bitcoin wallet will also work for Dash wallets.
ar: في معظم الحالات ، إذا اخترت كلمة مرور قوية ونسيتها أو فقدتها ، فلا يوجد أي أمل في التعافي. إن التشفير المستخدم من قبل محافظ داش قوي للغاية حسب التصميم ، ويجب أن تهزم كلمة المرور التي تم اختيارها جيدًا معظم محاولات اختراق القوة العنيفة. إذا كان باستطاعتك تذكر بعض تفاصيل كلمة المرور ، خاصة طولها أو تسلسلها من الأحرف التي يمكن تضمينها ، فقد يكون من المفيد عندئذ استخدام تقنيات تشذيب قوة كلمة المرور. توجد العديد من الخدمات للقيام بذلك ، أو يمكنك محاولة ذلك بنفسك. نظرًا لأن داش كور يعتمد على بيتكوين كور ، فإن معظم الطرق لتطبيق القوة الغاشمة على كسر محفظة بيتكوين ستعمل أيضًا في محافظ داش.
de: Wenn ein starkes Passwort gewählt wurde, gibt es in den meisten Fällen keine Möglichkeit je wieder einen Zugriff auf die Wallet zu bekommen. Die Dash-Verschlüsselung ist per Definition zu komplex um jemals geknackt zu werden und auch ein einfaches Nutzerpasswort sollte einem brutalen Angriff widerstehen können. Wenn zumindest Teile des Passworts oder dessen Länge bekannt sind, könnte ein starker Angriff auf das Passwort jedoch Erfolg haben. Verschiedene Dienste helfen bei diesem Vorgang und es ist auch möglich dies selbst zu versuchen. Da Dash Core auf Bitcoin Core basiert funktionieren Angriffsmöglichkeiten, die bei Bitcoin Core Erfolg haben eventuell auch bei Dash Core.
es: En la mayoría de los casos, si seleccionaste una contraseña fuerte y la olvidaste o perdiste, prácticamente no hay esperanza de recuperarla. La encriptación utilizada por las billeteras de Dash es extremadamente fuerte por diseño, y una contraseña bien elegida debería vencer a la mayoría de los intentos de agrietamiento por fuerza bruta. Si puedes recordar algunos detalles de la contraseña, particularmente su longitud o secuencias de caracteres que pueden incluirse, entonces puede valer la pena intentar las técnicas de descifrado de contraseñas con fuerza bruta . Existen varios servicios para hacer esto, o puedes intentarlo tu mismo. Debido a que Dash Core se basa en Bitcoin Core, la mayoría de los enfoques para aplicar la fuerza bruta para romper una billetera de Bitcoin también funcionarán para las billeteras de Dash.
fr: Dans la plupart des cas, si vous aviez choisi un mot de passe complexe puis l'avez oublié ou perdu, il n'y a quasiment aucun espoir de le retrouver. Le chiffrage employé par les portefeuilles Dash est de conception extrêmement sécurisée, et un mot de passe bien choisi fera échouer toutes les tentatives d'attaque par force brute. Si vous vous souvenez de quelques détails du mot de passe, en particulier de sa longueur ou d'une série de caractères qu'il peut comporter, alors les techniques d'attaque par force brute méritent d'être tentées. Plusieurs services existent pour cela, ou vous pouvez le faire vous-même. Comme Dash Core est basé sur Bitcoin Core, la plupart des méthodes d'application de la force brute sur un portefeuille Bitcoin marcheront aussi sur un portefeuille Dash.
it: Nella maggior parte dei casi, se hai selezionato una password complessa e l'hai dimenticata o persa, non c'è praticamente alcuna speranza di recuperarla. La crittografia utilizzata dai wallet Dash è estremamente potente per progettazione e una password ben scelta dovrebbe sconfiggere la maggior parte dei tentativi di cracking con forza bruta. Se riesci a ricordare alcuni dettagli della password, in particolare la sua lunghezza o le sequenze di caratteri che potrebbero essere incluse, potrebbe valere la pena provare le tecniche di cracking della password con forza bruta. Esistono diversi servizi per farlo, oppure puoi provarlo tu stesso. Poiché Dash Core è basato su Bitcoin Core, la maggior parte degli approcci per applicare la forza bruta per crackare un wallet Bitcoin funzionerà anche per i wallet Dash.
ru: В большинстве случаев, если вы выбрали надёжный пароль и забыли или потеряли его, то надежды на восстановление практически нет. Шифрование, используемое кошельками Dash, сделано чрезвычайно надёжным, и хорошо придуманный пароль должен защитить вас от самых грубые попыток взлома с помощью полного перебора. Если вы можете вспомнить некоторые данные о пароле, в частности его длину или последовательности символов, которые могут в него входить, тогда можно попытаться использовать методы взлома паролей с помощью полного перебора. Для этого существует несколько сервисов, или же вы можете попробовать сделать это самостоятельно. Поскольку Dash Core основан на Bitcoin Core, большинство подходов к применению полного перебора для взлома Биткойн-кошелька также будут работать и для кошельков Dash.

source: `Wallet Recovery Services <https://www.walletrecoveryservices.com/>`_
it: `Servizi di recupero wallet <https://www.walletrecoveryservices.com/>`_
ru: Сервисы восстановления кошельков <https://www.walletrecoveryservices.com/>`_

source: Dash Core
ar: داش كور
it: Core Dash

source: ~/Library/Application Support/
es: ~/Librería/Soporte de aplicación/

source: *budget.dat*
es: *presupuesto.dat*

source: *debug.log*
es: *depurar.log*

source: *fee_estimates.dat*
es: *estimados_comisiones.dat*

source: *governance.dat*
es: *governanza.dat*

source: *mnpayments.dat*
es: *mnpagos.dat*

source: `BTCRecover <https://github.com/gurnec/btcrecover>`_
es: `Recuperación de BTC <https://github.com/gurnec/btcrecover>`_

source: Linux
ar: لينكس

source: macOS
ar: ماك

source: Windows
ar: ويندوز
