Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/recovery.po
Languages: ar, de, es, fr, it, ru

source: Recovering Dash wallets from files, private keys or recovery phrases
ar: استعادة داش محافظ من الملفات والمفاتيح الخاصة أو كلمة الإستراد
de: Dash Wallet wiederherstellen per Datei, Private Key oder Wiederherstellungsphrase
es: Recuperar la billetera Dash desde archivos, llaves privadas o frases de recuperación
fr: Récupération de portefeuilles Dash depuis des fichiers, des clés privées ou des phrases de récupération
it: Recupero dei wallet Dash da file, chiavi private o frasi di recupero
ru: Восстановление кошельков Dash из файлов, с помощью приватных ключей или фраз для восстановления

source: dash, wallet, recovery, password, lost, mobile, core, phrase, private key
ar: داش ، محفظة ، الانتعاش ، كلمة المرور ، المفقودة ، المحمول ، الأساسية ، العبارة ، المفتاح الخاص
de: dash, wallet, wiederherstellung, passwort, verloren, mobile, core, phrase, private key
es: dash, billetera, recuperación, contraseña, perdido, perdida, móvil, core, frase, llave privada
fr: dash, portefeuille, récupération, mot de passe, perdu, mobile, core, phrase, clé privée
it: dash, wallet, recupero, password, perduto, mobile, core, frase, chiave privata
ru: dash, кошелёк, восстановление, пароль, потеря, мобильный, core, фраза, приватный ключ

source: Wallet Recovery
ar: إسترجاع المحفظة
de: Wallet-Wiederherstellung
es: Recuperación de billetera
fr: Récupération de portefeuille
it: Recupero Wallet
ru: Восстановление кошелька

source: Long-time users of cryptocurrency sometimes find old wallet files on USB drives or cloud storage that they have forgotten about. Others may have a backup, but can't remember the software they used to create it, or have forgotten the password. Other users may have an old version of Dash Core that no longer works because the network has upgraded. This documentation is intended to help these users restore access to their funds.
ar: في بعض الأحيان ، يجد مستخدمو العملات الرقمية منذ فترة طويلة ملفات المحفظة القديمة على محركات أقراص USB أو التخزين السحابي الذي نسوه. قد يكون للآخرين نسخة احتياطية ، ولكن لا يمكنهم تذكر البرنامج الذي استخدموه في إنشائه ، أو نسيان كلمة المرور. قد يكون لدى المستخدمين الآخرين نسخة قديمة من داش كور لم تعد تعمل لأن الشبكة قد تمت ترقيتها. يهدف هذا المستند إلى مساعدة هؤلاء المستخدمين في استعادة الوصول إلى أموالهم.
de: Erfahrene Kryptowährungsnutzer finden manchmal alte Wallet-Dateien, die sie auf einem USB-Stick oder in der Cloud vergessen haben. Andere haben vielleicht ein Backup und wissen nicht, womit sie es erstellt haben oder sie haben das Passwort vergessen. Wieder andere verwenden vielleicht eine alte Dash Core Version, die nicht mehr vom Netzwerk akzeptiert wird. Diese Dokumentation dient dazu diesen Nutzern zu helfen, wieder auf ihr Dash zuzugreifen.
es: Los usuarios veteranos de criptomonedas a veces encuentran viejos archivos de billetera en unidades USB o almacenamiento en la nube de los que se han olvidado. Otros pueden tener un respaldo, pero no pueden recordar el software que usaron para crearlo, o han olvidado la contraseña. Otros usuarios pueden tener una versión anterior de Dash Core que ya no funciona porque la red se ha actualizado. Esta documentación está destinada a ayudar a estos usuarios a restablecer el acceso a sus fondos.
fr: Ceux qui utilisent depuis longtemps les cryptomonnaies retrouvent parfois de vieux fichiers portefeuille, qu'ils avaient oubliés, sur des clés USB ou des espaces de stockage en ligne. D'autres peuvent avoir une sauvegarde, mais avoir oublié le logiciel utilisé pour la créer, ou bien avoir oublié le mot de passe. D'autres utilisateurs encore peuvent avoir une ancienne version de Dash Core qui ne fonctionne plus car la réseau, entre-temps, a évolué. Cette documentation est destinée à aider ces utilisateurs à retrouver un accès à leurs fonds.
it: Gli utenti di lunga data della criptovaluta a volte ritrovano vecchi file del wallet su unità USB o archivi cloud di cui si sono dimenticati. Altri potrebbero avere un backup, ma non ricordare il software utilizzato per crearlo o aver dimenticato la password. Altri utenti potrebbero avere una vecchia versione di Dash Core che non funziona più perché la rete è stata aggiornata. Questa documentazione ha lo scopo di aiutare questi utenti a ripristinare l'accesso ai propri fondi.
ru: Пользователи, которые длительный период пользуются криптовалютой, иногда находят старые файлы кошельков на USB-накопителях или в облачном хранилище, о которых они забыли. Также есть пользователи, которые могут иметь резервную копию, но не могут вспомнить какое программное обеспечение они использовали для её создания, или забыли пароль. И есть пользователи, которые могут иметь старую версию Dash Core, которая больше не работает из-за обновления сети. Эта документация призвана помочь таким пользователям восстановить доступ к своим средствам.

source: Determining the backup format
ar: تحديد تنسيق النسخ الاحتياطي
de: Wiederherstellungsformat bestimmen
es: Determinar el formato de respaldo
fr: Détermination du format de sauvegarde
it: Determinazione del formato di backup
ru: Определение формата резервного копирования

source: The first step is to determine the format of your backup. In most cases, this will either be a file, probably named *wallet.dat*, or a phrase of words. In some cases, you may have stored the private key for a Dash address directly. The following list shows the possibilities and methods to restore your wallet in order of probability.
ar: تتمثل الخطوة الأولى في تحديد تنسيق النسخة الاحتياطية. في معظم الحالات ، سيكون هذا الملف عبارة عن ملف ، ربما يُدعى *wallet.dat* ، أو عبارة كلمات. في بعض الحالات ، ربما تكون قد قمت بتخزين المفتاح الخاص لعنوان داش مباشرة. توضح القائمة التالية إمكانيات وأساليب استعادة محفظتك حسب الاحتمالية.
de: Der erste Schritt besteht darin, dass das Format des Backups bestimmt wird. Dies ist in den meisten Fällen entweder eine Datei mit dem Namen *wallet.dat* oder eine Phrase aus mehreren Wörtern. Unter Umständen wurde der private Schlüssel für eine Dash-Adresse aber auch direkt gespeichert. In der folgenden Liste werden Möglichkeiten und Methoden zur Wiederherstellung einer Wallet in einer Reihenfolge sortiert nach der Wahrscheinlichkeit aufgeführt.
es: El primer paso es determinar el formato de tu respaldo. En la mayoría de los casos, este será un archivo, probablemente llamado *wallet.dat*, o una frase de palabras. En algunos casos, es posible que hayas almacenado directamente la clave privada para una dirección de Dash. La siguiente lista muestra las posibilidades y métodos para restaurar tu billetera en orden de probabilidad.
fr: La première étape est de déterminer le format de votre sauvegarde. Dans la plupart des cas, elle sera soit un fichier, sans doute nommé *wallet.dat*, soit une série de mots. Dans certains cas, vous pourriez avoir archivé directement une clé privée correspondant à une adresse Dash. La liste suivante répertorie les cas de figure et les méthodes pour restaurer votre portefeuille, dans l'ordre de leur probabilité.
it: Il primo passo è determinare il formato del backup. Nella maggior parte dei casi, si tratterà di un file, probabilmente denominato *wallet.dat*, o di una frase. In alcuni casi, potresti aver memorizzato direttamente la chiave privata per un indirizzo Dash. L'elenco seguente mostra le possibilità e i metodi per ripristinare il tuo wallet in ordine di probabilità.
ru: Первым шагом является определение формата создаваемой вами резервной копии. В большинстве случаев это будет либо файл, возможно, названный *wallet.dat*, либо фраза из слов. В некоторых случаях вы можете напрямую сохранить приватный ключ для адреса Dash. В следующем списке показаны возможности и методы восстановления вашего кошелька в порядке вероятности.

source: Backup is stored in an older version of Dash Core that no longer works
ar: يتم تخزين النسخ الاحتياطي في إصدار قديم من داش كور لم يعد يعمل
de: Backup wird von einer alten Dash Core Version verwaltet, die nicht mehr funktioniert
es: El respaldo se almacena en una versión anterior de Dash Core que ya no funciona
fr: La sauvegarde est stockée dans une ancienne version du logiciel Dash Core qui ne fonctionne plus
it: Il backup è archiviato in una versione precedente di Dash Core che non funziona più
ru: Резервная копия хранится в старой версии Dash Core, которая больше не работает

source: Follow instructions for restoring wallet files using :ref:`Dash Core <dashcore-restore>`
ar: اتبع التعليمات لاستعادة ملفات المحفظة باستخدام :ref:`داش كور <dashcore-restore>`
de: Anweisungen zur Wiederherstellung unter :ref:`Dash Core <dashcore-restore>` folgen
es: Sigue las instrucciones para restaurar los archivos de billetera usando :ref:`Dash Core <dashcore-restore>`
fr: Suivez les instructions de restauration de fichiers portefeuille en utilisant :ref:`Dash Core <dashcore-restore>`
it: Segui le istruzioni per ripristinare i file del waallet utilizzando :ref:`Dash Core <dashcore-restore>`
ru: Следуйте инструкциям по восстановлению файлов кошелька, используя :ref:`Dash Core <dashcore-restore>`

source: Backup is a file
ar: النسخ الاحتياطي هو ملف
de: Backup ist eine Datei
es: El respaldo es un archivo
fr: La sauvegarde est un fichier
it: Il backup è un file
ru: Резервной копией является файл

source: If file name is similar to wallet.dat, try to restore using :ref:`Dash Core <dashcore-restore>`
ar: إذا كان اسم الملف مشابهًا لـ wallet.dat ، فحاول استعادة استخدامه :ref:`داش كور <dashcore-restore>`
de: Heißt die Datei wallet.dat oder ähnlich, kann sie wahrscheinlich mit :ref:`Dash Core <dashcore-restore>` wiederhergestellt werden
es: Si el nombre del archivo es similar a wallet.dat, intenta restaurar usando :ref:`Dash Core <dashcore-restore>`
fr: Si le nom du fichier est proche de "wallet.dat", essayez de restaurer en utilisant :ref:`Dash Core <dashcore-restore>`
it: Se il nome del file è simile a wallet.dat, prova a eseguire il ripristino utilizzando :ref:`Dash Core `
ru: Если файл имеет имя идентичное с wallet.dat, попробуйте способ восстановления по :ref:`Dash Core <dashcore-restore>`

source: If file name is similar to dash-wallet-backup or includes the word 'mobile', try to restore using :ref:`Dash Wallet for Android <dash-android-file-restore>`
ar: إذا كان اسم الملف مشابهًا للنسخة الاحتياطية من المحفظة أو يحتوي على كلمة 'هاتف'، فحاول استعادة الاستخدام :ref:`محفظة داش في الأندرويد <dash-android-file-restore>`
de: Heißt die Datei dash-wallet-backup oder beinhaltet der Name das Wort 'mobile', kann sie wahrscheinlich mit der :ref:`Dash Wallet für Android<dash-android-file-restore>` wiederhergestellt werden
es: Si el nombre del archivo es similar a dash-wallet-backup o incluye la palabra 'mobile', intenta restaurar usando :ref:`Billetera de Dash para Android <dash-android-file-restore>`
fr: Si le nom de fichier est similaire à "dash-wallet-backup" ou bien s'il comporte le mot "mobile", essayez de restaurer avec :ref:`Dash Wallet pour Android <dash-android-file-restore>`
it: Se il nome del file è simile a dash-wallet-backup o include la parola "mobile", prova a ripristinarlo utilizzando :ref:`Dash Wallet per Android <dash-android-file-restore>`
ru: Если имя файла аналогично с dash-wallet-backup или содержит слово 'mobile', попробуйте способ восстановления по :ref:`Кошелёк Dash для Android <dash-android-file-restore>`

source: Backup is a phrase of words
ar: النسخ الاحتياطي عبارة من الكلمات
de: Backup als Phrase aus Wörtern
es: El respaldo es una frase de palabras
fr: La sauvegarde est une phrase composée de plusieurs mots
it: Il backup è una frase di parole
ru: Резервной копией является фраза из слов

source: If 12 words long, try to restore using :ref:`Dash Electrum wallet <dash-electrum-phrase-restore>` or Dash wallet for :ref:`Android <dash-android-phrase-restore>` or :ref:`iOS <dash-ios-phrase-restore>`, depending what you used to create the backup
ar: إذا كانت الكلمات 12 طويلة ، حاول استعادة باستخدام :ref:`محفظة داش الإليكتروم <dash-electrum-phrase-restore>` أو محفظة داش في :ref:`الأندرويد <dash-android-phrase-restore>` أو في :ref:`الأيفون <dash-ios-phrase-restore>` اعتمادًا على ما استخدمته لإنشاء النسخة الاحتياطية
de: Ist die Phrase 12 Worte lang´, kann sie mit der :ref:`Dash Electrum Wallet <dash-electrum-phrase-restore>` oder der Dash Wallet für :ref:`Android <dash-android-phrase-restore>` oder :ref:`iOS <dash-ios-phrase-restore>`, wiederhergestellt werden, abhängig von der Wallet, mit der sie erstellt wurde
es: Si tienes 12 palabras, intenta restaurar utilizando :ref:`Billetera Dash Electrum <dash-electrum-phrase-restore>` o Billetera de Dash para :ref:`Android <dash-android-phrase-restore>` o :ref:`iOS <dash-ios-phrase-restore>`, dependiendo de lo que usaste para crear el respaldo
fr: Si cette phrase a une longueur de 12 mots, essayez de restaurer votre portefeuille en utilisant :ref:`le portefeuille Dash Electrum <dash-electrum-phrase-restore>` ou Dash wallet pour :ref:`Android <dash-android-phrase-restore>` ou :ref:`iOS <dash-ios-phrase-restore>`, selon ce que vous avez utilisé pour créer la sauvegarde
it: Se è lungo 12 parole, prova a eseguire il ripristino utilizzando :ref:`Dash Electrum wallet <dash-electrum-phrase-restore>` o Dash wallet per :ref:`Android <dash-android-phrase-restore>` o :ref:`iOS <dash-ios-phrase-restore>`, a seconda di cosa hai utilizzato per creare il backup
ru: Если фраза состоит из 12 слов, попробуйте восстановление по :ref:`кошелёк Dash Electrum <dash-electrum-phrase-restore>` или кошелёк Dash для :ref:`Android <dash-android-phrase-restore>` или :ref:`iOS <dash-ios-phrase-restore>`, в зависимости от того, какую платформу вы использовали для создания резервной копии

source: If 13 words long, try to restore using :ref:`Dash Electrum wallet <dash-electrum-phrase-restore>`
ar: إذا كانت 13 كلمة طويلة ، حاول استعادة باستخدام :ref:`محفظة داش الإليكتروم <dash-electrum-phrase-restore>`
de: Ist sie 13 Wort lang, kann sie mit der :ref:`Dash Electrum Wallet <dash-electrum-phrase-restore>` wiederhergestellt werden
es: Si tienes 13 palabras, intenta restaurar utilizando :ref:`Billetera Dash Electrum <dash-electrum-phrase-restore>`
fr: Si la phrase a une longueur de 13 mots, essayez une restauration avec :ref:`le portefeuille Dash Electrum <dash-electrum-phrase-restore>`
it: Se è lungo 13 parole, prova a ripristinarlo utilizzando :ref:`Dash Electrum wallet <dash-electrum-phrase-restore>`
ru: Если фраза состоит из 13 слов, попробуйте восстановление по :ref:`кошелёк Dash Electrum <dash-electrum-phrase-restore>`

source: If 12, 18 or 24 or 25 words long, try to restore with the :ref:`hardware wallet <hardware-phrase-restore>` you used to create the recovery phrase
ar: إذا كانت المدة 12 أو 18 أو 24 أو 25 كلمة ، فحاول استعادتها باستخدام :ref:`محفظة الأجهزة <hardware-phrase-restore>` التي استخدمتها لإنشاء كلمة الإستراد
de: Ist sie 12, 18, 24 oder 25 Worte lang, kann sie mit der :ref:`Hardware Wallet <hardware-phrase-restore>` mit der sie erstellt wurde, wiederhergestellt werden
es: Si tienes 12, 18 o 24 o 25 palabras, intenta restaurar con la :ref:`Billetera de hardware <hardware-phrase-restore>` que usaste para crear la frase de recuperación
fr: Si la phrase a une longueur de 12, 18, 24 ou 25 mots, essayez de restaurer le portefeuille avec le :ref:`portefeuille matériel <hardware-phrase-restore>` que vous avez utilisé pour créer la phrase de récupération
it: Se è lungo 12, 18 o 24 o 25 parole, prova a ripristinare con il :ref:`hardware wallet <hardware-phrase-restore>` che hai utilizzato per creare la frase di ripristino
ru: Если фраза состоит из 12, 18, 24 или 25 слов, попробуйте восстановление по :ref:`аппаратный кошелёк <hardware-phrase-restore>`, который вы использовали для создания фразы восстановления

source: Backup is a long string of random characters or a QR code
ar: النسخ الاحتياطي عبارة عن سلسلة طويلة من الأحرف العشوائية أو رمز الاستجابة السريعة
de: Backup ist eine lange Reihe an zufälligen Symbolen oder ein QR-Code
es: EL respaldo es una larga cadena de caracteres aleatorios o un código QR
fr: La sauvegarde est une longue série de caractères aléatoires, ou un QR-code
it: Il backup è una lunga stringa di caratteri casuali o un codice QR
ru: Резервной копией является длинная строка, состоящая из случайных букв и цифр или QR-код

source: If 34 characters long and starting with X, this is a public address and cannot be used to restore access to lost funds. You need the private key.
ar: إذا كان طوله 34 حرفًا وبداية بـ X ، فهذا عنوان عام ولا يمكن استخدامه لاستعادة الوصول إلى الأموال المفقودة. تحتاج المفتاح الخاص.
de: Ist sie 34 Zeichen lang und beginnt mit einem X, handelt es sich um einen öffentlichen Schlüssel und dieser kann nicht dazu verwendet werden verlorenes Guthaben wiederherzustellen. Dafür ist ein privater Schlüssel notwendig.
es: Si tienes 34 caracteres de largo y comienza con X, esta es una dirección pública y no se puede usar para restablecer el acceso a fondos perdidos. Necesitas la llave privada.
fr: Si elle a une longueur de 34 caractères et qu'elle commence par X, il s'agit d'une adresse publique et elle ne peut pas être utilisée pour retrouver l'accès aux fonds perdus. Vous avez besoin de la clé privée.
it: Se è lungo 34 caratteri e inizia con X, si tratta di un indirizzo pubblico e non può essere utilizzato per ripristinare l'accesso ai fondi perduti. Hai bisogno della chiave privata.
ru: Если строка состоит из 34 символов и начинается с Х, то это строка с публичным адресом и она не может использоваться для восстановления доступа к потерянным средствам. Вам необходим приватный ключ.

source: If 51 characters long and starting with 7, this is a :ref:`private key in WIF <privkey-restore>`, import using Dash Core
ar: إذا كان طولها 51 حرفًا وتبدأ بـ 7 أحرف ، فهذا يعني :ref:`مفتاح خاص في <privkey-restore>` ، بالاستيراد باستخدام داش كور
de: Ist sie 51 Zeichen lang und beginnt mit einer 7, dann ist es ein :ref:`privater Schlüssel in WIF <privkey-restore>` und dieser kann in Dash Core importiert werden
es: Si tiene 51 caracteres y comienza con 7, esta es una :ref:`llave privada en WIF <privkey-restore>`, importar usando Dash Core
fr: Si elle a une longueur de 51 caractères et commence par le chiffre 7, il s'agit d'une :ref:`clé privée au format WIF <privkey-restore>`, à importer en utilisant Dash Core
it: Se è lungo 51 caratteri e inizia con 7, si tratta di una :ref:`chiave privata in WIF <privkey-restore>`, importata utilizzando Dash Core
ru: Если строка состоит из 51 символа и начинается с 7, то это :ref:`приватный ключ в формате WIF <privkey-restore>`, импортируйте его с помощью Dash Core

source: If 58 characters long and starting with 6P, this is a :ref:`BIP38 encrypted private key <privkey-restore>`, decrypt using paper wallet then import using Dash Core
ar: إذا كان طولها 58 حرفًا وتبدأ بـ 6 أحرف ، فهذا يعني :ref:`BIP38مفتاح خاص مشفر <privkey-restore>`, فك تشفير باستخدام محفظة الورق ثم استيراد باستخدام داش كور
de: Ist sie 58 Zeichen lang und beginnt mit 6P, dann ist es ein :ref:`verschlüsselter privater Schlüssel in BIP38 <privkey-restore>` dieser kann über eine Paper Wallet in Dash Core importiert werden
es: Si tiene 58 caracteres de longitud y comienza con 6P, esta es una :ref:`Llave privada encriptada BIP38 <privkey-restore>`, descifrar usando una billetera de papel y luego importar utilizando Dash Core
fr: Si elle a une longueur de 58 caractères et commence par 6P, il s'agit d'une :ref:`clé privée chiffrée BIP38 <privkey-restore>`, à déchiffrer avec votre portefeuille papier, puis à importer dans Dash Core
it: Se è lungo 58 caratteri e inizia con 6P, si tratta di una :ref:`Chiave privata crittografata BIP38 <privkey-restore>`, decrittografa utilizzando il paper wallet quindi importa utilizzando Dash Core
ru: Если строка состоит из 58 символов и начинается с 6Р, то это :ref:`зашифрованный с помощью BIP38 приватный ключ <privkey-restore>`, расшифруйте его, используя бумажный кошелёк, затем импортируйте его с помощью Dash Core

source: Once you have determined your backup format, follow the links to view the restore guide for that format.
ar: بمجرد تحديد تنسيق النسخة الاحتياطية ، اتبع الارتباطات لعرض دليل الاستعادة لهذا التنسيق.
de: Nachdem bestimmt werden konnte, um welches Format es sich handelt, kann die detaillierte Schrittfolge zur Wiederherstellung des jeweiligen Formats verwendet werden.
es: Una vez que hayas determinado tu formato de respaldo, sigue los enlaces para ver la guía de restauración para ese formato.
fr: Une fois que vous avez déterminé le format de sauvegarde, suivez les liens pour consulter le guide de restauration propre à ce format.
it: Una volta determinato il formato di backup, segui i collegamenti per visualizzare la guida al ripristino per quel formato.
ru: После того как вы определили формат резервного копирования, следуйте по ссылкам для ознакомления с руководством по восстановлению для выбранного формата.

source: File Backups
ar: ملف النسخ الاحتياطية
de: Sicherheitskopie
es: Archivos de respaldo
fr: Sauvegardes sous forme de fichier
it: Backup dei file
ru: Файловые резервные копии
