Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/recovery.po
Languages: ar, de, es, fr, it, ru

source: Ensure your Dash wallet is fully updated in the Play Store, then open Dash. If you have an existing balance, either view and write down your recovery phrase or transfer your balance to an external address, because restoring a wallet will replace your existing wallet.
it: Assicurati che il tuo wallet Dash sia completamente aggiornato nel Play Store, quindi apri Dash. Se disponi di un saldo esistente, visualizza e annota la frase di recupero o trasferisci il saldo a un indirizzo esterno, poiché il ripristino di un wallet sostituirà il tuo esistente.
ru: Убедитесь, что ваш кошелек Dash полностью обновлен в Play Store, затем откройте Dash. Если у вас есть существующий баланс, либо просмотрите и запишите фразу восстановления, либо переведите баланс на внешний адрес, поскольку восстановление кошелька приведет к замене существующего кошелька.

source: Select **Restore from recovery phrase** from the menu at the bottom of the main page, and enter your 12-word phrase when prompted.
it: Seleziona **Ripristina dalla frase di ripristino** dal menu nella parte inferiore della pagina principale e inserisci la frase di 12 parole quando richiesto.
ru: Выберите пункт **Восстановить из фразы восстановления** в меню внизу главной страницы и введите фразу из 12 слов, когда появится запрос.

source: For devices that already have an active wallet, first write down the existing recovery phrase as a backup. Click the menu button on the bottom right corner and select **Security > View Recovery Phrase** to find it. After backing up the recovery phrase, reset the wallet by selecting the **Security > Reset Wallet** option and then proceed with restoring the recovery phrase.
it: Per i dispositivi che dispongono già di un wallet attivo, annotare prima la frase di ripristino esistente come backup. Fai clic sul pulsante del menu nell'angolo in basso a destra e seleziona **Sicurezza > Visualizza frase di ripristino** per trovarla. Dopo aver eseguito il backup della frase di ripristino, reimposta il wallet selezionando l'opzione **Sicurezza > Reimposta wallet** e quindi procedi con il ripristino della frase di ripristino.
ru: Для устройств, на которых уже есть активный кошелек, сначала запишите существующую фразу восстановления в качестве резервной копии. Для ее поиска нажмите кнопку меню в правом нижнем углу и выберите **Security > View Recovery Phrase**. После создания резервной копии фразы восстановления сбросьте кошелек, выбрав опцию **Security > Reset Wallet**, а затем приступайте к восстановлению фразы восстановления.

source: *Restoring a 12-word recovery phrase using Dash wallet for Android*
ar: *استعادة كلمة الإستراد مؤلفة من 12 كلمة باستخدام محفظة داش للأندرويد*
de: *Eine Wiederherstellungsphrase aus 12 Wörtern für die Dash Android Wallet verwenden*
es: *Restauración de una frase de recuperación de 12 palabras usando la billetera de Dash para Android*
fr: *Restauration d'une phrase de récupération de 12 mots avec le portefeuille Dash pour Android*
it: *Ripristino di una frase di recupero di 12 parole utilizzando il wallet Dash per Android*
ru: *Восстановление с помощью фразы для восстановления из 12 слов с использованием кошелька Dash для Android*

source: 12-word phrase on iOS
ar: 12 كلمة في الأيفون
de: iOS-Phrase mit 12 Wörtern
es: Frase de 12 palabras en iOS
fr: Phrase de 12 mots sur iOS
it: Frase da 12-parole con iOS
ru: Фраза из 12 слов для iOS

source: Ensure your Dash wallet is fully updated in the App Store, then open Dash. If this is the first time you are opening the app, you can enter your recovery phrase directly by selecting **Recover wallet** on the start screen. If you have an existing balance, either make another backup or transfer it to an external address, because restoring a wallet will replace your existing wallet!
ar: تأكد من تحديث محفظة داش بالكامل في متجر التطبيقات ، ثم افتح داش. إذا كانت هذه هي المرة الأولى التي تفتح فيها التطبيق ، يمكنك إدخال كلمة الإستراد مباشرة عن طريق اختيار **إسترجاع المحفظة** على شاشة البدء. إذا كان لديك رصيد موجود ، فقم إما بنسخ احتياطي آخر أو نقله إلى عنوان خارجي ، لأن استعادة المحفظة ستحل محل محفظتك الحالية!
de: Die Dash Wallet muss vollständig über den App Store aktualisiert worden sein, bevor sie geöffnet wird. Wenn die Wallet zum ersten Mal geöffnet wird, kann die Wiederherstellungsphrase sofort eingegeben werden, nachdem auf **Wallet wiederherstellen** geklickt wurde. Sollte bereits ein Guthaben vorhanden sein, muss entweder ein weiteres Backup erstellt oder der Inhalt an eine externe Adresse übertragen werden, da die Wiederherstellung einer Wallet die bestehende Wallet ersetzt!
es: Asegúrate de que tu billetera Dash esté completamente actualizada en App Store, luego abre Dash. Si esta es la primera vez que abres la aplicación, puedes ingresar tu frase de recuperación directamente seleccionando **Recuperar billetera** en la pantalla de inicio. Si tienes un saldo existente, haz otro respaldo o transfiérelo a una dirección externa, ¡porque restaurar una billetera reemplazará tu billetera existente!
fr: Assurez-vous dans l'App Store que votre application Dash soit mise à jour, puis ouvrez-la. Si c'est la première fois que vous ouvrez l'application, vous pouvez saisir directement la phrase de récupération en choisissant **Récupérer un portefeuille** sur l'écran de démarrage. Si vous avez déjà un solde Dash, vous pouvez soit faire une autre sauvegarde, soit transférer vos fonds à une adresse externe, car restaurer un portefeuille entraînera le remplacement de votre portefeuille existant !
it: Assicurati che il tuo wallet Dash sia completamente aggiornato nell'App Store, quindi apri Dash. Se è la prima volta che apri l'app, puoi inserire direttamente la frase di recupero selezionando **Recupera wallet** nella schermata iniziale. Se disponi di un saldo esistente, esegui un altro backup o trasferiscilo su un indirizzo esterno, perché il ripristino di un wallet sostituirà il tuo esistente!
ru: Убедитесь в том, что у вас последняя версия кошелька Dash, загруженная из App Store, затем откройте кошелёк Dash. Если вы открываете это приложение впервые, то можете ввести вашу фразу восстановления сразу на экране запуска, выбрав **Восстановить кошелёк**. Если на вашем балансе имеются какие-то средства, то либо сделайте ещё одну резервную копию, либо переведите деньги на какой-то внешний адрес, так как при восстановлении кошелька ваш существующий файл кошелька будет заменён новым!

source: Tap the menu button in the bottom right corner, select **Security > Reset wallet**. Tap **Continue** and enter your current wallet recovery phrase, then the app will reset and you will see the option to **Recover wallet** again.
it: Tocca il pulsante del menu nell'angolo in basso a destra, seleziona **Sicurezza > Reimposta wallet**. Tocca **Continua** e inserisci la frase di recupero del wallet corrente, quindi l'app verrà reimpostata e vedrai nuovamente l'opzione **Recupera wallet**.
ru: Нажмите кнопку меню в правом нижнем углу, выберите **Безопасность > Сбросить кошелек**. Нажмите кнопку **Продолжить** и введите текущую фразу восстановления кошелька, после чего приложение перезагрузится и снова появится возможность **Восстановить кошелек**.

source: *Restoring a 12-word recovery phrase using Dash wallet for iOS*
ar: *استعادة كلمة الإستراد مكونة من 12 كلمة باستخدام محفظة داش لنظام التشغيل الأيفون*
de: *Eine Wiederherstellungsphrase aus 12 Wörtern für die Dash iOS Wallet verwenden*
es: *Restauración de una frase de recuperación de 12 palabras usando la billetera de Dash para iOS*
fr: *Restauration d'une phrase de récupération de 12 mots sur le portefeuille Dash pour iOS*
it: *Ripristino di una frase di recupero di 12-parole utilizzando il wallet Dash per iOS*
ru: *Восстановление с помощью фразы для восстановления из 12 слов с использованием кошелька Dash для iOS*

source: 12/13-word phrase on Dash Electrum
ar: 12/13 كلمة عبارة عن داش إلكتروم
de: Electrum-Phrase mit 12/13 Wörtern
es: Frase de 12/13 palabras en Dash Electrum
fr: Phrase de 12 ou 13 mots sur Dash Electrum
it: Frase di 12/13-parole su Dash Electrum
ru: Фраза из 12/13 слов для кошелька Dash Electrum

source: Ensure you are using the latest version of Dash Electrum according to the installation instructions :ref:`here <electrum-installation>`. Dash Electrum supports multiple simultaneous wallets, so you can safely restore to a new wallet file without losing your old wallet. Click **File > New/Restore** and enter a file name to store your new wallet. Then select **I already have a seed** and enter your 12/13-word recovery phrase. Enter a new password for your wallet and click **Next** to recover your addresses from the recovery phrase.
ar: تأكد من استخدام أحدث إصدار من داش إلكتروم وفقًا لتعليمات التثبيت :ref:`هنا <electrum-installation>`. يدعم داش إلكتروم عدة محافظ متزامنة ، لذا يمكنك استعادة ملف محفظة جديد بأمان دون فقدان المحفظة القديمة. انقر فوق **ملف> جديد / استعادة** وأدخل اسم ملف لتخزين محفظتك الجديدة. ثم حدد **لدي بالفعل** وأدخل كلمة استرداد كلمة 12/13. أدخل كلمة مرور جديدة لمحفظةك وانقر فوق **التالي** لاسترداد العناوين من كلمة الإستراد.
de: Es ist wichtig, dass eine Dash Electrum Wallet verwendet wird, die nach :ref:`diesen <electrum-installation>` Angaben die aktuellste ist. Dash Electrum erlaubt mehrere Wallets gleichzeitig, sodass eine Wallet sicher wiederhergestellt werden kann, ohne, dass die alten Wallets in Gefahr geraten. Unter **File > New/Restore** kann einer neuen Wallet zunächst ein Name gegeben werden. Danach muss **I already have a seed** ausgewählt und die 12/13-Wortphrase eingegeben werden. Die Wallet kann zudem mit einem Passwort verschlüsselt werden und mit **Next** wird der Wiederherstellungsprozess abgeschlossen.
es: Asegúrate de estar utilizando la última versión de Dash Electrum de acuerdo con las instrucciones de instalación :ref:`aquí <electrum-installation>`. Dash Electrum admite múltiples billeteras simultáneas, por lo que puedes restaurar de forma segura un nuevo archivo de billetera sin perder tu billetera anterior. Haz clic en **Archivo > Nuevo/Restaurar** e ingresa un nombre de archivo para almacenar tu nueva billetera. Luego selecciona **Ya tengo una semilla** e ingresa tu frase de recuperación de 12/13 palabras. Ingresa una nueva contraseña para su billetera y haz clic en **Siguiente** para recuperar tus direcciones desde la frase de recuperación.
fr: Assurez-vous de disposer de la plus récente version de Dash Electrum en suivant les instructions d'installation :ref:`ici <electrum-installation>`. Dash Electrum permet d'utiliser simultanément plusieurs portefeuilles, vous pouvez donc restaurer en toute sécurité dans un nouveau fichier portefeuille, sans perdre votre ancien portefeuille. Cliquez sur **Fichier > Nouveau/Restaurer** et tapez un nom de fichier dans lequel stocker votre nouveau portefeuille. Puis sélectionnez **Je dispose déjà d'une graine** et saisissez votre phrase de récupération de 12 ou 13 mots. Saisissez un nouveau mot de passe pour votre portefeuille puis cliquez **Suivant** pour récupérer vos adresses depuis la phrase de récupération.
it: Assicurati di utilizzare la versione più recente di Dash Electrum seguendo le istruzioni di installazione :ref:`qui <electrum-installation>`. Dash Electrum supporta più wallet simultanei, quindi puoi ripristinare in sicurezza un nuovo file del wallet senza perdere il vecchio wallet. Fai clic su **File > Nuovo/Ripristina** e inserisci un nome file per archiviare il tuo nuovo wallet. Quindi seleziona **Ho già un seed** e inserisci la tua frase di recupero di 12/13 parole. Inserisci una nuova password per il tuo wallet e fai clic su **Avanti** per recuperare i tuoi indirizzi dalla frase di recupero.
ru: Убедитесь, что вы используете последнюю версию кошелька Dash Electrum в соответствии с инструкциями по инсталляции :ref:`здесь <electrum-installation>`. Dash Electrum поддерживает работу нескольких совместных кошельков, поэтому можно безопасно восстановиться в новый файл кошелька без потери старого кошелька. Нажмите **Файл > Создать/Восстановить** и введите имя для сохранения вашего новго кошелька. Затем выберите **I already have a seed** и введите фразу восстановления из 12/13 слов. Введите новый пароль для своего кошелька и нажмите **Далее** для восстановления ваших адресов из фразы восстановления.

source: *Restoring a 12-word recovery phrase using Dash Electrum*
ar: *استعادة كلمة الإستراد مكونًا من 12 كلمة باستخدام داش إلكتروم*
de: *Eine Wiederherstellungsphrase aus 12 Wörtern für die Dash Electrum Wallet verwenden*
es: *Restauración de una frase de recuperación de 12 palabras usando Dash Electrum*
fr: *Restauration avec une phrase de 12 mots sur Dash Electrum*
it: *Ripristino di una frase di recupero di 12-parole utilizzando Dash Electrum*
ru: *Восстановление с помощью фразы для восстановления из 12 слов с использованием Dash Electrum*

source: Hardware wallet recovery phrases
ar: كلمة الإستراد محفظة الأجهزة
de: Wiederherstellungsphrase für Hardware Wallets
es: Frases de recuperación de billetera de hardware
fr: Phrases de récupération sur un portefeuille matériel
it: Frasi di recupero del wallet hardware
ru: Фразы для восстановления аппаратного кошелька

source: If your 12, 18 or 24-word recovery phrase was generated by a hardware wallet, follow these instructions:
ar: إذا تم إنشاء كلمة الإستراد التي تتكون من 12 أو 18 أو 24 كلمة من خلال محفظة الأجهزة ، فاتبع هذه الإرشادات.
de: Wenn eine 12, 18 oder 24 Wörter lange Phrase durch eine Hardware-Wallet ausgegeben wurde, ist diese Anleitung die richtige:
es: Si tu frase de recuperación de 12, 18 o 24 palabras fue generada por una billetera de hardware, sigue estas instrucciones:
fr: Si votre phrase de récupération de 12, 18 ou 24 mots a été générée par un portefeuille matériel, veuillez suivre ces instructions :
it: Se la tua frase di recupero di 12, 18 o 24-parole è stata generata da un wallet hardware, segui queste istruzioni:
ru: Если ваша фраза, состоящая из 12, 18 или 24 слов была сгенерирована аппаратным кошельком - следуйте инструкциям ниже:

source: Restoring an iOS wallet in Dash Electrum
ar: استعادة محفظة الأيفون في داش إلكتروم
de: Eine iOS Wallet über Dash Electrum wiederherstellen
es: Restaurar una billetera iOS en Dash Electrum
fr: Restauration d'un portefeuille iOS dans Dash Electrum
it: Ripristino di un wallet iOS in Dash Electrum
ru: Восстановление кошелька iOS при помощи Dash Electrum

source: You can use your Dash iOS recovery phrase with Dash Electrum to recover funds if you lose access to your iOS device for any reason. However, since the wallet derivation paths are not identical, the process only works in one direction, meaning it is not possible to restore a Dash Electrum wallet using the Dash iOS wallet. Also, because the import process uses an xprv key rather than the recovery phrase directly, it will not be possible to display the recovery phrase in Dash Electrum. It is therefore recommended to move the funds (either to a standard Dash Electrum wallet or some other wallet) once recovery is successful to ensure that standard backup procedures work as expected.
ar: يمكنك استخدام كلمة الإستراد داش في الأيفون الخاصة بك مع داش إلكتروم لاسترداد الأموال إذا فقدت الوصول إلى جهاز الأيفون الخاص بك لأي سبب. ومع ذلك ، نظرًا لأن مسارات اشتقاق المحفظة ليست متطابقة ، فإن العملية تعمل فقط في اتجاه واحد ، مما يعني أنه لا يمكن استعادة محفظة داش إلكتروم باستخدام محفظة داش في الأيفون . أيضاً ، لأن عملية الاستيراد تستخدم مفتاح xprv بدلاً من كلمة الاسترداد مباشرة ، فلن يكون من الممكن اضهار عبارة الاسترداد في داش إلكتروم . ولذلك يوصى بتحويل الأموال (إما إلى محفظة داش إلكتروم قياسية أو محفظة أخرى) بمجرد نجاح عملية الاسترداد للتأكد من أن إجراءات النسخ الاحتياطي القياسية تعمل كما هو متوقع.
de: Es ist möglich eine iOS-Wallet über eine Dash Electrum Wallet wiederherzustellen, falls kein Zugang zu einem iOS-Gerät mehr besteht. Da die beiden Programme jedoch unterschiedliche Voraussetzungen haben, kann die iOS Wallet nicht direkt mit Hilfe der Wiederherstellungsphrase in Dash Electrum wiederhergestellt werden. Zudem ist wichtig, dass der Wiederherstellungsprozess einen xprv-Schlüssel verwendet, der nicht als Wiederherstellungsphrase angezeigt werden kann, weswegen es Sinn macht das Guthaben nach der erfolgreichen Wiederherstellung an eine andere Wallet (entweder an eine andere Electrum Wallet oder an eine sonstige Wallet) zu versenden. Zudem wird hierdurch das Funktionieren des Wiederherstellungsvorgangs überprüft.
es: Puedes usar tu frase de recuperación de Dash iOS con Dash Electrum para recuperar fondos si pierdes el acceso a tu dispositivo iOS por algún motivo. Sin embargo, dado que las rutas de derivación de la billetera no son idénticas, el proceso solo funciona en una dirección, lo que significa que no es posible restaurar una billetera Dash Electrum con la billetera Dash iOS. Además, dado que el proceso de importación utiliza una llave xprv en lugar de la frase de recuperación directamente, no será posible mostrar la frase de recuperación en Dash Electrum. Por lo tanto, se recomienda mover los fondos (ya sea a una billetera Dash Electrum estándar o a alguna otra billetera) una vez que la recuperación sea exitosa para garantizar que los procedimientos de respaldo estándar funcionen como se espera.
fr: Vous pouvez utiliser votre phrase de récupération Dash iOS pour retrouver vos fonds dans Dash Electrum, si jamais vous perdez l'accès à votre appareil iOS pour une raison ou une autre. Cependant, comme les chemins de dérivation de portefeuille ne sont pas identiques, la procédure ne marche que dans un sens, ce qui signifie qu'il n'est pas possible de restaurer un portefeuille Dash Electrum sur un portefeuille Dash iOS. De plus, le processus d'importation utilisant une clé xprv plutôt que la phrase de récupération directement, il ne sera pas possible d'afficher la phrase de récupération dans Dash Electrum. Il est donc recommandé de déplacer les fonds (soit vers un portefeuille standard Dash Electrum, soit vers un autre portefeuille) une fois que la récupération est terminée, pour s'assurer que les procédures standard de sauvegarde fonctionnent comme attendu.
it: Puoi utilizzare la frase di recupero Dash iOS con Dash Electrum per recuperare fondi se perdi l'accesso al tuo dispositivo iOS per qualsiasi motivo. Tuttavia, poiché i percorsi di derivazione del wallet non sono identici, il processo funziona solo in una direzione, il che significa che non è possibile ripristinare un wallet Dash Electrum utilizzando il wallet Dash iOS. Inoltre, poiché il processo di importazione utilizza una chiave xprv anziché direttamente la frase di ripristino, non sarà possibile visualizzare la frase di ripristino in Dash Electrum. Si consiglia pertanto di spostare i fondi (su un wallet Dash Electrum standard o su un altro wallet) una volta che il ripristino ha avuto esito positivo per garantire che le procedure di backup standard funzionino come previsto.
ru: Для восстановления средств можно использовать фразу восстановления Dash iOS в Dash Electrum, если по какой-либо причине вы потеряли доступ к своему устройству iOS. Однако, поскольку пути расположения кошелька не идентичны, процесс работает только в одном направлении, то есть невозможно восстановить кошелек Dash Electrum с помощью кошелька Dash iOS. Кроме того, поскольку в процессе импорта напрямую используется ключ xprv, а не фраза восстановления, невозможно будет отобразить фразу восстановления в Dash Electrum. Поэтому рекомендуется переместить средства (либо в стандартный кошелек Dash Electrum или какой-либо другой кошелек) после успешного восстановления, для того, чтобы убедиться, что стандартные процедуры резервного копирования работают должным образом.

source: Recovery takes place in two steps. First, we will convert the Dash iOS recovery phrase into an xprv key. In the second step, we will import the xprv key into Dash Electrum.
ar: الانتعاش يحدث في خطوتين. أولاً ، سنقوم بتحويل كلمة سترداد داش في الأيفون إلى مفتاح xprv. في الخطوة الثانية ، سنقوم باستيراد مفتاح xprv إلى داش إلكتروم.
de: Die Wiederherstellung umfasst zwei Schritte. Zuerst muss die iOS-Wiederherstellugsphrase als xprv-Schlüssel angezeigt werden. Im zweiten Schritt muss der xprv-Schlüssel in Dash Electrum übertragen werden.
es: La recuperación se hace en dos pasos. Primero, convertiremos la frase de recuperación de la Dash iOS en una llave xprv. En el segundo paso, importaremos la llave xprv en la Dash Electrum.
fr: La récupération a lieu en deux temps. D'abord, nous convertirons la phrase de récupération Dash iOS en une clé xprv. Ensuite, nous importerons la clé xprv dans Dash Electrum.
it: Il recupero avviene in due fasi. Innanzitutto, convertiremo la frase di ripristino di Dash iOS in una chiave xprv. Nel secondo passaggio importeremo la chiave xprv in Dash Electrum.
ru: Восстановление происходит в два шага. На первом шаге мы конвертируем фразу восстановления Dash iOS в ключ xprv. На втором шаге импортируем ключ xprv в кошелёк Dash Electrum.

source: Retrieving the correct Dash iOS xprv key
ar: استرجاع مفتاح داش في الأيفون xprv الصحيح
de: Den korrekten Dash iOS xprv-Schlüssel erzeugen
es: Recuperando la llave xprv correcta de Dash iOS
fr: Retrouver la bonne clé xprv de Dash iOS
it: Recupero della chiave Dash iOS xprv corretta
ru: Получение правильного ключа xprv для Dash на iOS
