Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/recovery.po
Languages: ar, de, es, fr, it, ru

source: Go to the `BIP39 Mnemonic Code Converter <https://iancoleman.io/bip39/>`_ page. This is a useful tool for manipulating/displaying BIP32/39 seed data. If you are not comfortable performing this procedure online, an offline version is available by downloading the file described in `these instrutions <https://github.com/iancoleman/bip39#standalone-offline-version>`_. Once the tool is loaded in your browser, complete the following steps:
ar: انتقل إلى `BIP39 Mnemonic Code Converter <https://iancoleman.io/bip39/>`_ هذا هو أداة مفيدة لمعالجة/عرض بيانات البذور BIP32 / 39. إذا لم تكن مرتاحًا لتنفيذ هذا الإجراء عبر الإنترنت ، يتوفر إصدار غير متصل عن طريق تنزيل الملف الموضح في `هذه التعليمات <https://github.com/iancoleman/bip39#standalone-offline-version>`_. بمجرد تحميل الأداة في المتصفح ، أكمل الخطوات التالية:
de: Durch den `BIP39 Mnemonic Code Converter <https://iancoleman.io/bip39/>`_ können die BIP 32/39 Seed-Daten dargestellt werden. Sollte der Wunsch bestehen diesen Vorgang offline und nicht online durchzuführen, kann `hier <https://github.com/iancoleman/bip39#standalone-offline-version>`_ eine Offlineversion heruntergeladen werden. Sobald das Programm im Browser initialisiert wurde, müssen die folgenden Schritte beachtet werden:
es: Vaya a la página de `BIP39 Convertidor de código Mnemonic <https://iancoleman.io/bip39/>`_. Esta es una herramienta útil para manipular/mostrar los datos de semilla BIP32/39. Si no te sientes cómodo realizando este procedimiento en línea, se encuentra disponible una versión fuera de línea descargando el archivo descrito en `estas instrucciones <https://github.com/iancoleman/bip39#standalone-offline-version>`_. Una vez que la herramienta este cargada en tu navegador, completa los siguientes pasos:
fr: Allez sur la page du `convertisseur de code mnémotechnique BIP39 <https://iancoleman.io/bip39/>`_. Il s'agit d'un outil très pratique pour manipuler et afficher les données des graines BIP32/39. Si vous n'êtes pas très à l'aise à l'idée d'opérer cette procédure en ligne, une version hors ligne est disponible en téléchargeant le fichier décrit dans `ces instructions <https://github.com/iancoleman/bip39#standalone-offline-version>`_. Une fois l'outil chargé dans votre navigateur, suivez les étapes suivantes :
it: Vai alla pagina `BIP39 Mnemonic Code Converter <https://iancoleman.io/bip39/>`_. Questo è uno strumento utile per manipolare/visualizzare i dati seed BIP32/39. Se non ti senti a tuo agio nell'eseguire questa procedura online, è disponibile una versione offline scaricando il file descritto in `queste istruzioni <https://github.com/iancoleman/bip39#standalone-offline-version>`_. Una volta caricato lo strumento nel browser, completa i seguenti passaggi:
ru: Перейдите на страницу `Конвертер мнемонического кода BIP39 <https://iancoleman.io/bip39/>`_. Это полезный инструмент для манипуляции/отображения даных сидов BIP32/39. Если вам неудобно выполнять эту процедуру онлайн, то можно загрузить офлайн версию, скачав файл, описанный в `этих инструкциях <https://github.com/iancoleman/bip39#standalone-offline-version>`_. Как только инструмент будет загружен в ваш браузер, следуйте следующим шагам:

source: Enter your 12 word seed phrase in the **BIP39 Mnemonic** field.
ar: أدخل عبارة بذور 12 كلمة في حقل **BIP39 Mnemonic**.
de: Die 12 Worte der Wiederherstellungsphrase in das Feld **BIP39 Mnemonic** eintragen.
es: Ingresa tu frase inicial de 12 palabras en el campo **BIP39 Mnemónico**.
fr: Saisissez votre graine (phrase de 12 mots) dans le champ **BIP39 Mnemonic**.
it: Inserisci la tua frase seed di 12 parole nel campo **BIP39 Mnemonico**.
ru: Введите вашу сид-фразу, состоящую из 12 слов в поле **BIP39 Mnemonic**.

source: Leave **BIP39 Passphrase** blank.
ar: اترك **BIP39 عبارة المرور** فارغة.
de: **BIP39 Passphrase** leer lassen.
es: Dejar la **BIP39 Frase de acceso** en blanco.
fr: Laissez **BIP39 Passphrase** vide.
it: Lasciare vuota la **Frase password BIP39**.
ru: Покиньте вкладку **BIP39 Passphrase**.

source: Set coin to **Dash**.
ar: تعيين عملة على **Dash**.
de: **Dash** als Coin auswählen.
es: Establecer moneda a **Dash**.
fr: Réglez la monnaie sur **Dash**.
it: Imposta la moneta su **Dash**.
ru: Переключите валюту на **Dash**.

source: Under **Derivation Path**, click the **BIP44** tab.
ar: تحت **مسار اشتقاق** ، انقر فوق علامة التبويب **BIP44**.
de: Unter **Derivation Path** auf den **BIP44** Tab klicken.
es: En **Ruta de derivación**, haga clic en la pestaña **BIP44**.
fr: Dans **Derivation Path**, cliquez sur l'onglet **BIP44**.
it: In **Percorso di derivazione**, fare clic sulla scheda **BIP44**.
ru: Под **Derivation Path**, кликните на вкладку **BIP44**.

source: Copy the value shown in **Account Extended Private Key**.
ar: انسخ القيمة المعروضة في **مفتاح خاص للمفتاح الخاص بالحساب**.
de: Den Wert unter **Account Extended Private Key** kopieren.
es: Copiar el valor mostrado en **Llave Privada de Cuenta Extendida**
fr: Copiez la valeur affichée dans **Account Extended Private Key**.
it: Copia il valore mostrato in **Chiave privata estesa dell'account**.
ru: Скопируйте значение показанное в поле **Account Extended Private Key**.

source: Importing the xprv key into Dash Electrum
ar: استيراد مفتاح xprv إلى داش إلكتروم
de: Den xprv-Schlüssel nach Dash Electrum kopieren
es: Importar la llave xprv en Dash Electrum
fr: Importation de la clé xprv dans Dash Electrum
it: Importazione della chiave xprv in Dash Electrum
ru: Импортируйте ключ xprv в кошелёк Dash Electrum

source: Open Dash Electrum and click **File** -> **New/Restore**.
ar: افتح داش إلكتروم وانقر على **مجلد** -> **جديد / إستراد**.
de: Dash Electrum öffnen und dann auf **File** -> **New/Restore** klicken.
es: Abrir Dash Electrum y hacer clic en **Archivo** -> **Nueva/Restaurar**.
fr: Lancez Dash Electrum et choisissez le menu **Fichier** -> **Nouveau/Restaurer**.
it: Apri Dash Electrum e fai clic su **File** -> **Nuovo/Ripristina**.
ru: Откройте кошелёк Dash Electrum и кликните **Файл** -> **Создать/Восстановить**.

source: Type a name for your wallet.
ar: اكتب اسمًا لمحفظتك.
de: Einen Namen für die Wallet eingeben.
es: Escribe un nombre para tu billetera.
fr: Donnez un nom à votre portefeuille.
it: Digita un nome per il tuo wallet.
ru: Наберите имя вашего кошелька.

source: Select **Standard wallet**.
ar: حدد **المحفظة العادية**.
de: **Standard wallet** auswählen.
es: Selecciona **Billetera estándar**.
fr: Choisissez **Portefeuille standard**.
it: Seleziona **Wallet standard**.
ru: Выберите **Стандартный кошелёк**

source: Select **Use public or private keys**.
ar: حدد **إستخدم مفاتيح عامة أو خاصة**.
de: **Use public or private keys** auswählen.
es: Selecciona **Usar llaves públicas o privadas**.
fr: Choisissez **Utilisez des clés publiques ou privées**.
it: Seleziona **Utilizza chiavi pubbliche o private**.
ru: Выберите **Use public or private keys**.

source: Paste in your value from **Account Extended Private Key**.
ar: الصق قيمتك من **مفتاح خاص للمفتاح الخاص بالحساب**.
de: Den Wert aus **Account Extended Private Key** einfügen.
es: Pegar en su valor de **Llave Privada de Cuenta Extendida**.
fr: Collez la valeur que vous aviez copiée dans **Account Extended Private Key**.
it: Incolla il tuo valore da **Chiave privata estesa dell'account**.
ru: Вставьте значение из поля **Account Extended Private Key**.

source: Optionally enter a password.
ar: اختياريا أدخل كلمة مرور.
de: Optionalerweise kann ein Passwort eingegeben werden.
es: Ingresa opcionalmente una contraseña.
fr: Saisissez un mot de passe si vous le souhaitez.
it: Facoltativamente inserire una password.
ru: При желании введите пароль.

source: Dash Electrum should now detect your Dash iOS balance and you should have complete access to your funds. The seed phrase won't be available in Dash Electrum , so you will just need to follow the steps above again if you want to restore this wallet from the recovery phrase again. It is recommended to send your funds to a new Dash Electrum wallet instead and follow :ref:`standard backup procedures <electrum-backup>`.
ar: يجب أن يكتشف داش إلكتروم الآن رصيد داش في الأيفون ويجب أن يكون لديك إمكانية الوصول الكامل إلى أموالك. لن تكون عبارة البذور متاحة في داش إلكتروم ، لذلك ستحتاج فقط إلى اتباع الخطوات المذكورة أعلاه مرة أخرى إذا كنت تريد استعادة هذه المحفظة من كلمة الإستراد مرة أخرى. من المستحسن إرسال أموالك إلى محفظة داش إلكتروم جديدة بدلاً من ذلك ومتابعتها :ref:`إجراءات النسخ الاحتياطي القياسية <electrum-backup>`.
de: Dash Electrum sollte nun das Dash iOS Guthaben darstellen und es sollte möglich sein dieses zu verwenden. Die Wiederherstellungsphrase kann in Dash Electrum nicht angezeigt werden, weswegen diese Schritte wiederholt werden müssten, sollte diese Wallet erneut wiederhergestellt werden müssen. Es wird empfohlen das Guthaben an eine neue Dash Electrum Wallet zu versenden und dabei dem :ref:`normalen Sicherungsvorgang <electrum-backup>` zu folgen.
es: Dash Electrum ahora debe detectar tu saldo de Dash en iOS y debes tener acceso completo a tus fondos. La frase inicial no estará disponible en Dash Electrum, por lo que solo tendrás que seguir los pasos anteriores nuevamente si deseas restaurar nuevamente esta billetera con la frase de recuperación. Se recomienda que envíes tus fondos a una nueva billetera Dash Electrum y sigas los :ref:`procedimientos de respaldo estándares <electrum-backup>`.
fr: Dash Electrum devrait alors détecter votre solde Dash iOS, et vous devriez avoir un accès complet à vos fonds. La phrase de graine ne sera pas disponible dans Dash Electrum, vous aurez donc besoin de suivre à nouveau les étapes ci-dessus si vous souhaitez restaurer à nouveau votre portefeuille depuis sa phrase de récupération. Il est plutôt recommandé d'envoyer les fonds à un nouveau portefeuille Dash Electrum en suivant la :ref:`procédure standard de sauvegarde <electrum-backup>`.
it: Dash Electrum ora dovrebbe rilevare il saldo del tuo Dash iOS e dovresti avere accesso completo ai tuoi fondi. La frase seed non sarà disponibile in Dash Electrum, quindi dovrai semplicemente seguire nuovamente i passaggi precedenti se desideri ripristinare nuovamente questo wallet dalla frase di ripristino. Si consiglia invece di inviare i fondi a un nuovo wallet Dash Electrum e seguire le :ref:`procedure di backup standard <electrum-backup>`.
ru: Кошелёк Dash Electrum теперь должен обнаружить баланс кошелька Dash iOS и у вас должен появиться полный доступ к вашим средствам. Сид-фраза не будет доступна в Dash Electrum, поэтому, если вы хотите снова восстановить этот кошелек с помощью фразы восстановления, то вам просто нужно будет повторить шаги, описанные выше. Вместо этого рекомендуется отправить свои деньги на новый кошелек Dash Electrum и следовать :ref:`стандартные шаги резервного копирования <electrum-backup>`.

source: Older versions of the Dash iOS wallet used **BIP32** addresses under the ``m/0'`` derivation path. The wallet should migrate these funds over to BIP44 addresses during normal use, but some residual balance may be under this derivation path, so restoring the **BIP32 Extended Private Key** may be helpful in some situations. Please see `this forum thread <https://www.dash.org/forum/threads/restore-breadwallet-dash-funds-to-your-electrum-dash-wallet-tested.8335/>`_ for further discussion on this process.
fr: D'anciennes versions du portefeuille Dash iOS utilisaient des adresses **BIP32** avec le chemin de dérivation ``m/0``. Le portefeuille devrait normalement migrer ces fonds vers des adresses BIP44, mais un solde résiduel peut persister sous ce chemin de dérivation, ce qui signifie que restaurer la **clé privée étendue BIP32** peut être utile dans certaines situations. Veuillez consulter `ce fil de discussion sur le forum <https://www.dash.org/forum/threads/restore-breadwallet-dash-funds-to-your-electrum-dash-wallet-tested.8335/>`_ pour en savoir plus sur cette procédure.
it: Le versioni precedenti del portafoglio Dash iOS utilizzavano indirizzi **BIP32** nel percorso di derivazione ``m/0'``. Il wallet dovrebbe migrare questi fondi agli indirizzi BIP44 durante il normale utilizzo, ma parte del saldo residuo potrebbe trovarsi in questo percorso di derivazione, quindi ripristinare la **chiave privata estesa BIP32** potrebbe essere utile in alcune situazioni. Consulta questo thread del forum <https://www.dash.org/forum/threads/restore-breadwallet-dash-funds-to-your-electrum-dash-wallet-tested.8335/>`_ per ulteriori discussioni su questo processo.
ru: Более старые версии кошелька Dash для iOS используют адреса **BIP32**, имеющие путь расположения ``m/0'``. Во время обычного использования кошелёк должен перенести эти средства на адреса BIP44, но некоторый остаточный баланс может находиться по этому пути расположения, поэтому восстановление некоторых **BIP32 Extended Private Key** в некоторых случаях может быть полезным. Посетите пожалуйста `эту ветку форума <https://www.dash.org/forum/threads/restore-breadwallet-dash-funds-to-your-electrum-dash-wallet-tested.8335/>`_ для дальнейшей дискуссии по этому процессу.

source: Private Keys
ar: مفاتيح خاصة
es: Llaves privadas
fr: Clés privées
it: Chiavi Private
ru: Приватные ключи

source: Most wallets offer a function to import an address from a private key, see the documentation for your wallet for specific instructions. While private keys can be stored in many ways, in this example we will work through the process of restoring a private key from a paper wallet using Dash Core. If you only have a QR code and not the key, use a barcode scanning app (`Android <https://play.google.com/store/apps/details?id=com.google.zxing.client.android>`_ or `iOS <https://apps.apple.com/us/app/quick-scan-qr-code-reader/id483336864>`_) to read the code first.
fr: La plupart des portefeuilles proposent une fonctionnalité d'importation d'une adresse depuis une clé privée (voir la documentation pour des instructions spécifiques à votre portefeuille). Les clés privées peuvent être récupérées suivant de nombreuses méthodes. Dans cet exemple, nous montrerons comment récupérer la clé privée d'un portefeuille papier en utilisant le logiciel Dash Core. Si vous ne disposez que d'un QR-code et non de la clé, utilisez une application de lecture de code-barres (`Android <https://play.google.com/store/apps/details?id=co m.google.zxing.client.android>`_ ou `iOS <https://apps.apple.com/us/app/quick-scan-qr-code-reader/id483336864>`_) pour lire le code d'abord.
it: La maggior parte dei wallet offre una funzione per importare un indirizzo da una chiave privata, consulta la documentazione del tuo wallet per istruzioni specifiche. Sebbene le chiavi private possano essere archiviate in molti modi, in questo esempio lavoreremo attraverso il processo di ripristino di una chiave privata da un paper wallet utilizzando Dash Core. Se hai solo un codice QR e non la chiave, utilizza un'app per la scansione dei codici a barre ("Android <https://play.google.com/store/apps/details?id=com.google.zxing.client.android>" _ o `iOS <https://apps.apple.com/us/app/quick-scan-qr-code-reader/id483336864>`_) per leggere prima il codice.
ru: Большинство кошельков предлагают функцию импорта адреса из приватного ключа, смотрите документацию для вашего кошелька с конкретными инструкциями. Хотя приватные ключи можно хранить разными способами, в этом примере мы будем работать с процессом восстановления приватного ключа из бумажного кошелька с использованием Dash Core. Если у вас есть только QR-код, а не ключ, используйте приложение сканирования штрих-кода (для `Android <https://play.google.com/store/apps/details?id=com.google.zxing.client.android>`_ или для `iOS <https://app.apple.com/us/app/quick-scan-qr-code-reader/id483336864>`_), чтобы сначала прочитать код.

source: First, start Dash Core and unlock your wallet by selecting **Settings > Unlock Wallet**. Enter your password, then open the debug console by selecting **Window > Console**. In the console, type the following, replacing the example private key with your key::
it: Innanzitutto, avvia Dash Core e sblocca il tuo wallet selezionando **Impostazioni > Sblocca wallet**. Inserisci la tua password, quindi apri la console di debug selezionando **Finestra > Console**. Nella console, digita quanto segue, sostituendo la chiave privata di esempio con la tua chiave::
ru: Сначала, запустите Dash Core и разблокируйте свой кошелёк, нажав **Настройки > Разблокировать кошелек**. Введите свой пароль, затем откройте консоль отладки нажав **Окно> Консоль**. В консоли наберите следующее, заменив образец приватного ключа своим ключом::

source: Importing a private key using the debug console in Dash Core wallet
ar: استيراد مفتاح خاص باستخدام وحدة تصحيح الأخطاء في محفظة داش كور
de: Importieren von privaten Schlüsseln über die Debugkonsole im Dash Core Wallet
es: Importación de una llave privada usando la consola de depuración en la billetera de Dash Core
fr: Importation d'une clé privée en utilisant la console de débogage du portefeuille logiciel Dash Core
it: Importazione di una chiave privata utilizzando la console di debug nel wallet Dash Core
ru: Импорт приватного ключа с использованием консоли отладки в кошельке Dash Core

source: Dash Core will rescan the blockchain for transactions involving the public address of this key and enter the transactions and balance in your wallet.
ar: ستقوم داش كور بإعادة فحص بلوكشين للمعاملات التي تتضمن العنوان العام لهذا المفتاح وإدخال المعاملات والتوازن في محفظتك.
de: Dash Core scannt die Blockchain nach Transaktionen, die die öffentliche Adresse dieses Schlüssels betreffen und gibt nun die Transaktionen und den passenden Saldo in der Wallet an.
es: Dash Core volverá a examinar la cadena de bloques para las transacciones que involucran la dirección pública de esta llave e ingresar las transacciones y el saldo en tu billetera.
fr: Dash Core rebalayera la blockchain pour trouver les transactions impliquant l'adresse publique de cette clé, identifier les transactions et recalculer le solde de votre portefeuille.
it: Dash Core eseguirà nuovamente la scansione della blockchain per le transazioni che coinvolgono l'indirizzo pubblico di questa chiave e inserirà le transazioni e il saldo nel tuo wallet.
ru: Dash Core пересканирует блокчейн для транзакций, использующих публичный адрес этого ключа и покажет транзакции и баланс в вашем кошельке.

source: The private key must be in wallet import format (WIF). If your key is encrypted using BIP38 (key begins with 6P instead of 7), you must first decrypt it to view the key in WIF. To do so, go to https://paper.dash.org/ and click **Wallet Details**. Enter the encrypted private key in the field and click **View Details**. You will be prompted for the password, and your keys will be decrypted. Find the key named **Private Key WIF** and import this into your wallet.
ar: يجب أن يكون المفتاح الخاص بتنسيق استيراد المحفظة (WIF). إذا تم تشفير المفتاح الخاص بك باستخدام BIP38 (يبدأ المفتاح بـ 6P بدلاً من 7) ، فيجب عليك أولاً فك تشفيره لعرض المفتاح في WIF. للقيام بذلك ، انتقل إلى https://paper.dash.org/ وانقر فوق **تفاصيل المحفظة**. أدخل المفتاح الخاص المشفر في الحقل وانقر فوق **عرض التفاصيل**. ستتم مطالبتك بكلمة المرور ، وسيتم فك تشفير المفاتيح. ابحث عن المفتاح المسمى **المفتاح الخاص WIF** وقم باستيراده إلى محفظتك.
de: Der private Schlüssel muss im WIF-Format (Wallet Import Format) vorhanden sein. Falls der Schlüssel mit BIP38 verschlüsselt ist (der Schlüssel beginnt mit 6P statt mit 7), muss er zuerst entschlüsselt werden, damit der Schlüssel als WIF angezeigt wird. Um dies zu tun, muss auf https://paper.dash.org/ auf **Wallet Details** geklickt werden. Der verschlüsselte private Schlüssel muss in das Feld eingeben und auf **Details anzeigen** geklickt werden. Das Passwort wird abgefragt und die Schlüssel werden wieder entschlüsselt. Der Schlüssel mit dem Namen **Private Key WIF** muss nun in die Wallet importiert werden.
es: La llave privada debe estar en formato de importación de billetera (WIF). Si tu llave está encriptada usando BIP38 (la llave comienza con 6P en vez de 7), primero debes descifrarla para ver la llave en WIF. Para hacerlo, ve a https://paper.dash.org/ y haz clic en **Detalles de la billetera**. Ingresa la llave privada encriptada en el campo y haz clic en **Ver detalles**. Se te pedirá la contraseña y sus llaves se descifrarán. Busca la llave llamada **llave privada WIF** e importa esto en tu billetera.
fr: La clé privée doit être au format d'importation de portefeuille (WIF). Si votre clé est chiffrée en utilisant BIP38 (la clé commence par 6P au lieu de 7), vous devez d'abord la déchiffrer pour l'afficher en WIF. Pour ce faire, allez sur https://paper.dash.org/ et cliquez sur **Détails du portefeuille**. Saisissez la clé privée chiffrée dans ce champ puis cliquez sur **Afficher les détails**. Votre mot de passe vous sera demandé, et vos clés seront déchiffrées. Trouvez la clé nommée **Clé privée WIF** et importez-la dans votre portefeuille.
it: La chiave privata deve essere nel formato di importazione del wallet (WIF). Se la tua chiave è crittografata utilizzando BIP38 (la chiave inizia con 6P anziché 7), devi prima decrittografarla per visualizzare la chiave in WIF. Per farlo, vai su https://paper.dash.org/ e fai clic su **Dettagli wallet**. Inserisci la chiave privata crittografata nel campo e fai clic su **Visualizza dettagli**. Ti verrà richiesta la password e le tue chiavi verranno decrittografate. Trova la chiave denominata **Private Key WIF** e importala nel tuo wallet.
ru: Приватный ключ должен быть в формате импорта кошелька (WIF). Если ваш ключ зашифрован с использованием BIP38 (ключ начинается с 6P вместо 7), то следует сначала расшифровать его, чтобы увидеть ключ в формате WIF. Чтобы сделать это - отправляйтесь по адресу https://paper.dash.org/ и кликните **Wallet Details**. В поле введите расшифрованный приватный ключ и кликните **View Details**. Вам будет предложено ввести пароль, после чего ваши ключи будут расшифрованы. Найдите ключ, который называется **Private Key WIF** и импортируйте его в свой кошелёк.

source: *Decrypting a BIP38 encrypted key to WIF for import in Dash Core wallet*
ar: *فك تشفير مفتاح BIP38 مشفر إلى WIF للاستيراد في محفظة داش كور*
de: *Einen mit BIP38 verschlüsselten Schlüssel zu WIF entschlüsseln und in die Dash Core Wallet importieren*
es: *Desencriptar una llave encriptada BIP38 para WIF para su importación en la billetera de Dash Core*
fr: *Déchiffrage d'une clé chiffrée BIP38 vers le format WIF avant importation dans le logiciel portefeuille Dash Core*
it: *Decrittografia di una chiave crittografata BIP38 su WIF per l'importazione nel wallet Dash Core*
ru: *Расшифровка закондированного в BIP38 ключа в формат WIF для импорта в кошелёк Dash Core*

source: Forgotten Passwords
ar: كلمات المرور المنسية
de: Vergessene Passwörter
es: Contraseñas olvidadas
fr: Mots de passe oubliés
it: Password dimenticate
ru: Забытые пароли
