Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/recovery.po
Languages: ar, de, es, fr, it, ru

source: One of the most common wallet backup formats is a *wallet.dat* file from Dash Core wallet. Before you begin, make absolutely sure that you have a copy of this file stored somewhere safe in case the restore process accidentally corrupts your wallet file! In most cases, *wallet.dat* backups will also be protected by a password, which you will need to know to regain access to your Dash funds. If you already have Dash Core installed, first ensure it has been updated to the latest version by clicking **Help > About Dash Core**. Compare this with the latest available version of `Dash Core on the website <https://www.dash.org/downloads/>`_ as follows:
fr: Un des formats les plus communs de fichier de sauvegarde est le fichier *wallet.dat* du portefeuille logiciel Dash Core. Avant de commencer, soyez absolument certain d'avoir une copie de ce fichier stockée dans un endroit sûr, au cas où la procédure de sauvegarde corromprait accidentellement votre fichier portefeuille ! Dans la plupart des cas, les sauvegardes de *wallet.dat* seront aussi protégées par un mot de passe dont vous aurez besoin pour retrouver l'accès à vos fonds Dash. Si vous avez déjà le logiciel Dash Core installé, assurez-vous d'abord que vous disposez de sa plus récente version en cliquant sur **Aide > À propos de Dash Core**. Comparez cette version avec la version la plus récente disponible sur `le site web Dash Core <https://www.dash.org/fr/telechargements>`_ en procédant ainsi :
it: Uno dei formati di backup del wallet più comuni è un file *wallet.dat* del wallet Dash Core. Prima di iniziare, assicurati di avere una copia di questo file archiviata in un posto sicuro nel caso in cui il processo di ripristino corrompe accidentalmente il file del tuo wallet! Nella maggior parte dei casi, i backup di *wallet.dat* saranno protetti anche da una password, che dovrai conoscere per riottenere l'accesso ai tuoi fondi Dash. Se hai già installato Dash Core, assicurati innanzitutto che sia stato aggiornato alla versione più recente facendo clic su **Guida > Informazioni su Dash Core**. Confrontalo con l'ultima versione disponibile di `Dash Core sul sito web <https://www.dash.org/downloads/>`_ come segue:
ru: Одним из наиболее распространённых форматов резервного копирования кошельков является файл *wallet.dat* кошелька Dash Core. Прежде чем начать пользоваться кошельком, убедитесь, что у вас есть копия этого файла, хранящаяся в безопасном месте, на случай, если процесс восстановления случайно повредит ваш файл кошелька! В большинстве случаев резервные копии *wallet.dat* также будут защищены паролем, который нужно знать, чтобы восстановить доступ к вашим средствам DASH. Если у вас уже установлен Dash Core, сначала убедитесь, что он обновлён до последней версии, нажав **Помощь > О Dash Core**. Сравните версию вашего кошелька с последней доступной версией `Dash Core на сайте <https://www.dash.org/ru/downloads/>`_ как показано ниже:

source: Comparing the installed version of Dash Core with the latest version available on the website
ar: مقارنة الإصدار المثبت من داش كور مع أحدث إصدار متاح على موقع الرئيسي
de: Die installierte Version von Dash Core mit der aktuellsten Version von der Website vergleichen
es: Comparando la versión instalada de Dash Core con la última versión disponible en el sitio web
fr: Comparaison de la version installée du logiciel Dash Core avec la version la plus récente disponible sur le site web
it: Confronto della versione installata di Dash Core con l'ultima versione disponibile sul sito web
ru: Сравнение установленной версии Dash Core с последней версией, доступной на веб-сайте

source: Update Dash Core to the latest version according to the :ref:`installation instructions <dashcore-installation>`. If you have only a wallet file and no existing installation of Dash Core, simply install Dash Core according to the :ref:`installation instructions <dashcore-installation>` and start it once to create the DashCore folder. Then close Dash Core and copy the *wallet.dat* file you want to restore to the DashCore folder in the location specified below, replacing or renaming the existing file.
ar: تحديث داش كور لأحدث إصدار وفقا ل :ref:`تعليمات التحميل <dashcore-installation>`، إذا كان لديك ملف محفظة فقط ولا يوجد تثبيت موجود لـ داش كور ، فقم ببساطة بتثبيت داش كور وفقًا لـ :ref:`تعليمات التحميل <dashcore-installation>` وبدء تشغيله مرة واحدة لإنشاء مجلد داش كور. ثم أغلق داش كور وانسخ ملف *wallet.dat* الذي تريد استعادته إلى حافظة داش كور في الموقع المحدد أدناه ، لتحل محل أو إعادة تسمية الملف الموجود.
de: Dash Core entsprechend der :ref:`Installationsanleitung <dashcore-installation>` auf die neueste Version bringen. Falls nur eine Wallet-Datei und keine existierende Installation von Dash Core vorhanden ist, muss Dash Core gemäß der :ref:`Installationsanleitung <dashcore-installation>` installiert und einmal gestartet werden, um den Ordner DashCore zu erzeugen. Danach muss Dash Core geschlossen werden und die Datei *wallet.dat* muss zur Wiederherstellung in den DashCore-Ordner an dem unten angegebenen Speicherort kopiert werden, wodurch die vorhandene Datei ersetzt wird.
es: Actualiza el Dash Core a la última versión de acuerdo con las :ref:`instrucciones de instalación <dashcore-installation>`. Si solo tienes un archivo de billetera y no hay instalación existente de Dash Core, simplemente instala Dash Core de acuerdo con las :ref:`instrucciones de instalación <dashcore-installation>` e inícialo de una vez para crear la carpeta DashCore. A continuación, cierra el Dash Core y copia el archivo *wallet.dat* que deseas restaurar en la carpeta DashCore en la ubicación especificada a continuación, reemplazando o renombrando el archivo existente.
fr: Mettez à jour le logiciel Dash Core en suivant les :ref:`instructions d'installation <dashcore-installation>`. Si vous disposez seulement d'un fichier portefeuille mais pas d'un logiciel Dash Core déjà installé, il vous suffit d'installer Dash Core en suivant les :ref:`instructions d'installation <dashcore-installation>` et de le démarrer une fois pour qu'il vous crée un répertoire DashCore. Ensuite, quittez le logiciel Dash Core et copiez le fichier *wallet.dat* que vous voulez restaurez dans le répertoire DashCore à l'emplacement spécifié ci-dessous, en remplaçant ou en renommant le fichier déjà existant.
it: Aggiorna Dash Core alla versione più recente seguendo le :ref:`istruzioni di installazione `. Se hai solo un file wallet e nessuna installazione esistente di Dash Core, installa semplicemente Dash Core seguendo le :ref:`istruzioni di installazione ` e avvialo una volta per creare la cartella DashCore. Quindi chiudi Dash Core e copia il file *wallet.dat* che desideri ripristinare nella cartella DashCore nella posizione specificata di seguito, sostituendo o rinominando il file esistente.
ru: Обновите Dash Core до последней версии в соответствии с :ref:`инструкции по инсталляции <dashcore-installation>`. Если у вас имеется только файл кошелька и нет установленной версии Dash Core, то просто установите Dash Core в соответствии с :ref:`инструкции по инсталляции <dashcore-installation>` после чего единожды запустите его для создания папки DashCore. Затем закройте Dash Core и скопируйте файл *wallet.dat*, который хотите восстановить в папку DashCore, расположенную по адресу, указанному ниже, заменив или переименовав существующий файл.

source: Platform
ar: المنصة
de: Plattform
es: Plataforma
fr: Plateforme
ru: Платформа

source: Path to data folder
ar: المسار إلى مجلد البيانات
de: Dateiverzeichnis
es: Ruta a la carpeta de datos
fr: Chemin du répertoire de données
it: Percorso della cartella dati
ru: Путь к папке с данными

source: How to navigate
ar: كيفية التنقل
de: Wie navigieren
es: Como navegar
fr: Comment naviguer
it: Come navigare
ru: Навигация

source: Go to your home folder and press **Ctrl+H** to show hidden files, then open ``.dashcore``
ar: انتقل إلى المجلد الرئيسي واضغط على **Ctrl + H** لإظهار الملفات المخفية ، ثم افتح ``.dashcore``
de: Im Home-Verzeichnis **Strg+H** drücken, damit versteckte Dateien angezeigt werden, danach ``.dashcore`` öffnen
es: Ve a tu carpeta de inicio y presionea **Ctrl + H** para mostrar los archivos ocultos, luego abre ``.dashcore``
fr: Allez dans votre dossier utilisateur et faites la combinaison de touches **Ctrl-H** pour afficher les fichiers cachés, puis ouvrez le répertoire ".dashcore"
it: Vai alla tua cartella Home e premi **Ctrl+H** per mostrare i file nascosti, quindi apri ``.dashcore``
ru: Откройте домашнюю папку и нажмите **Ctrl+H** для отображения скрытых файлов, затем откройте ``.dashcore``

source: Press **Shift + Command + G**, type ``~/Library/Application Support``, then open ``DashCore``
fr: Faites la combinaison de touches **Shift + Command + G**, tapez ``~/Library/Application Support``, puis ouvrez le dossier ``DashCore``
it: Premi **Shift + Command + G**, digita ``~/Library/Application Support``, quindi apri ``DashCore``
ru: Нажмите **Shift + Command+ G**, наберите ``~/Library/Application Support``, затем откройте ``DashCore``

source: Press **Windows Key + R** and type ``%APPDATA%``, then open ``DashCore``
ar: اضغط على **Windows Key + R** واكتب ``%APPDATA٪`` ، ثم افتح ``داش كور``
de: **Windows Key + R** drücken and ``%APPDATA%`` eingeben und dann ``DashCore`` öffnen
es: Presiona **tecla de Windows + R** y escribe ``%APPDATA%``, luego abre ``DashCore``
fr: Faites la combinaison de touches **Windows Key + R** et tapez ``%APPDATA%``, puis ouvrez le répertoire ``DashCore``
it: Premi **Tasto Windows + R** e digita ``%APPDATA%``, quindi apri ``DashCore``
ru: Нажмите **Windows Key + R** и наберите ``%APPDATA%``, затем откройте ``DashCore``

source: If your existing version of Dash Core is older than v0.12.1.x, you may need to rename your data folder from ``Dash`` to ``DashCore``.
ar: إذا كان الإصدار الحالي من داش كور أقدم من الإصدار v0.12.1.x ، فقد تحتاج إلى إعادة تسمية مجلد البيانات من ``داش`` إلى ``داش كور``.
de: Wenn die existierende Version von Dash Core älter als v0.12.1.x ist, muss der Dateiordner von ``Dash`` auf ``DashCore`` umbenannt werden.
es: Si tu versión actual de Dash Core es anterior a v0.12.1.x, es posible que necesites cambiar el nombre de tu carpeta de datos de ``Dash`` a ``DashCore``.
fr: Si votre version existante du logiciel Dash Core est plus ancienne que la version 0.12.1.x, vous aurez peut-être besoin de renommer votre répertoire de données "Dash" en "DashCore".
it: Se la versione esistente di Dash Core è precedente alla v0.12.1.x, potrebbe essere necessario rinominare la cartella dei dati da "Dash" a "DashCore".
ru: Если существующая версия Dash Core у вас старее, чем v0.12.1.x, то может потребоваться переименовать папку с данными из ``Dash`` в ``DashCore``.

source: To repair a broken installation, navigate to the DashCore folder and delete all *.log* and *.dat* files except *wallet.dat*. The following files can be safely deleted:
ar: لإصلاح عملية تثبيت مقطوعة ، انتقل إلى المجلد داش كور واحذف كافة ملفات *.log* و *dat* باستثناء *wallet.dat*. يمكن حذف الملفات التالية بأمان:
de: Wenn die Installation korrumpiert wurde, müssen alle *.log* und *.dat* Dateien außer *wallet.dat* aus dem DashCore-Ordner gelöscht werden. Die folgenden Dateien können alle sicher gelöscht werden:
es: Para reparar una instalación interrumpida, ve a la carpeta DashCore y elimina todos los archivos *.log* y *.dat* excepto *wallet.dat*. Los siguientes archivos se pueden eliminar de forma segura:
fr: Pour réparer une installation défectueuse, naviguez jusqu'au répertoire DashCore et effacer tous les fichiers *.log* et *.dat*, à l'exception du fichier *wallet.dat*. Les fichiers suivants peuvent être effacés en toute sécurité :
it: Per riparare un'installazione interrotta, accedi alla cartella DashCore ed elimina tutti i file *.log* e *.dat* tranne *wallet.dat*. I seguenti file possono essere eliminati in modo sicuro:
ru: Для исправления неудавшейся инсталляции, перейдите в папку DashCore и удалите все *.log* и *.dat* файлы, кроме *wallet.dat*. Удаление следующих файлов не принесёт вреда:

source: Leave ``.conf`` files and the folders (such as ``backups``, ``blocks``, ``chainstate``, etc.) intact, since they will help you get started faster by providing a copy of the blockchain and your settings.
ar: اترك الملفات ``.conf`` والمجلدات (مثل ``backups``، ``blocks``، ``chainstate``، إلى أخره.) سليمة ، لأنها سوف تساعدك على البدء بشكل أسرع من خلال توفير نسخة من بلوكشين والإعدادات الخاصة بك.
de: Die ``.conf``-Dateien und die Ordner (wie z.B. ``backups``, ``blocks``, ``chainstate``, etc.) können bestehen bleiben, da durch diese eine schnellere Einrichtung der Blockchain und der Einstellungen möglich ist.
es: Deja intactos los archivos ``.conf`` y las carpetas (como ``backups``, ``blocks``, ``chainstate``, etc.), ya que te ayudarán a comenzar más rápido al proporcionar una copia de la cadena de bloques y tu configuración
fr: Laissez intacts les fichiers ".conf" et les répertoires (tels que "backups", "blocks", "chainstate", etc.), car ils vous permettront un démarrage plus rapide en vous fournissant une copie de la blockchain et de vos réglages.
it: Lascia intatti i file ``.conf`` e le cartelle (come ``backups``, ``blocks``, ``chainstate``, ecc.), poiché ti aiuteranno a iniziare più velocemente fornendo una copia della blockchain e le tue impostazioni.
ru: ``.conf`` файлы и папки (такие как ``backups``, ``blocks``, ``chainstate``, и т.п.) не изменяйте, поскольку они помогут быстрее запустить кошелёк, обеспечив загрузку копии блокчейна и ваших настроек.

source: Now open Dash Core and wait for blockchain synchronization to complete. Your wallet will be restored/upgraded and all balances should be displayed. You should ensure you have the correct password by trying to unlock your wallet from **Settings > Unlock Wallet** to make sure you can actually create transactions using your balances. If you have any problems with your balance not appearing, try to force a rescan of the blockchain by going to **Window > Wallet Repair** and selecting **Rescan blockchain files**. **Rebuild index** may also help. Dash Core will restart and perform a full scan of the blockchain.
it: Ora apri Dash Core e attendi il completamento della sincronizzazione della blockchain. Il tuo wallet verrà ripristinato/aggiornato e tutti i saldi dovrebbero essere visualizzati. Dovresti assicurarti di avere la password corretta provando a sbloccare il tuo wallet da **Impostazioni > Sblocca wallet** per assicurarti di poter effettivamente creare transazioni utilizzando i tuoi saldi. Se riscontri problemi con la mancata visualizzazione del saldo, prova a forzare una nuova scansione della blockchain andando su **Finestra > Riparazione wallet** e selezionando **Riscansiona file blockchain**. Anche **Ricostruire l'indice** può essere d'aiuto. Dash Core si riavvierà ed eseguirà una scansione completa della blockchain.
ru: Теперь откройте кошелёк Dash Core и дождитесь завершения синхронизации с блокчейном. Ваш кошелёк будет восстановлен/обновлён, а все балансы должны отобразиться на экране. Вы должны убедиться, что имеете правильный пароль, попытавшись разблокировать кошелёк с помощью **Настройки» > Разблокировать кошелёк**, чтобы удостовериться, что вы действительно можете создавать транзакции, используя свои балансы. Если у вас возникли проблемы с отсутствием баланса, попробуйте принудительно выполнить повторное сканирование блокчейна, перейдя в **Инструменты > Ремонт кошелька** и выбрав **Пересканировать блокчейн**. Также может помочь опция **Перестроить индекс**. Dash Core перезапустится и выполнит полное сканирование блокчейна.

source: Forcing Dash Core to rescan the blockchain
ar: مما اضطر داش كور لإعادة فحص البلوكشين
de: Dash Core befehlen die Blockchain erneut zu durchsuchen
es: Forzar a Dash Core para volver a examinar la cadena de bloques
fr: Forcer Dash Core à rebalayer la blockchain
it: Forzare Dash Core a ripetere la scansione della blockchain
ru: Принуждение Dash Core к пересканированию блокчейна

source: At this stage, recovery is complete and you should make another backup using **File > Backup Wallet** or following the instructions :ref:`here <dashcore-backup>`. If you have any further problems, try asking on the `forum <https://www.dash.org/forum/topic/daemon-and-qt-wallet-support.64/>`_, `Reddit <https://www.reddit.com/r/dashpay/>`_ or the #help-desk channel at `Dash Discord <http://dashchat.org/>`_.
fr: À cette étape, la restauration est terminée et vous devriez faire une nouvelle sauvegarde en utilisant **Fichier > Sauvegarder le portefeuille** ou en suivant les instructions :ref:`ici <dashcore-backup>`. Si vous rencontrez d'autres problèmes, posez une question sur le `forum <https://www.dash.org/forum/topic/daemon-and-qt-wallet-support.64/>`_, sur `Reddit <https://www.reddit.com/r/dashpay/>`_ ou sur le canal de discussion #help-desk du `Discord Dash Nation <http://dashchat.org/>`_.
it: A questo punto, il ripristino è completo e dovresti effettuare un altro backup utilizzando **File > Backup Wallet** o seguendo le istruzioni :ref:`qui <dashcore-backup>`. Se riscontri ulteriori problemi, prova a chiedere sul `forum <https://www.dash.org/forum/topic/daemon-and-qt-wallet-support.64/>`_, `Reddit <https://www.reddit.com/r/dashpay/>`_ o il canale #help-desk su `Dash Discord <http://dashchat.org/>`_.
ru: На этой стадии восстановление завершено и вам следует создать ещё одну копию при помощи **Файл > Сделать резервную копию кошелька** или следуя инструкициям :ref:`здесь <dashcore-backup>`. Если вы столкнулись с другими проблемами, попробуйте задать вопрос на `форуме <https://www.dash.org/forum/topic/daemon-and-qt-wallet-support.64/>`_, `Reddit <https://www.reddit.com/r/dashpay/>`_ или на канале #help-desk в `Dash Discord <http://dashchat.org/>`_.

source: Dash Android
ar: داش أندرويد
ru: Dash на платформе Android

source: Similar to Dash Core wallet, Dash Wallet for Android can restore your wallet from a file. To restore this wallet on another device, simply copy the backup file to the ``/Downloads`` folder of your device using either a computer connected by USB or a file manager app on the device. Ensure your Dash wallet is fully updated in the Play Store, then open Dash. If you have an existing balance, either view and write down your recovery phrase or transfer your balance to an external address, because restoring a wallet will replace your existing wallet!
it: Simile al wallet Dash Core, Dash Wallet per Android può ripristinare il tuo wallet da un file. Per ripristinare questo wallet su un altro dispositivo, copia semplicemente il file di backup nella cartella "/Download" del tuo dispositivo utilizzando un computer collegato tramite USB o un'app di gestione file sul dispositivo. Assicurati che il tuo wallet Dash sia completamente aggiornato nel Play Store, quindi apri Dash. Se disponi di un saldo esistente, visualizza e annota la frase di recupero o trasferisci il saldo a un indirizzo esterno, perché il ripristino di un wallet sostituirà il tuo esistente!
ru: Подобно кошельку Dash Core, Dash Wallet для Android может восстанавливать кошелек из файла. Чтобы восстановить кошелек на другом устройстве, просто скопируйте файл резервной копии в папку ``/Downloads`` на устройстве, используя либо компьютер, подключенный по USB, либо приложение файлового менеджера на устройстве. Убедитесь, что ваш кошелек Dash полностью обновлен в Play Store, затем откройте Dash. Если у вас есть существующий баланс, либо просмотрите и запишите фразу восстановления, либо переведите баланс на внешний адрес, поскольку восстановление кошелька приведет к замене существующего кошелька!

source: Select **Restore from file** from the menu at the bottom of the main page, locate your file, and enter your file's password when prompted. This may take some time, and your balance will be displayed when complete.
it: Seleziona **Ripristina da file** dal menu nella parte inferiore della pagina principale, individua il file e inserisci la password del file quando richiesto. L'operazione potrebbe richiedere del tempo e il tuo saldo verrà visualizzato una volta completato.
ru: Выберите пункт **Восстановить из файла** в меню в нижней части главной страницы, найдите свой файл и введите пароль к файлу, когда появится запрос. Это может занять некоторое время, по завершении которого будет отображен ваш баланс.

source: For devices that already have an active wallet, first write down the existing recovery phrase as a backup. Click the menu button on the bottom right corner and select **Security > View Recovery Phrase** to find it. After backing up the recovery phrase, reset the wallet by selecting the **Security > Reset Wallet** option and then proceed with restoring the backup file.
it: Per i dispositivi che dispongono già di un wallet attivo, annotare prima la frase di ripristino esistente come backup. Fai clic sul pulsante del menu nell'angolo in basso a destra e seleziona **Sicurezza > Visualizza frase di ripristino** per trovarla. Dopo aver eseguito il backup della frase di ripristino, reimposta il wallet selezionando l'opzione **Sicurezza > Reimposta wallet** e quindi procedi con il ripristino del file di backup.
ru: Для устройств, на которых уже есть активный кошелек, сначала запишите существующую фразу восстановления в качестве резервной копии. Для ее поиска нажмите кнопку меню в правом нижнем углу и выберите **Security > View Recovery Phrase**. После создания резервной копии фразы восстановления сбросьте кошелек, выбрав опцию **Security > Reset Wallet**, а затем приступайте к восстановлению файла резервной копии.

source: *Restoring a file backup using Dash Wallet for Android*
ar: *استعادة نسخة احتياطية للملف باستخدام محفظة داش في الأندرويد*
de: *Eine Sicherheitskopie für die Dash Android Wallet verwenden*
es: *Restauración de un respaldo de archivos usando la billetera de Dash para Android*
fr: *Restauration d'un fichier de sauvegarde avec le portefeuille Dash pour Android*
it: *Ripristino di un backup di file utilizzando Dash Wallet per Android*
ru: *Восстановление резервной копии из файла при помощи кошелька Dash для Android*

source: Recovery Phrases
ar: كلمة الإستعادة
de: Wiederherstellungsphrase
es: Frases de recuperación
fr: Phrases de récupération
it: Frase di recupero
ru: Фразы для восстановления

source: If you have a 12-word phrase and feel certain your backup was made on an iOS or Android mobile device, follow these instructions.
ar: إذا كان لديك عبارة مكونة من 12 كلمة وتشعر بأن بعض النسخ الاحتياطية قد تم إجراؤها على جهاز جوّال يعمل بنظام الأيفون أو الأندرويد ، فاتبع هذه الإرشادات
de: Wenn eine Phrase aus 12 Wörtern vorhanden ist und sicher ist, dass diese einem Android- oder iOS-Gerät entstammt, ist die folgende Anleitung die richtige.
es: Si tienes una frase de 12 palabras y estás seguro de que tu copia de seguridad se realizó en un dispositivo móvil iOS o Android, sigue estas instrucciones.
fr: Si vous disposez d'une phrase de 12 mots et êtes certain que votre sauvegarde a été faite sur un appareil mobile iOS ou Android, veuillez suivre ces instructions.
it: Se hai una frase di 12 parole e ritieni che il backup sia stato eseguito su un dispositivo mobile iOS o Android, segui queste istruzioni.
ru: Если у вас есть фраза из 12 слов и вы уверены, что сделали резервную копию на мобильном устройстве на базе iOS или Android - следуйте инструкциям ниже.

source: 12-word phrase on Android
ar: عبارة 12 كلمة في الأندرويد
de: Android-Phrase mit 12 Wörtern
es: Frase de 12 palabras en Android
fr: Phrase de 12 mots sur Android
it: Frase da 12-parole su Android
ru: Фраза из 12 слов для устройств на Android
