Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/signing.po
Languages: ar, de, fr, it, ru, zh_cn

source: Guides and screenshots on how to sign and verify messages using the Dash cryptocurrency
ar: أدلة ولقطات شاشة عن كيفية تسجيل الرسائل والتحقق منها باستخدام أداة التشفير عملة داش
de: Anleitung und Screenshots, wie man eine Nachricht über Dash signiert und verifiziert
fr: Guides et copies d'écran sur la procédure de signature et de vérification de messages avec la cryptomonnaie Dash
it: Guide e screenshot su come firmare e verificare i messaggi utilizzando la criptovaluta Dash
ru: Руководство и скриншоты о том, как подписывать и верифицировать сообщения используя криптовалюту Dash
zh_cn: 有关加密数字货币达世币的签名及验证信息的指南和截图

source: dash, sign, verify, message, trezor, dash core
ar: داش، علامة، تحقق، رسالة، تريزور، داش كور
de: dash, signieren, verifizieren, nachricht, trezor, dash core
fr: dash, signer, vérifier, message, trezor, dash core
it: dash, firma, verifica, messaggio, trezor, dash core
ru: dash, подпись, верификация, сообщение, trezor, dash core
zh_cn: dash、签名、验证、消息、trezor、dash core

source: Signing and Verifying Messages
ar: التوقيع والتحقق من الرسائل
de: Nachrichten signieren und verifizieren
fr: Signer et vérifier des messages
it: Firma e verifica dei messaggi
ru: Подпись и верификация сообщений
zh_cn: 签名并验证信息

source: Dash wallets function by securely storing the private keys used to create transactions using publicly visible addresses on a distributed ledger called a blockchain. In some cases, it may be necessary to verify an address to demonstrate control of the funds that it holds, that you can receive using the address, or even to verify your identity to an exchange that has previously seen a transaction from that address. To avoid phishing attacks, take great care when sending signed messages to parties you do not trust, since ambiguously worded messages could be used to impersonate your identity.
ar: تعمل حافظات داش عن طريق تخزين المفاتيح الخاصة بشكل آمن لتكوين معاملات باستخدام عناوين مرئية بشكل عام على دفتر أستاذ موزع يسمى بلوكشين. في بعض الحالات ، قد يكون من الضروري التحقق من عنوان لإثبات التحكم في الأموال التي تحتفظ بها ، أو يمكنك تلقيها باستخدام العنوان ، أو حتى التحقق من هويتك إلى عملية تبادل سبق لها أن شهدت معاملة من هذا العنوان. لتجنب هجمات التصيد الاحتيالي ، يجب توخي الحذر الشديد عند إرسال رسائل موقعة إلى الأطراف التي لا تثق بها ، نظرًا لأنه يمكن استخدام الرسائل المجهولة بذكاء في انتحال هويتك.
de: Dash Wallets lagern die privaten Schlüssel in einem sicheren Umfeld, die notwendig sind zum Signieren einer Transaktion an eine öffentliche Adresse, die über die dezentrale Datenbank namens Blockchain sichtbar ist. In manchen Fällen ist es notwendig, zu beweisen, dass einem eine bestimmte Adresse und die darauf lagernden Kryptowährungen gehören, wenn es z.B. notwendig ist, sich gegenüber einer Börse zu identifizieren. Um Phishing-Angriffe abzuwehren, sollte man keine signierten Nachrichten an Personen schicken, denen man nicht vertraut, da sie die Nachricht nutzen könnten, um die eigene Identität zu stehlen.
fr: Les portefeuilles Dash fonctionnent en stockant de manière sûre les clés privées utilisées pour créer des transactions entre adresses publiques, lesquelles sont visibles sur un registre distribué appelé blockchain. Dans certains cas, il peut être nécessaire de vérifier une adresse afin de prouver qu'on contrôle les fonds qu'elle contient, qu'on peut recevoir des fonds à cette adresse, voire pour certifier votre identité auprès d'une plateforme de change qui a déjà constaté une transaction émise depuis cette adresse-là. Pour éviter les attaques de hameçonnage, veuillez vous assurer, quand vous envoyez des messages à des tierces parties auxquelles vous ne faites pas confiance, de rédiger des messages sans aucune ambiguïté qui pourrait conduire quelqu'un à usurper votre identité.
it: I wallet Dash funzionano archiviando in modo sicuro le chiavi private utilizzate per creare transazioni utilizzando indirizzi visibili pubblicamente su un registro distribuito chiamato blockchain. In alcuni casi, potrebbe essere necessario verificare un indirizzo per dimostrare il controllo dei fondi in esso detenuti, che puoi ricevere utilizzando quell'indirizzo, o anche per verificare la tua identità presso un exchange che ha precedentemente visto una transazione da quell'indirizzo. Per evitare attacchi di phishing, presta molta attenzione quando invii messaggi firmati a soggetti di cui non ti fidi, poiché i messaggi formulati in modo ambiguo potrebbero essere utilizzati per impersonare la tua identità.
ru: Функционал кошелька Dash включает безопасное хранение приватных ключей, используемых для проведения транзакций через видимый публичный адрес в распределенном списке экономических транзакций, называемых блокчейном. В некоторых случаях может понадобится верификация адреса для демонстрации факта контроля над средствами в нём и возможности получения средств на данный адрес. Возможно даже, что потребуется идентификация личности на бирже, которая зарегистрировала транзакции с этого адреса. Для избежания фишинговых атак, будте крайне аккуратны, когда отправляете подписанные сообщения лицам, которым не доверяете, так как двусмысленно написанные сообщения могут раскрыть вашу личность.
zh_cn: 达世币钱包借助被称作区块链的分布式帐目创建可公开预览的地址并安全地保管交易创建所需的私钥。在某些情况下，用户需要验证地址才能证明对个人资金的掌控，证明可以使用该地址接收款项，或者向此前已从该地址上浏览到交易资讯的交易平台证明个人身份。为了避免网络上的钓鱼攻击，用户在向不熟悉的对象发送签名信息时要特别谨慎，因为对方可能使用含糊不清的信息冒名顶替该用户。

source: Signing messages requires a private key. Verifying messages requires a public address. In this way, you can write an arbitrary message and generate a signature that could only have been created by a user with control of the private key for this address. Any user with the message, the public address and the signature can easily verify that only you could have created the signature. Messages are not stored on the blockchain. Instead, you must send these three text snippets (message, address and signature) to your intended recipient using another communication channel, such as email. As an example, you can test the following message and signature and verify that it was signed by the given address::
ar: يتطلب توقيع الرسائل مفتاحًا خاصًا. يتطلب التحقق من الرسائل عنوانًا عامًا. وبهذه الطريقة ، يمكنك كتابة رسالة عشوائية وإنشاء توقيع يمكن إنشاؤه بواسطة مستخدم يتحكم في المفتاح الخاص لهذا العنوان فقط. يمكن لأي مستخدم لديه الرسالة والعنوان العام والتوقيع بسهولة التحقق من أنك فقط من الممكن أن تكون قد أنشأت التوقيع. لا يتم تخزين الرسائل على بلوكشين. بدلاً من ذلك ، يجب أن ترسل هذه المقتطفات النصية الثلاثة (الرسالة والعنوان والتوقيع) إلى المستلم المقصود باستخدام قناة اتصال أخرى ، مثل البريد الإلكتروني. على سبيل المثال ، يمكنك اختبار الرسالة والتوقيع التاليين والتحقق من توقيعها من خلال العنوان المحدد::
de: Nachrichten können nur mit einem privaten Schlüssel signiert werden. Verifiziert werden sie hingegen mit einer öffentlichen Adresse. Die Nachricht kann also nur vom Besitzer der Adresse geschaffen werden, wohingegen er seine Schlüssel nicht offenlegen muss, damit die Nachricht gelesen werden kann. Jeder kann verifizieren, dass nur der Besitzer diese Nachricht erstellen konnte. Nachrichten werden nicht auf der Blockchain gespeichert. Stattdessen werden die drei notwendigen Textausschnitte (Nachricht, Adresse und Signatur) über einen anderen Kanal, wie etwa eine E-Mail, an den Empfänger geschickt. Als Beispiel kannst du die folgende Nachricht und ihre Signatur nehmen, um zu verifizieren, dass sie zu der angegebenen Adresse gehören::
fr: Signer des messages exige de détenir une clé privée. Vérifier (certifier) des messages ne demande qu'une adresse publique. De cette façon, vous pouvez rédiger tout message de votre choix, puis créer une signature qui ne peut être générée que par l'utilisateur détenant la clé privée correspondant à l'adresse publique. Tout utilisateur disposant du message, de l'adresse publique et de la signature peut vérifier facilement que vous êtes le seul qui aurait pu générer la signature. Les messages ne sont pas stockés sur la blockchain. À la place, vous devez envoyer ces trois bouts de texte (le message, l'adresse publique et la signature) à votre destinataire en utilisant un autre canal de communication, tel qu'un e-mail. En guise d'exemple, vous pouvez tester le message suivant et sa signature, et vérifier qu'il a bien été signée par l'adresse donnée :
it: La firma dei messaggi richiede una chiave privata. La verifica dei messaggi richiede un indirizzo pubblico. In questo modo è possibile scrivere un messaggio arbitrario e generare una firma che potrebbe essere stata creata solo da un utente con il controllo della chiave privata per questo indirizzo. Qualsiasi utente con il messaggio, l'indirizzo pubblico e la firma può facilmente verificare che solo tu potresti aver creato la firma. I messaggi non vengono archiviati sulla blockchain. Devi invece inviare questi tre frammenti di testo (messaggio, indirizzo e firma) al destinatario previsto utilizzando un altro canale di comunicazione, come l'e-mail. Ad esempio, puoi testare il messaggio e la firma seguenti e verificare che sia stato firmato dall'indirizzo specificato:
ru: Для подписания сообщений необходим приватный ключ. Верификация сообщения требует публичного адреса. Таким образом, можно написать произвольное сообщение и создать подпись, которая может быть создана только пользователем, владеющим приватным ключом к этому адресу. Любой пользователь с сообщением, публичным адресом и подписью может легко доказать, что только он мог создать подпись. Сообщения не хранятся в блокчейне. Вместо этого, вы должны отправить три текстовых элемента (сообщение, адрес и подпись) получателю через другой канал связи, например, электронную почту. В качестве примера, можно использовать следующее сообщение с подписью, в качестве тестового, и удостовериться, что оно было подписано с указанного адреса::
zh_cn: 用户在发送签名信息时需要用到私钥，而在验证信息时需要用到公共地址。通过这种方式，用户可以任意编写消息并生成一个签名，该签名只能由掌管该地址私钥的用户创建。任何持有信息、公共地址和签名的用户都可以轻松地证明对签名的独家创建。信息不会存储在区块链中，相反，用户需要通过电子邮件等其它通信渠道将这三个文本片段（包括消息、地址和签名）发送给收款方。例如，用户可以验证以下信息和签名，并验证它是否由既定地址的用户签名授权::

source: Signing a Message
ar: توقيع رسالة
de: Nachricht signieren
fr: Signer un message
it: Firmare un messaggio
ru: Подпись сообщения
zh_cn: 签名消息

source: The following screenshots show how to sign a message using the Dash Core wallet (**File > Sign message**), Trezor web wallet (Sign & Verify > Sign message) and DMT (**Tools > Sign message with HW for current masternode's address**):
ar: توضح اللقطات التالية كيفية توقيع رسالة باستخدام محفظة داش كور (**ملف> امضاء**) ، و Trezor web wallet (إمضاء & تحقق> تحقق من الرسالة) و DMT (**الأدوات>عنوان**):
de: Der folgende Screenshot zeigt, wie man eine Nachricht mit der Dash Core Wallet (**Datei > Nachricht signieren**), der Trezor Web Wallet (Sign & Verify > Sign message) und DMT (**Tools > Sign message with HW for current masternode's address**) signieren kann:
fr: Les captures d'écran suivantes montrent comment signer un message avec le portefeuille logiciel Dash Core (**Fichier > Signer un message**), l'interface web Trezor (**Signer & vérifier > Signer un message**) et DashMasternodeTool ou DMT (**Outils > Signer un message avec le portefeuille matériel pour l'adresse du masternode actuel**) :
it: Gli screenshot seguenti mostrano come firmare un messaggio utilizzando il wallet Dash Core (**File > Firma messaggio**), il portafoglio web Trezor (Firma e verifica > Firma messaggio) e DMT (**Strumenti > Firma messaggio con HW per il masternode corrente indirizzo**):
ru: Представленные далее снимки экрана показывают, как подписать сообщение в кошельке Dash Core (**Файл > Подписать сообщение**), веб кошельке Trezor (Подписать и верифицировать > Подписать сообщение) и DMT (**Инструменты> Подписать сообщение с помощью HW для текущего адреса мастерноды**):
zh_cn: 以下截图显示了不同的消息签名途径，其中包括Dash Core钱包（ **文件 > 为消息签名** ）、Trezor网页钱包（ **签名及验证 > 为消息签名** ）和DMT（ **工具 > 使用HW为当前的主节点地址提供消息签名** ）：

source: *Signing messages in Dash Core, Trezor web wallet and DMT*
ar: *توقيع الرسائل في داش كور و Trezor web wallet و DMT*
de: *Nachricht in Dash Core, Trezor Web Wallet und DMT signieren*
fr: *Signature de messages dans le portefeuille logiciel Dash Core, dans le portefeuille web Trezor et dans DMT*/
it: *Firma di messaggi in Dash Core, wallet web Trezor e DMT*
ru: *Подписание сообщений в Dash Core, веб кошельке Trezor и DMT*
zh_cn: *在Dash Core、Trezor网页钱包和DMT中进行消息签名*

source: Verifying a Message
ar: تحفق من الرسالة
de: Nachricht verifizieren
fr: Vérifier un message
it: Verifica di un messaggio
ru: Верификация сообщения
zh_cn: 验证消息

source: The following screenshots show how to verify a message using the Dash Core wallet (**File > Sign message**) and Trezor web wallet (**Sign & Verify > Sign message**):
ar: توضح اللقطات التالية كيفية التحقق من رسالة باستخدام محفظة داش كور (**ملف> امضاء**) و Trezor web wallet (**امضاء & تحقق> امضاء**):
de: Der folgende Screenshot zeigt, wie man eine Nachricht mit der Dash Core Wallet (**Datei > Nachricht signieren**) und der Trezor Web Wallet (Sign & Verify > Sign message) verifizieren kann:
fr: Les captures d'écran suivantes montrent comment vérifier un message avec le portefeuille logiciel Dash Core (**Fichier > Signer un message**) et l'interface web Trezor (**Signer & vérifier > Signer un message**) :
it: I seguenti screenshot mostrano come verificare un messaggio utilizzando il wallet Dash Core (**File > Firma messaggio**) e il wallet web Trezor (**Firma e verifica > Firma messaggio**):
ru: На представленных далее снимках экрана показывается как подписать сообщение, используя кошелёк Dash Core (**Файл > Подписать сообщение**) и веб кошелёк Trezor (**Подписать и верифицировать > Подписать сообщение**):
zh_cn: 以下截图显示了不同的消息验证途径，其中包括Dash Core钱包（ **文件 > 为消息签名** ）和 Trezor网页钱包（ **签名及验证 > 为消息签名** ）：

source: *Verifying messages in Dash Core and Trezor web wallet. Notice that the message verified by Dash Core was generated in Trezor, and vice versa*
ar: *التحقق من الرسائل في محفظة داش كور و Trezor على الويب. لاحظ أن الرسالة التي تم التحقق منها بواسطة داش كور تم إنشاؤها في Trezor والعكس بالعكس*
de: *Nachricht in Dash Core und Trezor Web Wallet verifizieren. Hinweis: Die Nachricht, die mit Dash Core verifiziert wurde, wurde in Trezor erstellt und andersherum*
fr: *Vérification de messages dans le portefeuille logiciel Dash Core et le portefeuille web Trezor. Veuillez noter que le message vérifié par Dash Core a été généré par un Trezor, et vice versa*
it: *Verifica dei messaggi nel wallet web Dash Core e Trezor. Nota che il messaggio verificato da Dash Core è stato generato in Trezor e viceversa*
ru: *Верификация сообщения в Dash Core и веб кошельке Trezor. Обратите внимание, что сообщение, верифицированное в Dash Core было создано в Trezor и наоборот*
zh_cn: *Dash Core钱包和Trezor网页钱包中的消息验证。请注意，Dash Core钱包的验证消息是在Trezor网页钱包中生成的，反之则反之*
