Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/web.po
Languages: it, ru

source: MyDashWallet is a secure web wallet for Dash, supporting InstantSend and CoinJoin
it: MyDashWallet è un wallet web sicuro per Dash, che supporta InstantSend e CoinJoin
ru: MyDashWallet - безопасный веб-кошелёк для пользования Dash, поддерживающий функции InstantSend и CoinJoin

source: dash, mydashwallet, web, wallet, coinjoin, privatesend, instantsend, my dash wallet
ru: dash, mydashwallet, веб, кошелёк, coinjoin, privatesend, instantsend, мой кошелёк Dash

source: `MyDashWallet <https://mydashwallet.org/>`_ is a web interface to the Dash blockchain, inspired by `MyEtherWallet <https://www.myetherwallet.com>`_ and created by `DeltaEngine.net <https://deltaengine.net/>`_. It is explicitly not an online wallet, meaning you maintain control over your private keys at all times. Unlike many other light wallets, MyDashWallet also supports advanced Dash features such as InstantSend and CoinJoin. The project is non-profit, open source and free to use. You can load a wallet and transact in a variety of wallet formats:
it: `MyDashWallet <https://mydashwallet.org/>`_ è un'interfaccia web per la blockchain Dash, ispirata a `MyEtherWallet <https://www.myetherwallet.com>`_ e creata da `DeltaEngine.net <https://deltaengine.net/>`_. Non è esplicitamente un wallet online, il che significa che mantieni sempre il controllo sulle tue chiavi private. A differenza di molti altri portafogli leggeri, MyDashWallet supporta anche funzionalità Dash avanzate come InstantSend e CoinJoin. Il progetto è senza scopo di lucro, open source e gratuito. Puoi caricare un portafoglio ed effettuare transazioni in una varietà di formati di portafoglio:
ru: `MyDashWallet <https://mydashwallet.org/>`_ - это веб-интерфейс к блокчейну Dash, созданный по мотивам `MyEtherWallet <https://www.myetherwallet.com>`_ и разработанный компанией `DeltaEngine.net <https://deltaengine.net/>`_. Это явно не онлайн-кошелек, что означает постоянный контроль над вашими приватными ключами. В отличие от многих других легких кошельков, MyDashWallet также поддерживает такие расширенные возможности Dash, как InstantSend и CoinJoin. Проект является некоммерческим, с открытым исходным кодом и бесплатным для использования. Вы можете загружать кошелек и осуществлять транзакции в различных форматах кошельков:

source: Keystore wallet (file-based)
ru: Кошелёк с хранилищем ключей (на файловой основе)

source: Ledger hardware wallet
ru: Аппаратный кошелёк Ledger

source: Trezor hardware wallet
ru: Аппаратный кошелёк Trezor

source: Private key
ru: Приватный ключ

source: BIP39/44 HD recovery phrase (coming soon)
it: Frase di recupero BIP39/44 HD (disponibile a breve)
ru: Фраза для восстановления BIP39/44 HD (появится в ближайшее время)

source: BIP32 HD recovery phrase (coming soon)
it: Frase di recupero BIP32 HD (disponibile a breve)
ru: Фраза для восстановления BIP32 HD (появится в ближайшее время)

source: Please note that web wallets may not be as secure as alternatives such as hardware wallets. Be aware of the risk of storing large amounts of Dash in keyfile wallets, since they are an easier target to attack than mobile or hardware wallets.
it: Tieni presente che i wallet web potrebbero non essere sicuri quanto alternative come gli hardware wallet. Sii consapevole del rischio di archiviare grandi quantità di Dash nei wallet con file di chiavi, poiché sono un bersaglio più facile da attaccare rispetto ai portafogli mobili o hardware.
ru: Обратите внимание, что веб-кошельки могут быть не столь безопасны, как альтернативные варианты, например аппаратные кошельки. Помните о риске хранения больших объемов Dash в кошельках с ключевыми файлами, поскольку они являются более легкой мишенью для атак, чем мобильные или аппаратные кошельки.

source: MyDashWallet offers complete and detailed documentation for all functions.
it: MyDashWallet offre una documentazione completa e dettagliata per tutte le funzioni.
ru: MyDashWallet предлагает полную и подробную документацию по всем функциям.

source: `Getting started <https://mydashwallet.org/help>`_
it: `Per iniziare <https://mydashwallet.org/help>`_
ru: `Начать работу <https://mydashwallet.org/help>`_

source: `How to Create a Wallet via Keystore file <https://old.mydashwallet.org/AboutCreateNewWallet>`_
it: `Come creare un portafoglio tramite il file Keystore <https://old.mydashwallet.org/AboutCreateNewWallet>`_
ru: `Как создать кошелёк, используя файл хранения ключей <https://old.mydashwallet.org/AboutCreateNewWallet>`_

source: `Using the Ledger Hardware Wallet on MyDashWallet <https://old.mydashwallet.org/AboutLedgerHardwareWallet>`_
it: `Utilizzo del portafoglio hardware Ledger su MyDashWallet <https://old.mydashwallet.org/AboutLedgerHardwareWallet>`_
ru: `Использование аппаратного кошелька Ledger с MyDashWallet <https://old.mydashwallet.org/AboutLedgerHardwareWallet>`_

source: `Using the Trezor Hardware Wallet on MyDashWallet <https://old.mydashwallet.org/AboutTrezorHardwareWallet>`_
it: `Utilizzo dell'hardware wallet Trezor su MyDashWallet <https://old.mydashwallet.org/AboutTrezorHardwareWallet>`_
ru: `Использование аппаратного кошелька Trezor с MyDashWallet <https://old.mydashwallet.org/AboutLedgerHardwareWallet>`_

source: `How to does DASH InstantSend work on MyDashWallet? <https://old.mydashwallet.org/AboutInstantSend>`_
it: `Come funziona DASH InstantSend su MyDashWallet? <https://old.mydashwallet.org/AboutInstantSend>`_
ru: `Каким образом Dash InstantSend работает на MyDashWallet? <https://old.mydashwallet.org/AboutInstantSend>`_

source: `How to does DASH PrivateSend work on MyDashWallet? <https://old.mydashwallet.org/AboutPrivateSend>`_
it: `Come funziona DASH PrivateSend su MyDashWallet? <https://old.mydashwallet.org/AboutPrivateSend>`_
ru: `Каким образом Dash CoinJoin работает в MyDashWallet? <https://old.mydashwallet.org/AboutInstantSend>`_

source: `WestWallet <https://westwallet.io/>`_ is a multicurrency web wallet for storing, sharing and transferring the most popular cryptocurrencies. The wallet includes an automatable instant exchange, instant transfers between users and automatic withdrawal.
it: `WestWallet <https://westwallet.io/>`_ è un wallet web multivaluta per archiviare, condividere e trasferire le criptovalute più popolari. Il wallet include un exchange istantaneo automatizzabile, trasferimenti istantanei tra utenti e prelievo automatico.
ru: `WestWallet <https://westwallet.io/>`_ - мультивалютный веб-кошелек для хранения, обмена и перевода наиболее популярных криптовалют. Кошелек включает в себя автоматический мгновенный обмен, мгновенные переводы между пользователями и автоматический вывод средств.

source: Support for WestWallet is available at `info@westwallet.info <info@westwallet.info>`_.
it: Il supporto per WestWallet è disponibile all'indirizzo `info@westwallet.info <info@westwallet.info>`_.
ru: Поддержка WestWallet осуществляется по адресу `info@westwallet.info <info@westwallet.info>`_.
