Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/network/dashmate/index.po
Languages: it, ru

source: Description of dashmate features and usage
it: Descrizione delle funzionalità e dell'utilizzo di Dashmate
ru: Описание возможностей и применения dashmate

source: Dashmate is a universal tool designed to help you set up and run Dash masternodes in a containerized environment. It is also an ideal tool to quickly and easily set up and run a development network on your local system.
it: Dashmate è uno strumento universale progettato per aiutarti a configurare ed eseguire i masternode Dash in un ambiente containerizzato. È anche uno strumento ideale per configurare ed eseguire rapidamente e facilmente una rete di sviluppo sul tuo sistema locale.
ru: Dashmate - это универсальный инструмент, предназначенный для настройки и запуска Dash-мастернод в контейнерной среде. Это также идеальный инструмент для быстрой и простой настройки и запуска сети разработки в локальной системе.

source: Setting up a testnet evonode using dashmate
it: Configurazione di questo evonode in Testnet utilizzando dashmate
ru: Настройка эвоноды в тестовой сети с помощью dashmate

source: Installation
it: Installazione
ru: Установка

source: This guide describes how to download, install and use dashmate on for Linux. The guide is written for Ubuntu 22.04 x64 LTS, but the steps should be similar for other Linux distributions.
ru: Это руководство описывает, как загрузить, установить и использовать dashmate для Linux. Руководство написано для Ubuntu 22.04 x64 LTS, но шаги должны быть аналогичными для других дистрибутивов Linux.

source: Install dependencies
it: Installa le dipendenze
ru: Установочные зависимости

source: Install and configure Docker::
it: Installa e configura Docker::
ru: Установите и настройте Docker::

source: Install dashmate
it: Installa dashmate
ru: Установите Dashmate

source: There are several methods available for installing dashmate. Installing the Linux, MacOS, or Windows packages from the `GitHub releases page <https://github.com/dashpay/platform/releases/latest>`__ is recommended for mainnet masternodes.
ru: Существует несколько способов установки dashmate. Установка пакетов для Linux, MacOS или Windows со страницы релизов на `GitHub <https://github.com/dashpay/platform/releases/latest>`__ рекомендуется для мастернод основной сети.

source: Debian package
it: Pacchetto Debian
ru: Пакет Debian

source: Download the newest dashmate installation package for your architecture from the `GitHub releases page <https://github.com/dashpay/platform/releases/latest>`__::
ru: Загрузите самый новый установочный пакет dashmate для вашей архитектуры со страницы релизов на GitHub <https://github.com/dashpay/platform/releases/latest>`__::

source: Install dashmate using apt::
it: Installa Dashmate utilizzando apt:
ru: Установите dashmate с помощью apt::

source: At the end of the installation process, ``apt`` may display an error due to installing a downloaded package. You can ignore this error message:
ru: В конце процесса установки ``apt`` может выдать ошибку, связанную с установкой загруженного пакета. Вы можете проигнорировать это сообщение об ошибке:

source: Node package
it: Pacchetto nodo
ru: Пакет ноды

source: This installation option is not recommended for mainnet masternodes. Please install packages from the `GitHub releases page <https://github.com/dashpay/platform/releases/latest>`__.
ru: Этот вариант установки не рекомендуется для мастернод основной сети. Пожалуйста, устанавливайте пакеты со страницы релизов на GitHub <https://github.com/dashpay/platform/releases/latest>`__.

source: Node.js dashmate install
ru: Установка Node.js dashmate

source: To install the NodeJS package, it is necessary to install NodeJS first. We recommend installing it using `nvm <https://github.com/nvm-sh/nvm#readme>`__::
it: Per installare il pacchetto NodeJS, è necessario prima installare NodeJS. Ti consigliamo di installarlo utilizzando `nvm <https://github.com/nvm-sh/nvm#readme>`__::
ru: Для установки пакета NodeJS необходимо сначала установить NodeJS. Мы рекомендуем установить его с помощью `nvm <https://github.com/nvm-sh/nvm#readme>`__::

source: Once NodeJS has been installed, use npm to install dashmate::
it: Una volta installato NodeJS, utilizza npm per installare dashmate::
ru: После установки NodeJS с помощью npm установите Dashmate::

source: Masternode setup
it: Configurazione del masternode
ru: Настройки мастерноды

source: Dashmate is primarily recommended for setting up Evolution masternodes (evonodes). With the exception of a few minor extra steps for evonodes, the process is identical for evonodes and regular masternodes. Complete the steps in the sections below to set up your node or follow along with this step-by-step tutorial.
ru: Dashmate в первую очередь рекомендуется для настройки эвонод (evonodes). За исключением нескольких незначительных дополнительных шагов для эвонод, процесс идентичен для эвонод и обычных мастернод. Выполните шаги в разделах ниже, чтобы настроить свою ноду, или следуйте этому пошаговому руководству.

source: To begin masternode setup, run ``dashmate setup`` to start the interactive wizard::
it: Per iniziare la configurazione del masternode, esegui ``dashmate setup`` per avviare la procedura guidata interattiva:
ru: Чтобы начать настройку мастерноды, выполните команду ``dashmate setup`` для запуска интерактивного мастера::

source: Set Network and Node type
it: Imposta la rete e il tipo di nodo
ru: Установите тип сети и ноды

source: Select the testnet network preset
it: Seleziona la preimpostazione della rete testnet
ru: Выберите предварительную настройку сети testnet

source: Create an Evolution masternode
it: Crea un masternode Evolution
ru: Создайте Эвоноду

source: Select **No** to register a new masternode or **Yes** to import information about an existing masternode.
it: Seleziona **No** per registrare un nuovo masternode o **Sì** per importare informazioni su un masternode esistente.
ru: Выберите **Нет** для регистрации новой мастерноды или **Да** для импорта информации о существующей мастерноде.

source: Set up a new masternode
it: Configura un nuovo masternode
ru: Настройка новой мастерноды

source: If registering a new masternode, jump to the :ref:`defining keys and addresses <dashmate-define-keys-addresses>` section next.
ru: Если вы регистрируете новый мастерноду, перейдите к следующему разделу :ref:`определение ключей и адресов <dashmate-define-keys-addresses>`.

source: Import existing Core data
ru: Импортируйте имеющиеся данные Core

source: The following step only applies when migrating an existing masternode into dashmate.
ru: Следующий шаг применим только при переносе существующей мастерноды в dashmate.

source: If you chose to import an existing masternode in the previous step, you will be prompted for the location of your existing installation.
ru: Если на предыдущем шаге вы решили импортировать существующую мастерноду, вам будет предложено указать местоположение существующей установки.

source: Import existing data
ru: Импортируйте имеющиеся данные

source: Enter existing Core data directory
ru: Введите существующий каталог данных Core

source: Core data import complete
ru: Импорт основных данных завершен

source: Once the Core data has been imported, jump to the :ref:`configure communication <dashmate-configure-communication>` section.
ru: После импорта данных Core перейдите к разделу :ref:`конфигурация коммуникаций <dashmate-configure-communication>`.

source: Define Keys and Addresses
it: Definire chiavi e indirizzi
ru: Определите ключи и адреса

source: Store masternode keys in Dash Core
it: Memorizza le chiavi masternode in Dash Core
ru: Храните ключи мастернод в Dash Core

source: Enter the requested information from your :hoverxref:`collateral funding transaction <evonode-send-collateral>`. You can find these values using Dash Core's :hoverxref:`masternode outputs <evonode-mn-outputs>` command.
it: Inserisci le informazioni richieste dal tuo :hoverxref:`transazione di finanziamento collaterale <evonode-send-collateral>`. Puoi trovare questi valori utilizzando il comando :hoverxref:`masternode outputs <evonode-mn-outputs>` di Dash Core.
ru: Введите запрашиваемую информацию из вашей :hoverxref:`транзакции финансирования залога <evonode-send-collateral>`. Эти значения можно найти с помощью команды Dash Core :hoverxref:`masternode outputs <evonode-mn-outputs>`.

source: Enter collateral transaction information
it: Inserisci le informazioni sulla transazione collaterale
ru: Введите информацию о транзакции с обеспечением

source: Enter the owner, voting, and payout addresses you :hoverxref:`generated using Dash Core <evonode-get-addresses>` or your selected wallet.
it: Inserisci gli indirizzi del proprietario, della votazione e del pagamento :hoverxref:`generati utilizzando Dash Core <evonode-get-addresses>` o il tuo wallet selezionato.
ru: Введите адреса владельца, голосования и выплат, которые вы :hoverxref:`сгенерировали с помощью Dash Core <evonode-get-addresses>` или выбранного вами кошелька.

source: Enter masternode addresses
it: Inserisci gli indirizzi masternode
ru: Введите адреса мастернод

source: Enter an operator BLS private key. You can enter one you have created (e.g. :hoverxref:`using Dash Core <evonode-bls-generation>`) or received from a hosting provider. Optionally, use the one automatically generated by dashmate.
it: Immettere una chiave privata BLS dell'operatore. Puoi inserirne uno che hai creato (ad esempio :hoverxref:`using Dash Core <evonode-bls-generation>`) o ricevuto da un provider di hosting. Facoltativamente, utilizza quello generato automaticamente da Dashmate.
ru: Введите закрытый ключ оператора BLS. Вы можете ввести созданный вами (например, :hoverxref:`используя Dash Core <evonode-bls-generation>`) или полученный от хостинг-провайдера. Как вариант, можно использовать ключ, автоматически сгенерированный dashmate.

source: If a portion of the masternode rewards are intended to go to the operator directly, set the reward share percentage also.
it: Se una parte dei premi masternode è destinata ad andare direttamente all'operatore, imposta anche la percentuale di condivisione del premio.
ru: Если часть вознаграждения за работу мастерноды предполагается направлять непосредственно оператору, установите также процентное соотношение вознаграждения.

source: Enter operator information
it: Inserisci le informazioni dell'operatore
ru: Введите информации об операторе

source: The following step only applies to Evolution masternodes. Regular masternodes do not require a Platform node key since they do not host Platform services.
it: Il passaggio seguente si applica solo ai masternode Evolution. I masternode regolari non richiedono una chiave di nodo della Platform poiché non ospitano i servizi della Platform.
ru: Следующий шаг применим только к Эвонодам. Для обычных мастернод ключ узла Платформы не требуется, поскольку на них не размещаются сервисы Платформы.

source: Enter a Platform node key. You can enter one :hoverxref:`you have created <evonode-generate-platform-node-id>` or received from a hosting provider. Optionally, use the one automatically generated by dashmate.
it: Immettere una chiave di nodo della platform. Puoi inserirne uno :hoverxref:`che hai creato <evonode-generate-platform-node-id>` o ricevuto da un provider di hosting. Facoltativamente, utilizza quello generato automaticamente da Dashmate.
ru: Введите ключ узла платформы. Вы можете ввести один :hoverxref:`вы создали <evonode-generate-platform-node-id>` или получили от хостинг-провайдера. Как вариант, можно использовать ключ, автоматически сгенерированный dashmate.

source: Enter the Platform node key
it: Immettere la chiave del nodo Platform
ru: Введите ключ ноды платформы

source: Configure communication
it: Configurare la comunicazione
ru: Конфигурирование связи

source: Dashmate will automatically detect the external IP address and select the default ports for the network you are setting up. You can modify these values if necessary for a specific reason, but typically the defaults should be used.
it: Dashmate rileverà automaticamente l'indirizzo IP esterno e selezionerà le porte predefinite per la rete che stai configurando. È possibile modificare questi valori se necessario per un motivo specifico, ma in genere è necessario utilizzare i valori predefiniti.
ru: Dashmate автоматически определит внешний IP-адрес и выберет порты по умолчанию для настраиваемой сети. При необходимости можно изменить эти значения, но, как правило, следует использовать значения по умолчанию.

source: Enter connection information
it: Inserisci le informazioni di connessione
ru: Введите информацию о соединении

source: Register the masternode
it: Registra il masternode
ru: Зарегистрируйте вашу мастерноду

source: Copy the provided protx command and run it using dash-cli or the Dash Core console. Do note that your payout address must have a balance for the registration process to be successful, so remember to send some DASH to this address before you begin registration.
it: Copia il comando protx fornito ed eseguilo utilizzando dash-cli o la console Dash Core. Tieni presente che il tuo indirizzo di pagamento deve avere un saldo affinché il processo di registrazione abbia esito positivo, quindi ricorda di inviare alcuni DASH a questo indirizzo prima di iniziare la registrazione.
ru: Скопируйте предоставленную команду protx и запустите ее с помощью dash-cli или консоли Dash Core. Обратите внимание, что для успешной регистрации на вашем адресе выплат должен быть баланс, поэтому не забудьте отправить на этот адрес некоторое количество DASH до начала регистрации.

source: Select **Yes** after the command has been run successfully. If you receive an error, select **No** to go back through the previous steps and review details.
it: Selezionare **Sì** dopo che il comando è stato eseguito correttamente. Se ricevi un errore, seleziona **No** per tornare ai passaggi precedenti ed esaminare i dettagli.
ru: После успешного выполнения команды выберите **Да**. При возникновении ошибки выберите **Нет**, чтобы вернуться к предыдущим шагам и просмотреть детали.

source: Run the registration command
it: Esegui il comando di registrazione
ru: Выполните команду регистрации

source: Enable SSL
it: Abilita SSL
ru: Включите SSL

source: The following step only applies to evonodes. Regular masternodes do not require an SSL certificate since they do not host Platform services.
it: Il passaggio seguente si applica solo agli evonodi. I masternode regolari non richiedono un certificato SSL poiché non ospitano i servizi della platform.
ru: Следующий шаг применим только к Эвонодам. Для обычных мастернод сертификат SSL не требуется, поскольку на них не размещаются сервисы Платформы.

source: Dash Platform requires SSL for communication. Dashmate provides several options for obtaining the required SSL certificate.
it: La Platform Dash richiede SSL per la comunicazione. Dashmate offre diverse opzioni per ottenere il certificato SSL richiesto.
ru: Dash Platform требует использования SSL для обмена данными. Dashmate предоставляет несколько вариантов получения необходимого SSL-сертификата.

source: Self-signed certificates cannot be used on mainnet. When setting up a mainnet evonode, **ZeroSSL** and **File on disk** are the only options available.
it: I certificati autofirmati non possono essere utilizzati sulla mainnet. Quando si configura un evonode della rete principale, **ZeroSSL** e **File su disco** sono le uniche opzioni disponibili.
ru: Самоподписанные сертификаты не могут быть использованы в сети. При настройке Эвонод в основной сети единственными доступными вариантами являются **ZeroSSL** и **File on disk**.

source: Configure SSL
it: Configura SSL
ru: Настройте SSL

source: Once the configuration is complete, a summary showing the network and type of node configured is displayed. This summary includes important parameters and information on how to proceed.
it: Una volta completata la configurazione viene visualizzato un riepilogo che mostra la rete e la tipologia di nodo configurato. Questo riepilogo include parametri importanti e informazioni su come procedere.
ru: После завершения конфигурирования отображается сводка, показывающая сеть и тип сконфигурированной ноды. В этой сводке указаны важные параметры и информация о дальнейших действиях.

source: The BLS operator private key and Platform Node key must be backed up and kept secure.
it: È necessario eseguire il backup della chiave privata dell'operatore BLS e della chiave del nodo della Platform e mantenerle al sicuro.
ru: Закрытый ключ оператора BLS и ключ ноды платформы должны иметь сохраненную копию и надежно защищены.

source: Configuration complete! 🎉
it: Configurazione completata! 🎉
ru: Конфигурация завершена! 🎉

source: Start the node
it: Avvia il nodo
ru: Запустите ноду

source: Start your node as follows::
it: Avvia il tuo nodo come segue::
ru: Запустите свою ноду следующим образом::

source: When starting a node for the first time, dashmate will download the Docker images required for each service. The time required for this one-time download will depend on the available bandwidth but typically should complete within a few minutes.
it: Quando si avvia un nodo per la prima volta, Dashmate scaricherà le immagini Docker richieste per ciascun servizio. Il tempo necessario per questo download una tantum dipenderà dalla larghezza di banda disponibile, ma in genere dovrebbe essere completato in pochi minuti.
ru: При первом запуске узла Dashmate загрузит образы Docker, необходимые для каждого сервиса. Время, необходимое для этой однократной загрузки, зависит от доступной качества соединения, но обычно она завершается в течение нескольких минут.

source: Dashmate node operation
it: Decima operazione sul nodo
ru: Работа ноды Dashmate

source: You can manage your masternode status, configuration, and running state entirely from within dashmate. Use the built-in help system to learn more:
it: Puoi gestire lo stato, la configurazione e lo stato di esecuzione del tuo masternode interamente da Dashmate. Utilizza il sistema di aiuto integrato per saperne di più:
ru: Вы можете управлять статусом, конфигурацией и рабочим состоянием своей мастерноды полностью из dashmate. Для получения дополнительной информации воспользуйтесь встроенной справочной системой:

source: Dashmate displaying top-level help output
it: Dashmate mostra l'output della guida di livello superiore
ru: Dashmate отображает вывод справки верхнего уровня

source: Start or restart node
it: Avvia o riavvia il nodo
ru: Запуск или перезапуск ноды

source: To start your dashmate node, run::
it: Per avviare il tuo nodo Dashmate, esegui::
ru: Чтобы запустить ноду dashmate, выполните команду::

source: To restart your dashmate node, run::
it: Per riavviare il tuo nodo Dashmate, esegui::
ru: Чтобы перезапустить ноду dashmate, выполните команду::

source: Stop node
it: Ferma il nodo
ru: Остановить ноду

source: To stop your dashmate node, run::
it: Per interrompere il tuo nodo Dashmate, esegui::
ru: Чтобы остановить ноду dashmate, выполните команду::

source: Node status
it: Stato del nodo
ru: Статус ноды

source: You can check the status of your masternode using the various ``dashmate status`` commands as follows::
it: Puoi controllare lo stato del tuo masternode utilizzando i vari comandi ``dashmate status`` come segue:
ru: Проверить состояние мастерноды можно с помощью различных команд ``dashmate status`` следующим образом::

source: Dashmate displaying a range of status output
it: Dashmate mostra una serie di output di stato
ru: Dashmate отображает диапазон состояния выхода

source: Node update
it: Aggiornamento del nodo
ru: Обновление ноды

source: To update dashmate, it is necessary to download and install the new version of dashmate. First, stop dashmate if it is running::
ru: Чтобы обновить dashmate, необходимо скачать и установить новую версию dashmate. Сначала остановите dashmate, если он запущен::

source: Next, install the new version of dashmate following the instructions in the :ref:`dashmate install section <dashmate-install>`.
ru: Далее установите новую версию dashmate, следуя инструкциям в :ref:`секции установки dashmate <dashmate-install>`.

source: Once the new version of dashmate is installed, update dash service docker images::
ru: Как только новая версия dashmate будет установлена, обновите docker-образы dash-сервиса::

source: Finally, restart dashmate::
ru: И наконец, перезапустите dashmate::

source: Troubleshooting
ru: Устранение неполадок.

source: Only enable logs if you have :ref:`configured log rotation <dashmate-log-rotation>` to avoid running out of disk space.
ru: Включайте логи только в том случае, если у вас :ref:`настроена ротация логов <dashmate-log-rotation>`, чтобы избежать нехватки дискового пространства.

source: The following sections describe how to enable log rotation, set up file logging for Core and Platform, adjust log levels, and collect the logs for analysis.
ru: В следующих разделах описано, как включить ротацию логов, настроить регистрацию файлов для Core и Platform, настроить уровни журналов и собрать журналы для анализа.

source: Dashmate log overview
ru: Обзор логов Dashmate

source: Dashmate logs for each service are stored within its Docker container. Although this is typically sufficient, more advanced options are sometimes needed to adjust the log level, output format, or destination. Several cases include when you need to:
ru: Логи Dashmate для каждого сервиса хранятся в его Docker-контейнере. Хотя обычно этого достаточно, иногда требуются более продвинутые опции для настройки уровня журнала, формата вывода или места назначения. В некоторых случаях необходимо:

source: Modify the level of detail provided in the logs (e.g., debug vs info)
ru: Изменяйте уровень детализации логов (например, отладка против информации).

source: Provide data to a log server (e.g., `Elasticsearch <https://www.elastic.co/elasticsearch>`_)
ru: Предоставление данных серверу логов (например, `Elasticsearch <https://www.elastic.co/elasticsearch>`_)

source: Store persistent file logs external to the Docker containers
ru: Хранение постоянных логов в файлах, внешних по отношению к контейнерам Docker

source: Use log monitoring tools to track service health
ru: Используйте средства мониторинга логов для отслеживания состояния службы

source: For example, since the default dashmate logs are only stored in the Docker containers, they are lost if the container is removed for some reason (new Docker image, dashmate reset, failure, etc.). Therefore, you may want to store persistent log files external to Docker while troubleshooting an issue to ensure valuable log data cannot be lost.
ru: Например, поскольку логи dashmate по умолчанию хранятся только в контейнерах Docker, они будут потеряны, если контейнер по какой-то причине будет удален (новый образ Docker, перезагрузка dashmate, сбой и т. д.). Поэтому во время устранения неполадок вам может понадобиться хранить постоянные файлы логов вне Docker, чтобы не потерять ценные данные.

source: Set up log rotation
ru: Настройка ротации логов

source: By default, dashmate logs are not written to the docker host file system. At times you may want to write them to the host file system. Before enabling logging, it is important to configure log rotation to avoid running out of disk space.
ru: По умолчанию логи dashmate не записываются в файловую систему хоста docker. В некоторых случаях вы можете захотеть записывать их в файловую систему хоста. Перед включением записи логов важно настроить ротацию логов, чтобы избежать нехватки дискового пространства.

source: Create a new logrotate configuration file for dashmate logs:
ru: Создайте новый файл конфигурации logrotate для логов dashmate:
