Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/network/dashmate/index.po
Languages: it, ru

source: Paste in the following configuration and replace the example path one that matches your system. This example configuration rotates logs daily and retains seven historical files for each log file type. Historical files are each limited to 1GB.
ru: Вставьте следующую конфигурацию и замените пример пути на тот, который соответствует вашей системе. В этом примере конфигурации логи ротируются ежедневно и сохраняются семь исторических файлов для каждого типа файлов журнала. Каждый исторический файл ограничен 1 ГБ.

source: Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file.
ru: Нажмите **Ctrl + X**, чтобы закрыть редактор, и **Y** и **Enter**, чтобы сохранить файл.

source: For additional log rotation details, see `this configuration tutorial <https://www.digitalocean.com/community/tutorials/how-to-manage-logfiles-with-logrotate-on-ubuntu-22-04>`_ or check out the `logrotate man pages <https://manpages.ubuntu.com/manpages/jammy/man8/logrotate.8.html>`_.
ru: Для получения дополнительной информации о ротации логов смотрите `это руководство по конфигурации <https://www.digitalocean.com/community/tutorials/how-to-manage-logfiles-with-logrotate-on-ubuntu-22-04>`_ или ознакомьтесь с `руководством по logrotate <https://manpages.ubuntu.com/manpages/jammy/man8/logrotate.8.html>`_.

source: Configure Core logs
ru: Настройте логи Core

source: Enable logging to file
ru: Включить ведение логов в файл

source: Use ``dashmate config set`` to configure a location for storing Core logs on the host file system. Replace the example path with one that matches your system:
ru: Используйте ``dashmate config set`` для настройки места хранения логов Core в файловой системе хоста. Замените приведенный в примере путь на тот, который соответствует вашей системе:

source: Toggle debug logs
ru: Переключение логов отладки

source: To enable debug logging for additional details, run the following command. Debug logs can be turned off by setting the value back to ``false``:
ru: Чтобы включить ведение отладочных логов для получения дополнительных сведений, выполните следующую команду. Логи отладки можно отключить, вернув значение в ``false``:

source: Advanced debug logging
ru: Расширенная система логирования отладки

source: Dashmate supports some advanced debug log options provided by Dash Core. The following boolean ``core.log.debug`` settings correspond directly to the parameters described in the `Core documentation <https://docs.dash.org/projects/core/en/stable/docs/dashcore/wallet-arguments-and-commands-dashd.html#debugging-testing-options>`_: ``ips``, ``sourceLocations``, ``threadNames``, and ``timeMicros``.
ru: Dashmate поддерживает некоторые расширенные параметры лога отладки, предоставляемые Dash Core. Следующие булевские настройки ``core.log.debug`` напрямую соответствуют параметрам, описанным в документации по ``Core`` <https://docs.dash.org/projects/core/en/stable/docs/dashcore/wallet-arguments-and-commands-dashd.html#debugging-testing-options>`_: ``ips``, ``sourceLocations``, ``threadNames`` и ``timeMicros``.

source: **Dashmate Debug Log Options**
ru: **Параметры логов отладки Dashmate**

source: **Setting**
ru: **Настройка**

source: **Description**
ru: **Описание**

source: Logs the IP addresses of incoming and outgoing connections
ru: Ведет логирование IP-адресов входящих и исходящих соединений

source: Logs the source locations (file and line number) for debugging information
ru: Записывает в лог местоположение исходного текста (номер файла и строки) для получения отладочной информации

source: Logs the names of the threads used for various operations
ru: Логирует имена потоков, используемых для различных операций

source: Logs timestamps with microsecond precision for detailed performance analysis
ru: Ведет логирование временных меток с микросекундной точностью для детального анализа производительности

source: Log only the specified categories (e.g., ``["net", "rpc"]``). If empty, all categories will be logged
ru: Записывать в логи только указанные категории (например, ``[«net», «rpc»]``). Если пусто, то будут логироваться все категории

source: Excludes specified categories from logging (e.g., ``["rpc", "instantsend"]``)
ru: Исключает указанные категории из логирования (например, ``[«rpc», «instantsend»]``)

source: View current log settings
ru: Просмотр текущих настроек логов

source: To view the current Core log settings, run:
ru: Чтобы просмотреть текущие настройки логирования Core, выполните команду:

source: Disable logging to file
ru: Отключить логирование в файл

source: To disable logging to a file outside the container, reset the log path to ``null``:
ru: Чтобы отключить ведение логов в файл за пределами контейнера, установите путь к журналу в значение ``null``:

source: Configure Platform logs
ru: Настройка логов платформы

source: For troubleshooting flexibility, dashmate provides independent log configuration for the Platform Gateway, Drive ABCI, and Tenderdash. Each service can be configured with the most helpful log level and output format.
ru: Для гибкости поиска и устранения неисправностей dashmate обеспечивает независимую настройку логов для шлюза платформы, Drive ABCI и Tenderdash. Для каждой службы можно настроить наиболее полезный уровень ведения логирования и формат вывода.

source: Gateway logs
ru: Логи шлюза

source: The Platform gateway has two types of logs: service logs and access logs. Service logs are directed to stdout, while access logs can be configured to go to stdout, stderr, or to a file. If all logs are directed to stdout, the output will be a mixture of service and access data.
ru: Шлюз Platform имеет два типа логов: логи служб и логи доступа. Логи обслуживания направляются в stdout, в то время как логи доступа могут быть настроены на вывод в stdout, stderr или в файл. Если все логи направляются в stdout, то на выходе будет смесь служебных данных и данных доступа.

source: **Enable file logging**
ru: **Включить логирование файлов**

source: Use ``dashmate config set`` to configure a location for storing Platform gateway access logs on the host file system. The example below adds file logging while also keeping the default stdout logging. Replace the example path with one that matches your system:
ru: Используйте ``dashmate config set`` для настройки места хранения логов доступа шлюза Platform в файловой системе хоста. Приведенный ниже пример добавляет ведение логов в файл, сохраняя при этом ведение логов по умолчанию в stdout. Замените путь в примере на тот, который соответствует вашей системе:

source: **Disable file logging**
ru: **Отключить логирование файлов**.

source: To disable logging to a file, remove the file config from the accessLogs setting:
ru: Чтобы отключить логирование в файл, удалите конфигурацию файла из параметра accessLogs:

source: **Change log level**
ru: **Изменить уровень логирования**

source: Platform gateway service logs support several levels of detail. In increasing order of detail they are: ``critical``, ``error``, ``warn``, ``info`` (default), ``debug``, and ``trace``. To disable service logs, set the log level to ``off``.
ru: Логи службы шлюза платформы поддерживают несколько уровней детализации. В порядке возрастания степени детализации это: ``critical``, ``error``, ``warn``, ``info`` (по умолчанию), ``debug`` и ``trace``. Чтобы отключить служебные журналы, установите уровень журнала на ``off``

source: The log level can be changed by using ``dashmate config set`` to update the ``platform.gateway.log.level`` value. For example, run these commands to change the gateway service log level to debug on your dashmate node:
ru: Уровень логирования можно изменить с помощью команды ``dashmate config set``, чтобы обновить значение ``platform.gateway.log.level``.

source: **View log settings**
ru: **Просмотр настроек логирования**

source: To view the current Platform gateway log settings, run:
ru: Чтобы просмотреть текущие настройки логов шлюза Platform, выполните команду:

source: Drive ABCI logs
ru: Логи Drive ABCI

source: Use ``dashmate config set`` to configure a location for storing Platform ABCI logs on the host file system. Replace the example path with one that matches your system:
ru: Используйте ``dashmate config set`` для настройки места хранения логов Platform ABCI в файловой системе хоста. Замените приведенный в примере путь на тот, который соответствует вашей системе:

source: To disable logging to a file, remove the file config from the logs setting:
ru: Чтобы отключить ведение логов в файл, удалите параметр file config из настройки logs:

source: Drive ABCI logs support several levels of detail. In increasing order of detail they are: ``error``, ``warn``, ``info`` (default), ``debug``, and ``trace``. A logging specification string can also be provided in the RUST_LOG format for more flexibility. To disable service logs, set the log level to ``silent``.
ru: Логи Drive ABCI поддерживают несколько уровней детализации. В порядке возрастания детализации они следующие: ``error'', ``warn'', ``info'' (по умолчанию), ``debug'' и ``trace''. Для большей гибкости можно также указать строку спецификации журнала в формате RUST_LOG. Чтобы отключить служебные логи, установите уровень логирования на ``silent``.

source: The log level can be changed by using ``dashmate config set`` to update the ``platform.drive.abci.logs.*.level`` value. For example, run these commands to change the log levels for file logging and stdout logging to debug on your dashmate node:
ru: Уровень логирования можно изменить с помощью команды ``dashmate config set``, чтобы обновить значение ``platform.drive.abci.logs.*.level``. Например, выполните эти команды, чтобы изменить уровни логирования для регистрации файлов и stdout для дебага вашей ноды dashmate:

source: Tenderdash logs
ru: Логи Tenderdash

source: Use ``dashmate config set`` to configure a location for storing Tenderdash logs on the host file system. Replace the example path with one that matches your system:
ru: Используйте ``dashmate config set`` для настройки места хранения логов Tenderdash в файловой системе хоста. Замените приведенный в примере путь на тот, который подходит для вашей системы:

source: To disable logging to a file, set the path back to ``null``:
ru: Чтобы отключить ведение логов в файл, установите путь обратно в ``null``:

source: Tenderdash logs support several levels of detail. In increasing order of detail they are: ``error``, ``warn``, ``info`` (default), ``debug``, and ``trace``. A logging specification string can also be provided in the RUST_LOG format for more flexibility. To disable service logs, set the log level to ``silent``.
ru: Логи Tenderdash поддерживают несколько уровней детализации. В порядке возрастания детализации они следующие: ``error``, ``warn``, ``info`` (по умолчанию), ``debug`` и ``trace``. Для большей гибкости можно также указать строку спецификации логирования в формате RUST_LOG. Чтобы отключить служебные журналы, установите уровень журнала на ``silent``.

source: The log level can be changed by using ``dashmate config set`` to update the ``platform.drive.abci.logs.*.level`` value. For example, run these commands to change the log level to debug on your dashmate node:
ru: Уровень логирования можно изменить с помощью команды ``dashmate config set``, чтобы обновить значение ``platform.drive.abci.logs.*.level``. Например, выполните эти команды, чтобы изменить уровень логирования для дебага вашей ноды dashmate:

source: To view the current Tenderdash log settings, run:
ru: Чтобы просмотреть текущие настройки логов Tenderdash, выполните команду:

source: Collect logs
ru: Сбор логов

source: Dashmate includes the doctor command to make troubleshooting and log reporting easier. The dashmate doctor command collects important debugging data about the masternode and creates a compressed report file that can be sent to the support team if necessary. This report includes:
ru: В состав Dashmate входит команда doctor, облегчающая поиск и устранение неисправностей и создание отчетов. Команда dashmate doctor собирает важные отладочные данные о мастерноде и создает сжатый файл отчета, который при необходимости может быть отправлен в службу поддержки. Этот отчет включает в себя:

source: **Operating System**: Details about the architecture, CPU, memory, and swap
ru: **Операционная система**: Подробные сведения об архитектуре, процессоре, памяти и swap

source: **Docker**: Status and logs (exit codes, stdout, stderr) for each service
ru: **Docker**: Состояние и журналы (exit codes, stdout, stderr) для каждой службы

source: **Core RPC**: Essential details like the best ChainLock, quorums, blockchain information, peers, and masternode status
ru: **Core RPC**: Такие важные данные, как лучший ChainLock, кворумы, информация о блокчейне, пиры и статус мастерноды.

source: **Tenderdash RPC**: Status, genesis, network information, ABCI details, and a consensus state dump
ru: **Tenderdash RPC**: Статус, генезис, информация о сети, детали ABCI и дамп состояния консенсуса

source: **Metrics**: Tenderdash and Drive metrics (if enabled in the configuration)
ru: **Метрики**: Метрики Tenderdash и Drive (если они включены в конфигурации)

source: To create a report, run ``dashmate doctor`` and select **Yes**::
ru: Чтобы создать отчет, запустите команду ``dashmate doctor`` и выберите **Yes**::

source: Run the doctor command
ru: Выполните команду "doctor"

source: Upon successful completion, the full path to the report archive is displayed.
ru: После успешного завершения отобразится полный путь к архиву отчета.

source: Doctor output
ru: вывод команды Docktor

source: Metrics
ru: Метрики

source: To provide better network visibility to DCG developers for troubleshooting, volunteers can contribute metrics to the DCG metrics server.
ru: Чтобы обеспечить разработчикам DCG лучшую визуализацию сети для устранения неполадок, волонтеры могут предоставлять метрики на сервер метрик DCG.

source: Enable metrics on your dashmate node
ru: Включите метрики на вашей ноде dashmate

source: Grant access to metrics from the DCG metrics server (34.219.3.238) by updating your network configuration (i.e., your firewall, AWS security groups, etc.)
ru: Предоставьте доступ к метрикам с сервера метрик DCG (34.219.3.238), обновив конфигурацию сети (т. е. брандмауэр, группы безопасности AWS и т. д.).

source: Provide DCG with your IP address and port so it can be added to the DCG Prometheus server
ru: Сообщите DCG свой IP-адрес и порт, чтобы его можно было добавить на сервер DCG Prometheus

source: Additional Information
it: Informazioni aggiuntive
ru: Дополнительная информация

source: For further documentation see the `dashmate repository <https://github.com/dashpay/platform/blob/master/packages/dashmate/README.md>`__.
it: Per ulteriore documentazione consultare il `repository dashmate <https://github.com/dashpay/platform/blob/master/packages/dashmate/README.md>`__.
ru: Дополнительную документацию можно найти в репозитории `dashmate <https://github.com/dashpay/platform/blob/master/packages/dashmate/README.md>`__.

source: dash, wallet, core, platform, evonode, masternodes, dashmate
it: dash, wallet, core, platform, evonode, masternode, dashmate
