Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/introduction/about.po
Languages: fr, ko, ru, zh_cn

source: Introduction to the Dash cryptocurrency and links to further reading
fr: Introduction à la cryptomonnaie Dash et liens pour en savoir plus
ko: 암호화폐 대시의 소개 및 관련 페이지 링크
ru: Знакомство с криптовалютой Dash и ссылки на дополнительные материалы
zh_cn: 有关加密数字货币达世币的介绍和相关阅读的链接

source: dash, cryptocurrency, videos, documentation, roadmap, governance, funding, payments, whitepaper, roadmap
fr: dash, cryptomonnaie, vidéos, documentation, feuille de route, gouvernance, financement, paiements, livre blanc, feuille de route
ko: 대시, 암호화폐, 비디오, 문서, 로드맵, 거버넌스, 자금 지원, 지불, 백서, 로드맵
ru: dash, криптовалюта, видео, документация, дорожная карта, управление, финансирование, платежи, белая книга, дорожная карта
zh_cn: 达世币，加密数字货币，视频文档，路线图，管理，资金，支付，白皮书，路线图

source: What is Dash?
fr: Qu'est-ce que Dash ?
ko: 대시란 무엇인가?
ru: Что такое Dash?
zh_cn: 什么是达世币？

source: Dash aims to be the most user-friendly and scalable payments-focused cryptocurrency in the world. The Dash network features :ref:`instant transaction confirmation <instantsend>`, double spend protection, optional :ref:`privacy <coinjoin>` equal to that of physical cash, a :ref:`self-governing, self-funding model <decentralized-governance>` driven by :ref:`incentivized full nodes <masternode-network>` and a `clear roadmap <https://www.dash.org/roadmap/>`_ for on-chain scaling to up to 400MB blocks using custom-developed open source hardware. While Dash is based on Bitcoin and compatible with many key components of the Bitcoin ecosystem, its two-tier network structure offers significant improvements in transaction speed, privacy and governance. This section of the documentation describes these and many more key features that set Dash apart in the blockchain economy.
fr: Dash a pour ambition d'être la cryptomonnaie la plus simple d'utilisation au monde et la plus adaptée aux paiements. Le réseau Dash propose une :ref:`confirmation instantanée des transactions <instantsend>`, une protection contre les doubles dépenses, un :ref:`anonymat <coinjoin>` facultatif similaire à celui de l'argent liquide, un :ref:`système de gouvernance autogéré et autofinancé <decentralized-governance>` s'appuyant sur :ref:`des nœuds rétribués <masternode-network>`, et une `feuille de route claire <https://www.dash.org/roadmap/>`_ vers un objectif de blocs de 400 Mo associé à du matériel informatique dédié et open source. Tout en étant basé sur Bitcoin et compatible avec beaucoup de composants clés de l'écosystème Bitcoin, Dash offre, grâce à son réseau à deux niveaux, des améliorations significatives en matière de vitesse de transaction, d'anonymat et de gouvernance. Cette section de la documentation décrit ces avantages, mais aussi bien d'autres fonctions clés qui distinguent profondément Dash du reste de l'économie blockchain.
ru: Миссия Dash - быть самой масштабируемой и дружелюбной к пользователю криптовалютой в мире. Уникальные особенности Dash: :ref:`мгновенное подтверждение транзакции <instantsend>`, защита от двойной траты, :ref:`опциональная приватность <coinjoin>` не хуже чем у бумажных денег, :ref:`децентрализованное самоуправление и самофинансирование <decentralized-governance>` на основе :ref:`самоокупаемых полных нод <masternode-network>` и `прозрачный план-концепция <https://www.dash.org/ru/roadmap/>`__ масштабов операций на блокчейне вплоть до блоков размером в 400MB с применением специального оборудования с открытой архитектурой. Dash основан на том же коде, что и Биткойн, поэтому он легко совместим с ключевыми компонентами биткойн-экосистемы, но, вместе с тем, его двухуровневая сетевая структура может предложить гораздо большую скорость транзакций, приватность и управляемость сети. Этот раздел документации описывает эти и многие другие ключевые отличительные особенности Dash в криптоэкономике.

source: Check out the `official Dash website <https://www.dash.org/>`__ to learn how `individuals <https://www.dash.org/individuals/>`__ and `businesses <https://www.dash.org/businesses/>`__ can use Dash. The videos, links and documentation collected here can help you get started, or use the table of contents on the left to find a specific topic of interest. New users may be interested in getting started with an appropriate :ref:`wallet <wallets>`, learning about :ref:`how to buy Dash <how-to-buy>` and :ref:`where to spend Dash <earning-spending>`, learning about :ref:`safety <safety>` or joining one of the many :ref:`Dash community sites <information>`.
fr: Veuillez consulter le `site officiel Dash <https://www.dash.org/fr>`__ pour savoir comment des `particuliers <https://www.dash.org/fr/particuliers/>`__ et des `professionnels <https://www.dash.org/fr/professionnels/>`__ peuvent utiliser Dash. Les vidéos, les liens et la documentation réunis ici vous aideront à entrer dans l'univers Dash. Vous pouvez aussi utiliser la table des matières sur la gauche pour consulter un sujet particulier. Les nouveaux utilisateurs seront peut-être intéressés d'apprendre comment ouvrir un :ref:`portefeuille <wallets>`, :ref:`acheter des dashs <how-to-buy>` et :ref:`dépenser des dashs <earning-spending>`, ou encore comment assurer leur :ref:`sécurité <safety>` ou rejoindre l'un des nombreux :ref:`sites communautaires Dash <information>`.
ru: Загляните на официальный сайт Dash <https://www.dash.org/>`__, чтобы узнать, как частные лица <https://www.dash.org/individuals/>`__ и предприятия <https://www.dash.org/businesses/>`__ могут использовать Dash. Собранные здесь видеоролики, ссылки и документация помогут вам начать работу, или воспользуйтесь оглавлением слева, чтобы найти интересующую вас тему. Новым пользователям может быть интересно начать работу с подходящим :ref:`кошельком <wallets>`, узнать о :ref:`как купить Dash <how-to-buy>` и :ref:`куда потратить Dash <earning-spending>`, узнать о :ref:`безопасности <safety>` или присоединиться к одному из многочисленных :ref:`сайтов сообщества Dash <information>`.

source: Dash Videos
fr: Vidéos Dash
ko: 대시 비디오
ru: Видеоматериалы Dash
zh_cn: 达世币视频

source: Armenian Crypto School has produced an in-depth video describing Dash and its many distinguishing features.
fr: L'Armenian Crypto School a réalisé une vidéo décrivant Dash en profondeur, avec ses nombreuses caractéristiques uniques.
ru: Армянская криптошкола подготовила подробный видеоролик, рассказывающий о Dash и ее многочисленных отличительных особенностях.

source: Dash School is a six-part video series produced by Amanda B. Johnson. It explains Dash from a beginner's level up to descriptions of the more advanced features.
fr: "Dash School" est une série de six vidéos produites par Amanda B. Johnson. Elle explique Dash d'un point de vue de débutant jusqu'aux fonctions les plus avancées.
ko: 대시 스쿨은 Amanda B. Johnson이 제작한 6부작 영상입니다. 초급자부터 고급 기능에 이르기까지, 대시에 관한 설명을 제공합니다.
ru: Школа Dash это шестисерийное видео, подготовленное Амандой Джонсон. В них она объясняет принципы работы Dash от самых основ до чуть более сложных технических деталей.
zh_cn: 达世币学堂是一个视频系列节目，分为六期，由Amanda B. Johnson制作。它从入门到非常深入地解释了达世币项目特性。

source: Dash 101 is an eight-part video series produced by Aaron Koenig. It covers unique features and functions only available on the Dash network, and is available in `English <https://www.youtube.com/watch?v=DzH7cMbZQHI&list=PLiFMZOlhgsYIDP2V2XsuTFZu1C1sV5ohr>`__, `French <https://www.youtube.com/watch?v=CMGXChAR9f4&list=PLiFMZOlhgsYJvvpWN9xGSxwIVejOWVXKZ>`__, `German <https://www.youtube.com/watch?v=0YyDGu17IE4&list=PLiFMZOlhgsYKrbanA3ng7oh2aNRh7D98V>`__, `Spanish <https://www.youtube.com/watch?v=AwqrG_K8nzw&list=PLiFMZOlhgsYK8P_NViNEJKCzADzdT8k0R>`__ and `Russian <https://www.youtube.com/watch?v=cAPgPUMVwzo&list=PLiFMZOlhgsYKBYORZIReix5hejKj08nUk>`__.
fr: "Dash 101" est une série de huit vidéos produite par Aaron Koenig. Elle explique les caractéristiques et fonctions uniques du réseau Dash, et elle est disponible en `anglais <https://www.youtube.com/watch?v=DzH7cMbZQHI&list=PLiFMZOlhgsYIDP2V2XsuTFZu1C1sV5ohr>`__, `français <https://www.youtube.com/watch?v=CMGXChAR9f4&list=PLiFMZOlhgsYJvvpWN9xGSxwIVejOWVXKZ>`__, `allemand <https://www.youtube.com/watch?v=0YyDGu17IE4&list=PLiFMZOlhgsYKrbanA3ng7oh2aNRh7D98V>`__, `espagnol <https://www.youtube.com/playlist?list=PLiFMZOlhgsYK8P_NViNEJKCzADzdT8k0R>`__ et `russe <https://www.youtube.com/playlist?list=PLiFMZOlhgsYKBYORZIReix5hejKj08nUk>`__.
ko: 대시학개론은 Aaron Koenig이 제작 한 8부작 영상 시리즈로, 대시 네트워크에서만 가능한 고유 특징과 기능을 다루고 있습니다. 현재 지원되는 언어는 다음과 같습니다. `영어 <https://www.youtube.com/watch?v=DzH7cMbZQHI&list=PLiFMZOlhgsYIDP2V2XsuTFZu1C1sV5ohr>`__, `프랑스어 <https://www.youtube.com/watch?v=CMGXChAR9f4&list=PLiFMZOlhgsYJvvpWN9xGSxwIVejOWVXKZ>`__, `독일어 <https://www.youtube.com/watch?v=0YyDGu17IE4&list=PLiFMZOlhgsYKrbanA3ng7oh2aNRh7D98V>`__, `스페인어 <https://www.youtube.com/watch?v=AwqrG_K8nzw&list=PLiFMZOlhgsYK8P_NViNEJKCzADzdT8k0R>`__ `러시아어 <https://www.youtube.com/watch?v=cAPgPUMVwzo&list=PLiFMZOlhgsYKBYORZIReix5hejKj08nUk>`__.
ru: Dash 101 это восемь видеороликов, снятых Аароном Кэнигом. В них рассказывается про уникальные особенности и функции, доступные только в сети Dash. Видео доступно на `английском <https://www.youtube.com/watch?v=DzH7cMbZQHI&list=PLiFMZOlhgsYIDP2V2XsuTFZu1C1sV5ohr>`__, `французском <https://www.youtube.com/watch?v=CMGXChAR9f4&list=PLiFMZOlhgsYJvvpWN9xGSxwIVejOWVXKZ>`__, `немецком <https://www.youtube.com/watch?v=0YyDGu17IE4&list=PLiFMZOlhgsYKrbanA3ng7oh2aNRh7D98V>`__, `испанском <https://www.youtube.com/watch?v=AwqrG_K8nzw&list=PLiFMZOlhgsYK8P_NViNEJKCzADzdT8k0R>`__ и `русском <https://www.youtube.com/watch?v=cAPgPUMVwzo&list=PLiFMZOlhgsYKBYORZIReix5hejKj08nUk>`__.
zh_cn: 达世币 101系列节目由Aaron Koenig制作，分为八期。它讲述了达世币网络独有的特点和功能，并为多国语言版。\ `英语 <https://www.youtube.com/watch?v=DzH7cMbZQHI&list=PLiFMZOlhgsYIDP2V2XsuTFZu1C1sV5ohr>`__、`法语 <https://www.youtube.com/watch?v=CMGXChAR9f4&list=PLiFMZOlhgsYJvvpWN9xGSxwIVejOWVXKZ>`__、`德语 <https://www.youtube.com/watch?v=0YyDGu17IE4&list=PLiFMZOlhgsYKrbanA3ng7oh2aNRh7D98V>`__、`西班牙语\ <https://www.youtube.com/watch?v=AwqrG_K8nzw&list=PLiFMZOlhgsYK8P_NViNEJKCzADzdT8k0R>`__\ 和\ `俄语 <https://www.youtube.com/watch?v=cAPgPUMVwzo&list=PLiFMZOlhgsYKBYORZIReix5hejKj08nUk>`__。

source: Whitepaper
fr: Livre blanc
ko: 화이트페이퍼
ru: Белая книга
zh_cn: 白皮书

source: The Dash Whitepaper describes the original unique value proposition and key innovations in Dash from an academic and theoretical perspective. It is a historical document available as a GitHub wiki, and no longer receives updates as new features or architectural changes are implemented. Instead, these features are described in successive Dash Improvement Proposals (DIPs), while larger architectural changes are described in separate whitepapers. Features backported from Bitcoin are described in Bitcoin Improvement Proposals (BIPs).
fr: Le livre blanc Dash détaille la proposition unique et les innovations clés de Dash d'un point de vue scientifique et théorique. C'est un document historique disponible sous forme de wiki GitHub, qui n'est plus mis à jour au fur et à mesure que de nouvelles fonctions ou des changements d'architecture sont implémentés. À la place, ces nouvelles fonctionnalités sont décrites dans les propositions d'amélioration de Dash (Dash Improvement Proposals, DIPs) successives, tandis que les changements importants d'architecture sont décrits dans des livres blancs séparés. Les fonctionnalités rétroportées depuis Bitcoin sont décrites dans les propositions d'amélioration de Bitcoin (BIPs).
ru: В Dash "Whitepaper" описывается оригинальное уникальное ценностное предложение и ключевые инновации в Dash с академической и теоретической точек зрения. Это исторический документ, доступный в виде вики на GitHub, и он больше не обновляется по мере внедрения новых функций или архитектурных изменений. Вместо этого данные функции описываются в последовательных предложениях по улучшению Dash (DIP), а более крупные архитектурные изменения - в отдельных документах. Функции, перенесенные из Bitcoin, описываются в предложениях по улучшению Bitcoin (BIP).

source: `Whitepaper and translations <https://github.com/dashpay/dash/wiki/Whitepaper>`_
fr: `Livre blanc et traductions <https://github.com/dashpay/dash/wiki/Whitepaper>`_
ru: `Whitepaper и официальные переводы <https://github.com/dashpay/dash/wiki/Whitepaper>`_

source: `PDF whitepaper <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20V2.pdf>`_
fr: `Livre blanc au format PDF <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20V2.pdf>`_
ko: `백서 PDF <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20V2.pdf>`_
ru: `Белая книга в PDF <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20V2.pdf>`_
zh_cn: `PDF 白皮书 <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20V2.pdf>`_

source: `Dash Improvement Proposals (DIPs) <https://github.com/dashpay/dips>`_
fr: `Propositions d'amélioration de Dash (Dash Improvement Proposals, DIPs) <https://github.com/dashpay/dips>`_

source: `Bitcoin Improvement Proposals (BIPs) <https://github.com/bitcoin/bips>`_
fr: `Propositions d'amélioration de Bitcoin (Bitcoin Improvement Proposals, BIPs) <https://github.com/bitcoin/bips>`_

source: `Evolution Initial Design Document <https://www.dash.org/wp-content/uploads/Dash-Evolution-Initial-Design-Document.pdf>`_
fr: `Document originel du projet Evolution <https://www.dash.org/wp-content/uploads/Dash-Evolution-Initial-Design-Document.pdf>`_
ru: Начальный план эволюции <https://www.dash.org/wp-content/uploads/Dash-Evolution-Initial-Design-Document.pdf>`_

source: `Original Darkcoin whitepaper (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Darkcoin.pdf>`_
fr: `Livre blanc original Darkcoin (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Darkcoin.pdf>`_
ko: `기존 다크코인 화이트페이퍼 (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Darkcoin.pdf>`_
ru: `Оригинальная техническая концепция Darkcoin (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Darkcoin.pdf>`_
zh_cn: `原始暗黑币白皮书 (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Darkcoin.pdf>`_

source: `InstantSend whitepaper (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_
fr: `Livre blanc InstantSend (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_
ko: `인스턴드샌드 화이트페이퍼 (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_
ru: `Техническая концепция InstantSend (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_
zh_cn: `即时支付白皮书 (PDF) <https://github.com/dashpay/docs/raw/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_

source: Roadmap
fr: Feuille de route
ko: 로드맵
ru: План-концепция
zh_cn: 路线图

source: The Dash Roadmap sets out delivery milestones for future releases of Dash and includes specific technical details describing how the development team plans to realise each challenge.
fr: La feuille de route Dash définit les grandes étapes des futures versions de Dash. Elle comprend des détails techniques spécifiques, expliquant comment l'équipe de développement compte réaliser chaque objectif.
ko: 대시 로드맵은 대시의 향후 출시에 관한 전달 일정을 제시하고, 개발 팀이 각 과제를 실현하는 데 필요한 계획을 실현하기 위한 자세한 기술적 세부 사항을 설명합니다.
ru: План-концепция Dash описывает разрабатываемые и планируемые версии, устанавливает сроки внедрения каждой и включает технические детали, описывающие их схему реализации.
zh_cn: Dash 路线图提出了未来 Dash 发布的里程碑并包含了相关特殊技术细节关于开发团队如何计划发布每个挑战。

source: `Dash Roadmap <https://www.dash.org/roadmap/>`_
fr: `Feuille de route Dash <https://www.dash.org/fr/feuille-de-route/>`_
ru: `Дорожная карта Dash <https://www.dash.org/roadmap/>`_

source: Dash School
ko: 대시 스쿨
ru: Школа Dash
zh_cn: 达世币学堂

source: Dash 101
ko: 대시학개론
zh_cn: 达世币 101
