Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/introduction/information.po
Languages: ru, zh_cn

source: Glossary and collection of links to other parts of the Dash ecosystem and network
ru: Глоссарий и ссылки на различные части экосистемы и сети Dash
zh_cn: 达世币生态体系和网络的相关词汇及链接

source: dash, cryptocurrency, glossary, links, dao, community, official, github, roadmap, chat, discord, facebook, twitter, telegram, social media
ru: dash, криптовалюта, глоссарий, ссылки, дао, сообщество, официальный, github, дорожная карта, чат, discord, facebook, twitter, telegram, социальные медиа

source: Links and Information
ru: Ссылки и Информация
zh_cn: 链接及资讯

source: Links
ru: Ссылки
zh_cn: 链接

source: Official sites
ru: Официальные сайты
zh_cn: 官方网站

source: **Website:** https://www.dash.org
ru: **Вебсайт:** https://www.dash.org

source: **User documentation:** https://docs.dash.org
ru: **Пользовательская документация:** https://docs.dash.org
zh_cn: **用户文档:** https://docs.dash.org

source: **Dash Core Documentation:** https://docs.dash.org/core
ru: **Документация Dash Core** https://docs.dash.org/core

source: **Dash Platform Documentation:** https://docs.dash.org/platform
ru: **Документация платформы Dash** https://docs.dash.org/platform

source: **Roadmap:** https://www.dash.org/roadmap/
ru: **Дорожная карта:** https://www.dash.org/roadmap/

source: **DIPs:** https://github.com/dashpay/dips
ru: **DIP-ы:** https://github.com/dashpay/dips

source: Community sites
ru: Сайты сообщества
zh_cn: 社区网站

source: Forums
ru: Форумы
zh_cn: 论坛

source: **Dash Forum**: https://www.dash.org/forum/
ru: **Форум Dash**: https://www.dash.org/forum/

source: **BitcoinTalk thread:** https://bitcointalk.org/index.php?topic=421615.0
ru: **Тред на Bitcointalk:** https://bitcointalk.org/index.php?topic=421615.0
zh_cn: **BitcoinTalk 创始贴:** https://bitcointalk.org/index.php?topic=421615.0

source: Chat
ru: Чат
zh_cn: 聊天社区

source: **Dash Discord:** https://discord.com/invite/PXbUxJB
ru: **Дискорд Dash:** https://discord.com/invite/PXbUxJB

source: **Dash Dapp Devs Discord:** https://chat.dashdevs.org
ru: **Дискорд разработчиков dApps на Dash** https://chat.dashdevs.org

source: **Dash English Telegram:** https://t.me/dash_chat
ru: **Английский Dash чат в Telegram:** https://t.me/dash_chat
zh_cn: **Dash 英文 Telegram:** https://t.me/dash_chat

source: **Dash Brasil Telegram:** https://telegram.me/dashbrasil
ru: **Бразильский Dash чат в Telegram:** https://telegram.me/dashbrasil
zh_cn: **Dash 巴西 Telegram:** https://telegram.me/dashbrasil

source: **Dash Russia Telegram:** https://telegram.me/Dash_Ru
ru: **Русский Dash чат в Telegram:** https://telegram.me/Dash_Ru
zh_cn: **Dash 俄罗斯 Telegram:** https://telegram.me/Dash_Ru

source: **Dash en Español Telegram:** https://t.me/dashpayES
ru: **Испанский Telegram Dash** https://t.me/dashpayES

source: **Dash Embassy D-A-CH auf Deutsch Telegram:** https://t.me/dashembassydach
ru: **Dash Embassy D-A-CH на немецком в Telegram:** https://t.me/dashembassydach
zh_cn: **Dash Embassy D-A-CH auf 德语电报群:** https://t.me/dashembassydach

source: **Dash Telegram News Bot:** https://telegram.me/dashnews
ru: **Новостной бот Dash в Telegram:** https://telegram.me/dashnews
zh_cn: **Dash Telegram 新闻机器人:** https://telegram.me/dashnews

source: Social media
ru: Социальные сети
zh_cn: 社交媒体

source: **English (Official):** https://www.facebook.com/DashPay
ru: **Английский (Официальный):** https://www.facebook.com/DashPay
zh_cn: **英文（官方）:** https://www.facebook.com/DashPay

source: **Dash News En Español:** https://www.facebook.com/DashNewsEspanol
ru: **Испанский Dash News:** https://www.facebook.com/DashNewsEspanol
zh_cn: **达世币新闻 西班牙语:** https://www.facebook.com/DashNewsEspanol

source: **Brazil:** https://www.facebook.com/DashBrazil
ru: **Бразилия:** https://www.facebook.com/DashBrazil
zh_cn: **巴西:** https://www.facebook.com/DashBrazil

source: **Denmark:** https://www.facebook.com/DashDenmark
ru: **Дания:** https://www.facebook.com/DashDenmark
zh_cn: **丹麦:** https://www.facebook.com/DashDenmark

source: **Germany:** https://www.facebook.com/dashgermany
ru: **Германия:** https://www.facebook.com/dashgermany
zh_cn: **德国:** https://www.facebook.com/dashgermany

source: **Greece:** https://www.facebook.com/DashGreece
ru: **Греция:** https://www.facebook.com/DashGreece
zh_cn: **希腊:** https://www.facebook.com/DashGreece

source: **Poland:** https://www.facebook.com/Dash.Polska
ru: **Польша:** https://www.facebook.com/Dash.Polska
zh_cn: **波兰:** https://www.facebook.com/Dash.Polska

source: **Russia:** https://www.facebook.com/Dash.Russia
ru: **Россия:** https://www.facebook.com/Dash.Russia
zh_cn: **俄罗斯:** https://www.facebook.com/Dash.Russia

source: **Vietnam:** https://www.facebook.com/dashvietnam
ru: **Вьетнам:** https://www.facebook.com/dashvietnam
zh_cn: **越南:** https://www.facebook.com/dashvietnam

source: **Dash Official Account:** https://twitter.com/dashpay
ru: **Официальный аккаунт Dash:** https://twitter.com/dashpay
zh_cn: **达世币官方账号:** https://twitter.com/dashpay

source: **Samuel Westrich, CTO of Dash Core Group:** https://twitter.com/SamWestrich/
ru: **Самуэль Вестрич, CTO Dash Core Group:** https://twitter.com/SamWestrich/

source: **Joël Valenzuela, Chief Editor, Dash Force News:** https://twitter.com/TheDesertLynx
ru: **Джоэл Валенсуэла, главный редактор, Dash Force News:** https://twitter.com/TheDesertLynx
zh_cn: **Joël Valenzuela, 主编, Dash Force News:** https://twitter.com/TheDesertLynx

source: **とみ三（Samurai33）, Dash Japan:** https://twitter.com/samurai3311
ru: **とみ三（Samurai33）, из Dash Японии:** https://twitter.com/samurai3311
zh_cn: **とみ三（Samurai33）, 达世币日本:** https://twitter.com/samurai3311

source: News
ru: Новости
zh_cn: 新闻

source: **Dash News En Español (YouTube):** https://www.youtube.com/channel/UCG6Cuh8Q2eUt4NlZu4K-u8g
ru: **Новости Dash на испанском (YouTube):** https://www.youtube.com/channel/UCG6Cuh8Q2eUt4NlZu4K-u8g
zh_cn: **Dash News 西班牙语 (YouTube):** https://www.youtube.com/channel/UCG6Cuh8Q2eUt4NlZu4K-u8g

source: **Dash News Korea:** https://dashnewskorea.com
ru: **Новости Dash в Корее:** https://dashnewskorea.com
zh_cn: **Dash News 韩国:** https://dashnewskorea.com

source: **Dash News China (Wechat):** dashnews (or scan QR below)
ru: **Dash News Китай (Wechat):** dashnews (или просканируйте QR ниже)
zh_cn: **达世币中国资讯 (微信公众号):** dashnews (或扫描下方QR码)

source: Blogs
ru: Блоги
zh_cn: 博客

source: **Evan Duffield's blog:** https://medium.com/@eduffield222
ru: **Блог Эвана Даффилда:** https://medium.com/@eduffield222

source: Wikipedia
ru: Википедия
zh_cn: 维基百科

source: Inactive
ru: Неактивные
zh_cn: 无效的

source: **Bitcoin.com forum:** https://forum.bitcoin.com/dash-f67
ru: **Форум Bitcoin.com:** https://forum.bitcoin.com/dash-f67
zh_cn: **Bitcoin.com 论坛:** https://forum.bitcoin.com/dash-f67

source: **Crypto-city.com page:** https://www.crypto-city.com/index.php/dash-dash-coin
ru: **Страница на Crypto-city.com:** https://www.crypto-city.com/index.php/dash-dash-coin
zh_cn: **Crypto-city.com 网页:** https://www.crypto-city.com/index.php/dash-dash-coin

source: **Bitco.in forum:** https://bitco.in/forum/threads/dash-digitalcash.891
ru: **Форум Bitco.in:** https://bitco.in/forum/threads/dash-digitalcash.891
zh_cn: **Bitco.in 论坛:** https://bitco.in/forum/threads/dash-digitalcash.891

source: Tools
ru: Инструменты
zh_cn: 工具

source: Block explorers, statistics and visualizations
ru: Эксплореры блоков, статистика и визуальное отображение
zh_cn: 区块链浏览器，数据统计和图像

source: Treasury tools
ru: Инструменты Бюджета
zh_cn: 预算工具

source: Masternode management
ru: Управление Мастернодой
zh_cn: 主节点管理

source: Price monitoring and research
ru: Наблюдение за ценой и статистикой

source: Dash Community project
ru: Проект Сообщество Dash
zh_cn: 达世币社区项目

source: DarkNet pages
ru: Страницы в DarkNet
zh_cn: 暗网网页

source: **Dash (Mirror of Main Page):** http://dashorg64cjvj4s3.onion
ru: **Dash (Зеркало главной страницы):** http://dashorg64cjvj4s3.onion
zh_cn: **Dash (镜像主页):** http://dashorg64cjvj4s3.onion

source: **The Hidden Wiki:** `http://zqktlwi4fecvo6ri.onion/wiki/Dash_-_DigitalCash <http://zqktlwi4fecvo6ri.onion/wiki/Dash_-_DigitalCash>`_
ru: **Спрятанная Вики:** `http://zqktlwi4fecvo6ri.onion/wiki/Dash_-_DigitalCash <http://zqktlwi4fecvo6ri.onion/wiki/Dash_-_DigitalCash>`_

source: Mobile Apps
ru: Мобильные приложения
zh_cn: 手机Apps

source: **Dash Wallet:** https://apps.apple.com/app/id1206647026
ru: **Кошелёк Dash:** https://apps.apple.com/app/id1206647026

source: **Edge:** https://apps.apple.com/app/id1344400091
ru: **Кошелёк Edge:** https://apps.apple.com/app/id1344400091

source: **Coinomi:** https://apps.apple.com/app/id1333588809
ru: **Кошелёк Coinomi:** https://apps.apple.com/app/id1333588809

source: **Exodus:** https://apps.apple.com/app/id1414384820
ru: **Кошелёк Exodus:** https://apps.apple.com/app/id1414384820

source: **Dash Wallet:** https://play.google.com/store/apps/details?id=hashengineering.darkcoin.wallet
ru: **Кошелёк Dash:** https://play.google.com/store/apps/details?id=hashengineering.darkcoin.wallet
zh_cn: **Dash 钱包:** https://play.google.com/store/apps/details?id=hashengineering.darkcoin.wallet

source: **Edge:** https://play.google.com/store/apps/details?id=co.edgesecure.app
ru: **Кошелёк Edge:** https://play.google.com/store/apps/details?id=co.edgesecure.app

source: **Coinomi:** https://play.google.com/store/apps/details?id=com.coinomi.wallet
ru: **Кошелёк Coinomi:** https://play.google.com/store/apps/details?id=com.coinomi.wallet

source: **Exodus:** https://play.google.com/store/apps/details?id=exodusmovement.exodus
ru: **Кошелёк Exodus:** https://play.google.com/store/apps/details?id=exodusmovement.exodus

source: Glossary
ru: Глоссарий
zh_cn: 术语

source: 51% Attack
ru: 51% атака
zh_cn: 51% 攻击

source: A condition in which more than half the computing power on a cryptocurrency network is controlled by a single miner or group of miners. That amount of power theoretically makes them the authority on the network. This means that every client on the network believes the attacker’s hashed transaction block.
ru: Состояние, в котором больше половины вычислительной мощности в криптоватолютной сети контролируется одним майнером или группой майнеров. Такое количество мощности теоретически наделяет их властью над сетью. Это означает, что каждый клиент в сети верит хэшированному блоку транзакций, который сгенерировал атакущий.
zh_cn: 一旦某个加密数字货币的超过一半的算力由某一位或某一群矿工所控制，那么，这些在在算力数量上独占优势的矿工就会成为该网络的权威人士。这就意味着，网络上的每个客户端都会信任这些潜在的网络攻击者验证后的交易区块。

source: Address
ru: Адрес
zh_cn: 地址

source: A Dash address is used to :ref:`Send/Receive a Payment <dashcore-send-receive>` on the Dash network. It contains a string of alphanumeric characters, but can also be represented as a scannable QR code. A Dash address is also the public key in the pair of keys used by Dash holders to digitally sign transactions (see Public key).
ru: Адрес Dash используется для того, чтобы :ref:`Получить или Отправить Платёж <dashcore-send-receive>` в сети Dash. Он состоит из строки букв и цифр, но также может выглядеть как QR код. Адрес Dash - это также и открытый ключ из пары ключей, которая используется владельцами Dash, чтобы подписывать транзакции электронной подписью (см. Открытый ключ).
zh_cn: 达世币地址用于\ :ref:`在达世币网络上完成达世币的发送/接收 <dashcore-send-receive>`\ 。它包含一连串由字母和数字组成的字符，或者以可扫描的二维码的形式出现。达世币地址同时也可以充当达世币用户的公钥，从而以数字化的方式授权交易（请参照公钥词条浏览相关信息）。

source: Algorithm
ru: Алгоритм
zh_cn: 算法

source: In mathematics and computer science, an `algorithm <https://en.wikipedia.org/wiki/Algorithm>`_ is a self-contained step-by-step set of operations to be performed. Algorithms perform calculation, data processing, and/or automated reasoning tasks.
ru: В математике и информатике, `aлгоритм <https://en.wikipedia.org/wiki/Algorithm>`_ - это независимый пошаговый набор действий, которые нужно выполнить. С помощью алгоритмов производятся расчёты, обработка данных, и/или выполнение автоматических логических задач.
zh_cn: 根据维基百科的定义，\ `算法 <https://en.wikipedia.org/wiki/Algorithm>`_\ 指的是在数学和计算机科学之中，任何独立且定义完备的具体计算步骤，通常用于计算、数据处理和自动推理。

source: Altcoin
ru: Альткоин
zh_cn: 竞争币

source: Since Bitcoin was the first cryptocurrency and has the largest market capitalization, it is considered as the reference. An altcoin, or alternative coin, is any cryptocurrency other than Bitcoin.
ru: Поскольку Биткойн был первой криптовалютой, и у него самая большая рыночная капитализация, он используется в качестве эталона. Альткоин, или альтернативная монета, это любая другая криптовалюта кроме Биткойна.
zh_cn: 比特币是全球首个加密数字货币，它的市值比其它币种都要高。考虑到这些因素，比特币往往被当作行业的标杆，而通常所说的竞争币往往是指除比特币之外的其它任何加密数字货币。

source: Anti-Money Laundering techniques are used to stop people from making illegally obtained funds appear as though they have been earned legally. AML mechanisms can be legal or technical in nature. Regulators frequently apply AML techniques to Dash exchanges.
ru: Методы AML применяются для того, чтобы люди не выдавали нелегально полученные средства за легально заработанный доход. Механизмы AML по своей природе могут быть техническими или юридическими. Регулирующие органы часто применяют техники AML к обменникам Dash.
zh_cn: 反洗钱技术用于防止人们将非法所得合法化，从本质上来说，它是技术或法律操作。监管机构经常将反洗钱技术应用于达世币交易平台。

source: In computer programming, an `application programming interface (API) <https://en.wikipedia.org/wiki/Application_programming_interface>`_ is a set of routines, protocols, and tools for building software and applications.
ru: В компьютерном программировании, `программный интерфейс приложения (API) <https://en.wikipedia.org/wiki/Application_programming_interface>`_ это набор функций, протоколов и инструментов для разработки программного обеспечения и приложений.
zh_cn: 据维基百科的定义，\ `应用程序接口 （API） <https://en.wikipedia.org/wiki/Application_programming_interface>`_\ 指的是在计算机编程中，用于软件和应用程序建设的一系列惯例、协议和工具。

source: An API expresses a software component in terms of its operations, inputs, outputs, and underlying types, defining functionalities that are independent of their respective implementations, which allows definitions and implementations to vary without compromising the interface. A good API makes it easier to develop a program by providing all the building blocks, which are then put together by the programmer.
ru: API описывает части программы с точки зрения её операций, входящих и исходящих данных и соответствующих типов, определяющих функциональные возможности, которые являются независимыми от соответствующих им реализаций, что позволяет использовать различные определения и реализации, не ставя под угрозу интерфейс. Хороший API облегчает разработку программы, предоставляя готовые блоки, которые программист затем собирает в готовое решение.
zh_cn: 应用程序接口通常以软件的操作、输入、输出和默认类型来表达其成分，并定义独立于各个部分之外的总体功能。这就意味着，在应用手续接口界面不受损害的前提下，应用程序仍然具备其定义并能完成操作。一个好的应用程序接口可以为软件开发提供所有的构件，帮助程序员高效地完成组合。

source: An application-specific integrated circuit (ASIC), is an integrated circuit (IC) customized for a particular use, rather than intended for general-purpose use. For example, a chip designed to run in a digital voice recorder or for :ref:`high-efficiency Dash mining <asic-mining>` is an ASIC.
ru: Интегральная схема специального назначения (ASIC) - это интегральная схема (IC), которая специализирована для решения конкретной задачи, а не для общих целей. Например, чип, специально разработанный для записи голоса или для :ref:`высокоэффективного майнинга Dash <asic-mining>` - это ASIC.
zh_cn: 专用集成电路 (ASIC) 是针对整机或系统的需要，专门为之设计制造的集成电路 (IC)，而不是为了满足通用目的而设计制造的集成电路。举个例子，为\ :ref:`高效率的达世币挖矿 <asic-mining>`\ 而专门设计的数字录音机的芯片就是一种专用集成电路。

source: A Dash ATM is a physical machine that allows a customer to buy Dash with cash. There are many manufacturers, some of which enable users to sell Dash for cash. They are also sometimes called 'BTMs' or 'Dash AVMS.' Dash is supported on several :ref:`ATMs <how-to-buy>`.
ru: ATM Dash - это физическое устройство, с помощью которого пользователь может купить Dash за наличные деньги. Существует множество производителей, и некоторые из этих устройств также дают возможность продавать Dash за наличность. Иногда эти устройства также называются BTM или Dash AVMS. Dash поддерживается на нескольких :ref:`ATM <how-to-buy>`.
zh_cn: 达世币ATM是一种实体设备，消费者们可以通过它用现金购买达世币。目前，业内有各种各样的达世币ATM制造商，其中的一些产品可以为用户将达世币兑换成现金。有时，这些达世币ATM也被称作"BTMs"或者"Dash AVMS"。很多类型的\ :ref:`ATMs <how-to-buy>`\ 都开通了达世币业务。

source: Backlog
ru: Задержка
zh_cn: 积压

source: Backlog generally refers to an accumulation over time of work waiting to be done or orders to be fulfilled.
ru: Под задержкой обычно понимают постепенное накопление работы, которая должна быть сделана или заказы, которые должны быть выполнены.
zh_cn: 积压通常是指随着时间的推移而日渐累积的待办事项或等待完成的命令。

source: Backup
ru: Создание резервной копии
zh_cn: 备份

source: The process of making copies of a computer file to ensure its integrity in case of loss, theft, or damage. Dash allows users to :ref:`make backup copies <dashcore-backup>` of their digital wallets. This protects against losing one's money in the event of a computer crashing or losing one’s mobile device. This would be the equivalent of being able to backup the cash in your wallet, so that if you lost it, you could restore the cash from a backup.
ru: Процесс копирования компьютерного файла для того, чтобы обеспечить его целостность в случае его утраты, кражи или повреждения. В Dash у пользователей есть :ref:`возможность сделать резервные копии <dashcore-backup>` их электронных кошельков. Таким образом можно предотвратить утрату денег в случае, если компьютер сломается или потеряется мобильное устройство. Например, если вы сделаете резервную копию наличных денег вашего кошелька, а потом потеряете кошелёк, то вы сможете восстановить эти деньги с помощью резервной копии.
zh_cn: 复制计算机文件，以便文件在发生丢失、失窃或损坏等情况后仍能保持完整。达世币允许用户对个人的数字钱包\ :ref:`进行备份 <dashcore-backup>`\ ，从而防止因计算机系统崩溃或移动设备丢失而造成的资金损失。这就相当于将钱包中的现金进行了备份，即使丢失了钱包，现金也能通过备份进行恢复。

source: Bitcoin 2.0
ru: Биткойн 2.0
zh_cn: 比特币 2.0

source: This is a term explaining the next new level of Bitcoin projects which started as a fork of Bitcoin but extended their code into the next level of Blockchain Projects (Smart Contracts, Decentralised Voting,....)
ru: Этот термин означает следующий уровень Биткойн проектов, которые появились в результате форка от Биткойна, но расширили свой код для следующего уровня блокчейн-проектов (смарт контракты, децентрализованное голосование и т.д.)
zh_cn: 这一术语阐释了比特币项目的新级别。虽然这个项目起步于比特币的一个分叉，但其代码却拓展到了区块链项目的新级别，(包括智能合约和去中心化投票,....)等等。

source: Blockchain
ru: Блокчейн
zh_cn: 区块链

source: A `blockchain <https://en.wikipedia.org/wiki/Block_chain_(database)>`_ is a distributed database that maintains a continuously-growing list of data records hardened against tampering and revision. It consists of data structure blocks — which exclusively hold data in initial blockchain implementations, and both data and programs in some of the more recent implementations — with each block holding batches of individual transactions and the results of any blockchain executables. Each block contains a timestamp and information linking it to a previous block.
ru: `Блокчейн <https://en.wikipedia.org/wiki/Block_chain_(database)>`_ - это распределённая база данных, которая содержит постоянно растущий список данных, защищённых от фальсификации и изменений. Он состоит из структурированных блоков с информацией, которые в первоначальных версиях блокчейна содержали исключительно данные, но в более современных вариантах содержат и данные, и программы, где каждый блок содержит серию индивидуальных транзакций и результаты любых исполняемых файлов блокчейна. Кроме того, в каждом блоке есть временная метка и информация о предыдущем блоке.
zh_cn: 据维基百科的定义，\ `区块链 <https://en.wikipedia.org/wiki/Block_chain_(database)>`_\ 是一个分布式的数据库，它维护着一个不断拓展的、优化了防篡改功能功能的数据记录列表。区块链是由包含交易信息的区块从后向前有序链接起来的数据结构。区块链的初始区块中存储着数据，而新近的区块上则存储着数据和程序，其中，每个区块都包含着批量的个人交易数据和任何区块链上的可执行文件的结果。此外，每个区块上都包含着一个时间戳和将其链接到此前区块的信息。

source: Blocks
ru: Блоки
zh_cn: 区块

source: Transactions on the Blockchain are collected in "`blocks <https://en.wikipedia.org/wiki/Block_chain_(database)#Blocks>`_" which record and confirm when and in what sequence transactions enter and are logged in the block chain. Blocks are created by users known as "miners" who use specialized software or equipment designed specifically to create blocks.
ru: Транзакций в блокчейне собираются в "`блоки <https://en.wikipedia.org/wiki/Block_chain_(database)#Blocks>`_", которые записывают и подтверждают, когда и в какой последовательности транзакции появились и были зарегистрированы в цепочке блоков. Блоки создаются пользователями, которые называются "майнерами". Они используют специальный софт или оборудование, разработанное для создания блоков.
zh_cn: 据维基百科的定义，区块链上的\ `区块 <https://en.wikipedia.org/wiki/Block_chain_(database)#Blocks>`_\ 汇总了该区块链上的所有交易。这些区块记录并确认交易发生的时间和顺序，并存储到区块链上。区块是由所谓的 "矿工" 创建的，他们使用专用的软件和设备来创建区块。

source: Defined in `DIP8 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__, ChainLocks are a method of using an LLMQ to threshold sign a block immediately after it is propogated by the miner in order to enforce the first-seen rule. This is a powerful method of mitigating 51% mining attacks, which are associated with double spending.
ru: В соответствии с определением в `DIP8 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__, ChainLocks представляет собой способ использования LLMQ для пороговой подписи блока немедленно после его продвижения майнером для принудительного выполнения правила «увидел первый» или, в английском варианте, first-seen. Это действенный способ уменьшения вероятности майнинговых атак 51%, которые связаны с двойной тратой.
zh_cn: 定义于`DIP8 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__，ChainLocks 是在区块被矿工传播后立即用 LLMQ来 签名以确保最先见证规则的一种方式。这是一种有效缓解 51%攻击的方式，该攻击通常与双花相关。

source: Cloud Wallet
ru: Облачный кошелёк
zh_cn: 云钱包

source: Third parties that will store your Dash on their servers for you, so that you can access your funds from any device connected to the internet. If their website is hacked or if their servers are damaged, you run the risk of losing your Dash. Any online wallets should be secured with strong passphrases and 2FA. You cannot make backup copies of your online wallet, because you do not have access to the private keys. We do not recommend that you store large quantities of funds in online wallets.
ru: Это третья сторона, которая будет хранить ваши Dash на своих серверах, чтобы вы могли получить доступ к своим средствам с любого устройства, которое подключено к интернету. Если их вебсайт взломают или их сервера сломаются, вы рискуете потерять ваши Dash. Любые онлайн кошельки должны быть защищены сильной кодовой фразой и 2FA. Сделать резервную копию онлайн кошелька невозможно, потому что у вас нет доступа к приватным ключам. Мы не рекомендуем вам хранить крупные суммы в онлайн кошельках.
zh_cn: 第三方服务器可以为用户代为存储达世币，这样用户就可以从联网的任何设备上获取个人资金了。不过，如果第三方的网站遭到黑客攻击或者服务器受损，那么用户的资金就有丢失的风险。用户的网络钱包都应当强化密码配置并使用2FA双重验证。用户的网络钱包是无法备份的，因为个人无法获取私钥。我们不建议用户将大量资金存储在网络云钱包当中。

source: Coinbase transaction
ru: Coinbase-транзакция
zh_cn: Coinbase交易

source: The first transaction in a block. Always created by a miner, it includes a single input which constitutes the block reward. This is split between the miner and a deterministically chosen masternode.
ru: Первая транзакция в блоке. Всегда создаётся майнером и включает в себя один вход, который представляет собой вознаграждение за блок. Оно делится между майнером и определённым образом выбранной мастернодой.
zh_cn: 区块中的第一个交易都是由矿工创建的，它包括一个指明区块回报的输入值。其中，区块回报主要划分给矿工和既定的主节点持有人。

source: Cold Storage
ru: Холодное хранение
zh_cn: 冷存储
