Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/introduction/information.po
Languages: ru, zh_cn

source: An indication, flag, or signal of support for a feature or fork. The term signaling is most often used in the context of miners delivering this indication of support or agreement. The message is generally delivered through their adoption of updated software in support of a particular protocol and/or by setting a specific version bit within discovered blocks.
ru: Индикация, флаг или сигнал поддержки функции или форка. Термин "сигнализирование" чаще всего используется в контексте майнеров, которые являются источником подобной индикации поддержки или согласия. О своём согласии майнеры дают понять с помощью обновления программного обеспечения для поддержки определённого протокола и/или путём указания определённой версии в обнаруженных ими блоках.
zh_cn: 一个支持某个功能或分叉的迹象，标识或者信号。常常用于那些发布支持同意信号的矿工。该消息往往通过他们应用更新版本的软件支持某个协议和/或在产生的区块中设置某个特殊的标志位来传送。

source: State View
ru: Обзор состояний
zh_cn: 状态浏览

source: The current state of all data objects once all changes from state transitions have been applied. Used in Evolution to determine what should be displayed in a given social wallet, for example.
ru: Текущее состояние всех объектов данных после применения всех переходных этапов. Используется в Evolution для определения, например, того, что должно отображаться в данном социальном кошельке.
zh_cn: 所有状态变更已经被应用后的所有数据对象的当前状态。以在Evolution当中为例，它可以确定社交钱包应当显示的内容。

source: Spork
ru: Спорк
zh_cn: 叉勺技术

source: The Dash development team created a mechanism known as a ":ref:`spork <sporks>`" by which updated code is released to the network, but not immediately made active (or “enforced”). Communication is sent out to users informing them of the change and the need for them to update their clients. Those who update their clients run the new code, but in the event of errors occurring with that new code, the client’s blocks are not rejected by the network and unintended forks are avoided. Data about the error can then be collected and forwarded to the development team. Once the development team is satisfied with the new code’s stability in the mainnet environment – and once acceptable network consensus is attained – enforcement of the updated code can be activated remotely. Should problems arise, the code can be deactivated in the same manner, without the need for a network-wide rollback or client update.
ru: Команда разработчиков Dash создала механизм, известный как ":ref:`спорк <sporks>`", с помощью которого обновлённый код становится доступным для сети, но не активируется или (или "исполняется") сразу же. Пользователям рассылается сообщение, уведомляющее их об изменениях и необходимости обновить их клиенты. Те, кто обновил клиенты, запускают новый код, но в случае, если новый код работает с ошибками, блоки этого клиента не отвергаются сетью, и таким образом избегается появление нежелательных форков. Затем данные об ошибках могут быть собраны и отправлены команде разработчиков. Когда разработчики остаются довольны стабильностью работы нового кода в основной сети - и когда достигается приемлемый консенсус в сети - может быть запущено удалённая установка нового кода. Если возникнут какие-то проблемы, код снова можно деактивировать тем же способом, не откатывая назад сеть или обновление клиента.
zh_cn: 达世币研发团队创造了一个称为\ :ref:`叉勺 <sporks>`\ 的技术。通过这个机制，更新的代码将被公布到网络上，但不会被立即激活(或强制执行)。此后，有关变动和更新客户端的必要性的通知信息将会被发送给用户。完成客户端更新的用户将会运行新的代码。不过，在新代码发生错误的时候，达世币网络不会拒绝客户端上的区块，但会避免意外的分叉。然后，错误的相关信息就会被收集并发送给研发团队。一旦研发团队对主网环境下的新代码的稳定性感到满意且网络就新代码的采用达成共识，那么团队就可以远程激活新代码的实施。相反，如果新代码的稳定性出现问题，那么研发团队也可以通过相同的方式停用代码，以避免在整个达世币网络上进行召回或客户端更新。

source: Tainted Coins
ru: Запятнанные монеты
zh_cn: 被污染的币

source: Taint is a measure of correlation between two (wallet) addresses. It is only important if the user is trying to remain anonymous.
ru: Пятно обозначает связь между двумя адресами (кошельками). Это важно только в том случае, если пользователь хочет оставаться анонимным.
zh_cn: Taint是用于关联两个（钱包）地址的方法。只有用户尝试保持匿名的时候，这个方法的重要性才会凸显出来。

source: Test Dash, used on :ref:`testnet <testnet>`.
ru: Тестовый Dash, который использовался в :ref:`тестнете <testnet>`.
zh_cn: 测试网达世币，在\ :ref:`测试网 <testnet>`\ 中使用。

source: Testnet
ru: Тестнет
zh_cn: 测试网

source: :ref:`Testnet <testnet>` is a network only for testing (parallel to the mainnet), test wallets, test coins, test masternodes, test miners, and test users all simulate their mainnet counterparts in a safe environment where errors or forks are not harmful.
ru: :ref:`Тестнет <testnet>` - это сеть исключительно для тестирования (работающая параллельно с основной сетью), с тестовыми кошельками, тестовыми монетами, тестовыми мастернодами, тестовыми майнерами и тестовыми пользователями, которые симулируют действия своих двойников из основной сети в безопасной среде, где ошибки или форки не могут принести ущерб.
zh_cn: :ref:`测试网络 <testnet>`\ 是一个（与主网并行但）仅用于测试的网络，它可以用于测试钱包、加密数字货币、主节点、矿工和用户是否都能在一个安全的环境中模拟他们的主网对应物，在这种环境下发生错误或分叉不会对主网带来不良影响。

source: An anonymous routing protocol used by people wanting to hide their identity online.
ru: Анонимный протокол маршрутизации, которым пользуются люди, желающие остаться анонимными в сети.
zh_cn: Tor是一种匿名的路由协议。希望维持网络身份匿名性的人们通常会使用这种协议。

source: Transaction
ru: Транзакция
zh_cn: 交易

source: Some movement of data on the distributed blockchain ledger. Transactions may be divided into classical and special transactions. Similar to Bitcoin, classical transactions move balances between addresses on the blockchain. Special transactions contain an extra payload in the format defined by `DIP2 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_, and can be used to manage blockchain users, for example.
ru: Некоторое перемещение данных в распределённом блокчейн реестре. Транзакции могут быть обычными и специальными. Как и в Биткойне, обычные транзакции переводят балансы между адресами в блокчейне. Специальные транзакции содержат дополнительные данные в формате, обозначенном `DIP2 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_, и могут быть использованы, например, для управления пользователями блокчейна.
zh_cn: 分布式区块链帐目上的一些数据移动。交易可以划分为常规交易和特殊交易。与比特币类似的是，达世币的常规交易在区块链上的地址之间转移余额资金。而特殊交易则包含了由\ `DIP2 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_\ 限定格式的额外负载，并且可用于管理区块链用户。

source: Transaction Block
ru: Блок транзакций
zh_cn: 交易区块

source: A collection of transactions on the Dash network, gathered into a block that can then be hashed and added to the blockchain.
ru: Набор транзакций сети Dash, собранных в блок, который затем можно хэшировать и добавить в блокчейн.
zh_cn: 达世币网络上发生的一系列交易，它们集中在一起，统一处理并写入到区块链上。

source: Transaction Fee
ru: Комиссия за транзакцию
zh_cn: 交易手续费

source: A :ref:`small fee <fees>` imposed on some transactions sent across the Dash network. The transaction fee is awarded to the miner that successfully hashes the block containing the relevant transaction.
ru: :ref:`Небольшая комиссия <fees>`, которая взимается с некоторых транзакций, проведённых через сеть Dash. Комиссия за транзакцию вручается майнеру, который успешно хэшировал блок, содержаший эту транзакцию.
zh_cn: 在达世币网络上为某些交易而缴纳的\ :ref:`小额费用 <fees>`\ 。这些费用会被分配给成功处理了与交易相关的区块的矿工。

source: Unconfirmed Transactions
ru: Неподтверждённые транзакции
zh_cn: 未确认交易

source: Transactions that are not yet processed by miners or held via InstantSend are "unconfirmed on the blockchain." Unconfirmed transactions can be reversed and should not be considered as "final."
ru: Транзакции, которые ещё не обработаны майнерами или посланные через InstantSend - "неподтверждённые блокчейном транзакции". Неподтверждённые транзакции могут быть отозваны и не должны считаться "окончательными".
zh_cn: 未经矿工处理或未由即时发送功能处理的交易被视为“未确认的交易”。未经确认的交易是可逆的，因此它们不应被视作最终结果。

source: Vanity Address
ru: Адрес тщеславия
zh_cn: 微地址

source: A Dash address with a desirable pattern, such as a name.
ru: Dash адрес, содержащий определённые желаемые элементы, например, имя.
zh_cn: 一个有理想模型的达世币地址，比如名字。

source: Virgin Dash
ru: Первичный Dash
zh_cn: 原始达世币

source: Dash received as a reward for mining a block or running a masternode. These have not yet been spent anywhere and are "virgin."
ru: Dash, полученный в качестве награды за майнинг блока или за управление мастернодой. Эти Dash, которые ещё не были ни на что потрачены, называются "первичными".
zh_cn: 因挖矿行为或持有主节点提供服务所获得的达世币。这些还没有被支出的资金被称作原始达世币。

source: Volatility
ru: Волатильность
zh_cn: Volatility反复无常

source: The measurement of price movements over time for a traded financial asset (including Dash).
ru: Изменение движений цен с учетом времени на торгуемые финансовые активы (в том числе Dash).
zh_cn: 对于被交易的金融资产（包括达世币在内）的价格波动的衡量。

source: Wallet
ru: Кошелёк
zh_cn: 钱包

source: A method of storing Dash for later use. A wallet holds the private keys associated with Dash addresses. The blockchain is the record of the Dash balances (and transactions) associated with those addresses.
ru: Способ хранения Dash для дальнейшего использования. Кошелёк содержит приватные ключи, которые связаны с адресами Dash. Блокчейн - это запись балансов (и транзакций) Dash, которая связаны с этими адресами.
zh_cn: 存储达世币以供将来使用的一种方法。钱包包含有私钥，而私钥与达世币地址相关。区块链记录着与这些地址相关的达世币余额（和交易情况）。

source: Whitepaper
ru: Белая книга
zh_cn: 白皮书

source: A `white paper <https://en.wikipedia.org/wiki/White_paper>`_ is an authoritative report or guide that informs readers concisely about a complex issue and presents the issuing body's philosophy on the matter. It is meant to help readers understand an issue, solve a problem, or make a decision.
ru: `Белая книга <https://en.wikipedia.org/wiki/White_paper>`_ - это авторитетный отчёт или гид, который в краткой форме даёт читателям представление о сложной задаче и содержит подход выпустивших эту книгу людей к задаче. Она предназначена для того, чтобы помочь читателям понять задачу, разрешить её или принять решение.
zh_cn: 根据维基百科的定义，\ `白皮书 <https://en.wikipedia.org/wiki/White_paper>`_\ 指的是权威的报告或指南，它简明扼要地向读者介绍某个复杂的问题，并阐述发行机构在这个问题上秉持的理念。它旨在帮助读者理解问题、解决问题或作出决策。

source: :ref:`X11 <x11-hash-algorithm>` is a hashing algorithm created by Dash Core developer Evan Duffield.
ru: :ref:`X11 <x11-hash-algorithm>` это алгоритм хэширования, созданный Dash Core разработчиком Эваном Даффилдом.
zh_cn: :ref:`X11 <x11-hash-algorithm>`\ 指由Dash Core开发者Evan Duffield所创立的哈希算法。

source: Zero Confirmations
ru: Нулевое подтверждение
zh_cn: 零确认

source: This is a transaction without any confirmations from the blockchain. It is technically reversible (unless InstantSend was used).
ru: Это транзакция, которая ни разу не была подтверждена блокчейном. Технически, она обратима (если для её отправления не использовался InstantSend).
zh_cn: 零确认的意思是交易未经区块链的确认。从技术上说，，除非交易是通过即时发送功能完成的（否则零确认交易是可逆的）。

source: A transaction (tx) consists of one or more inputs and one or more outputs. The vin is the list of inputs to the transaction, and vout is the list of outputs. Masternodes require a 1000 DASH vin (exactly that amount) in order to work.
ru: Транзакция (tx) содержит один или более входов и один или более выходов. Vin - это список входов в транзакцию, а vout это список выходов. Для того, чтобы мастернода заработала, требуется vin в 1000 Dash (именно эта сумма).
zh_cn: 交易（tx）由一个或多个输入和输出组成。vin指的是交易的输入列表，vout指的则是交易的输出列表。 达世币主节点的运营需要（整好）有1000达世币的输入才能生效。

source: Virtual Masternode - a standalone masternode emulator in JavaScript that simulates Layer 1-3 Evolution functions for DAP design, development and testing.
ru: Виртуальная мастернода - отдельный эмулятор мастерноды на JavaScript, который симулирует работу Layer 1-3 Evolution для создания, разработки и тестирования DAP.
zh_cn: 虚拟主节点是JavaScript中的独立主节点模拟器，可模拟Evolution去中心化应用程序设计的第1 -3层级。

source: Android
zh_cn: 安卓

source: AML
zh_cn: 反洗钱

source: Darkcoin
zh_cn: 暗黑币

source: Dash
zh_cn: 达世币

source: DashDrive
zh_cn: Dash驱动

source: Dash Schema
zh_cn: 达世币纲要

source: DDoS
zh_cn: DDoS攻击

source: InstantSend
zh_cn: 即时支付
