Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/introduction/information.po
Languages: ru, zh_cn

source: A `graphics processing unit (GPU) <https://en.wikipedia.org/wiki/Graphics_processing_unit>`_, also occasionally called visual processing unit (VPU), is a specialized electronic circuit designed to rapidly manipulate and alter memory to accelerate the creation of images in a frame buffer intended for output to a display. GPUs are used in embedded systems, mobile phones, personal computers, workstations, and game consoles. Modern GPUs are very efficient at manipulating computer graphics and image processing, and their highly parallel structure makes them more efficient than general- purpose CPUs for algorithms where the processing of large blocks of data is done in parallel. In a personal computer, a GPU can be present on a video card, or it can be embedded on the motherboard or — in certain CPUs — on the CPU die. Certain cryptocurrencies use mining algorithms which are most efficiently run on GPUs.
ru: `Графический процессор (GPU) <https://en.wikipedia.org/wiki/Graphics_processing_unit>`_, который иногда называют также визуальным процессором (VPU), это специализированная электронная схема, разработанная, чтобы быстро управлять памятью для оперативного создания изображений в буфере кадров, которые затем выводятся на экран. GPU используются во встроенных система, мобильных телефонах, персональных компьютерах, рабочих станциях и игровых консолях. Современные GPU весьма эффективны в управлении компьютерной графикой и обработке изображений, а их параллельная структура делает их более эффективными, чем CPU общего назначения, когда дело касается одновременной обработки больших блоков данных. В персональном компьютере, GPU расположен на видеокарте, может быть встроен в материнскую плату или - в некоторых CPU - встроен в центральный процессор. Некоторые криптовалюты используют такие майнинговые алгоритмы, которые эффективнее всего выполнять на GPU.
zh_cn: 根据维基百科的定义，\ `图形处理器（GPU） <https://en.wikipedia.org/wiki/Graphics_processing_unit>`_\ 也称视觉处理单元(VPU)，它是一种专用电路，设计用于快速操控和修改存储器，从而加速创建输出到显示器上的图像。图形处理器可用于嵌入式系统、移动电话、个人计算机，工作站和游戏机。现代的图形处理器在处理计算机图形和图像时非常高效，并且高度并行的结构使它们能以比通用中央处理器更高的效率处理需要并行处理的大量数据。在个人计算机中，图形处理器可存在于显卡上、嵌在主板上或嵌在中央处理器芯片上。某些加密数字货币的挖矿算法在图形处理器上才能实现效率最大化。

source: Hardware Wallet
ru: Аппаратный кошелёк
zh_cn: 硬件钱包

source: :ref:`Hardware wallets <hardware-wallets>` are among the safest type of wallet for storing your Dash. Your private key is protected inside a piece of hardware, and is never exposed to the internet. You are still able to sign transactions as normal, making it both safe and convenient.
ru: :ref:`Аппаратный кошелёк <hardware-wallets>` - это один из наиболее безопасных кошельков для хранения Dash. Ваш приватный ключ защищён на физическом уровне, и он никогда не будет доступен из интернета. Вы можете так же подписывать транзакции, и это удобно и безопасно.
zh_cn: :ref:`硬件钱包 <hardware-wallets>`\ 是最安全的达世币钱包。用户的私钥会被存储在硬件当中，不存在泄露到互联网上的风险。与此同时，用户仍然能够正常地进行交易。硬件钱包既安全，又方便。

source: Hash
ru: Хэш
zh_cn: 哈希值

source: A mathematical process that takes a variable amount of data and produces a shorter, fixed-length output. A hashing function has two important characteristics. First, it is mathematically difficult to work out what the original input was by looking at the output. Second, changing even the tiniest part of the input will produce an entirely different output.
ru: Математический процесс, который преобразует массив данный произвольной длинны в более короткую выходную строку с установленной длинной. Хэш-функция имеет две важные характеристики. Во-первых, математически очень сложно вычислить, какой была оригинальная строка, имея на руках только выходную строку. Во-вторых, самые малые изменения во входящих данных влекут за собой полное изменения выходных данных.
zh_cn: 这一词条指的是一个数学过程，它采用数量可变的数据来产生较短的且长度固定的输出数据。哈希函数具有两个重要的特征：首先，从数学的角度来看，人们很难根据输出数据来推算原始的输入数据；其次，对输入数据的微小改变将导致截然不同的输出数据。

source: Hashrate
ru: Хешрейт
zh_cn: 算力

source: The number of hashes that can be performed by a Dash miner in a given period of time (usually a second).
ru: Это количество хэшей, которое может произвести майнер Dash в заданный период времени (обычно в секунду).
zh_cn: 达世币矿工在既定时间里（通常是一秒钟）可以改变算力。

source: Blockchain information server used to power block explorers and respond to transaction queries.
ru: Сервер с блокчейном использовался для поддержки Обозревателя блоков и ответа на транзакционные запросы.
zh_cn: 用于支持区块浏览器并回复交易查询的区块链信息服务器。

source: See InstantSend
ru: см. InstantSend
zh_cn: 查看即时支付

source: :ref:`InstantSend <instantsend>` technology uses the masternode network to "lock" transaction inputs, preventing Dash from being double-spent. Unlike Bitcoin, where it takes an hour or longer for transactions to fully confirm, transactions using InstantSend are "locked" and irreversible after only a few seconds.
ru: Технология :ref:`InstantSend <instantsend>` с помощью сети мастернод "блокирует" входы транзакции, предотвращая двойное списание Dash. В отличие от Биткойна, где полное подтверждение транзакции занимает примерно час или даже больше, транзакции InstantSend "блокируются" и становятся необратимыми уже через несколько секунд.
zh_cn: :ref:`即时发送 <instantsend>`\ 技术借助主节点网络锁定输入的交易数据，防止达世币双花支付。与需要一个小时甚至更长时间才能完成交易确认的比特币不同的是，即时发送功能只需要几秒钟就能锁定交易并使交易不可逆转。

source: Liquidity
ru: Ликвидность
zh_cn: 资产流动性

source: The ability to buy and sell an asset easily, with pricing that stays roughly similar between trades. A suitably large community of buyers and sellers is important for liquidity. The result of an illiquid market is price volatility, and the inability to easily determine the value of an asset.
ru: Возможность легко и быстро купить или продать актив, цена которого остаётся примерно на одном рыночном уровне. Для ликвидности важно наличие относительно большого сообщества продавцов и покупателей. Результатом неликвидного рынка является волатильность, а также невозможность быстро определить ценность актива.
zh_cn: 在轻松进行交易的同时维持价格大致相同。对于流通性来说，拥有稳定且大规模的买卖群体非常重要。一旦市场流通性不足，币价将出现波动，各方也无法轻松地确认资产的价值。

source: Defined in `DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, A Long- Living Masternode Quorum (LLMQ) is a deterministic subset of the global deterministic masternode list. Such a quorum is formed with the help of a distributed key generation (DKG) protocol and is supposed to be active for a long time (e.g. days). Multiple quorums are kept alive at the same time, allowing load balancing between these quorums. The main task of a LLMQ is to perform threshold signing of consensus related messages.
ru: Как определено в `DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, A Long- Living Masternode Quorum (LLMQ) или долгосрочный кворум мастернод - это детерминированное подмножество глобального детерминированного списка мастернод. Подобный кворум формируется с помощью протокола распределённого создания ключей (DKG) и срок активности этого кворума подразумевается длительным (например, несколько дней). Многочисленные кворумы сосуществуют в одно и то же время, что позволяет нагрузке равномерно распределяться между кворумами. Главной задачей LLMQ является выполнение пороговой подписи сообщений, относящихся к консенсусу.
zh_cn: 定义与`DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__，一个长效主节点仲裁团（LLMQ）是一个确定性的全节点子集。此仲裁团在分布式密钥生成（DKG）协议的帮助下生成并且存在很长时间（例如数天）。多个仲裁团同时处于激活状态，允许这些仲裁团之前负载均衡。LLMQ 的主要任务就是共识相关消息的签名工作。

source: Masternode
ru: Мастернода
zh_cn: 主节点

source: A :ref:`masternode <masternode-network>` is special type of full node that performs services for the network and is paid a portion of the block reward. Masternodes require proof of ownership of 1000 DASH.
ru: :ref:`Мастернода <masternode-network>` - это особый вид полной ноды, которая выполняет услуги для сети и получает оплату в виде части от вознаграждения за блок. Для запуска мастерноды необходимо подтверждение владения 1000 Dash.
zh_cn: :ref:`主节点 <masternode-network>`\ 是一种特殊的全节点，它为网络提供服务并凭借这样的服务获取区块奖励。主节点的持有条件是持有1000个达世币。

source: Masternodes serve as the second tier of the Dash network, and power InstantSend, CoinJoin, and the Budget System.
ru: Мастерноды являются вторым уровнем сети Dash, и благодаря им работает InstantSend, CoinJoin, а также казна Dash DAO.

source: Mining
ru: Майнинг
zh_cn: 挖矿

source: :ref:`Miners <mining>` process transactions on the Dash network and publish them on the blockchain. As a reward for doing this, miners are paid a percentage of the block reward. The current percentage can be found in :ref:`this table <block-reward-reallocation>`.
ru: :ref:`Майнеры <mining>` обрабатывают транзакции в сети Dash и размещают их в блокчейне. В качестве вознаграждения за это майнеры получают процент от вознаграждения за блок. Текущий процент можно найти в :ref:`этой таблице <block-reward-reallocation>`.

source: Mobile Wallet
ru: Мобильный кошелёк
zh_cn: 移动钱包

source: These are wallets available on mobile devices (iOS + Android).
ru: Это кошельки, которые работают на мобильных устройствах (iOS + Android).
zh_cn: 这些移动钱包支持不同手机钱包（iOS + 安卓）。

source: MultiSig
ru: Мультиподпись
zh_cn: 多重签名

source: Multi-signature addresses provide additional security by requiring multiple people to sign a transaction with their private key before the transaction can be sent. For example, in :ref:`2 of 3 multisig <dashcore-multisig>`, two out of three possible signatories have to sign a transaction for it to be processed. Multi-signature addresses are commonly used by exchanges and other organizations that are in possession of large sums of cryptocurrency, since it makes theft much more difficult.
ru: Адреса с мультиподписью дают дополнительный уровень защиты, поскольку для подписания транзакции перед её отправлением требуется подписи нескольких человек с их приватными ключами. Например, в :ref:`мультиподписи 2 из 3 <dashcore-multisig>`, требуется как минимум два человека, которые подпишут транзакцию, чтобы её можно было отправить. Адреса с мультиподписью часто используются биржами или другими организациями, в чьём распоряжении находятся большие суммы криптовалюты, поскольку такой подход затрудняет кражу этих сумм.
zh_cn: 通过要求用户在交易发送前以个人私钥进行签名授权，多重签名地址为用户进一步强化了安全。举个例子，在\ :ref:`2/3多重签名当 <dashcore-multisig>`\ 中，用户需要获得规定的3个签名中的两个才能授权交易。通常来说，多重签名地址被交易平台或其它拥有大量加密数字货币的机构所采纳，用于降低失窃的风险。

source: Node
ru: Нода
zh_cn: 节点

source: A node is any device running Dash wallet software. Full nodes are software clients that have downloaded the entire blockchain and serve it to other clients on Dash's peer-to-peer network.
ru: Нода это любое устройство, на котором запущен кошелёк Dash. Полноценные ноды - это приложения, которые скачали весь блокчейн и раздают его другим клиентам в пиринговой сети Dash.
zh_cn: 节点指的是运行达世币钱包软件的任何设备。全节点是下载了整个区块链并在达世币点对点网络上为其它客户服务的节点。

source: Over the counter (OTC) trades are trades that occur off exchanges. In an OTC trade, a buyer and seller trade with each other directly, or through an intermediary. OTC trading is useful when a person wants to either buy or sell a large amount of cryptocurrency and is afraid that a large buy or sell order will move the price (called "slippage").
ru: Внебиржевые (OTC) сделки - это сделки, которые происходят за пределами бирж. Во время внебиржевой сделки, продавец и покупатель взаимодействуют друг с другом напрямую или через посредника. Внебиржевая сделка удобна в том случае, если человек хочет продать или купить большое количество криптовалюты и опасается, что такая крупная покупка или продажа вызовет сдвиг в цене (т.н. "проскальзывание").
zh_cn: 场外交易（OTC）是指在交易平台之外发生的交易。在场外交易期间，买卖双方直接对接或经过中间人进行接触。当一个人想要买卖大额的加密数字货币但又担心大额订单会导致价格改变（波动）时，场外交易非常有用。

source: Peer-to-peer. Decentralized interactions that happen between at least two parties in a highly interconnected network. An alternative system to a 'hub-and-spoke' arrangement, in which all participants in a transaction deal with each other through a single mediation point.
ru: Пиринговая сеть. Децентрализованное взаимодействие, которое происходит как минимум между двумя участниками в сильно взаимосвязанной сети. Это альтернатива "веерной" системе, в которой все участники транзакции взаимодействуют друг с другом через одного посредника.
zh_cn: 点对点交易。它指的是在高度互联的网络中至少在两方之间发生的去中心化交流。它是轴辐式网络的替代系统，轴辐式网络中的各交易方由一个联结点连接起彼此。

source: Paper Wallet
ru: Бумажник
zh_cn: 纸钱包

source: :ref:`Paper wallets <dash-paper-wallet>` are offline wallets, printed on paper for safety. If properly secured and stored they are considered the safest way to store cryptocurrency.
ru: :ref:`Бумажные кошельки <dash-paper-wallet>` это оффлайн кошельки, которые напечатаны на бумаге для большей безопасности. При должном хранении, они считаются наиболее безопасным способом хранения криптовалюты.
zh_cn: :ref:`纸钱包 <dash-paper-wallet>`\ 指的是离线钱包，用户可以将公钥或私钥打印到纸上，从而保障安全。如果保管和保密工作得当，纸钱包是存储加密数字货币的最安全的方式。

source: Privacy
ru: Приватность
zh_cn: 隐私

source: `Privacy <https://en.wikipedia.org/wiki/Privacy>`_ is the ability of an individual or group to seclude themselves, or information about themselves, and thereby express themselves selectively. The boundaries and content of what is considered private differ among cultures and individuals, but share common themes. When something is private to a person, it usually means that something is inherently special or sensitive to them. The domain of privacy partially overlaps security (confidentiality), which can include the concepts of appropriate use, as well as protection of information. Dash includes CoinJoin, which allows users to maintain financial privacy.
ru: `Приватность <https://en.wikipedia.org/wiki/Privacy>`_ - это возможность одного человека или группы скрывать свою личность или информацию о ней, и таким образом решать, какую информацию о себе показать. Границы и содержимое того, что считается приватным, среди разных культур и людей разнятся, но есть некоторые общие темы. Если что-то для человека является приватным, это означает, что это является особенной или деликатной темой. Область того, что считается приватным, частично перекрывается безопасностью (конфиденциальностью), которая может включать в себя идеи надлежащего использования, а также защиты информации. У Dash есть функция CoinJoin, которая даёт возможность поддерживать финансовую приватность.

source: Private Key
ru: Приватный ключ
zh_cn: 私钥

source: A `private key <https://en.wikipedia.org/wiki/Public- key_cryptography>`_ is a long alphanumeric passcode that allows Dash to be spent. Every Dash wallet contains one or more private keys which are saved in the wallet file. The private keys are mathematically related to all Dash addresses generated for the wallet. Because the private key is the "ticket" that allows someone to spend Dash, it is important that these are kept secure and secret.
ru: `Приватный ключ <https://en.wikipedia.org/wiki/Public- key_cryptography>`_ - это длинный буквенно-цифровой пароль, который даёт возможность тратить Dash. Каждый кошелёк Dash содержит один или более приватных ключей, которые хранятся в файле кошелька. Приватные ключи математически связаны со всеми адресами Dash, которые сгенерированы для этого кошелька. Поскольку приватный ключ это своего рода "билет", который позволяет кому-либо тратить Dash, важно хранить их в безопасном месте и в тайне.
zh_cn: 根据维基百科的定义，\ `私钥 <https://en.wikipedia.org/wiki/Public-key_cryptography>`_\ 指的是使用达世币时所需的、由数字和字母组成的密码。每一个达世币钱包都包含有一个或多个私钥，它被保存在钱包文件当中。从数学的角度上看，私钥与为钱包而生成的所有达世币地址都有关联。由于它是个人支付达世币的必备条件，所以它的安全性和保密性尤为重要。

source: PrivateSend
ru: Функция PrivateSend
zh_cn: 匿名支付

source: :ref:`PrivateSend <coinjoin>` obscures the source of funds in order to maintain financial privacy between users. It can be turned on or off at the users' discretion.
ru: :ref:`PrivateSend <coinjoin>` скрывает источник средств, чтобы сохранить финансовую приватность между пользователями. Эту функцию можно включить или выключить по желанию пользователя.

source: Proof of Service - PoSe
ru: Доказательство предоставления услуги - PoSe
zh_cn: 服务量证明 - PoSe

source: Consensus mechanism used in Dash to verify that a masternode has provided uninterrupted service meeting a minimum quality level to the network. Maintaining this service allows a masternode to enter and move up through the global list and eventually into the selection pool to receive payment.
ru: Механизм достижения консенсуса, который используется в Dash для подтверждения того, что мастернода предоставила сети полноценную услугу, отвечающую минимальному уровню качества. Постоянное предоставление этой услуги даёт мастерноде возможность попасть в общий список и двигаться по нему верх, пока она не попадёт в список потенциальных кандидатов для получения оплаты.
zh_cn: 通过要求耗费计算能力来创建新的区块，从而确保所有节点真实存在的共识机制。矿工使用昂贵的设备并支付电费来为区块链创建新的区块。如果缺乏某种共识机制，任何节点都能为区块链创建新的区块，这样一来网络节点将难以认同区块链的有效性。

source: Proof of Stake - PoS
ru: Подтверждение доли владения - PoS
zh_cn: 权益证明 - PoS

source: Consensus mechanism that relies on ownership of a cryptocurrency to maintain the blockchain. In Proof of Stake systems, each owner of the currency can use their wallet to "stake," and there's a small chance that they will be chosen to create the next block and add it to the chain. In this way consensus is maintained across all nodes. Proof of Stake saves electricity and does not require specialized computer hardware. It does however suffer from several pitfalls, including the "nothing at stake" problem. Since no electricity is consumed, in the event of an attack it is actually beneficial for Proof of Stake nodes to "vote" to accept both the legitimate chain and the attacker's chain.
ru: Механизм достижения консенсуса, который описается на владение криптовалютой для поддержание работы блокчейна. В системах, основанных на подтверждении доли владения, каждый владелец криптовалюты может воспользоваться своим кошельком, чтобы "заявить о своей доле", и есть небольшой шанс, что именно его выберут для создания следующего блока и добавят в цепь. Таким способом консенсус поддерживается всеми нодами. PoS экономит электроэнергию и не требует для работы специального компьютерного оборудования. Однако у него есть несколько недостатков, в том числе проблема "нулевого владения". Поскольку в процессе не тратится электричество, в случае атаки нодам, работающим с консенсусом PoS на самом деле выгодно "голосовать" за принятие и легитимной, и хакерской цепочки.
zh_cn: 依赖加密数字货币的所有权来维护区块链的共识机制。在权益证明机制中，每位加密数字货币所有人都可以通过钱包获得一定的“权益”，并且有很小的几率被选作下一个区块的创建者和将新区块添加到区块链的添加人。通过这种方式，所有节点都能达成共识。权益证明机制可以降低耗电量，而且也不需要专用的计算机硬件。不过，这个共识机制也面临着“缺乏权益”的问题。由于没有电力消耗，在被攻击时，权益证明机制出于利益的考量可能会“投票”同时接受正规的区块链和由攻击者创建的区块链。

source: Proof of Work - PoW
ru: Доказательство выполненной работы - PoW
zh_cn: 工作量证明 - PoW

source: Consensus mechanism that keeps all nodes honest by requiring computational power to be expended in order to create new blocks. Miners must use expensive equipment and burn electricity to add blocks to the blockchain. Without a consensus mechanism of some sort, any node could add blocks to the chain and the network's nodes would never agree on which chain was valid.
ru: Консенсусный механизм, который обеспечивает честность всех нод, требуя затраты вычислительных мощностей в обмен на создание новых блоков. Майнерам необходимо дорогое оборудование и расходы электричества, чтобы добавить блоки в блокчейн. Без подобного консенсусного механизма, любая нода смогла бы добавить блоки в цепь, а находящиеся в сети ноды никогда бы не смогли определиться, какая цепочка является верной.
zh_cn: 通过算力来创建新的区块并进而确保所有节点真实可信的共识机制。矿工需要依赖昂贵的设备并支付高额的电费才能将区块添加到区块链上。共识机制的缺失可能致使任何节点都能随意地向区块链新增区块，而网络节点却永远无法就区块链的有效性达成一致意见。

source: Public Key
ru: Публичный ключ
zh_cn: 公钥

source: The `public key <https://en.wikipedia.org/wiki/Public- key_cryptography>`_ is derived from the private key but is not secret and can be revealed to anybody. When a private key is used to sign messages, the public key is used to verify that the signature is valid.
ru: `Публичный ключ <https://en.wikipedia.org/wiki/Public- key_cryptography>`_ определяется приватным ключом, но не является секретным, и его можно передавать любому другому пользователю. В то время как приватный ключ используется для подписи сообщений, публичный ключ используется для подтверждения того, что подпись верна.
zh_cn: 根据维基百科的定义，\ `公钥 <https://en.wikipedia.org/wiki/Public-key_cryptography>`_\ 由私钥衍生而来，它和私钥的不同之处在于它不是保密的，任何人都可以得知公钥。私钥用于为信息签名授权，而公钥则用于证实签名的有效性。

source: Pump and dump
ru: Накачивание и сброс
zh_cn: 拉高出货

source: Inflating the value of a financial asset that has been produced or acquired cheaply, often using aggressive publicity and misleading statements. The publicity causes others to acquire the asset, forcing up its value. When the value is high enough, the perpetrator sells their assets, cashing in and flooding the market, which causes the value to crash. This is particularly common in markets with low liquidity, such as some altcoins.
ru: Завышение цены финансового актива, который был выпущен или приобретён по низкой цене, часто с использованием агрессивной пропаганды и вводящих в заблуждение утверждений. Пропаганда убеждает других покупать актив, тем самым поднимая его цену. Когда цена поднимается достаточно высоко, исполнитель продаёт его активы, зарабатывая на этом, и перенасыщает рынок, что вызывает падение цены. Это довольно частое явление для рынков с низкой ликвидностью, например, для некоторых альткоинов.
zh_cn: 通过激进的宣传和误导性的描述来夸大廉价生产或低价购得的资产的价值。这样的宣传往往诱使他人购进资产，从而推高资产的价格。当价格足够高时，他们再大量出售或变现资产，从而导致价格的暴跌。这样的现象在流动性低的市场上尤其常见，典型的例子就是竞争币市场。

source: Quorum
ru: Кворум
zh_cn: 仲裁连

source: Group of masternodes signing or voting on some action, with the formation of the group determined by some determiniation algorithm.
ru: Группа мастернод, которые ставят подпись или голосуют по какому-либо действию, где формат этой группы задан определённым алгоритмом.
zh_cn: 由既定算法随机选取后组成的主节点群，用以签名或对某行为进行投票。

source: QR Code
ru: QR код
zh_cn: 二维码

source: A two-dimensional graphical block containing a monochromatic pattern representing a sequence of data. QR codes are designed to be scanned by cameras, including those found in mobile phones, and are frequently used to encode Dash addresses.
ru: Двухмерное графическое изображение, которое содержит монохромный рисунок, представляющий собой последовательность данных. QR коды разработаны для сканирования камерами, в том числе камерами мобильных телефонов, а также часто используются для того, чтобы зашифровать адреса Dash.
zh_cn: 二维码是指在一维条码的基础上扩展出另一维具有可读性的条码，使用黑白矩形图案表示二进制数据的图形块。包括手机摄像头在内的摄像头都可以扫描二维码。它通常还用于达世币地址的解读。

source: Satoshi Nakamoto
ru: Сатоши Накамото
zh_cn: 中本聪

source: `Satoshi Nakamoto <https://en.wikipedia.org/wiki/Satoshi_Nakamoto>`_ is the name used by the person or people who designed Bitcoin and created its original reference implementation.
ru: `Сатоши Накамото <https://en.wikipedia.org/wiki/Satoshi_Nakamoto>`_ - имя, которым пользуется человек или группа лиц, создавшая Биткойн в его изначальном виде.
zh_cn: 根据维基百科的定义，`\ 中本聪 <https://en.wikipedia.org/wiki/Satoshi_Nakamoto>`_\ 是比特币的设计者和初始执行方案的创建人。

source: Software Development Kit. A set of tools, code and documentation used by developers to create apps targeting a specific hardware or software platform.
ru: Набор средств разработки. Набор, состоящий из инструментов, кода и документации, который используется разработчиками для создания приложений, работающих с определённым оборудованием или платформой программного обеспечения.
zh_cn: 软件开发工具包是软件工程师在为特定的软件包和软硬件平台创建应用软件时所用的工具、代码和文档的集合。

source: Signaling
ru: Сигнализирование
zh_cn: 信号
