Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/introduction/information.po
Languages: ru, zh_cn

source: **Desktop Wallet** (:ref:`Dash Electrum Wallet <dash-electrum-wallet>`, :ref:`Dash Core Wallet <dash-core-wallet>`): Wallet programs that you install on a laptop or desktop computer. You are solely responsible for protecting the wallet file and the private keys it contains. Make backup copies of your wallet files to ensure that you don't lose access to your funds.
ru: **Десктоп-кошелёк** (:ref:`Dash Electrum Wallet <dash-electrum-wallet>`, :ref:`Dash Core Wallet <dash-core-wallet>`): программы-кошельки, которые можно установить на ноутбук или стационарный компьютер. Вы несёте полную ответственность за защиту файла кошелька и приватных ключей, которые в нём хранятся. Делайте резервные копии файлов вашего кошелька, чтобы не потерять ваши средства.
zh_cn: **桌面钱包**\ （\ :ref:`达世币轻钱包 <dash-electrum-wallet>`\ 、\ :ref:`Dash Core钱包 <dash-core-wallet>`\ ）：指的是安装在台式电脑或笔记本电脑上的钱包软件。用户只需保障钱包文件和文件中包含的私钥的安全。用户还可以对钱包文件进行备份，以便防止丢失个人拥有的达世币。

source: **Mobile Wallet** (:ref:`Android <dash-android-wallet>`, :ref:`iOS <dash-ios-wallet>`): These wallets can be downloaded through Google Play or Apple (iTunes) App Stores. Mobile wallets allow you to use Dash on-the-go by scanning a QR code to send payment. Make backup copies of your mobile wallet files to ensure that you don't lose access to your funds. Due to security issues with mobile phones, it is advised that you don't store large amounts of funds on these wallets.
ru: **Мобильный кошелёк** (:ref:`Android <dash-android-wallet>`, :ref:`iOS <dash-ios-wallet>`): Эти кошельки можно скачать через Google Play или Apple (iTunes) App Store. С помощью мобильных кошельков вы можете пользоваться Dash на ходу, просканировав QR код, чтобы отправить платёж. Делайте резервные копии вашего мобильного кошелька, чтобы не потерять доступ к вашим средствам. Из-за проблем с безопасностью, которым подвержены мобильные телефоны, рекомендуется не хранить в мобильных кошельках большие суммы.
zh_cn: **移动钱包**\ （\ :ref:`安卓 <dash-android-wallet>`\ 、\ :ref:`iOS <dash-ios-wallet>`\ ）：用户可以通过Google Play或苹果应用商店(iTunes)下载。通过移动钱包，用户可以通过扫描二维码来付款，以便随时随地地使用达世币。用户还可以对移动钱包文件进行备份，以便防止丢失个人拥有的达世币。由于手机存在安全隐患，因此我们不建议用户在移动钱包上存储大量资金。

source: **Online/Cloud/Web Wallet** (:ref:`Exodus <third-party-wallets>`, :ref:`MyDashWallet <web-wallets>`): Third parties that will store your Dash on their servers for you or provide an interface to access your Dash with you providing the keys, so that you can access your Dash from any device connected to the internet. If their website is hacked or if their servers are damaged, you run the risk of losing your Dash. Any online wallets should be secured with strong passphrases and 2FA. You cannot make backup copies of your online wallet, because you do not have access to the private keys. We strongly urge that you NEVER store large amounts of Dash in any online wallet or cryptocurrency exchange.
ru: **Онлайн/Облачные/Веб кошельки** (:ref:`Exodus <third-party-wallets>`, :ref:`MyDashWallet <web-wallets>`): это сторонние сервисы, которые хранят ваши Dash на своих серверах, или представляют интерфейся для доступа к вашим Dash, запрашивая для этого ключи, и таким образом вы можете получить доступ к Dash с любого устройства, которое подключено к Интернету. Если их сайт подвергнется атаке или их сервера повредятся, вы рискуете потерять ваши Dash. Любые онлайн-кошельки нужно защищать сильной кодовой фразой и 2FA. Сделать резервную копию онлайн-кошелька невозможно, поскольку у вас нет приватных ключей. Мы настоятельно рекомендуем НИКОГДА не хранить большое количество Dash в любом онлайн кошельке или на любой криптовалютной бирже.
zh_cn: **网络钱包、云钱包或网络钱包**\ （\ :ref:`Exodus <third-party-wallets>`\ 、\ :ref:`MyDashWallet <web-wallets>`\ ）：第三方服务商将用户的达世币存储到他们的服务器上，并为用户提供借助密码和任何联网设备即可获取个人资金的界面。一旦网络遭到黑客攻击或服务器受损，用户可能丢失个人拥有的达世币。任何网络钱包都应通过强化密码或2FA双重验证来提升安全性。由于无法获得私钥，因此用户无法备份网络钱包。我们不建议用户在网络钱包或加密数字货币交易平台上存储大量的达世币。

source: **Hardware Wallets** (:ref:`Trezor <hardware-wallets>`, KeepKey, Ledger, Nano): A hardware wallet is a specialized, tamper-proof, hardware device that stores your private keys. This device is able to sign transactions with your private key without being connected to the internet. However, you must have an internet connection to send the transaction to the Dash network. This allows your private keys to be accessed easily while still keeping them securely protected. This is widely regarded to be the safest form of storage for your Dash.
ru: **Аппаратные кошельки** (:ref:`Trezor <hardware-wallets>`, KeepKey, Ledger, Nano). Аппаратный кошелёк это специализированное защищённое от взлома устройство, в котором хранятся ваши приватные ключи. Это устройство может подписывать транзакции с помощью приватного ключа, не имея при этом доступа к интернету. Однако, чтобы отправить транзакцию в сеть Dash, подключение к интернету всё же понадобится. Аппаратный кошелёк даёт вам быстрый доступ к приватным ключам, которые при этом надёжно защищены. Он считается наиболее безопасным вариантом хранения Dash.
zh_cn: **硬件钱包**\ （\ :ref:`Trezor <hardware-wallets>`\ 、KeepKey、Ledger和Nano)：硬件钱包指的是专用的防篡改硬件设备，它可以存储个人私钥。用户可以使用在脱机状态下使用私钥来完成交易。不过，要想把交易上传到达世币网络，用户必须联网。硬件钱包不仅方便用户使用私钥，还确保了私钥的安全。它是公认的最安全的达世币存储方式。

source: **Offline/Cold Storage** (:ref:`Paper wallet <dash-paper-wallet>`): A special wallet that is created offline and is never exposed to the internet. Accomplished by using software to generate a public and private key offline and then recording the generated keys. They keys can be printed out on paper or even laser-etched in metal. Copies can be made and stored in a personal safe or bank deposit box. This is an extremely secure way to store Dash. There is no risk of using software wallet files, which can become corrupt, or web wallets, which can be hacked. NOTE: USB sticks are not safe for long-term (multi-year) storage because they degrade over time.
ru: **Оффлайн/Холодное хранение** (:ref:`Бумажный кошелёк <dash-paper-wallet>`): специальный кошелёк, который создаётся оффлайн и не подключается к интернету. Выполняется с использованием программы для генерирования публичного и приватного ключей оффлайн, а затем эти ключи сохраняются. Эти ключи впоследствии можно распечатать на бумаге или даже выжечь лазером на металле. Можно сделать копии и хранить в личном сейфе или банковской депозитной ячейке. Это самый безопасный способ хранения Dash. Вы не рискуете, используя файлы десктоп-кошельков, которые могут быть неисправны, или веб-кошельков, которые можно взломать. ОБРАТИТЕ ВНИМАНИЕ: USB флэшки не подходят для долгосрочного хранения (в течение нескольких лет) ключей, потому что они со временем портятся.
zh_cn: **线下存储/冷存储**\ （\ :ref:`冷钱包 <dash-paper-wallet>`\ ）：这是一种离线创建且不会联网的钱包。它的创建过程包括使用软件离线生成公钥和私钥，然后记录下生成的公钥和私钥。用户可以将公钥或私钥打印到纸上，或者采用激光蚀刻进行记录。用户还可以制作副本并存储在个人保险箱或银行保险箱里。这是一种非常安全的达世币存储方式，它不像软件钱包一样面临失窃风险，也不像网络钱包一样可能受到黑客攻击。但值得注意的是，U盘对于长期（数年）存储来说是不安全的，因为U盘的性能会随着时间的推移而降低。

source: Defined in `DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, Distributed Key Generation (`DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__) is a method of generating a BLS key pair for use in an LLMQ to perform threshold signing on network messages. It is based on BLS M-of-N Threshold Scheme and Distributed Key Generation, which is an implementation of Shamir’s Secret Sharing.
ru: В соответствии с определением в `DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, Distributed Key Generation или распределённое создание ключей (`DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__) это способ создания пары BLS ключей для использования их в LLMQ для выполнеия пороговой подписи сетевых сообщений. Cпособ основывается на BLS M-of-N пороговой схеме и распределённом создании ключей, с помощью которых осуществляется разделение секрета Шамира.
zh_cn: 定义于`DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__，分布式 Key 生成(`DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__) 是一种生成 用来在 LLMQ 中进行网络消息签名的BLS 密钥对。它基于 M-N 策略和分布式生成，是 Shamir 的秘密分享技术的实现。

source: Digital Signature
ru: Электронная подпись
zh_cn: 数字签名

source: A digital signature is a mathematical mechanism that allows someone to prove their identity or ownership of a digital asset. When your digital wallet signs a transaction with the appropriate private key, the whole network can see that the signature matches the address of the Dash being spent, without the need to reveal the private key to the network. You can also digitally sign messages using your private key, to prove for instance that you are the owner of a certain Dash address.
ru: Электронная подпись - это математический механизм, который позволяет какому-либо лицу удостоверить свою личность или право владения электронным активом. Когда ваш кошелёк подписывает транзакцию соответствующим приватным ключом, вся сеть видит, что подпись соответствует адресу, с которого были потрачены Dash, и при этом нет необходимости раскрывать сети этот приватный ключ. Кроме того, с помощью приватного ключа вы можете подписывать сообщения, например, чтобы подтвердить, что вы являетесь владельцем определённого адреса Dash.
zh_cn: 数字签名是一种数学机制，它帮助个人证明自己的身份和对数字资产的所有权。当个人的数字钱包通过正确的私钥进行交易时，整个达世币网络都可以看到与交易地址对应的签名，而用户而无需向网络公示自己的私钥。用户还可以通过私钥进行数字化的签名，从而证明自己对达世币地址的所有权。

source: Electrum Wallet
ru: Electrum кошелёк
zh_cn: 轻钱包

source: :ref:`Dash Electrum Wallet <dash-electrum-wallet>` is a lightweight wallet that does not require you to download or sync the entire blockchain, making the wallet lighter and faster. It includes support for advanced InstantSend, CoinJoin and masternode features.
ru: :ref:`Dash Electrum Wallet <dash-electrum-wallet>` - это "лёгкий" кошелёк, для работы с которым не требуется скачивать или синхронизировать весь блокчейн, и поэтому он легче и быстрее. Он также поддерживает как и InstantSend, так и CoinJoin.

source: Encryption
ru: Шифрование
zh_cn: 加密

source: In cryptography, `encryption <https://en.wikipedia.org/wiki/Encryption>`_ is the process of encoding messages or information in such a way that only authorized parties can read it. Encrypted messages which are intercepted by a third-party are indecipherable gibberish without the private key. In an encryption scheme, the *plaintext* message is encrypted using an encryption algorithm, generating *ciphertext* that can only be read if decrypted by the intended recipient. For technical reasons, an encryption scheme usually uses a pseudo-random encryption key generated by an algorithm. Increases in computing power have "broken" many past encryption algorithms, but a well-designed modern system such as AES-256 is considered essentially "uncrackable."
ru: В криптографии, `шифрование <https://en.wikipedia.org/wiki/Encryption>`_ - это процесс кодирования сообщений или информации таким образом, чтобы их могли прочитать только уполномоченные на это лица. Без приватного ключа зашифрованные сообщения кажутся стороннему наблюдателю бессмысленным набором символов. В схеме шифрования, *исходный текст* зашифровывается с помощью шифровального алгоритма, который генерирует *шифротекст*, и его можно прочитать только если он будет расшифрован человеком, которому этот текст предназначался. По техническим причинам, схемы шифрования обычно используют псевдо-рандомные ключи шифрования, которые генерируются алгоритмом. Повышение вычислительных мощностей "сломало" большую часть старых алгоритмов шифрования, но хорошо продуманные современные системы, например, AES-256 считаются "неприступными".
zh_cn: 在密码学当中，\ `加密 <https://en.wikipedia.org/wiki/Encryption>`_\ 指的是对消息或信息进行加密，以确保只有得到授权的第三方才能读取这些消息或信息的过程。即使第三方拦截了经过加密的信息，在没有私钥的情况下，他们所能看到的也只是乱码。在加密计划中，明码文本会以某种加密算法生成只有既定信息接收者才能解密的密码文本。出于技术方面的考虑，加密方案往往采用算法生成的伪随机加密密码。不断提高的计算能力已经破解了许多过去的加密算法，但AES-256等经过精心设计的现代系统基本上是“不可破解的”。

source: Escrow Services
ru: Эскроу сервисы
zh_cn: 契约服务

source: An `escrow <https://en.wikipedia.org/wiki/Escrow>`_ is:
ru: `Эскроу <https://en.wikipedia.org/wiki/Escrow>`_ - это:
zh_cn: `契约 <https://en.wikipedia.org/wiki/Escrow>`_\ 是指：

source: a contractual arrangement in which a third party receives and disburses money or documents for the primary transacting parties, with the disbursement dependent on conditions agreed to by the transacting parties; or
ru: контрактное соглашение, согласно которому третья сторона получает и распределяет деньги или документы для сторон, которые заключают сделку, и распространение зависит от оговоренных в соглашении условий; или
zh_cn: 一个协议。根据这个协议，第三方为主要的交易方收发资金或文件，不过，支付条款取决于交易方的一致同意。

source: an account established by a broker for holding funds on behalf of the broker's principal or some other person until the consummation or termination of a transaction; or
ru: это счёт, который создаётся брокером для хранения средств в интересах его нанимателя или другого человека до подтверждения или отмены договора; или
zh_cn: 或由经纪人设立的账户，确定代表经纪人的委托方或其它个人代为持有达世币，直到交易完成或终止。

source: a trust account held in the borrower's name to pay obligations such as property taxes and insurance premiums.
ru: это трастовый счёт, который открыт на имя заёмщика, чтобы выполнять его финансовые обязательства, например, уплату налогов или страховых взносов.
zh_cn: 以借款人的名义持有的信托账户，用于履行财产税的缴纳和保险费用的支付等义务。

source: A trusted escrow service is often used when purchasing cryptocurrency or other goods/services over the internet. Both the buyer and seller will choose a trusted third-party, the seller will send the item (or currency) to the escrow agent, and the buyer will send the purchasing funds to the escrow agent as well. Once the escrow agent is satisfied that both parties have satisfied the terms of the agreement, he/she will forward the funds and the product (or currency) being purchased to the appropriate party.
ru: Трастовый эскроу сервис часто используется при покупке криптовлаюты или других товаров/услуг через интернет. И продавец, и покупатель выбирают доверенное третье лицо, затем продавец высылает товар (или валюту) эскроу-агенту, а покупатель высылает эскроу-агенту оплату за заказ. Когда эскроу-агент убеждается, что обе стороны удовлетворены условиями сделки, он или она отправит средства и заказанный продукт (или валюту) соответствующим сторонам.
zh_cn: 在互联网上购买加密数字货币或其它关联产品或服务时，消费者通常可以使用可靠的托管服务。买卖双方都可以选择一个值得信赖的第三方，由卖方将加密数字货币（或其它关联产品）发送给第三方，再由买方向第三方发送相应的钱款。一旦确认双方都满足了协议条款的规定，受委托的第三方就会将钱款和所购买的加密数字货币（或其它关联产品）转发给相应的一方。

source: Evan Duffield
ru: Эван Даффилд

source: Founder and first Lead Developer of Dash. Inventor of X11, InstantSend and PrivateSend. Before creating Dash, Evan was a financial advisor and holds a Series 65 license.
ru: Основатель и первый Вещующий Разработчик Dash. Создатель X11, InstantSend и PrivateSend. До создания Dash, Эван работал финансовым консультантом и имел соответствующую лицензию - Series 65.
zh_cn: Evan是达世币的创始人和第一个首席开发人员，也是X11算法、即时发送功能和匿名发送功能的发明者。在创建达世币之前，他是一名持有Series 65金融牌照的理财顾问。

source: Exchange
ru: Обменный курс
zh_cn: 交易所

source: The current price of one Dash compared to the price of other currencies, like the US dollar, Yen, Euro, or Bitcoin. Because most trading volume takes place on the BTC/DASH markets, price is often quoted in fractions of a bitcoin. For instance, the price of one Dash at the end of March 2017 was 0.08 (bitcoins per Dash). An excellent site for following the exchange rate of Dash is `CoinMarketCap <https://coinmarketcap.com/>`_. Businesses wishing to reduce the risk of holding a volatile digital currency can avoid that risk altogether by having a payment processor do an instant exchange at the time of each transaction.
ru: Текущая цена одного Dash по отношению к цене на другую валюту, например, доллар США, йену, евро или Биткойн. Поскольку основной объем торговли происходит на рынках BTC/DASH, цена часто озвучивается в долях Биткойна. Например, в конце марта 2017 года цена одного Dash равнялась 0,08 (Биткойнов за Dash). Отличный сайт для мониторинга курса Dash - CoinMarketCap <https://coinmarketcap.com/>`_. Бизнесы, которые хотят сократить риск владения волатильной электронной валютой, могут избежать риска, обменивая монеты через обработчик платежей во время каждой транзакции.
zh_cn: 达世币汇率指的是达世币与美元、日元、欧元或比特币等其它币种的币价汇率。由于大多数加密数字货币交易大多发生在达世币和比特币市场上，因此币价通常参考比特币的报价。举个例子，2017年3月的达世币价约等于0.08（比特币）。跟进达世币价的最佳网站之一就是\ `CoinMarketCap <https://coinmarketcap.com/>`_\ 。企业渴望降低持有币价波动较大的数字货币的风险，在这种情况下，这些企业可以借助支付服务处理器在进行每次交易时完成即时支付。

source: Faucet
ru: Кран

source: Faucets are a reward system, in the form of a website or app, that dispenses rewards in the form of a microdash or Duff, which is a hundredth of a millionth Dash, for visitors to claim in exchange for completing a captcha or task as described by the website.
ru: Краны - это система вознаграждения в форме вебсайта или приложения, которые распределяют награду в виде microdash или Duff свои посетителям в обмен на ввод капчи или выполнение описанного на вебсайте задания.
zh_cn: Faucets是一个奖励系统，它以网站或应用程序的形式出现，向访客提供百万分之一个达世币的小额奖励。根据网站的要求，访客可以在输入验证码或完成任务后领取奖励。

source: Fiat Gateway
ru: Фиатный шлюз
zh_cn: 法币通道

source: `Fiat money <https://en.wikipedia.org/wiki/Fiat_money>`_ has been defined variously as:
ru: `Фиатные деньги <https://en.wikipedia.org/wiki/Fiat_money>`_ определяются по-разному:
zh_cn: `法币 <https://en.wikipedia.org/wiki/Fiat_money>`_\ 有下列含义：

source: Any money declared by a government to be legal tender.
ru: Любые деньги, которые объявляются правительством законным денежным средством.
zh_cn: 依靠政府的法令成为合法通货的货币。

source: State-issued money which is neither convertible by law to any other thing, nor fixed in value in terms of any objective standard.
ru: Государственные деньги, неразменные по закону на какую-либо вещь, а также не имеющие фиксированной стоимости с точки зрения объективных критериев.
zh_cn: 由国家发行，但根据法律规定无法兑换成其它商品，根据任何客观标准也不具备固定价值的货币。

source: Intrinsically valueless money used as money because of government decree.
ru: Деньги, по своей сути не обладающие никакой стоимостью, но которые используются в качестве денег из-за указа правительства.
zh_cn: 本质上毫无价值，但由于政府法令的支持才成为货币。

source: Examples include the US dollar, the Euro, the Yen, and so forth.
ru: В качестве примера можно привести доллар США, евро, йену и так далее.
zh_cn: 法定货币的例子包括美元、欧元和人民币等。

source: Fintech
ru: Финтех
zh_cn: 金融科技

source: `Financial technology <https://en.wikipedia.org/wiki/Financial_technology>`_, also known as FinTech, is an economic industry composed of companies that use technology to make financial services more efficient. Financial technology companies are generally startups trying to make financial processes more efficient or eliminate middle- men. Recently many fintech companies have begun utilizing blockchain technology, which is the same technology that underpins Dash and Bitcoin.
ru: `Финансовые технологии <https://en.wikipedia.org/wiki/Financial_technology>`_, также известные как финтех, это экономическая индустрия, состоящая из компаний, которые используют технологии для того, чтобы сделать финансовые услуги более эффективными. Финтех компании это обычно стартапы, которые хотят сделать финансовые процессы более эффективными или избавиться от посредников. Недавно многие финтех компании стали использовать блокчейн технологию, то есть, ту самую технологию, которая лежит в основе Dash и Bitcoin.
zh_cn: 根据维基百科的定义，\ `金融科技 <https://en.wikipedia.org/wiki/Financial_technology>`_\ 指的是指企业运用科技手段使金融服务变得更高效，并因此而形成的一个经济产业。这些金融科技企业通常在创立之初就立志要使金融服务更加高效或力求摆脱中间商的干扰。最近，许多金融科技公司已经开始使用区块链技术了，这项技术正是达世币和比特币的基础。

source: Fork
ru: Форк
zh_cn: 分叉

source: When the blockchain diverges or splits, with some clients recognizing one version of the blockchain as valid, and other clients believing that a different version of the blockchain is valid. Most forks resolve themselves without causing any problems, because the longest blockchain is always considered to be valid. In time, one version of the blockchain will usually "win" and become universally recognized as valid. Forks can, however, be extremely dangerous and should be avoided if possible.
ru: Когда блокчейн отклоняется или раскалывается на две версии, некоторые клиенты признают одну версию блокчейна как валидный, а некоторые верят, что валидна другая версия. Большинство форков разрешаются сами собой, не создавая никаких проблем, потому что валидной версией в итоге признаётся самая длинная цепочка блоков. Со временем, какая-то из версий блокчейна обычно "выигрывает" и признаётся всеми валидной. Однако форки могут быть очень опасны, и по возможности их следует избегать.
zh_cn: 当区块链分叉之后，一些客户会认定其中的某一个版本才是正宗的，而另一些客户则认可另一个版本。由于更早诞生的区块链往往被人们认为是正版，因此很多分叉可以自发解决各种问题并避免后续干扰。随着时间的流逝，某个版本的区块链终将胜出并获得大多数人的认可。不过，分叉仍然是有风险的，因此区块链应当尽量避免分叉。

source: Forking is most likely to occur during software updates to the network. Dash uses a Multi-Phased Fork (“:ref:`Spork <sporks>`”) system for greater flexibility and safety.
ru: В большинстве случаев форк возникает в результате обновления программного обеспечения сети. Dash использует Мультифазовую Форковую систему (":ref:`Спорк <sporks>`"), для большей гибкости и надёжности.
zh_cn: 最有可能发生分叉的阶段是网络进行软件更新的时候。达世币通过多阶段的分叉技术（\ :ref:`叉勺技术 <sporks>`\ ）来提高灵活性和安全性。

source: Full Nodes
ru: Полноценная нода
zh_cn: 全节点

source: Any Dash client that is serving a full version of the blockchain to peers. This can be a user running a Dash Core wallet on his/her desktop, or it could be a :ref:`masternode <masternodes>`. Full nodes promote decentralization by allowing any user to double check the validity of the blockchain.
ru: Любой Dash клиент, который раздаёт пирам полную версию блокчейна. Это может быть запущенный пользователем Dash Core Wallet на его/её рабочем столе или :ref:`мастернода <masternodes>`. Полноценные ноды способствуют децентрализации, позволяя любому пользователю дважды проверить валидность блокчейна.
zh_cn: 全节点指的是为网络提供完整版区块链的任何达世币客户端，其中包括在个人电脑上运行的Dash Core钱包和\ :ref:`主节点 <masternodes>`\ 等等。全节点通过允许任何用户对区块链的有效性进行双重验证来提高去中心化。

source: Fungible
ru: Взаимозаменяемость
zh_cn: 可代替姓

source: Every unit of the currency is worth the same as any other unit.
ru: Каждая единица валюты стоит столько же, сколько любая другая единица.
zh_cn: 任何单位货币与其他同单位货币的价值相等。

source: Genesis Block
ru: Первичный блок
zh_cn: 原始块

source: The very first block in the block chain.
ru: Самый первый блок в блокчейне.
zh_cn: 区块链上产生的第一个区块。
