Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/introduction/information.po
Languages: ru, zh_cn

source: A method of generating and storing private keys completely offline. One could use a desktop or laptop computer disconnected from the internet, a dedicated hardware wallet, a USB stick, or a :ref:`paper wallet <dash-paper-wallet>`.
ru: Это метод оффлайн генерирования и хранения приватных ключей. Для этого можно использовать компьютер или ноутбук, отключённый от интернета, предназначенный для этого аппаратный кошелёк, USB-накопитель или :ref:`бумажник<dash-paper-wallet>`.
zh_cn: 线下生成并存储私钥。用户可以使用脱机状态下的台式电脑或笔记本电脑、专用的硬件钱包、U盘或\ :ref:`纸钱包 <dash-paper-wallet>`\ 来生成并存储私钥。

source: Confirm(ed) Transaction
ru: Подтвердить (Подтверждена) транзакцию
zh_cn: (已)确认交易

source: When a Dash transaction is made, a miner must verify that the transaction is valid. When the inputs and outputs are verified, the transaction is included in a block in the blockchain. The transaction can then be considered complete and irreversible. The confirmation number increases as more blocks are added to the blockchain.
ru: Когда совершается транзакция Dash, майнер должен подтвердить, что эта транзакция валидна. Когда все входы и выходы подтверждены, транзакция включается в блок блокчейна. После этого транзакция может считаться завершённой и необратимой. Номер подтверждения увеличивается по мере того, как в блокчейн добавляются новые блоки.
zh_cn: 当达世币交易发生时，矿工必须验证交易是否有效。在输入和输出得到验证后，交易才会被包含进区块链上的区块里。此时，交易完成且不可逆转。随着区块链上的区块数量的增加，交易确认的数量也会随之增加。

source: Confirmation Number
ru: Номер подтверждения
zh_cn: 确认数

source: confirmations
ru: Подтверждения

source: The number of confirmations for a specific Dash transaction. Zero confirmations means that the **transaction is unconfirmed**. One confirmation means that the transaction is included in the latest block in the blockchain. Two confirmations means the transaction is included in two blocks, three confirmations for three blocks, and so on. The probability of a transaction being reversed (double spent) diminishes exponentially with every block and subsequent confirmation. Six confirmations is usually considered "safe" and irreversible.
ru: Это число подтверждений определённой транзакции Dash. Ноль подтверждений означает, что **транзакция не подтверждена**. Одно подтверждение означает, что транзакция включена в последний блок в блокчейне. Два подтверждения означают, что транзакция включена в два блока, три - в три блока, и так далее. Возможность отмены транзакции (двойного списания) уменьшается по экспоненте с каждым новым блоком и последующим подтверждением. Обычно шести подтверждений достаточно, чтобы считать транзакцию "защищённой" и необратимой.
zh_cn: 具体某个达世币交易的确认次数。零确认意指\ **未确认的交易**\ 。一次确认意味着交易包含在区块链上的最后一个区块上。二次确认意味着交易包含在最后的两个区块上；三次确认意味着交易包含在最后的三个区块上……以此类推。交易被逆转（也就是所谓的双花支付）的概率随着各个区块和后续确认的增加而骤减。六次确认往往就被认为是 "安全" 且不可逆转的。

source: Confirmed Transactions
ru: Подтверждённые транзакции
zh_cn: 已确认的交易

source: Transactions that are processed by miners and considered irreversible, usually after six confirmations. In the case of InstantSend, funds can be considered irreversible after a few seconds, but must still be written to the blockchain (and thus "confirmed").
ru: Это транзакции, которые обрабатываются майнерами и которые считаются необратимыми, обычно после шести подтверждений. В случае InstantSend, средства могут считаться "необратимыми" уже через несколько секунд, однако их всё так же необходимо записать в блокчейн (и таким образом "подтвердить").
zh_cn: 完成六次确认后的交易被视为已由矿工处理且不可逆。以即时发送为例，资金在数秒后不逆转，不过交易情况仍然会被记录在区块链上，并被视作（已）确认。

source: CPU
ru: ЦПУ

source: A `central processing unit (CPU) <https://en.wikipedia.org/wiki/Central_processing_unit>`_ is the electronic circuitry within a computer that carries out the instructions of a computer program by performing the basic arithmetic, logical, control and input/output (I/O) operations specified by the instructions. The term has been used in the computer industry at least since the early 1960s. Traditionally, the term "CPU" refers to a processor, more specifically to its processing unit and control unit (CU), distinguishing these core elements of a computer from external components such as main memory and I/O circuitry.
ru: Центральное процессорное устройство (ЦПУ) <https://en.wikipedia.org/wiki/Central_processing_unit>`_ это электронная схема в компьютере, которая исполняет инструкции компьютерной программы, совершая базовые арифметические, логические, контрольные операции и операции ввода/вывода (I/O), которые оговорены в инструкции. Этот термин используется в компьютерной индустрии как минимум с 1960х годов. Обычно, термин "ЦПУ" обозначает процессор, а именно его блок обработки и блок управления (CU), тем самым отделяя эти базовые элементы компьютера от внешних элементов, например, оперативной памяти и схемы ввода/вывода.
zh_cn: 据维基百科的定义，\ `中央处理器（CPU） <https://en.wikipedia.org/wiki/Central_processing_unit>`_\ 指的是计算机内部的集成电路，它通过基础计算、逻辑操作、控制、输入和输出 (I/O) 来完成计算机程序的指令。至少从1960年起，中央处理器就通用于计算机行业了。中央处理器一词通常泛指处理器，具体来说，它包括运算核心和控制核心 (CU)，这些计算机核心部件有别于主存储器、输入电路和输出电路等外部组件。

source: Cryptocurrency
ru: Криптовалюта
zh_cn: 加密数字货币

source: A `cryptocurrency <https://en.wikipedia.org/wiki/Cryptocurrency>`_ (or crypto currency or crypto-currency) is a medium of exchange using cryptography to secure the transactions and to control the creation of new units.
ru: `Криптовалюта <https://en.wikipedia.org/wiki/Cryptocurrency>`_ (также пишется как крипто валюта или крипто-валюта) это средство обмена, использующее криптографию для защиты транзакций и контролирования создания новых единиц.
zh_cn: 据维基百科的定义，\ `加密数字货币 <https://en.wikipedia.org/wiki/Cryptocurrency>`_\ （虚拟货币或加密货币）指的是应用加密技术来确保交易安全并控制货币发行的交换媒介。

source: Cryptography
ru: Криптография
zh_cn: 密码学

source: Cryptography or cryptology (from Greek κρυπτός *kryptós*, "hidden, secret"; and γράφειν *graphein*, "writing," or -λογία *-logia*, "study," respectively) is the practice and study of techniques for secure communication in the presence of third parties called adversaries. More generally, cryptography is about constructing and analyzing protocols that prevent third parties or the public from reading private messages; various aspects in information security such as data confidentiality, data integrity, authentication, and non- repudiation are central to modern cryptography. Modern cryptography exists at the intersection of the disciplines of mathematics, computer science, and electrical engineering. Applications of cryptography include ATM cards, computer passwords, and electronic commerce.
ru: Криптография или криптология (от греческого κρυπτός "скрытый"; и γράφειν, "пишу," или -λογία, "слово", соответственно) - это создание или изучение методов безопасной коммуникации в присутствии третьих лиц, которые называются "противниками". В более общем смысле, криптография - это создание и анализ протоколов, которые защищают приватные сообщения от прочтения третьими лицами или попадания в общий доступ. Различные аспекты информационной безопасности, например, конфиденциальность и целостность данных, аутентификация, а также невозможность отказа от авторства - это основа современной криптографии. Современная криптография существует на стыке таких дисциплин, как математика, информатика и электротехника. Криптография применяется в том числе для ATM-карт, при создании компьютерных паролей и в электронной коммерции.
zh_cn: 密码学（一词源于希腊语kryptós“隐藏的”和gráphein“书写”）。它指的是在有第三方存在的情况下，为提高通信安全技术而进行的研究和操作。通常来说，密码学是构建和分析协议，从而防止第三方或公众浏览私人讯息的学科，它涉及信息安全的方方面面，其中数据保密性、数据完整性、身份验证和不可否认性是现代密码学的核心。现代密码学汇集了数学、计算机科学和电子工程的学科知识，它的应用包括ATM卡、计算机密码和电子商务。

source: DAO
ru: ДАО

source: The development of Dash and the Dash ecosystem is self-funded by the DAO or Decentralized Autonomous Organization. Each time a block is discovered, 80% of the block reward is split between the miner and a masternodes per the distribution found :ref:`here <block-reward-reallocation>`. 20% of the block subsidy is withheld by the network and used to fund projects that are approved by the masternode network. For a fee, anybody can submit a proposal to the network, and will be paid directly by the blockchain if approved by the masternodes. The Budget System is sometimes called the Treasury System; the two terms are interchangeable.
ru: Развитие Dash и экосистемы Dash осуществляется за счет самофинансирования Dash DAO или Децентрализованной Автономной Организации. Каждый раз, когда добывается блок, 80% вознаграждения за блок делится между майнером и мастернодами в соответствии с распределением, приведенным :ref:`тут <block-reward-reallocation>`. 20% удерживаются сетью и используются для финансирования проектов, одобренных сетью мастернод. За определенную плату любой желающий может подать предложение в сеть, и оно будет оплачено непосредственно блокчейном, если будет одобрено мастернодами. Бюджетную систему иногда называют казной; эти два термина взаимозаменяемы.

source: Decentralized Application Protocol. This term describes an application running on top of the Dash DAPI platform.
ru: Децентрализованный протокол приложения. Этот термин описывает приложение, которое работает на базе платформы DAPI Dash.
zh_cn: 分布式应用协议指的是以达世币去中心化应用为基础而运行的软件应用。

source: DAP Client
ru: DAP-клиент
zh_cn: DAP客户端

source: An HTTP Client that connects to DAPI and enables Dash blockchain users to read and write data to their DAP Space.
ru: HTTP-клиент, который подключается к DAPI и даёт возможность пользователям блокчейна Dash считывать и записывать данные в их DAP-пространстве.
zh_cn: 指HTTP客户端连接DAPI，使达世币区块链用户可以在各自的DAP空间读取和写入数据。

source: DAP Schema
ru: DAP-схема
zh_cn: DAP纲要

source: A Dash Schema document extending the Dash System Schema to define consensus data and rules within a DAP contract.
ru: Документ со схемой Dash, расширяющий схему системы Dash для определения данных и правил консенсуса в контрактах DAP.
zh_cn: 达世币纲要文档是达世币系统纲要的延展，用以定义共识数据和DAP合约的规则。

source: DAP Space
ru: DAP-пространство
zh_cn: DAP空间

source: The part of a DAP State that is owned by a specific blockchain user. Data in a DAP Space can only be changed by the owner.
ru: Часть состояния DAP, которая принадлежит конкретному пользователю блокчейна. Данные в пространстве DAP могут быть изменены только владельцем.
zh_cn: 部分DAP空间被具体的某个区块链用户拥有。DAP空间内的数据只能被拥有者更改。

source: DAP State
ru: DAP-состояние
zh_cn: DAP状态

source: The total set of data stored in a DAP. This data consists of user DAP Spaces.
ru: Совокупный набор данных, сохранённых в DAP. Эти данные содержат информацию о пользователях пространств DAP.
zh_cn: 全部的数据存储于DAP。这份数据随用户DAP空间而更新。

source: Decentralized Application Programming Interface. See above for a definition of API. DAPI will perform the same functions as an API, but with quorums of masternodes acting as the endpoints for API communication.
ru: Децентрализованный программный интерфейс приложения. См. выше определение API. DAPI выполняет те же функции, что и API, но с учётом кворумов мастернод, которые выступают в роли конечных точек для коммуникации API.
zh_cn: 分布式应用程序接口的定义可参考上一词条应用程序接口的定义。它所具备的功能与应用程序接口相同，不同的是主节点仲裁链作为分布式应用程序接口的通信端点。

source: Dark Gravity Wave
ru: Алгоритм Dark Gravity Wave
zh_cn: 暗黑重力波

source: In concept, :ref:`Dark Gravity Wave (DGW) <dark-gravity-wave>` is similar to *Kimoto Gravity Well*, adjusting the difficulty levels every block (instead of every 2016 blocks like Bitcoin) by using statistical data of the last blocks found. In this way block issuing times can remain consistent despite fluctuations in hashpower. However it doesn't suffer from the time-warp exploit.
ru: По своей сути, :ref:`Dark Gravity Wave (DGW) <dark-gravity-wave>` похож на *Kimoto Gravity Well*, алгоритм подстройки к уровню сложности каждого блока (в отличие от каждого 2016 блока, как в Биткойне), который использует статистические данные последнего найденного блока. Таким образом, время выпуска блока может оставаться неизменным, несмотря на разницу вычислительных мощностей. Однако, в DGW отсутствует уязвимость к временным скачкам.
zh_cn: :ref:`暗黑重力波难度调节算法(也称Dark Gravity Wave或简称DGW) <dark-gravity-wave>`\ ，它和Kimoto Gravity Well相似，是开放源代码的难度调节算法。不过，（和根据过去2016个区块的生成时间长短来确认下一个周期的难度的比特币不同的是），暗黑重力波难度调节算法使用最后一个区块上的统计数据来调节各个区块的的难度。在这种情况下，即使算力有所波动，新区块的生成也能维持稳定，并且这种算法不会受到时间错位的影响。

source: Dash was initially launched as XCoin and then rebranded to Darkcoin and finally Dash.
ru: Изначально, Dash был запущен под названием XCoin, затем был переименован в Darkcoin и, наконец, в Dash.
zh_cn: 达世币最初发布时项目名为Xcoin，随后改为暗黑币，最终确定为达世币。

source: Originally launched as Xcoin and later renamed to Darkcoin, the currency was later renamed "Dash" to avoid association with the darknet markets. Dash is a portmanteau of "Digital Cash." Dash is an open source peer-to- peer cryptocurrency that solves many of Bitcoin's problems. Dash's features include InstantSend, CoinJoin, a Decentralized Autonomous Organization (DAO), a 2nd tier network (referred to as the masternode network). See the :ref:`Features <features>` page for a full list of Dash's features.
ru: Будучи изначально запущенной с именем XCoin, а затем переименованной в Darkcoin, валюта позже поменяла название на Dash во избежание ассоциаций с даркнетом. Dash - это сокращение словосочетания "Digital Cash". Dash - это децентрализованная криптовалюта с открытым исходным кодом, в которой решены многие проблемы Биткойна. Особенностями Dash являются функции InstantSend, CoinJoin и Децентрализованной Автономной Организации (DAO), а также 2й уровень сети (более известный как сеть мастернод). Для получения информации о полном перечне особенностей Dash, см. страницу :ref:`Особенности <features>`.

source: Dash network data storage backend service used by masternodes for off-chain data relating to Evolution. DashDrive implements `IPFS <https://ipfs.io>`_, a type of distributed file storage system.
ru: Backend-сервис для хранения данных сети Dash, который используется мастернодами для офчейн данных, имеющих отношение к Evolution. DashDrive использует IPFS <https://ipfs.io>`_, распределённую систему хранения файлов.
zh_cn: 主节点使用达世币网络数据存储终端服务来处理与Evolution相关的链下数据。DashDrive安装了\ `IPFS <https://ipfs.io>`_，这是一种分布式的文件存储系统。

source: Dash Client
ru: Dash-клиент
zh_cn: 达世币客户端

source: Dash clients are software programs used to interface with the Dash network. They store the private keys needed to conduct Dash transactions as well as a copy of the entire blockchain. A Dash client connects to the Dash network and becomes a node in the network. A node shares and propagates new transactions with the rest of the network, creating a robust decentralized infrastructure.
ru: Dash-клиенты это программы, которые используются для взаимодействия с сетью Dash. Они хранят приватные ключи, которые нужны для совершения Dash транзакций, а также копию всего блокчейна. Dash-клиент подключается к сети Dash и становится нодой этой сети. Нода разделяет и распространяет новые транзакции между остальными нодами сети, таким образом создавая надёжную децентрализованную инфраструктуру.
zh_cn: 达世币客户端是用于与达世币网络相连的软件程序。它存储着完成达世币交易所需的私钥和整个区块链的副本。每一个与达世币网络相连的达世币客户端都会成为网络上的一个节点，而每一个节点都会与整个网络的其它成员一同分享和传播新的交易资讯，从而创建一个更有活力的去中心化基础框架。

source: Dash Core Wallet
ru: Кошелёк Dash Core
zh_cn: Dash Core钱包

source: The :ref:`Dash Core Wallet <dash-core-wallet>` (known also as the QT wallet) is the "official" Dash wallet that is compiled by the Dash Core Team and allows both InstantSend and CoinJoin. The DashCore wallet will download the entire blockchain and serve it over the internet to any peers who request it.
ru: :ref:`Dash Core Wallet <dash-core-wallet>`, (также известный как QT кошелёк) это "официальный" кошелёк Dash, который собран Dash Core Team и с помощью которого можно совершать переводы через InstantSend и CoinJoin. Кошелёк DashCore полностью скачивает блокчейн и раздаёт его любому пиру, которые его запросит.

source: This is a 3 tier network Dash developers are presently building. It will make Dash as easy to use as PayPal, while still remaining decentralized. See the :ref:`Evolution <evolution>` page for more information.
ru: Это 3-х уровневая сеть Dash, над которой сейчас трудятся разработчики. Благодаря ей пользоваться Dash будет так же просто, как и Paypal, и он по-прежнему будет децентрализованным. См. страницу :ref:`Evolution <evolution>`, чтобы узнать больше.
zh_cn: 目前，达世币在搭建一个3层的网络，它将使达世币在保持去中心化的同时，变得像Paypal一样便于使用。如需了解更多信息，请浏览\ :ref:`达世币Evolution <evolution>`\ 的相关页面。

source: A JSON-based language specification for defining and validating consensus data in Evolution.
ru: Основанный на JSON язык спецификаций, который используется для определения и подтверждения консенсусных данных в Evolution.
zh_cn: 以JSON为基础的语言用以定义和验证Evolution中的共识数据。

source: A distributed denial of service attack uses large numbers of computers under an attacker’s control to drain the resources of a central target. They often send small amounts of network traffic across the Internet to tie up computing and bandwidth resources at the target, which prevents it from providing services to legitimate users. Dash exchanges have sometimes been hit with DDoS attacks.
ru: Распределённая атака "отказа в обслуживании" использует большое количество компьютеров, подконтрольных хакеру, чтобы исчерпать все ресурсы главной цели. Часто они рассылают небольшие пакеты данных по Интернету, чтобы связать воедино вычислительные и пропускные ресурсы и замкнуть на одной цели, не давая ей обслуживать законных пользователей. Иногда Dash биржи подвергаются таким DDoS атакам.
zh_cn: 分散式阻断服务攻击指的是攻击者使用个人控制的大量计算机来消耗攻击对象的资源。他们经常通过互联网发送少量的网络流量，从而阻碍攻击对象的计算能力和带宽资源，并阻断攻击对象向正规用户提供的服务。达世币交易平台有时也会遭到此类攻击。

source: Decentralized
ru: Децентрализация
zh_cn: 分布式

source: `Decentralized computing <https://en.wikipedia.org/wiki/Decentralized_computing>`_ is the allocation of resources, both hardware and software, to each individual workstation or office location. In contrast, centralized computing exists when the majority of functions are carried out or obtained from a remote centralized location. Decentralized computing is a trend in modern-day business environments. This is the opposite of centralized computing, which was prevalent during the early days of computers. A decentralized computer system has many benefits over a conventional centralized network. Desktop computers have advanced so rapidly that their potential performance far exceeds the requirements of most business applications. This results in most desktop computers remaining nearly idle most of the time. A decentralized system can use the potential of these systems to maximize efficiency. However, it is debatable whether these networks increase overall effectiveness.
ru: `Децентрализованное вычисление <https://en.wikipedia.org/wiki/Decentralized_computing>`_ - это распространение ресурсов аппаратного и программного обеспечения, между всеми индивидуальными рабочими местами или кабинетами. Для сравнения, в централизованном вычислении основная часть функций осуществляется или получается от удалённого централизованного источника. Децентрализованное вычисление - это тренд современной бизнес-среды. Оно является противоположность. централизованного вычисления, которое было широко распространено в начале компьютерной эпохи. У децентрализованной компьютерной системы есть ряд преимуществ перед обычной централизованной сетью. Персональные компьютеры так быстро развиваются, что их потенциальная мощность намного превышает требования большинства бизнес-приложений. Следовательно, большая часть компьютеров большую часть времени практически простаивает. Децентрализованная система может использовать их потенциал, чтобы обеспечить максимальную эффективность. Однако, вопрос о том, повысят ли такие сети общую эффективность, всё ещё остаётся открытым.
zh_cn: 根据维基百科的定义，\ `分布式计算 <https://en.wikipedia.org/wiki/Decentralized_computing>`_\ 指的是将硬件和软件资源分配到每个工作站或办公室的计算模式。相比之下，集中式计算则是将大部分计算功能集中于本地或者远程进行集中计算。分布式计算是一种现代化的计算模式。与分布式计算相反的集中计算则普遍存在于早期的计算机当中。和传统的集中计算相比，分布式的计算机系统拥有诸多优势。台式计算机发展如此迅猛，以至于它们的性能表现甚至远远超前于大多数企业应用的要求。这样一来，台式计算机的大多数计算能力都无用武之地。而分布式计算则可以发挥这些潜能，从而最大限度地提高计算机的效率。然而，分布式网络能否提高整个网络的效用还有待商榷。

source: Desktop Wallet
ru: Desktop-кошелёк
zh_cn: 桌面钱包

source: A wallet is a piece of software that stores your Dash. There are many different wallet options, but it is imperative to choose a secure one. We recommend any of the following: :ref:`Dash Core Wallet <dash-core-wallet>` / :ref:`Dash Electrum Wallet <dash-electrum-wallet>` / :ref:`Hardware Wallets <hardware-wallets>`
ru: Кошелёк - это программа, которая хранит ваши Dash. Существует множество вариантов кошелька, но важно выбрать надёжный. Мы рекомендуем следующие: :ref:`Dash Core Wallet <dash-core-wallet>`, :ref:`Dash Electrum Wallet <dash-electrum-wallet>`, :ref:`Аппаратные кошельки <hardware-wallets>`.
zh_cn: 钱包指的是用于存储达世币的软件。现有的钱包种类多种多样，但用户必须选择安全系数高的钱包。我们建议用户选用\ :ref:`Dash Core钱包 <dash-core-wallet>`\ 、\ :ref:`达世币轻钱包 <dash-electrum-wallet>`\ 和\ :ref:`硬件钱包 <hardware-wallets>`\ 。

source: Difficulty
ru: Сложность
zh_cn: 难度

source: This number determines how difficult it is to hash a new block. It is related to the maximum allowed number in a given numerical portion of a transaction block’s hash. The lower the number, the more difficult it is to produce a hash value that fits it. Difficulty varies based on the amount of computing power used by miners on the Dash network. If large numbers of miners leave a network, the difficulty would decrease. Dash's increasing popularity and the availability of specialized ASIC miners have caused the difficulty to increase over time.
ru: Это число определяет сложность хэширования нового блока. Оно связано с максимально возможной целью в заданной числовой строке хэша текущего блока. Чем ниже это число, тем сложнее будет найти подходящее значение хэш. Сложность изменяется в зависимость от уровня вычислительной мощности, которую задействуют майнеры сети Dash. Если из сети уйдёт большое количество майнеров, сложность снизится. Растущая популярность Dash и доступность специальных ASIC майнеров привели к тому, что сложность со временем повышается.
zh_cn: 这一数字决定了计算新的区块的难度。它和区块哈希的既定数值中的最大数值有关。这个最大数值越低，那么产生适宜的哈希值的难度就越大。难度的变化取决于矿工在达世币网络上使用的计算能力的大小。如果大量矿工脱离网络，那么难度就会减小。达世币的日趋流行和专用集成电路的日渐普及使得难度与日俱增。

source: Digital Wallet
ru: Электронный кошелёк
zh_cn: 数字钱包

source: See :ref:`this link <wallets>` for full documentation on wallets.
ru: Полную документацию о кошельках см. :ref:`здесь <wallets>`.
zh_cn: 查看此\ :ref:`链接 <wallets>`\ ，浏览所有钱包资料。

source: A digital wallet is similar to a physical wallet except that it is used to hold **digital currency**. A Dash wallet holds your private keys, which allow you to spend your Dash. You are also able to make backups of your wallet in order to ensure that you never lose access to your Dash. Digital wallets can exist in many different forms and on many devices:
ru: Электронный кошелёк во многом похож на физический кошелёк за исключением того, что он используется для хранения **цифровой валюты**. В кошельке Dash хранятся ваши приватные ключи, с помощью которых вы можете тратить ваши Dash. Вы также можете сделать резервное копирование вашего кошелька, чтобы убедиться, что вы никогда не потеряете доступ к вашим Dash. Существует множество версий электронных кошельков для различных устройств:
zh_cn: 数字钱包类似于实体钱包，只不过数字钱包里放的是 **数字货币** ，而实体钱包里放的是实体货币。达世币钱包里还存有私钥，也就是完成达世币交易的必备工具之一。为了防止丢失个人拥有的达世币，用户可以对钱包进行备份。数字钱包有多种类型，可用于各种设备:
