Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/electrum/installation.po
Languages: es, pt

source: How to install and create a new Dash Electrum wallet on Windows, Linux, macOS and Android
es: Como descargar, instalar y encriptar una nueva billetera Dash Electrum en Windows, Linux, macOS y Android
pt: Como instalar e criar uma nova carteira Dash Electrum no Windows, Linux, macOS e Android

source: dash, mobile, wallet, electrum, android, linux, windows, macos, installation, compile
es: dash, móvil, billetera, electrum, android, linux, windows, macos, instalación, compilar
pt: dash, mobile, carteira, electrum, android, linux, windows, macos, instalação, compilar

source: Installation
es: Instalación
pt: Instalação

source: Download
es: Descarga

source: You can download Dash Electrum from the official Dash website or the Dash Electrum minisite.
es: Puedes descargar Dash Electrum del sitio web oficial de Dash o del sitio web de Dash Electrum.
pt: Você pode baixar o Dash Electrum no site oficial do Dash ou no minisite Dash Electrum.

source: Dash Electrum is developed by community member **akhavr** and is released through his GitHub account.
es: Dash Electrum es desarrollado por el miembro de la comunidad **akhavr** y es lanzado por su cuenta GitHub.

source: Dash Electrum for Linux is available from a PPA for Ubuntu and Linux Mint, and as a source tarball for other systems. As of version 3.0.6, it requires Python 3 to run. Enter the following commands to install from PPA::
es: Dash Electrum para Linux está disponible desde un PPA para Ubuntu y Linux Mint, y como tarball de origen para otros sistemas. A partir de la versión 3.0.6, requiere Python 3 para su ejecución. Ingresa los siguientes comandos para instalar desde PPA::
pt: O Dash Electrum para Linux está disponível a partir de um PPA para o Ubuntu e Linux Mint e como um tarball de origem para outros sistemas. A partir da versão 3.0.6, requer que o Python 3 seja executado. Digite os seguintes comandos para instalar a partir do PPA::

source: Simply download and run the DMG file. You may need to grant permission to install, depending on your security settings. Click through the installation wizard and run Dash Electrum from your Applications folder when complete.
es: Simplemente descargua y ejecuta el archivo DMG. Es posible que debas otorgar permiso para la instalación, dependiendo de tu configuración de seguridad. Haz click en el asistente de instalación y ejecuta Dash Electrum desde la carpeta Aplicaciones cuando se haya completado.
pt: Basta baixar e executar o arquivo DMG. Talvez seja necessário conceder permissão para instalar, dependendo das configurações de segurança. Clique no assistente de instalação e execute o Dash Electrum na sua pasta Aplicativos quando estiver completo.

source: Simply download and run the installer file to set up Dash Electrum. You may need to grant permission to install, depending on your security settings. Click through the installation wizard and run Dash Electrum from the Start menu when complete.
es: Simplemente descargua y ejecuta el archivo de instalación para configurar Dash Electrum. Es posible que debas otorgar permiso para la instalación, dependiendo de tu configuración de seguridad. Haz click en el asistente de instalación y ejecuta Dash Electrum desde el menú Inicio cuando se complete.
pt: Basta baixar e executar o arquivo de instalação para configurar o Dash Electrum. Talvez seja necessário conceder permissão para instalar, dependendo das configurações de segurança. Clique no assistente de instalação e execute o Dash Electrum no menu Iniciar quando terminar.

source: Download and run the APK file from https://electrum.dash.org to set up Dash Electrum. You may need to grant permission to install from unknown sources, depending on your security settings. Click through the installation wizard and run Dash Electrum when complete.
es: Descarga y ejecuta el archivo APK desde https://electrum.dash.org para configurar Dash Electrum. Es posible que debas otorgar permiso para instalar desde fuentes desconocidas, dependiendo de tu configuración de seguridad. Haz click en el asistente de instalación y ejecuta Dash Electrum cuando se complete.
pt: Faça o download e execute o arquivo APK em https://electrum.dash.org para configurar o Dash Electrum. Talvez seja necessário conceder permissão para instalar a partir de fontes desconhecidas, dependendo das configurações de segurança. Clique no assistente de instalação e execute o Dash Electrum quando terminar.

source: Creating a New Wallet
es: Crear una Nueva Billetera
pt: Criando uma nova carteira

source: Dash Electrum gathers configuration data when run for the first time. For more on the concepts behind this process, skip to the later sections of this guide discussing backups, security, and addresses. When setting up Dash Electrum for the first time, a wizard will guide you through the process of creating your first wallet. The first screen asks how you would like to connect to the remote server. Select **Auto connect** and click **Next** to continue. You will see a notice that no wallet currently exists. Enter a name for your wallet (or accept the default name) and click **Next** to create your wallet.
es: Dash Electrum recopila datos de configuración cuando se ejecuta por primera vez. Para obtener más información sobre los conceptos detrás de este proceso, ve a las secciones posteriores de esta guía donde se explican los respaldos, la seguridad y las direcciones. Al configurar Dash Electrum por primera vez, un asistente te guiará a través del proceso de creación de tu primera billetera. La primera pantalla te pregunta cómo te gustaría conectarte al servidor remoto. Selecciona **Conexión automática** y haz clic en **Siguiente** para continuar. Verás un aviso de que actualmente no existe una billetera. Ingresa un nombre para tu billetera (o acepta el nombre predeterminado) y haz clic en **Siguiente** para crear tu billetera.
pt: O Dash Electrum reúne dados de configuração quando executado pela primeira vez. Para mais informações sobre os conceitos por trás deste processo, pule para as seções posteriores deste guia, discutindo backups, segurança e endereços. Ao configurar o Dash Electrum pela primeira vez, um assistente irá guiá-lo através do processo de criação de sua primeira carteira. A primeira tela pergunta como você gostaria de se conectar ao servidor remoto. Selecione **Conexão automática** e clique em **Avançar** para continuar. Você verá um aviso de que nenhuma carteira existe atualmente. Digite um nome para sua carteira (ou aceite o nome padrão) e clique em **Avançar** para criar sua carteira.

source: Selecting the server and naming your first wallet
es: Selecciona el servidor y nombra tu primera billetera
pt: Selecionando o servidor e nomeando sua primeira carteira

source: You will be asked what kind of wallet you want to create. Choose between **Standard wallet**, **Multi-signature wallet** and **Watch Dash addresses**. If you are unsure, select **Standard wallet** and click **Next** to continue. You will then be asked how you want to store/recover the seed. If stored safely, a seed can be used to restore a lost wallet on another computer. Choose between **Create a new seed**, **I already have a seed**, **Use public or private keys** or **Use a hardware device**. If you are using Electrum Dash for the first time and not restoring an existing wallet, choose **Create a new seed** and click **Next** to continue.
es: Se te preguntará qué tipo de monedero quieres crear. Elije entre **Billetera estándar**, **Billetera multifirmas** y **Ver direcciones Dash**. Si no estás seguro, selecciona **Billetera estándar ** y haz clic en **Siguiente** para continuar. Luego se te preguntará cómo deseas almacenar/recuperar la semilla. Si se almacena de manera segura, se puede usar una semilla para restaurar en otra computadora una billetera perdida. Elije entre **Crear una nueva semilla**, **Ya tengo una semilla**, **Usar llaves públicas o privadas** o **Usar un dispositivo de hardware**. Si estás utilizando Electrum Dash por primera vez y no restauras una billetera existente, elije **Crear una nueva semilla** y haz clic en **Siguiente** para continuar.
pt: Você será perguntado que tipo de carteira você quer criar. Escolha entre **Carteira padrão**, **Carteira multi-assinatura** e **Endereços do painel de acompanhamento**. Se não tiver certeza, selecione **Carteira padrão** e clique em **Próximo** para continuar. Você será perguntado como deseja armazenar/recuperar a semente. Se armazenado com segurança, uma semente pode ser usada para restaurar uma carteira perdida em outro computador. Escolha entre **Crie uma nova semente**, **Eu já possuo uma nova semente**, **Utilizar chaves públicas ou privadas** ou **Utilizar um dispositivo de hardware**. Se você estiver usando o Electrum Dash pela primeira vez e não estiver restaurando uma carteira existente, escolha **Crie uma nova semente** e clique em **Avançar** para continuar.

source: Selecting the wallet type and keystore
es: Seleccionar el tipo de billetera y el almacén de claves
pt: Selecionando o tipo de carteira e keystore

source: Electrum Dash will generate your wallet and display the recovery seed. Write this seed down, ideally on paper and not in an electronic format, and store it somewhere safe. This seed is the only way you can recover your wallet if you lose access for any reason. To make sure you have properly saved your seed, Electrum Dash will ask you to type it in as a confirmation. Type the words in the correct order and click **Next** to continue.
es: Electrum Dash generará tu billetera y mostrará la semilla de recuperación. Escribe esta semilla, idealmente en papel y no en formato electrónico, y guárdala en un lugar seguro. Esta semilla es la única forma en que puedes recuperar tu billetera si pierdes el acceso por cualquier motivo. Para asegurarte de haber guardado correctamente tu semilla, Electrum Dash te pedirá que la escribas como confirmación. Escribe las palabras en el orden correcto y haz clic en **Siguiente** para continuar.
pt: O Electrum Dash gerará sua carteira e exibirá a semente de recuperação. Escreva essa semente, idealmente em papel e não em formato eletrônico, e guarde-a em algum lugar seguro. Essa semente é a única maneira de recuperar sua carteira se você perder o acesso por qualquer motivo. Para ter certeza de que você salvou sua semente corretamente, a Electrum Dash pedirá que você a digite como uma confirmação. Digite as palavras na ordem correta e clique em **Proximo** para continuar.

source: Generating and confirming the recovery seed
es: Generar y confirmar la semilla de recuperación
pt: Gerando e confirmando a semente de recuperação

source: A password optionally secures your wallet against unauthorized access. Adding a memorable, strong password now improves the security of your wallet by encrypting your seed from the beginning. Skipping encryption at this point by not selecting a password risks potential theft of funds later, however unlikely the threat may be. Enter and confirm a password, ensure the **Encrypt wallet file** checkbox is ticked and click **Next** to continue.
es: Opcionalmente con una contraseña proteges tu monedero del acceso no autorizado. Agregar una contraseña segura mejora la seguridad de tu monedero encriptando tu semilla desde el principio. Omitir la encriptación en este punto al no seleccionar una contraseña puede ocasionar un posible robo de fondos más adelante, por improbable que sea la amenaza. Ingresa y confirma una contraseña, asegúrate de que la casilla de verificación **Encriptar archivo de billetera** esté marcada y haz clic en **Siguiente** para continuar.
pt: Uma senha opcionalmente protege sua carteira contra acesso não autorizado. Adicionar uma senha forte e memorável melhora a segurança de sua carteira criptografando sua semente desde o início. Ignorar a criptografia neste ponto, ao não selecionar uma senha, arrisca um possível roubo de fundos posteriormente, por mais improvável que seja a ameaça. Digite e confirme uma senha, verifique se a caixa de seleção **Criptografar arquivo da carteira** está marcada e clique em **Proximo** para continuar.

source: Entering and confirming a wallet encryption password
es: Ingresar y confirmar una contraseña de encriptación de la billetera
pt: Entrando e confirmando uma senha criptografica da carteira

source: Your Dash Electrum wallet is now set up and ready for use.
es: Tu billetera Dash Electrum ahora está configurada y listo para usar.
pt: Sua carteira Dash Electrum está agora pronta para uso.

source: Dash Electrum after setup is complete
es: Dash Electrum una vez completada la configuración
pt: O Dash Electrum após a conclusão da instalação

source: Enter the following commands (changing the version number to match the current version as necessary) in the terminal to install Dash Electrum from the source tarball::
pt: Digite os seguintes comandos (alterando o número da versão para coincidir com a versão atual, conforme necessário) no terminal para instalar o Dash Electrum a partir do source de origem:
