Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/android/advanced-functions.po
Languages: ar, de, es, ru

source: Set up address book, exchange rates, sweep paper wallets and change settings in the Dash Android wallet.
ar: قم بإعداد دفتر العناوين وأسعار الصرف وحافظ الأوراق النقدية وتغيير الإعدادات في محفظة داش في الأندرويد
de: Adressbuch und Kurs einrichten, Paper Wallets entleeren und Einstellungen der Dash Android Wallet ändern.
es: Configurar una libreta de direcciones, tasas de cambio, barrer billeteras de papel y cambiar las configuraciones en la billetera Dash de Android.
ru: Настройка адресной книги, обменных курсов, перенос бумажного кошелька и изменение настроек в кошельке Dash для Android.

source: dash, mobile, wallet, android, address book, paper, exchange rates
ar: داش ، الهاتف ، المحفظة ، الأندرويد ، دفتر العناوين، ورقة ، أسعار الصرف
es: dash, móvil, billetera, android, libreta de direcciones, papel, tasas de cambio
ru: dash, мобильный, кошлёк, android, адресная книга, бумажный, обменный курс

source: Advanced functions
ar: الوظائف المتقدمة
de: Erweiterte Funktionen
es: Funciones Avanzadas
ru: Продвинутые функции

source: Address book
ar: دفتر العناوين
de: Adressbuch
es: Libreta de direcciones
ru: Адресная книга

source: Your Android wallet allows you to manage frequently used addresses by adding a label to help you identify the owner. You can also label your own addresses in the wallet in order to keep track of regular incoming payments. You can access the address book by tapping the **Menu button**, then **Address book**. This will display a screen where you can swipe left and right between your own addresses and the addresses to which you frequently send Dash, such as family members for example. Tap the **More options** button to **Paste from clipboard** or to **Scan address** from a QR code, or tap an existing address to **Send Dash** or **Edit** the label.
ar: تتيح لك محفظة الأندرويد إدارة العناوين المستخدمة بكثرة عن طريق إضافة تصنيف لمساعدتك في تحديد المالك. يمكنك أيضًا تصنيف العناوين الخاصة بك في المحفظة من أجل متابعة المدفوعات الواردة العادية. يمكنك الوصول إلى دفتر العناوين عن طريق النقر فوق **زر القائمة** ، ثم **دفتر العناوين**. سيعرض هذا شاشة يمكنك من خلالها التمرير إلى اليسار واليمين بين العناوين الخاصة بك والعناوين التي ترسل إليها داش بشكل متكرر ، مثل أفراد العائلة على سبيل المثال. انقر فوق الزر **مزيد من الخيارات** إلى **لصق من الحافظة** أو **عنوان المسح الضوئي** من رمز الاستجابة السريعة ، أو انقر فوق عنوان موجود إلى **إرسال داش** أو **تعديل** الملصق .
de: Deine Android Wallet erlaubt es dir, ein Adressbuch anzulegen, in dem du Adressen mit einer Beschreibung abspeicherst, die den Besitzer identifiziert. Du kannst auch deine eigenen Adressen markieren, um regelmäßige Zahlungen zu kennzeichnen. Öffne hierfür das Adressbuch über das **Menü-Symbol** und den Eintrag **Adressbuch**. Indem du nach Links und Rechts wischst, kannst du zwischen deinen Adressen und Adressen, von denen du bereits empfangen hast, hin und her schalten. Über **Mehr Optionen** kannst du **Aus dem Clipboard einfügen** und **Adresse scannen** auswählen. Außerdem kannst du auf eine bereits existierende Adresse tappen und **Dash senden** oder **Bearbeiten** auswählen.
es: Tu billetera Android te permite administrar direcciones de uso frecuente mediante la adición de una etiqueta que te ayudará a identificar al propietario. También puedes etiquetar tus propias direcciones en la billetera para realizar un seguimiento de los pagos regulares que recibes. Puedes acceder a la libreta de direcciones tocando el **Botón de menú**, luego **Libreta de direcciones**. Aparecerá una pantalla en la que puedes deslizar el dedo hacia la izquierda y hacia la derecha entre tus propias direcciones y las direcciones a las que envías Dash con frecuencia, como por ejemplo, miembros de la familia. Toca el botón **Más opciones** para **Pegar desde el portapapeles** o para **Escanear dirección** desde un código QR, o toca una dirección existente para **Enviar Dash** o **Editar** la etiqueta .
ru: Ваш кошелёк для Android позволяет настроить часто используемые адреса путём добавления метки для быстрой идентификации владельца. Так же вы можете создавать метки для своих адресов, чтобы следить за регулярными входящими платежами. Доступ к адресной книге можно получить, нажав кнопку **Меню**, а потом **Адресная книга*. Это выведет экран, который можно пролистывать влево и вправо для перемещения между вашими адресами и адресами, на которые вы часто отправляете Dash, например, это могут быть адреса членов семьи. Нажмите кнопку **Больше опций**, чтобы **Скопировать из буфера обмена** или **Отсканировать адрес** из QR-кода или же нажмите на существующий адрес, чтобы **Отправить Dash** или **Отредактировать** метку.

source: *Accessing the address book and adding an address*
ar: *الوصول إلى دفتر العناوين وإضافة عنوان*
de: *Das Adressbuch öffnen und eine Adresse hinzufügen*
es: *Acceder a la libreta de direcciones y agregar una dirección*
ru: *Вход в адресную книгу и добавление адреса*

source: You can also add labels directly from the main transaction history screen by tapping the **More options** button for the transaction (three vertical dots) and selecting either **Add label to your address**, **Edit label of your address**, **Add sending address** or **Edit label of sending address**.
ar: يمكنك أيضًا إضافة تصنيفات مباشرة من شاشة سجل المعاملات الرئيسية من خلال النقر على زر **مزيد من الخيارات** للمعاملة (ثلاث نقاط رأسية) وتحديد إما **إضافة تصنيف إلى عنوانك** ، **تعديل عنوان لعنوانك** ، **إضافة عنوان إرسال** أو **تعديل عنوان إرسال البريد**.
de: Du kannst Beschreibungen auch über den Hauptbildschirm hinzufügen, indem du den Knopf **Mehr Optionen** für die Transaktion verwendest (drei vertikale Punkte) und entweder **Name zu eigener Adresse hinzufügen**, **Name von eigener Adresse ändern**, **Sendeadresse hinzufügen** oder **Name von Sendeadresse ändern** auswählst.
es: También puedes agregar etiquetas directamente desde la pantalla principal del historial de transacciones presionando el botón **Más opciones** para la transacción (tres puntos verticales) y seleccionando **Agregar etiqueta a tu dirección**, **Editar etiqueta de tu dirección**, **Agregar dirección de envío** o **Editar etiqueta de dirección de envío**.
ru: Также вы можете добавлять метки напрямую из главного экрана истории транзакций, нажав кнопку **Больше опций** для конкретной транзакции (три вертикальных точки) и выбрав **Добавить метку к вашему адресу**, **Отредактировать метку вашего адреса**, **Добавить адрес отправки** или **Отпредактировать адрес отправки**.

source: *Adding and editing address labels in transaction view*
ar: *إضافة وتحرير عناوين العناوين في عرض المعاملات*
de: *Adressbeschreibung in der Transaktionsübersicht hinzufügen und ändern*
es: *Agregar y editar etiquetas de direcciones en la vista de transacciones*
ru: *Добавление и редактирование меток адресов в просмотре транзакций*

source: Exchange rates
ar: معدل التحويل
de: Kurse
es: Tasas de cambio
ru: Обменные курсы

source: Dash Wallet for Android allows you to display the equivalent value of your Dash balance and in transactions by selecting a default fiat currency. To select a default currency, tap the **Menu button**, then **Exchange rates**. Find your preferred fiat currency, then tap the **More options** button for that currency and select **Set as default**. The exchange rate for this currency will appear when sending Dash, and you can also tap in the fiat currency field to enter the value in the fiat currency directly, instead of in Dash.
ar: تسمح لك محفظة داش في الأندرويد ان بعرض القيمة المكافئة لرصيد داش وفي المعاملات عن طريق تحديد عملة fiat افتراضية. لتحديد عملة افتراضية ، انقر فوق زر القائمة ، ثم **أسعار الصرف**. ابحث عن العملة الورقية المفضلة لديك ، ثم اضغط على زر **المزيد من الخيارات** لهذه العملة وحدد **تعيين كافتراضي**. سيظهر سعر الصرف لهذه العملة عند إرسال داش ، ويمكنك أيضًا النقر في حقل العملة fiat لإدخال القيمة بالعملة الورقية مباشرةً ، بدلاً من إدخالها في داش.
de: Die Dash Wallet für Android erlaubt es dir, den Wert deines Dash-Guthabens und deiner Transaktionen in einer Standard-Fiatwährung anzeigen zu lassen. Gehe hierzu über das **Menü Symbol** auf **Wechselkurse**. Hier kannst du deine bevorzugte Fiatwährung auswählen und über das Symbol **Mehr Optionen** **als Standard festsetzen**. Der Wechselkurs für diese Fiatwährung wird angezeigt, wenn du Dash versendest und du kannst den Wert deiner Transaktion auch direkt über das Feld für Fiatwährungen eingeben.
es: La billetera de Dash para Android te permite mostrar el valor equivalente de tu saldo de Dash y en transacciones seleccionando una moneda fiduciaria predeterminada. Para seleccionar una moneda predeterminada, presiona el **botón de menú**, luego **Tasas de cambio**. Encuentra tu moneda fiduciaria preferida, luego presiona el botón **Más opciones** para esa moneda y selecciona **Establecer como predeterminado**. La tasa de cambio para esta moneda aparecerá al enviar Dash, y también puedes tocar en el campo de moneda fiduciaria para ingresar el valor en la moneda fiduciaria directamente, en lugar de en Dash.
ru: Кошелёк Dash для Android позволяет показывать эквивалентную стоимость вашего баланса Dash и транзакций в фиатных деньгах, выбрав фиатную валюту по умолчанию. Для выбора фиатной валюты, нажмите **Кнопка Меню*, далее **Обменные курсы**. Выберите предпочитаемую фиатную валюту, потом нажмите кнопку **Больше опций** для выбранной фиатной валюты и нажмите **Установить по умолчанию**. Обменный курс этой валюты появится при отправке Dash. Также вы можете нажать на поле фиатной валюты для указания размера транзакции в фиатной валюте, вместо Dash.

source: *Selecting a fiat exchange rate and creating a transaction denominated in USD*
ar: *اختيار سعر صرف العملة وإجراء معاملة بالدولار الأمريكي*
de: **Einen Fiat-Wechselkurs auswählen und eine Transaktion in US-Dollar denominieren**
es: *Seleccionar una tasa de cambio fija a moneda fiduciaria y crear una transacción denominada en USD*
ru: *Выбор обменного курса на фиатные деньги и создание транзакции, деноминированной в USD*

source: Sweep paper wallet
ar: إحتياج المحفظة الورقية
de: Paper Wallet entleeren
es: Arrastrar la billetera de papel
ru: Перенос бумажного кошелька

source: Sweeping a paper wallet is a method of transferring the value stored on an address you may have received as a paper wallet or from an ATM into your own wallet. You must have access to the private key for an address to use this function. In this process, all Dash stored on the address will be sent to a new address that has been deterministically generated from your wallet seed. The private keys you sweep do not become a part of your wallet.
ar: تجتاح المحفظة الورقية هي طريقة لنقل القيمة المخزنة على عنوان قد تكون تلقيته كمحفظة ورقية أو من ماكينة الصراف الآلي إلى محفظتك الخاصة. يجب أن يكون لديك حق الوصول إلى المفتاح الخاص لعنوان لاستخدام هذه الوظيفة. في هذه العملية ، سيتم إرسال كل داش المخزن على العنوان إلى عنوان جديد تم إنشاؤه بشكل حاسم من بذرة المحفظة الخاصة بك. لا تصبح المفاتيح الخاصة التي تمسحها جزءًا من محفظتك.
de: Eine Paper-Wallet zu entleeren bedeutet, den Wert einer Adresse, die man z.B. als Paper-Wallet oder von einem Geldautomaten erhalten hat, in die eigene Wallet zu übertragen. Zur Nutzung dieser Funktion muss der private Schlüssel einer Adresse bekannt sein. Dabei werden alle auf der Adresse gespeicherten Dash an eine neue Adresse gesendet, die deterministisch aus dem Wallet-Seed generiert wurde. Die privaten Schlüssel, mit denen du die Dash transferierst, werden nicht Teil deiner Wallet.
es: Arrastrar una billetera de papel es un método para transferir el valor almacenado en una dirección que hayas recibido como billetera de papel o de un cajero automático a tu propia billetera. Debes tener acceso a la llave privada para que una dirección use esta función. En este proceso, todos los Dash almacenados en la dirección se enviarán a una nueva dirección que se ha generado determinísticamente a partir de tu semilla de billetera. Las llaves privadas que arrastras no se vuelven parte de tu billetera.
ru: Перенос бумажного кошелька это метод переноса средств, хранимых на адресе, которые вы могли получить в качестве бумажного кошелька или из криптомата на ваш кошелёк. Для использования этой функции у вас должен быть приватный ключ к адресу. В рассматриваемом случае, все Dash, хранящиеся на этом адресе будут отправлены на новый адрес, который определённым образом создан из сида вашего кошелька. Приватные ключи, которые вы переносите не становятся частью вашего кошелька.

source: To sweep a paper wallet, tap the **Menu button** and select **Sweep paper wallet**. Tap the **Scan** button and scan the QR code from your paper wallet. Once the private key has been identified, tap **Sweep** to create the transaction moving the Dash into your own wallet. Once this transaction is confirmed, the paper is worthless and should be destroyed.
ar: لاكتساح محفظة ورق ، انقر فوق زر القائمة وحدد **مسح محفظة الورق**. اضغط على زر **المسح الضوئي** ومسح رمز الاستجابة السريعة من محفظتك الورقية. بمجرد التعرف على المفتاح الخاص ، انقر فوق **إحتياج** لإنشاء المعاملة لتحريك داش إلى المحفظة الخاصة بك. وبمجرد تأكيد هذه المعاملة ، فإن الورق لا قيمة له ويجب تدميره.
de: Um die Paper Wallet zu entleeren, wähle über das **Menü Symbol** die Option **Paper-Wallet leeren** aus. Mit Hilfe des **Scan** Symbols kannst du den QR-Code der Paper Wallet einscannen. Sobald der PrivateKey identifiziert wurde, kannst du über **Entleeren** eine Transaktion durchführen, welche die Dash in deine Wallet überträgt. Nach der Transaktion ist das Papier wertlos und kann zerstört werden.
es: Para arrastrar una billetera de papel, presiona el **Botón de menú** y selecciona **Arrastrar Billetera de papel**. Presiona el botón **Escanear** y escanea el código QR de tu billetera de papel. Una vez que se haya identificado la llave privada, presiona **Arrastrar** para crear la transacción moviendo los Dash hacia tu billetera. Una vez que se confirma esta transacción, el papel no tiene valor y debe ser destruido.
ru: Для переноса бумажного кошелька нажмите **Кнопку Меню** и выберите **Перенести бумажный кошелёк**. Нажмите **Отсканировать** и отсканируйте QR-код из вашего бумажного кошелька. Как только приватный ключ будет определён, то нажмите **Перенести** для создания транзакции по переносу Dash в ваш кошелёк. Как только транзакция будет подтверждена, то бумажный кошелёк потеряет свою ценность и его следует уничтожить.

source: *Sweeping a paper wallet with 0.10 DASH into the Android Wallet*
ar: *تجتاح محفظة ورقية مع 0.10 داس في محفظة الأندرويد*
de: **Paper Wallet mit 0.10 Dash entleeren und an die Android Wallet übertragen**
es: *Arrastrar una billetera de papel con 0.10 DASH en la billetera Android*
ru: *Перенос бумажного кошелька с 0,10 DASH в кошелёк Android*

source: Network monitor
ar: مراقبة الشبكة
de: Netzwerk-Monitor
es: Monitor de red
ru: Сетевой монитор

source: The Dash Android Wallet is a light wallet and functions in SPV mode, meaning it does not download a full copy of the blockchain. The network monitor allows you to view details about the full nodes to which you are connected. You can also swipe left to view blocks as they are created on the blockchain.
ar: محفظة داش في الأندرويد هي محفظة خفيفة ووظائف في وضع SPV ، مما يعني أنها لا تقوم بتنزيل نسخة كاملة من بلوكشين. تسمح لك مراقبة الشبكة بعرض تفاصيل حول العقد الكاملة التي تتصل بها. يمكنك أيضًا التمرير سريعًا لليسار لعرض الكتل عند إنشائها على البلوكشين
de: Die Dash Android Wallet ist eine Light Wallet, die im SPV-Modus läuft und daher keine vollständige Kopie der Blockchain herunterladen muss. Der Netzwerk-Monitor erlaubt es dir, Details zu den verbundenen Full Nodes aufzurufen. Du kannst außerdem nach links wischen, um die letzten Blöcke der Blockchain zu betrachten.
es: La billetera de Dash para Android es una billetera liviana y funciona en modo SPV, lo que significa que no descarga una copia completa de la cadena de bloques. El monitor de red te permite ver detalles sobre los nodos completos a los que está conectado. También puedes deslizar hacia la izquierda para ver los bloques a medida que se crean en la cadena de bloques.
ru: Кошелёк Dash для Android это лёгкий кошелёк, который работает в режиме SPV. Это означает, что необходимость выкачивать полную копию блокчейна отсутствует. Сетевой монитор позволяет видеть детальную информацию по полным нодам, к которым вы подключены. Вы можете перелистать экран налево, чтобы видеть как создаются блоки в сети.

source: *Viewing peers and blocks to monitor network activity*
ar: *عرض الأقران والكتل لرصد نشاط الشبكة*
de: **Peers und Blöcke ansehen, um Netzwerk-Aktivitäten zu überwachen**
es: *Visualización de pares y bloques para monitorear la actividad de la red*
ru: *Просмотр пиров и блоков для слежения за сетевой активностью*

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuraciones
ru: Настройки

source: *The Settings menu in Dash Android Wallet*
ar: *قائمة الإعدادات في محفظة داش الأندرويد*
de: *Das Einstellungsmenü der Dash Android Wallet*
es: *El menú de Configuración en la billetera de Dash para Android*
ru: *Меню настроек в кошельке Dash для Android*

source: The settings menu contains a range of options to control the behavior of the Dash Android Wallet. To access the settings, tap the **Menu button**, then **Settings**. You can then choose between **Settings**, **Diagnostics** and **About**, which displays wallet version, copyright, license and source code information.
ar: تحتوي قائمة الإعدادات على مجموعة من الخيارات للتحكم في سلوك محفظة داش الأندرويد. للوصول إلى الإعدادات ، اضغط على **زر القائمة** ، ثم **الإعدادات**. يمكنك بعد ذلك الاختيار بين إعدادات و **التشخيص** و **عن** ، والتي تعرض إصدار المحفظة وحقوق النشر والرخصة ومعلومات شفرة المصدر.
de: Das Einstellungsmenü beinhaltet eine große Zahl an Optionen, die das Verhalten der Dash Android Wallet beeinflussen. Um auf die Einstellungen zuzugreifen, wähle über das **Menü Symbol** den Punkt **Einstellungen** aus. Du kannst **Einstellungen**, **Diagnose** und **Über** auswählen. Der letzte Punkt zeigt die Wallet Version, das Copyright, die Lizenz und die Quellcode-Informationen an.
es: El menú de configuración contiene una variedad de opciones para controlar el comportamiento de la billetera de Dash para Android. Para acceder a la configuración, presiona el **botón de Menú**, luego **Configuración**. A continuación, puedes elegir entre **Configuración**, **Diagnóstico** y **Acerca de**, que muestra la versión de la billetera, el derecho de autor, la licencia y la información del código fuente.
ru: Меню настроек содержит в себе большой круг настроек для управления работой кошелька Dash для Android. Для доступа к настройкам, нажмите **Кнопку Меню**, далее **Настройки**. Вы можете перемещаться между окнами **Настройка**, **Диагностика** и **О программе**, где найдёте сведения о версии кошелька, правах на интеллектуальную собственность и информацию об исходном коде.

source: Denomination and precision
ar: المذهب والدقة
de: Stückelung und Genauigkeit
es: Denominación y precisión
ru: Деноминация и точность

source: Select the number of decimal places to show for DASH denominations, or switch to mDASH or µDASH denominations
ar: حدد عدد المنازل العشرية التي تريد إظهارها لفئات داش أو قم بالتبديل إلى فئات mDASH أو µDASH
de: Wähle die Zahl der Dezimalstellen für die Dash-Denominierung aus oder wechsle zu den Denominationen mDASH or µDASH.
es: Selecciona la cantidad de decimales que se mostrarán para las denominaciones de DASH, o cambia a las denominaciones mDASH o μDASH
ru: Выберите число десятичных знаков, которые будут показываться для деноминаций DASH или переключитесь в режим показа mDASH или µDASH деноминаций

source: Own name
ar: إسمنا
de: Eigener Name
es: Nombre propio
ru: Собственное имя

source: Enter a short name to be included in your QR codes when displaying to other users for scanning. The short name will then appear as a label in their wallet to verify the recipient and simplify address management.
ar: أدخل اسمًا قصيرًا لإدراجه في رموز QR عند عرضه على المستخدمين الآخرين لإجراء المسح الضوئي. سيظهر الاسم القصير كتصنيف في محفظتهم للتحقق من المستلم وتبسيط إدارة العناوين.
de: Gib einen kurzen Namen an, der in deine QR-Codes übernommen werden soll, wenn andere diese zum Zahlen einscannen. Der kurze Name wird in ihrer Wallet angezeigt werden, um einfacheres Adress-Management zu ermöglichen.
es: Ingresa un nombre corto que se incluirá en tus códigos QR cuando se muestre a otros usuarios para escanear. El nombre corto aparecerá como una etiqueta en su billetera para verificar el destinatario y simplificar el manejo de la dirección.
ru: Введите короткое имя, которое будет включаться в ваши QR-коды, когда они показываются другим пользователям для сканирования. Короткое имя будет показано как метка в их кошельке, это делается для быстрого определения получателя и упрощения работы с адресами.

source: Auto-close send coins dialog
ar: قم بإغلاق مربع حوار العملات بإغلاق تلقائي
de: Coin-Versandformular automatisch schließen
es: Diálogo de cierre automático para enviar monedas
ru: Автозакрытие диалога отправки монет

source: Specify whether or not to close the send dialog once a payment is complete.
ar: حدد ما إذا كنت تريد إغلاق مربع الحوار إرسال بمجرد اكتمال الدفع.
de: Gib an, ob der Sende-Dialog geschlossen werden soll, nachdem eine Zahlung durchgeführt wurde.
es: Especifica si se debe cerrar o no el diálogo de envío una vez que se completa un pago.
ru: Укажите, закрывать или не закрывать диалог после завершения платежа.

source: Connectivity indicator
ar: مؤشر الاتصال
de: Konnektivitäts-Anzeige
es: Indicador de conectividad
ru: Индикатор соединения

source: Enables display of an indicator in the Android notification area to be able to quickly verify connectivity.
ar: لتمكين عرض مؤشر في منطقة إشعار الأندرويد حتى تتمكن من التحقق من الاتصال بسرعة.
de: Zeigt ein Symbol in der Android-Benachrichtigungsleiste an, durch das die Verbindung verifiziert werden kann.
es: Permite visualizar un indicador en el área de notificación de Android para poder verificar rápidamente la conectividad.
ru: Включает показ индикатора в области оповещений Andoid для быстрого определения наличия соединения

source: Trusted peer
ar: نظير موثوق
de: Vertrauenswürdiger Peer
es: Par de confianza
ru: Доверенный пир

source: Enter the IP address or hostname of a single peer to connect to.
ar: أدخل عنوان IP أو اسم المضيف لنظير واحد للاتصال به.
de: Gib die IP-Adresse oder den Hostnamen eines einzelnen Peer, zu dem die Verbindung hergestellt werden soll, an.
es: Ingresa la dirección IP o el nombre de host de un solo par para conectarte.
ru: Введите IP-адрес или имя хоста одиночного пира для присоединения.

source: Skip regular peer discovery
ar: تخطي الاكتشاف الأقران العادية
de: Reguläre Peers übergehen
es: Omitir el descubrimiento regular de pares
ru: Пропустить поиск обычного пира

source: Enabling this option prevents automatic peer discovery and forces connection to the one specified trusted peer only.
ar: يؤدي تمكين هذا الخيار إلى منع اكتشاف النظير التلقائي وفرض الاتصال بالنظير الموثوق الوحيد المحدد فقط.
de: Die Aktivierung dieser Option verhindert das automatische entdecken eines Peers und erzwingt die Verbindung zu dem angegebenen vertrauenswürdigen Peer.
es: Al habilitar esta opción, se impide el descubrimiento automático de pares y se fuerza la conexión con el único par de confianza especificado.
ru: Включает опцию предотвращения автоматического поиска пира и принудительно включает присоединение к определённому доверенному пиру.

source: Block explorer
ar: مستكشف الكتلة
es: Bloquear explorador
ru: Обозреватель блоков
