Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/android/advanced-functions.po
Languages: ar, de, es, ru

source: Allows you to select which block explorer you want to use for functions linking to a block explorer.
ar: يسمح لك بتحديد مستكشف الكتل الذي تريد استخدامه للوظائف التي تربط إلى مستكشف كتلة.
de: Diese Funktion erlaubt dir, den Blockexplorer zu wählen, auf den Funktionen zugreifen, die zu einem Blockexplorer verlinken.
es: Te permite seleccionar qué explorador de bloques deseas usar para las funciones que enlazan con un explorador de bloques.
ru: Позволяет выбрать обозреватель блоков, который вы хотели бы использовать для функций привязанных к обозревателю блоков.

source: Data usage
ar: استخدام البيانات
de: Datenverbrauch
es: Uso de datos
ru: Использование данных

source: Links to the Android **Data usage** function to view and/or restrict data usage for the app.
ar: الروابط إلى وظيفة الأندرويد **إستخدام البيانات** لعرض و / أو تقييد استخدام البيانات للتطبيق.
de: Verlinkt zur Android-Funktion **Datenverbrauch**, um die Daten, die von der App verwendet werden, einzusehen und zu beschränken.
es: Enlaces a la función de Android **Uso de datos** para ver y/o restringir el uso de datos para la aplicación.
ru: Соединяет с функцией Android **Использование данных** для просмотра и/или ограничения таффика, используемого приложением.

source: Balance reminder
ar: تذكير الرصيد
de: An Guthaben erinnern
es: Recordatorio de saldo
ru: Оповещение о балансе

source: Enables an Android system notification to remind you of any unspent Dash if you don't open the app in that time.
ar: لتمكين إشعار نظام الأندرويد لتذكيرك بأي شرطة غير منفقة إذا لم تفتح التطبيق في ذلك الوقت.
de: Aktiviert eine Android-Systemnachricht, die angezeigt wird, wenn du noch über ungenutzte Dash verfügst und du die App schon länger nicht geöffnet hast.
es: Permite que una notificación del sistema Android te recuerde cualquier Dash que no ha sido gastado si no abres la aplicación en ese momento.
ru: Включает системные оповещения Android для напоминаний о наличии непотраченных Dash, если вы не открываете приложение.

source: Enable InstantSend
ar: الإرسال الفوري متاح
es: Habilitar InstantSend
ru: Включить InstantSend

source: Enables functionality to use InstantSend to send and receive Dash.
ar: لتمكين وظيفة لاستخدام الإرسال الفوري لإرسال واستقبال داش
de: Ermöglicht Funktionen die Verwendung von InstantSend, um Dash zu senden und zu empfangen.
es: Habilita la funcionalidad para usar InstantSend para enviar y recibir Dash.
ru: Включает функционал, позволяющий использовать InstantSend для отправки и получения Dash.

source: Enable Lite Mode
ar: الوضع العادي متاح
es: Habilitar modo ligero
ru: Включить облегчённый режим

source: Enabling lite mode reduces bandwidth usage.
ar: يعمل تمكين الوضع البسيط على تقليل استخدام النطاق الترددي.
de: Aktiviert den Lite-Modus, um Bandbreite zu sparen.
es: Al habilitar el modo ligero se reduce el uso del ancho de banda.
ru: Включает режим, уменьшающий нагрузку на интернет-соединение.

source: Show disclaimer
ar: عرض إخلاء المسؤولية
es: Mostrar descargo de responsabilidad
ru: Показать документ об отказе от ответсвенности

source: Enables or disables various disclaimers and warning messages in the app.
ar: تمكن أو تعطيل مختلف إخلاء المسئولية ورسائل التحذير في التطبيق.
de: Aktiviert oder deaktiviert verschiedene Disclaimer und Warnhinweise in der App.
es: Habilita o deshabilita varios descargos de responsabilidad y mensajes de advertencia en la aplicación.
ru: Включает или выключает показ различных юридических документов и предупреждающих сообщений в приложении.

source: BIP70 for scan-to-pay
ar: BIP70 للمسح الضوئي
es: BIP70 para escanear-para-pagar
ru: BIP70 для сканирования с целью оплаты

source: Enables use of the `BIP70 payment protocol <https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki>`_ to add further verification and security features when scanning QR codes.
ar: `BIP70 payment protocol <https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki>`_ متاح و لإضافة المزيد من ميزات التحقق والأمان عند مسح رموز QR.
de: Aktiviert die Verwendung des `BIP70 Zahlungsprotokoll <https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki>`_, um weitere Verifizierungs- und Sicherheitsfunktionen beim Scannen eines QR-Codes einzuschalten.
es: Habilita el uso del `Protocolo de pago BIP70 <https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki>`_ para agregar más funciones de verificación y seguridad al escanear códigos QR.
ru: Включает использование `протокола платежей BIP70 <https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki>`_ с целью дополнительной верификации и дополнительных функций безопасности при сканировании QR-кодов.

source: Look up wallet names
ar: أنظر فوق لرؤية إسم المحفظة
es: Buscar nombres de billetera
ru: Поиск по названиям кошельков

source: Enables use of `DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_Syst em_Security_Extensions>`_ to attempt to identify a wallet name when creating transactions.
ar: `DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_Syst em_Security_Extensions>`_ متاح و محاولة تحديد اسم محفظة عند إنشاء المعاملات.
de: Aktiviert die Verwendung von `DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_Syst em_Security_Extensions>`_, um beim Erstellen einer Transaktion die Identifikation des Wallet-Namens zu versuchen.
es: Habilita el uso de `DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_Syst em_Security_Extensions>`_ para intentar identificar un nombre de billetera al crear transacciones.
ru: Включение использования `DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_Syst em_Security_Extensions>`_ для попытки определения названия кошелька при создании транзакций.

source: Diagnostics
ar: التشخيص
de: Diagnose
es: Diagnósticos
ru: Диагностика

source: Report issue
ar: إبلاغ عن مشكل
de: Problem melden
es: Reportar problema
ru: Сообщить об ошибке

source: Allows you to gather a range of information related to your wallet in order to send a bug report to developers for troubleshooting.
ar: يسمح لك بجمع مجموعة من المعلومات المتعلقة بمحفظتك من أجل إرسال تقرير خطأ للمطورين لاستكشاف الأخطاء وإصلاحها.
de: Erlaubt dir, eine Reihe von Informationen, die zu deiner Wallet gehören, zu sammeln und als Bug-Report an die Entwickler zu schicken.
es: Te permite recopilar una variedad de información relacionada con tu billetera para enviar un informe de errores a los desarrolladores para la resolución de problemas.
ru: Позволяет собирать определённую информацию касаемо вашего кошелька для отправки отчётов об ошибках разработчикам с целью их исправления.

source: Show xpub
ar: عرض xpub
de: Xpub anzeigen
es: Mostrar xpub
ru: Показать xpub

source: Displays the extended public key for the seed used to generate addresses in your wallet. Providing your xpub to a third party will allow them to view your entire transaction history, but not make new transactions.
ar: يعرض المفتاح العام الموسع للبذرة المستخدمة لإنشاء عناوين في محفظتك. سيتيح لك توفير xpub لطرف ثالث إمكانية عرض سجل المعاملات بالكامل ، دون إجراء معاملات جديدة.
de: Zeigt den erweiterten Public Key des Seeds an, der genutzt wird, um Wallet-Adressen zu erzeugen. Das Senden des Xpub an einen Drittanbieter, erlaubt es diesem, alle Transaktionen und Adressen anzusehen, ohne, dass diese auf die Guthaben zugreifen könnten.
es: Muestra la llave pública extendida para la semilla utilizada para generar direcciones en tu billetera. Proporcionar tu xpub a un tercero les permitirá ver todo tu historial de transacciones, pero no realizar nuevas transacciones.
ru: Показывает расширенный публичный ключ для сида, используемого при создании адресов в вашем кошельке. Передача вашего xpub третьим лицам позволит им видеть вашу историю транзакций, без права создавать новые транзакции.

source: Reset block chain
ar: إعادة تعيين سلسلة كتلة
de: Blockchain zurücksetzen
es: Restablecer la cadena de bloques
ru: Пересканировать блокчейн

source: Resets data stored on your device relating to the blockchain. This data will need to be collected again from full nodes, similar to when setting up a new wallet. This process may take some time.
ar: إعادة ضبط البيانات المخزنة على جهازك والمتعلقة بالكتلة. ستحتاج هذه البيانات إلى جمعها مرة أخرى من العقد الكاملة ، على نحو مشابه عند إعداد محفظة جديدة. هذه العملية قد تستغرق بعض الوقت.
de: Setzt die Daten zurück, welche auf dem Gerät in Bezug auf die Blockchain gespeichert wurden. Die Daten werden erneut von den verbundenen Full Nodes bezogen, wie beim Neuaufsetzen einer Wallet. Dieser Vorgang kann einige Zeit in Anspruch nehmen.
es: Restablece los datos almacenados en tu dispositivo relacionados con la cadena de bloques. Esta información deberá recopilarse nuevamente a partir de nodos completos, similar a la configuración de una nueva billetera. Este proceso puede llevar un tiempo.
ru: Сбрасывает данные о блокчейне на вашем устройстве. Эти данные необходимо будет снова собрать из полных нод, этот процесс похож на настройку нового кошелька. Он занимает некоторое время.
