Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ar, de, fr, ko, vi, zh_cn

source: New features or versions of Dash undergo extensive testing on testnet before they are released to the main network. When a new feature or version of Dash is released on mainnet, communication is sent out to users informing them of the change and the need for them to update their clients. Those who update their clients run the new code, but it is not activated until a sufficient percentage of network participants (usually 80%) reach consensus on running it. In the event of errors occurring with the new code, the client’s blocks are not rejected by the network and unintended forks are avoided. Data about the error can then be collected and forwarded to the development team. Once the development team is satisfied with the new code’s stability in the mainnet environment – and once acceptable network consensus is attained – enforcement of the updated code can be activated remotely by multiple members of the core development team signing a network message together with their respective private keys. Should problems arise, the code can be deactivated in the same manner, without the need for a network-wide rollback or client update. For technical details on individual sporks, see :ref:`here <understanding-sporks>`.
ar: تخضع الميزات الجديدة أو إصدارات داش لاختبارات مكثفة على تيست نت قبل إصدارها إلى الشبكة الرئيسية. عند إصدار ميزة جديدة أو إصدار جديد من داش ، يتم إرسال الاتصالات إلى المستخدمين لإعلامهم بالتغيير والحاجة إلى تحديث عملائهم. يقوم أولئك الذين يقومون بتحديث عملائهم بتشغيل التعليمات البرمجية الجديدة ، ولكن لم يتم تفعيلها حتى تصل نسبة كافية من المشاركين في الشبكة (80٪ عادةً) إلى توافق حول تشغيلها. في حالة حدوث أخطاء بالشفرة الجديدة ، لا يتم منع كتل العميل من قبل الشبكة ويتم تجنب الشوك غير المقصودة. يمكن بعد ذلك جمع البيانات حول الخطأ وإعادة توجيهها إلى فريق التطوير. بمجرد أن يشعر فريق التطوير بالرضا عن استقرار الشفرة الجديدة في بيئة الشبكة الرئيسية - وحالما يتم التوصل إلى توافق في الآراء مقبول على الشبكة - يمكن تفعيل تطبيق الشفرة المحدثة عن بعد بواسطة أعضاء متعددين من فريق التطوير الأساسي يوقعون رسالة شبكة مع بعضهم البعض. مفاتيح. في حالة حدوث مشكلات ، يمكن إلغاء تنشيط التعليمة البرمجية بنفس الطريقة ، دون الحاجة إلى التراجع عن تحديث الشبكة أو تحديث العميل. للحصول على التفاصيل الفنية الفردية ، انظر :ref:`هنا <understanding-sporks>`.
de: Neue Funktionen oder Versionen von Dash werden zunächst eingehend über das Testnet getestet, bevor sie für das Hauptnetzwerk veröffentlicht werden. Sobald eine neue Funktion oder Version veröffentlicht wurde, werden die Nutzer über die Änderungen benachrichtigt und darum gebeten, ihre Version zu aktualisieren. Nutzer, die die aktuelle Version installiert haben verwenden bereits den neuen Code, doch dessen Neuerungen werden erst dann aktiv, wenn ein großer Teil (meistens 80%) des Netzwerks seinen Konsens zu der neuen Version gegeben hat. Sollte es zu Fehlern mit dem neuen Code kommen, werden die Blöcke der Clients nicht vom Netzwerk zurückgewiesen, wodurch ungewollte Forks vermieden werden. Daten über die Fehler werden gesammelt und an die Entwickler übermittelt. Sobald das Entwicklerteam mit der Stabilität des Codes in der Hauptnetzwerksumgebung zufrieden ist – und der nötige Konsens erreicht wurde – wird der Code vollständig aktiviert, indem mehrere der Core-Entwickler eine Nachricht an das Netzwerk mit den dafür vorgesehenen Private Keys signieren. Sollte es zu Problemen kommen, dann kann der Code auf die gleiche Art und Weise wieder deaktiviert werden, ohne, dass das Netzwerk zurückgesetzt oder ein Client geupdated werden müsste. Technische Details zu den einzelnen Sporks finden sich an :ref:`dieser<understanding-sporks>` Stelle.
fr: Les nouvelles fonctionnalités ou versions de Dash subissent de nombreux essais sur le réseau de test, avant d'être diffusées sur le réseau principal. Quand une nouvelle fonctionnalité ou version est diffusée sur le réseau principal, les utilisateurs sont informés du changement et de la nécessité de mettre à jour leurs logiciels clients. Ceux qui mettent à jour leurs clients font tourner le nouveau code, mais il n'est pas activé avant qu'un pourcentage suffisant des participants au réseau (en général 80%) ne forment un consensus pour le faire tourner. Dans le cas d'erreurs se manifestant dans le nouveau code, les blocs des clients ne sont pas rejetés par le réseau, et ainsi des “forks" non souhaités sont évités. Les données sur les erreurs peuvent alors être récupérées et transmises à l'équipe de développement. Une fois que l'équipe est satisfaite de la stabilité du nouveau code dans le réseau principal — et que le consensus acceptable est atteint dans le réseau —, l'activation du code mis à jour se fait à distance par plusieurs membres de l'équipe de développement, qui signent un message réseau ensemble, avec leurs clés privées respectives. Si des problèmes apparaissent, le code peut être désactivé de la même façon, sans nécessité d'un retour en arrière de l'ensemble du réseau, ni d'une mise à jour du client. Pour plus de détails techniques sur les sporks individuels, voir :ref:`ici <understanding-sporks>`.
ko: 대시의 새로운 기능 혹은 버전은 메인 네트워크에 선보이기 전에 테스트넷에서 매우 긴 테스트를 통과합니다. 이 대시의 새로운 기능 혹은 버전이 메인넷에 출시되면, 사용자에게 이와 같은 변경을 알리고 클라이언트를 업데이트하라는 정보성 메시지가 전달됩니다. 그러나 클라이어트를 업데이트하고 새로운 코드를 작동시킨다고 하더라도 네트워크 참여자들이 이 업데이트에 관한 컨센서스에 도달하기 전까지(일반적으로 80%) 이 새로운 버전은 작동하지 않습니다. 새로운 코드와 관련하여 에러가 발생하는 경우 클라이언트의 블록은 네트워크에 의해 거부되지 않으며 의도적이지 않은 포크는 차단됩니다. 이후 에러에 관한 데이터가 수집되어 개발 팀에 전달됩니다. 개발 팀이 메인넷 상에서 새로운 코드의 안정성을 승인하고 네트워크가 컨센서스에 도달하면, 업데이트된 코드의 집행이 코어 개발 팀 내 다수의 멤버들이 각자의 프라이빗 키로 네트워크 메시지에 서명함으로써 원격으로 활성화됩니다. 만일 문제가 발생하는 경우, 네트워크 전체가 회귀하거나 클라이언트를 업데이트할 필요 없이 같은 방식으로 코드가 비활성화될 수 있습니다. 각각의 스포크에 대한 기술적인 세부 사항은 :ref:`이곳 <understanding-sporks>`\ 에서 확인하십시오.
vi: Các tính năng hoặc các phiên bản mới của Dash đang được kiểm tra một cách kỹ lưỡng trên mạng testnet trước khi công bố lên mạng chính thức. Khi một chức năng hoặc một phiên bản của Dash được công bố trên mạng chính thức, thông tin được gửi cho người dùng để nhắc họ về những thay đổi và cho họ nâng cấp phần mềm của mình. Những ai nâng cấp phần mềm sẽ chạy mã mới, nhưng nó chưa được kích hoạt đến tận khi có đủ một lượng phần trăm nhất định (thường khoảng 80%) thì mới đạt được sự đồng thuận về việc chạy đó. Trong trường hợp khi có lỗi xảy ra đối với bản mã mới, những khối của phần mềm mới không bị từ chối bởi mạng lưới và tránh được việc phân nhánh không mong muốn. Dữ liệu về lỗi sau đó có thể được thu thập và chuyển tiếp đến nhóm phát triển. Khi nhóm phát triển hài lòng với sự ổn định của mã mới trong môi trường mạng chính - và một khi sự đồng thuận của mạng đã đạt được - việc thực thi mã cập nhật có thể được kích hoạt từ xa bởi nhiều thành viên của Core Team cùng ký vào một thông điệp với các khoá riêng của họ. Nếu có vấn đề phát sinh, mã có thể bị vô hiệu hóa theo cách tương tự, mà không cần cập nhật toàn bộ hoặc cập nhật phần mềm. Để có thông tin kỹ thuật cụ thể về các spork riêng, hãy xem :ref:`ở đây <understanding-sporks>`.
zh_cn: 达世币的新功能或新版本在发布到主网前，都会在测试网上经受大量的测试。当达世币的新功能或新版本在主网发布时，信息会发给用户，将相应的变化和向客户更新的要求通知到他们。那些已经更新了客户端的用户会运行新的代码，但不会激活，直到有足够比例的网络参与者（一般是80%）达成运行共识。如果新的代码有错误，客户端区块不会被网络拒绝，所以意外的分叉可以被避免。有关错误的数据也会被收集起来发送给开发团队。一旦开发团队对新代码在主网环境下的稳定性表示满意，并且达成同意接受的网络共识，通过核心开发团队多数成员使用各自的私人密钥进行数字签名，更新代码的实施便可被远程激活。如果有问题发生，可以用同样的方式让代码失效，而不需要整个网络的回滚或客户端更新。关于单个叉勺的技术细节，详见\ :ref:`这里 <understanding-sporks>`\ 。

source: X11 Hash Algorithm
ar: خوارزمية X11
de: X11 Hash Algorithmus
fr: Algorithme de hachage X11
ko: X11 해시 알고리즘(X11 Hash Algorithm)
vi: Thuật toán băm X11
zh_cn: X11算法

source: X11 is a widely used hashing algorithm created by Dash core developer Evan Duffield. X11’s chained hashing algorithm utilizes a sequence of eleven scientific hashing algorithms for the proof-of-work. This is so that the processing distribution is fair and coins will be distributed in much the same way Bitcoin’s were originally. X11 was intended to make ASICs much more difficult to create, thus giving the currency plenty of time to develop before mining centralization became a threat. This approach was largely successful; as of early 2016, ASICs for X11 now exist and comprise a significant portion of the network hashrate, but have not resulted in the level of centralization present in Bitcoin. Information on mining with X11 can be found in the :ref:`Mining <mining>` section of this documentation.
ar: X11 هو خوارزمية التجزئة المستخدمة على نطاق واسع التي تم إنشاؤها بواسطة المطور الأساسي داش ايفان دوفيلد. تستخدم خوارزمية هاشم X11 المتسلسلة سلسلة من 11 خوارزمية تجزئة علمية لإثبات العمل. هذا بحيث يكون توزيع المعالجة عادًا وسيتم توزيع العملات بنفس الطريقة التي كانت فيها البيتكوين أصلاً. كان الهدف من X11 هو جعل ASIC أكثر صعوبة في الإنشاء ، وبالتالي منح العملة الكثير من الوقت لتطويره قبل أن تصبح مركزية التعدين تهديدًا. كان هذا النهج ناجحًا إلى حد كبير. بدءًا من مطلع عام 2016 ، أصبحت ASICs for X11 موجودة الآن وتشكل جزءًا كبيرًا من التجزئة الشبكية ، ولكنها لم تسفر عن مستوى المركزية الموجودة في البيتكوين. يمكن العثور على معلومات عن التعدين مع X11 في :ref:`التعدين <mining>` قسم من هذه الوثائق.
de: X11 ist ein weitverbreiteter Hash-Algorithmus, der vom Dash-Entwickler Evan Duffield entwickelt wurde. X11s verketteter Hash-Algorithmus verwendet eine Abfolge von 11 verschiedenen Algorithmen für den Proof-of-Work. Dies soll dafür sorgen, dass der Verteilungsprozess fair ist und Coins so ausgeschüttet werden, wie diese bei Bitcoin ursprünglich der Fall war. X11 wurde mit der Intention geschaffen, dass ASIC-Mining erschwert werden sollte, damit die Währung sich zunächst unabhängig entwickeln konnte, damit Zentralisierung nicht zu einem Problem würde. Dieser Ansatz war zum größten Teil erfolgreich; seit Anfang 2016 gibt es ASICs, welche für den größten Teil der Hashrate verantwortlich sind, doch es gibt nicht das gleiche Niveau an Zentralisierung, wie dies bei Bitcoin der Fall ist. Informationen über X11 können im Abschnitt :ref:`Mining <mining>` dieser Dokumentation gefunden werden.
fr: X11 est un algorithme de hachage largement utilisé, créé par Evan Duffield, développeur Dash Core. L'algorithme de hachage en chaîne de X11 utilise une série d'onze fonctions mathématiques de hachage pour la preuve de travail, dans le but que le processus de distribution soit équitable et que les unités soient distribuées à peu près de la même façon que celles de Bitcoin à l'origine. X11 a été conçu de façon à rendre plus difficile la création d'ASICs, et donc à donner à la monnaie plus de temps pour se développer avant que la centralisation du minage ne devienne une menace. Cette approche a été largement couronnée de succès ; depuis début 2016, des ASICs pour X11 existent et représentent une part significative du taux de hachage du réseau, mais n'ont pas entraîné un niveau de centralisation comparable à celui de Bitcoin. Plus d'informations sur le minage X11 sont consultables dans la section :ref:`Minage <mining>` de la présente documentation.
ko: X11은 대시 코어 개발자인 에반 듀필드에 의해 만들어졌으며 널리 사용되는 해싱 알고리즘입니다. X11의 체인 해싱 알고리즘은 작업 증명을 위한 11개의 과학적 해싱 알고리즘 시퀀스를 활용합니다. 이로써 분배 과정을 공정하게 처리하고 코인은 비트코인의 초기 방식에 보다 가깝게 분배됩니다. X11은 대시용 ASIC을 만들기 어렵도록 설계되었으며, 이로써 중앙화된 채굴 방식이 위협적으로 변화할 때까지 개발에 충분한 시간을 제공할 수 있습니다. 이 접근 방식은 크게 성공적이었습니다. 2016년 초 현재 X11용 ASIC이 존재하며 네트워크 해시 레이트의 상당수를 차지하지만 비트코인에 나타나는 바와 같은 수준의 중앙화는 진행되지 않고 있습니다. X11 채굴에 관한 정보는 이 문서의 `채굴 <mining>`_ 항목에서 확인하실 수 있습니다.
vi: X11 là một thuật toán băm được sử dụng rộng rãi, nó được tạo ra bởi người phát triển ra Dash tên là Evan Duffield. Chuỗi các thuật toán băm của X11 sử dụng một chuỗi 11 thuật toán băm để xử lý vấn đề proof-of-work. Nó cũng giúp cho việc phân phối coin một cách công bằng và các coin của Dash cũng được phân phối theo cách giống như với Bitcoin. X11 được tạo ra sao cho việc tạo khó khăn hơn trong việc tạo ra chip ASIC, và như vậy nó cho phép coin có nhiều thời gian hơn để phát triển trước khi bị đe doạ bởi sự tập trung hoá của việc đào coin. Cách tiếp cận này cũng khá thành công; và đầu năm 2016 thì chip ASIC dành cho X11 được ra mắt và nó chiếm một phần khá lớn trong tổng năng lực băm của mạng lưới, nhưng điều đó vẫn không làm cho nó bị một mức độ tập trung như Bitcoin hiện nay. Thông tin về việc đào coin với X11 có thể tìm thấy ở phần :ref:`Đào coin <mining>` trong tài liệu này.
zh_cn: X11算法是由Dash Core创始人Evan Duffield创建并被广泛应用的算法。X11的链式算法利用了11个科学散列算法序列用于工作量证明。这是为了让分配的过程更加公平，使币的分布能像比特币最开始设想的那样。X11的初衷是想使集成电路矿机做起来比较难，这样就可以在挖矿集权成为入驻前，给货币以足够的时间去发展。这个方法在很大程度上是成功的。从2016年初开始，针对于X11算法的ASIC矿机现在已经出现并占据了很大部分的网络算力，但是并没有造成像比特币那种程度的集权。关于针对X11算法挖矿的信息可以在\ :ref:`挖矿 <mining>`\ 专区中找到。

source: X11 is the name of the chained proof-of-work (**PoW**) algorithm that was introduced in Dash (launched January 2014 as "Xcoin"). It was partially inspired by the chained-hashing approach of Quark, adding further "depth" and complexity by increasing the number of hashes, yet it differs from Quark in that the rounds of hashes are determined *a priori* instead of having some hashes being randomly picked.
ar: X11 هو اسم خوارزمية إثبات العمل (**PoW**) المتسلسلة التي تم إدخالها في داش (تم إطلاقه في يناير 2014 باسم "Xcoin"). تم استلهامها جزئياً من مقاربة التجزئة الخاصة بالكوارك ، وإضافة مزيد من "العمق" والتعقيد عن طريق زيادة عدد التجزئات ، ومع ذلك تختلف عن الكوارك في أن يتم تحديد جولات التجزؤ *بداهة* بدلاً من وجود بعض عمليات التجزؤ اختار عشوائيا.
de: X11 ist der Name des verketteten Proof-of-Work (**PoW**) Algorithmus, der für Dash (welches im Januar 2014 als „Xcoin“ das Licht der Welt erblickte) geschaffen wurde. X11 wurde zum Teil vom verketteten Hashing-Ansatz Quark inspiriert, was die Komplexität erhöht, da es eine erweiterte Zahl an Hashes ermöglicht. Der Algorithmus unterscheidet sich jedoch von Quark, da die Zahl der Hash-Runden *a priori* vorherbestimmt ist und keine Hashes zufällig gewählt werden.
fr: X11 est le nom de l'algorithme chaîné de preuve de travail (PoW) créé avec Dash (lancé en janvier 2014 sous le nom d'“Xcoin"). Il tire pour partie son inspiration de l'approche de hachage chaîné de Quark, ajoutant plus de "profondeur" et de complexité en augmentant le nombre de hashs, cependant il diffère de Quark en ceci que les cycles de hachage sont fixés a priori au lieu d'être choisis au hasard pour certains.
ko: X11은 대시(2014년 1월 'Xcoin'으로 런칭)에 소개된 체인 작업 증명(Proof-of-Work, **PoW**) 알고리즘의 이름입니다. 이는 부분적으로 쿼크의 체인 해싱 접근 방식에 영감을 받았으며, 해시의 숫자를 증가시킴으로써 '뎁스Depth'와 복잡성을 추가하였습니다. 그러나 이는 일부 해시가 무작위로 선택되는 대신 해시의 라운드가 *연역적으로* 결정되어있다는 점에서 쿼크와는 차이점을 보입니다.
vi: X11 là tên của một chuỗi các thuật toán proof-of-work (**PoW**) được giới thiệu trong Dash (ra mắt vào tháng Giêng năm 2014 với tên là "Xcoin"). Nó một phần có được nhờ cảm hứng của chuỗi các thuật toán băm giống như Quark, và thêm vào độ "sâu" và độ phức tạp bằng cách tăng số lượng phép băm, nhưng nó khác với Quark ở chỗ số vòng băm được xác định trước *một trật tự* thay vì sử dụng các phép băm được chọn một cách ngẫu nhiên.
zh_cn: X11是达世币（2014年1月按Xcoin命名发行）引入的工作量证明（ **POW** ）的一个算法名称。它一部分受Quark的启发，通过提高散列的数量增加了更多“深度“和复杂性，但是它与Quark的不同是，散列的轮次是确定先验的而不是随机挑选的。

source: The X11 algorithm uses multiple rounds of 11 different hashes (blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo), thus making it one of the safest and more sophisticated cryptographic hashes in use by modern cryptocurrencies. The name X11 is not related to the open source X11 windowing system common on UNIX-like operating systems.
ar: تستخدم خوارزمية X11 عدة جولات من 11 تجزئة مختلفة (blake، bmw، groestl، jh، keccak، skein، luffa، cubehash، shavite، simd، echo) ، مما يجعلها واحدة من أكثر شفرات التشفير الآمنة والأكثر تعقيدًا في الاستخدام العملات الرقمية. لا يرتبط اسم X11 بنظام النوافذ X11 المفتوح المصدر الشائعة في أنظمة التشغيل الشبيهة بنظام لينكس.
de: Der X11-Algorithmus verwendet mehrere Runden der 11 verschiedenen Hashes (blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo), wodurch er einer der sichersten und komplexesten kryptographischen Hashes ist, die von modernen Kryptowährungen verwendet werden. Der Name X11 hat jedoch nichts mit dem Open Source Fenstersystem X11 zu tun, welches häufig von UNIX-artigen Betriebssystemen verwendet wird.
fr: L'algorithme X11 utilise plusieurs cycles de 11 hashs différents (blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo), en faisant un des processus de hachage les plus sûrs et les plus sophistiqués utilisés dans les cryptomonnaies modernes. Le nom X11 n'a aucun rapport avec le système de fenêtrage X11 couramment utilisé sur les systèmes UNIX.
ko: X11 알고리즘은 11개의 다양한 해시(blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo)의 다중 라운드를 사용하며, 이로써 현대 암호화폐에서 사용되는 가장 안전하고 정교한 암호학 해시 중 하나가 되었습니다. X11라는 이름은 UNIX와 같은 운영 시스템과 공통점을 가진 오픈 소스 X11 윈도우 시스템과는 관련이 없습니다.
vi: Thuật toán X11 sử dụng nhiều vòng của 11 thuật toán băm (blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo), như vậy nó đảm bảo sự an toàn cao nhất nhờ sự kết hợp các thuật toán băm rất tinh vi mà thường được sử dụng trong các loại tiền điện tử hiện đại. Cái tên X11 không liên quan đến hệ thống cửa sổ mã nguồn mở X11, thông dụng trên các hệ điều hành kiểu Unix.
zh_cn: X11算法采用的是11种不同的算法（blake、bmw、groestl、jh、keccak、skein、luffa、cubehash、shavite、simd、echo），这使其成为加密数字货币应用中最安全的更复杂的加密算法。X11的名字与类似近UNIX操作系统的X11开源WINDOWS系统没有任何关系。

source: Advantages of X11
ar: مزايا X11
de: Vorteile von X11
fr: Avantages d'X11
ko: X11의 장점
vi: Ưu điểm của X11
zh_cn: X11的优势

source: The increased complexity and sophistication of the chained algorithm provides enhanced levels of security and less uncertainty for a digital currency, compared to single-hash PoW solutions that are not protected against security risks like SPOF (Single Point Of Failure). For example, a possible but not probable computing breakthrough that "breaks" the SHA256 hash could jeopardize the entire Bitcoin network until the network shifts through a hard fork to another cryptographic hash.
ar: يزيد التعقيد والتعقيد المتزايدان للخوارزمية المقيدة مستويات محسنة من الأمان وأقل عدم يقين بالنسبة للعملة الرقمية ، مقارنةً بحلول PoW ذات التجزئة الفردية غير المحمية من المخاطر الأمنية مثل SPOF (نقطة واحدة من الفشل). على سبيل المثال ، يمكن أن يؤدي اختراق الحوسبة SHA256 المحتمل إلى احتمالية اختراقه إلى اختراق شبكة بيتكوين بالكامل إلى أن تنتقل الشبكة من خلال شوكة صلبة إلى تجزئة تشفير أخرى.
de: Die erhöhte Komplexität und die Verschachtelung des verketteten Algorithmus bieten ein verstärktes Sicherheitsniveau und eine geringere Zahl der Unsicherheiten, denen eine Kryptowährung ausgesetzt ist, die auf eine Single-Hash-PoW-Lösung vertraut und sich dadurch nicht resistent gegenüber Sicherheitsrisiken wie SPOF (Single Point Of Failure) zeigt. Es ist zwar sehr unwahrscheinlich, aber sollte der SHA256-Hash "geknackt" werden, könnte dies das gesamte Bitcoin-Netzwerk lahmlegen, bis ein anderer kryptographischer Hash durch eine Hardfork implementiert würde.
fr: La complexité accrue et la sophistication de l'algorithme chaîné offrent à une monnaie numérique des niveaux de sécurité améliorés et une moindre incertitude par rapport aux solutions de preuve de travail (PoW) à algorithme unique, qui ne sont pas protégées contre les risques de sécurité de type “point de vulnérabilité unique". Par exemple, une percée possible (mais improbable) en informatique qui permettrait de “casser" le hachage SHA256 pourrait mettre en péril le réseau Bitcoin en entier, jusqu'à ce qu'il bascule par “hard fork" vers un autre hachage cryptographique.
ko: 체인 알고리즘의 증가된 복잡성과 정교함은 SPOF(Single Point Of Failure)와 같은 보안 위험에 대한 보호를 제공하지 않는 단일 해시 PoW와 비교할 때 향상된 보안을 제공하며 디지털 통화의 불확실성을 줄여줍니다. 예컨대, SHA256 해시를 '돌파'할 가능성이 있으나 개연성이 없는 컴퓨팅 돌파구는 해당 네트워크가 또 다른 암호학적 해시로 하드포크 함으로써 전환되기 전 까지는 전체 블록체인 네트워크를 위태롭게 할 수 있습니다.
vi: Việc tăng độ phức tạp của chuỗi các thuật toán nhằm nâng cao mức độ an toàn và giảm sự không chắc chắn cho tiền kỹ thuật số, so với việc sử dụng giải pháp PoW dùng một thuật toán đơn, dùng thuật toán đơn là không bảo đảm cho việc rủi ro về mặt an ninh mà người ta gọi là SPOF (Một Điểm Chịu Lỗi). Ví dụ, giả sử có khả năng về tính toán mà nó "phá vỡ" thuật toán SHA256 thì nó có thể gây nguy hại cho toàn bộ mạng lưới của Bitcoin cho đến khi Bitcoin phải chuyển đổi bằng hard fork sang thuật toán mới.
zh_cn: 相较于没有安全风险保护的单一算法的工作量证明解决方法，比如SPOF（单点故障），多重算法中提升的复杂性增强了数字货币的安全性，减少了不确定性。例如，如果有新的计算突破，可能但不一定会发生，攻破了SHA256算法，就有可能会危及到整个比特币网络，除非网络通过硬分叉转移到另外一个加密算法中去。

source: In the event of a similar computing breakthrough, a digital currency using the X11 PoW would continue to function securely unless all 11 hashes were broken simultaneously. Even if some of the 11 hashes were to prove unreliable, there would be adequate warning for a currency using X11 to take measures and replace the problematic hashes with other more reliable hashing algorithms.
ar: في حالة حدوث اختراق مماثل للحوسبة ، ستستمر العملة الرقمية التي تستخدم X11 PoW في العمل بشكل آمن ما لم يتم كسر كل 11 تجزئة في وقت واحد. حتى إذا كان بعض من 11 تجزئة لا تثق بها ، سيكون هناك تحذير كاف لعملة تستخدم X11 لاتخاذ تدابير واستبدال تجزئات إشكالية مع خوارزميات التجزئة أكثر موثوقية أخرى.
de: Sollte es einen sprunghaften Anstieg der Rechenleistung geben, würde eine digitale Währung, die den X11-Algorithmus verwendet sicher bleiben, solange nicht alle 11 Hashes gleichzeitig geknackt würden. Sollten manche der 11 Hashes nicht mehr sicher sein, könnte eine Währung, die auf X11 vertraut, damit beginnen, die problematischen Hashes durch verlässlichere Algorithmen zu ersetzen.
fr: Dans l'hypothèse d'une telle percée informatique, une monnaie numérique utilisant la PoW X11 continuerait de fonctionner en sécurité, à moins que les 11 hachages soient “cassés" simultanément. Même si certains des 11 hachages s'avéraient faillibles, l'alerte serait donnée suffisamment à temps pour qu'une monnaie utilisant X11 puisse prendre des mesures de remplacement des hachages vulnérables par d'autres algorithmes plus fiables.
ko: 유사한 컴퓨팅 돌파구가 발생하는 경우, 모든 열 한 개의 해시가 동시에 충돌하지 않는 한, X11 PoW를 사용하는 디지털 통화는 계속해서 안전하게 작동합니다. 이들 열 한 개의 해시 중 일부를 신뢰할 수 없는 것으로 입증된 경우에도 X11을 사용하는 통화에 충분한 경고를 제공하여 문제가 되는 해시를 측정하고 더욱 신뢰할 수 있는 해싱 알고리즘으로 교체할 수 있습니다.
vi: Trong sự kiện tương tự nếu có sự cố về mặt tính toán, một loại tiền dùng cơ chế PoW với X11 sẽ vẫn hoạt động một cách an toàn trừ khi cả 11 thuật toán băm đều được phá vỡ một cách đồng thời. Thậm chí nếu vài thuật toán băm trong X11 được chứng minh là không đáng tin cậy, thì nó vẫn đủ thời gian để cảnh báo cho đồng tiền dùng X11 đánh giá và thay thế những thuật toán băm có vấn đề bằng các thuật toán băm khác đáng tin cậy hơn.
zh_cn: 如果有相似的计算突破发生，使用X11算法验证PoW的数字货币还会继续安全地运行，除非11个算法同时被攻破。即使11个算法中有一些被证实不可靠，但也足够向使用X11算法的货币提出预警，以便采取措施，用其它更可靠的算法替换掉有问题的算法。
