Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ar, de, fr, ko, vi, zh_cn

source: You can read more about Dash governance in the :ref:`governance` section of this documentation.
ar: يمكنك قراءة المزيد عن إدارة داش في :ref:`الحكم` قسم من هذه الوثائق.
de: Weitergehende Information zum Thema Dash-Governance findest du im Kapitel :ref:`governance` dieser Dokumentation.
fr: Pour en savoir plus sur la gouvernance Dash, voir la section :ref:`governance` de cette documentation.
ko: 대시 거버넌스에 관한 더 자세한 내용은 이 문서의 :ref:`governance` 에서 확인하실 수 있습니다.
vi: Bạn có thể đọc thêm về cơ chế quản trị của Dash ở mục :ref:`governance` của tài liệu này.
zh_cn: 你可以在\ :ref:`governance`\ 专区浏览更多关于达世币管理的文献资料。

source: Introduced in Dash 0.12.1, Sentinel is an autonomous agent for persisting, processing and automating Dash governance objects and tasks. Sentinel is implemented as a Python application that binds to a local version dashd instance on each Dash masternode.
fr: Apparu dans Dash 0.12.1, Sentinel est un agent autonome destiné à surveiller, opérer et automatiser les objets et tâches de gouvernance. Sentinel prend la forme d'une application Python connectée à une instance locale dashd sur chaque masternode Dash.

source: A Governance Object (or "govObject") is a generic structure introduced in Dash 0.12.1 to allow for the creation of Budget Proposals and Triggers. Class inheritance has been utilized to extend this generic object into a "Proposal" object to supplant the current Dash budget system.
fr: Un objet de gouvernance (ou "govObject") est une structure générique apparue dans Dash Core 0.12.1 et permettant la création de propositions budgétaires et d'interrupteurs. L'héritage de classe a été utilisé pour étendre cet objet générique comme objet de "proposition" afin de réformer le système budgétaire Dash actuel.

source: Diagram highlighting the relationship between Dash Sentinel and Core
ar: رسم تخطيطي يوضح العلاقة بين حماية داش و كور
de: Dieses Diagramm verdeutlicht die Beziehung zwischen Dash Sentinel und Core
fr: Diagramme des interactions entre Dash Sentinel et Dash Core
ko: 대시 센티넬과 코어 사이의 관계를 강조하는 도표
vi: Sơ đồ làm nổi bật mối quan hệ giữa Dash Sentinel và Core
zh_cn: 图解强调了达世币哨兵和核心之间的关系

source: Fees
ar: الرسوم
de: Gebühren
fr: Frais de transaction
ko: 수수료
vi: Phí giao dịch
zh_cn: 手续费

source: Transactions on the Dash network are recorded in blocks on the blockchain. The size of each transaction is measured in bytes, but there is not necessarily a correlation between high value transactions and the number of bytes required to process the transaction. Instead, transaction size is affected by how many input and output addresses are involved, since more data must be written in the block to store this information. Each new block is generated by a miner, who is paid for completing the work to generate the block with a block reward. In order to prevent the network from being filled with spam transactions, the size of each block is artificially limited. As transaction volume increases, the space in each block becomes a scarce commodity. Because miners are not obliged to include any transaction in the blocks they produce, once blocks are full, a voluntary transaction fee can be included as an incentive to the miner to process the transaction. Most wallets include a small fee by default, although some miners will process transactions even if no fee is included.
de: Transaktionen über das Dash-Netzwerk werden in den Blöcken der Blockchain aufgezeichnet. Die Größe jeder Transaktion wird in Bytes gemessen und es gibt keinen notwendigen Zusammenhang zwischen dem hohen Wert einer Transaktion und der Menge an Bytes, die zum Ausführen benötigt wird. Die Größe einer Transaktion hängt vielmehr von der Zahl der Inputs und Outputs an, die verwendet werden, da durch diese mehr Daten in den Block eingeschrieben werden müssen. Jeder neue Block wird von einem Miner generiert, der für die Schaffung des Blocks mit dem Block-Reward belohnt wird. Damit das Netzwerk nicht von Spam-Transaktionen überflutet werden kann, ist die Größe eines Blocks limitiert. Wenn die Menge an Transaktionen zunimmt, wird die Speicherkapazität des Blocks zu einem knappen Gut. Da Miner nicht dazu verpflichtet sind Transaktionen in die Blöcke aufzunehmen, kann eine freiwillige Transaktionsgebühr hinzugefügt werden, welche dem Miner einen Anreiz bietet, die Transaktion zu verarbeiten. Die meisten Wallets setzen von sich aus eine Transaktionsgebühr fest, auch wenn manche Miner eine Transaktion auch ohne Gebühren akzeptieren würden.
fr: Les transactions sur le réseau Dash sont inscrites dans des blocs, sur la blockchain (chaîne de blocs). La taille de chaque transaction est mesurée en octets, mais il n'y a pas forcément de corrélation entre des transactions de montant élevé et le nombre d'octets nécessaires pour opérer la transaction. La taille de la transaction dépend du nombre d'adresses d'entrée et de sortie impliquées : en effet, plus ou moins de données doivent être écrites dans le bloc pour stocker cette information. Chaque nouveau bloc est généré par un mineur, qui est rétribué par une récompense de bloc s'il achève ce travail de génération. Afin d'éviter que le réseau ne soit saturé de transactions "spam", la taille de chaque bloc est limitée de façon artificielle. Au fur et à mesure que le volume de transactions augmente, l'espace disponible dans chaque bloc se raréfie. Les mineurs ne sont pas contraints d'inclure toutes les transactions dans les blocs qu'ils produisent, et donc, une fois que les blocs sont pleins, des frais de transaction volontaires peuvent être ajoutés à la transaction, constituant une incitation pour que le mineur traite la transaction. La plupart des portefeuilles définissent de faibles frais de transaction par défaut ; cependant beaucoup de mineurs traiteront les transactions même si elles ne comportent pas de frais.
zh_cn: Dash 网络上的交易被记录在区块链上。交易的大小以字节为单位，但高价值交易与其交易字节数大小无必要相关性。交易大小则是由有多少输入与输出决定，因为有更多的数据被保存在区块中。每个区块都 是由一个矿工生成，他将因为生成区块做的工作被奖励。为了防止区块链被垃圾交易塞满，每个块的大小被人为限制。随着交易数量增长，每个区块的空间变得十分珍贵。因为矿工没有义务在他们产生的区块中包含任意交易，一旦区块被填满，一笔自愿的交易费用被用来激励矿工从而包含该交易，大多数钱包默认包含一笔小交易费，尽管一些矿工即使没有交易费照样处理交易。

source: The release of Dash 0.12.2.0 and activation of DIP0001 saw a simultaneous reduction of fees by a factor of 10, while the block size was increased from 1MB to 2MB to promote continued growth of low-cost transactions even as the cost of Dash rises. Dash 0.13.0.0 introduced InstantSend autolocks, which causes masternodes to automatically attempt to lock any transaction with 4 or fewer inputs — which are referred to as “simple” transactions — and removes the additional fee for InstantSend. The current fee schedule for Dash is as follows:
fr: La sortie de Dash 0.12.2.0 et l'activation de la DIP0001 ont entraîné une division des frais de transaction par 10, cependant que la taille de bloc a augmenté de 1 Mo à 2 Mo pour soutenir la croissance des transactions à frais bas, même si le cours de Dash augmente. La version 0.13.0.0 de Dash a inauguré les verrouillages automatiques InstantSend, où les masternodes tâchent de verrouiller toute transaction comportant 4 entrées ou moins (ce qu'on appelle des transactions "simples"), et elle a supprimé les frais supplémentaires pour InstantSend. La grille de frais actuelle est la suivante :

source: Transaction type
ar: نوع المعاملة
de: Transaktionsart
fr: Type de transaction
ko: 거래 유형
vi: Kiểu giao dịch
zh_cn: 交易类型

source: Recommended fee
ar: الرسوم الموصى بها
de: Empfohlene Gebühr
fr: Frais recommandés
ko: 권장 수수료
vi: Mức phí gợi ý
zh_cn: 推荐手续费

source: Per unit
ar: لكل وحدة
de: Pro Einheit
fr: Par unité
ko: 단위당
vi: Mỗi đơn vị
zh_cn: 每单位

source: Standard transaction
ar: المعاملة العادية
de: Standardtransaktion
fr: Transaction standard
ko: 표준 거래
vi: Giao dịch chuẩn
zh_cn: 标准交易

source: .00001 DASH
ar: .00001 داش
fr: 0,00001 DASH
ko: .00001 대시

source: Per kB of transaction data
ar: لكل كيلو بايت من بيانات المعاملات
de: Pro kb versendeter Daten
fr: Par Ko de données de transaction
ko: 거래 데이터의 kB 당
vi: Cho mỗi kB dữ liệu giao dịch
zh_cn: 每 kB 交易数据

source: InstantSend autolock
fr: Verrouillage automatique InstantSend
zh_cn: 即时交易 自动锁定

source: .0001 DASH
ar: .0001 داش
fr: 0,0001 DASH
ko: .0001 대시

source: Per transaction input
ar: لكل إدخال المعاملة
de: Pro Transaktions-Input
fr: Par entrée de transaction
ko: 거래 입력값당
vi: Cho mỗi đầu vào giao dịch
zh_cn: 每交易输入

source: .001 DASH
ar: .001 داش
fr: 0,001 DASH
ko: .001 대시

source: Per 10 rounds of mixing (average)
ar: لكل 10 جولات من الخلط (المتوسط)
de: Pro 10 Runden Mixing (durchschnittlich)
fr: Par 10 cycles de mélange (en moyenne)
ko: (평균) 믹싱 10라운드당
vi: Mỗi 10 vòng trộn (trung bình)
zh_cn: 每10轮混币（平均）

source: As an example, a standard and relatively simple transaction on the Dash network with one input, one output and a possible change address typically fits in the range of 200 - 400 bytes. Assuming a price of US$100 per DASH, the fee falls in the range of $0.0002 - $0.0004, or 1/50th of a cent. Processing a simple transaction using InstantSend at the same price is free of charge, while more complex InstantSend transactions may cost around 1-2 cents per transaction, depending on the number of inputs. These fees apply regardless of the Dash or dollar value of the transaction itself.
de: Nehmen wir als Beispiel eine einfache Standardtransaktion im Dash-Netzwerk mit einem Input, einem Output und einer Wechselgeldadresse, deren Größe meistens zwischen 200 und 400 Bytes liegt. Bei einem Preis von $100 pro Dash liegen die Gebühren zwischen $0.0002 - $0.0004, also bei etwa einem 1/50 Cent. Soll die Transaktion beim selben Dash-Preis mit InstantSend durchgeführt werden, fällt keine zusätzliche Gebühr mehr an, solange die Zahl der Inputs 4 nicht übersteigt. Eine komplexere InstantSend-Transaktion würde zwischen 1 und 2 Cent pro Transaktion kosten, je nach Anzahl der Inputs. Diese Gebühr wird erhoben, egal wie hoch der eigentliche Wert der Transaktion in Dash oder Dollar ist.
fr: Par exemple, une transaction standard et relativement simple sur le réseau Dash, comportant une entrée, une sortie et une adresse éventuelle de monnaie rendue, représente en général une taille comprise entre 200 et 400 octets. En supposant un cours de 100 dollars par dash, la transaction revient de 0,0002 à 0,0004 dollar, c'est-à-dire 1/50e de centime. Faire une transaction simple avec InstantSend, au même cours de Dash, est gratuit, tandis que des transactions InstantSend plus complexes pourraient coûter environ 0,01 à 0,02 dollars (1 à 2 centimes) par transaction. Ces frais s'appliquent indépendamment du montant en Dash ou en dollars de la transaction elle-même.
zh_cn: 举个例子，一个在 Dash 网络上只有一个输入一个输出的相对简单的的标准交易，加上一个可能的找零地址一般保持在 200-400 字节。假如一个 DASH 价值 US$100，手续费则在$0.0002 -$0.0004范围 或 1/50 分。用即时发送来处理一个简单交易中免费的，然后更复杂的即时发送交易则需要 1-2 美分，取决与输入的数量。这些费用与交易的 DASH 与美元价值没有关系。

source: :ref:`PrivateSend` works by creating denominations of 10, 1, 0.1, 0.01 and 0.001 DASH and then mixing these denominations with other users. Creation of the denominations is charged at the default fee for a standard transaction. Mixing is free, but to prevent spam attacks, an average of one in ten mixing transactions are charged a fee of 0.0001 DASH. Spending inputs mixed using PrivateSend incurs the usual standard or InstantSend fees, but to avoid creating a potentially identifiable change address, the fee is always rounded up to the lowest possible denomination. This is typically .001 DASH, so it is important to deduct the fee from the amount being sent if possible to minimise fees. Combining InstantSend and PrivateSend may be expensive due to this requirement and the fact that a PrivateSend transaction may require several inputs, while InstantSend charges a fee of 0.0001 DASH per input. Always check your fees before sending a transaction.
fr: PrivateSend fonctionne en créant des coupures de 10, 1, 0,1, 0,01 et 0,001 dashs, puis en mélangeant ces coupures avec d'autres utilisateurs. La création des coupures coûte les frais par défaut pour une transaction standard. Le mélange est gratuit mais, pour empêcher les attaques "spam", environ une transaction de mélange sur dix doit régler des frais de 0,0001 dash. Dépenser des entrées mélangées avec PrivateSend entraîne les frais habituels (standard ou InstantSend) mais, pour éviter de créer des adresses de monnaie rendue potentiellement identifiables, les frais sont toujours arrondis à la plus petite coupure possible supérieure. Cela représente typiquement 0,001 dash. Il est donc important de déduire les frais du montant envoyé, si possible, pour optimiser les frais. Combiner InstantSend et PrivateSend peut coûter cher pour cette raison, mais aussi parce qu'une transaction PrivateSend peut impliquer plusieurs entrées alors qu'InstantSend entraîne des frais de 0,0001 dash pour chaque entrée. Veuillez toujours vérifier vos frais avant d'envoyer une transaction.

source: `Dash Evolution <https://www.dash.org/roadmap/>`_ is the code name for a decentralized platform built on Dash blockchain technology. The goal is to provide simple access to the unique features and benefits of Dash to assist in the creation of decentralized technology. Dash introduces a tiered network design, which allows users to do various jobs for the network, along with decentralized API access and a decentralized file system.
fr: `Dash Evolution <https://www.dash.org/fr/feuille-de-route/>`_ est le nom de code d'une plateforme monétaire décentralisée, bâtie sur la technologie blockchain Dash. L'objectif est de fournir un accès simple aux fonctionnalités et aux avantages uniques de Dash, et de faciliter l'usage des technologies décentralisées. Dash propose un réseau à niveaux multiples qui permet aux utilisateurs d'exécuter différentes tâches pour le réseau, avec un accès par API décentralisée et un système de fichiers décentralisé.

source: Dash Evolution will be released in stages. Dash Core releases 0.12.1 through to 0.12.3 lay the groundwork for the decentralized features behind the scenes. Version 0.13 introduces the foundation of Evolution, specifically `DIP2 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ and `DIP3 Deterministic Masternode Lists <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__. Version 0.14 establishes `DIP6 Long Living Masternode Quorums <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__. Expected in late 2019, Dash Core 1.0 will introduce key Evolution features such as username-based payments, the world's first decentralized API (DAPI) and a decentralized data storage system (Drive) based on IPFS.
fr: Dash Evolution sortira en plusieurs étapes. Les versions 0.12.1 à 0.12.3 de Dash Core ont établi les premières fonctionnalités décentralisées. La version 0.13 a introduit la fondation d'Evolution, en particulier les `transactions spéciales DIP2 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ et les `listes de masternodes déterministes DIP3 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__. La version 0.14 introduit les `quorums de masternode à longue durée de vie DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__. Attendue pour la fin 2019, la version 1.0 de Dash Core introduira des fonctionnalités clés d'Evolution, telles que les paiements basés sur noms d'utilisateur, la toute première API décentralisée au monde (DAPI) et un système de stockage de données décentralisé (Dash Drive) basé sur IPFS.

source: Included below is our current work on Evolution, that adds many components such as:
ar: يرد أدناه عملنا الحالي في التورة ، الذي يضيف العديد من المكونات مثل:
de: Weiter unten befindet sich unsere momentane Arbeit an Evolution, durch welches folgende Komponenten integriert werden:
fr: Notre travail actuel sur Evolution ajoute un grand nombre de composants, tels que :
ko: 아래의 내용은 에볼루션에 관한 현재의 작업 상황을 나타냅니다. 여기에는 아래와 같은 많은 구성 요소들이 포함됩니다.
vi: Dưới đây là công việc hiện tại của chúng tôi về Evolution, ngoài ra còn có thêm nhiều thành phần như:
zh_cn: 以下便是我们目前在Evolution上所做的工作，增加了许多单元如：

source: **Drive:** A decentralized shared file system for user data that lives on the second tier network
fr: **Drive** : un système de fichiers décentralisé et partagé, pour stocker les données utilisateurs sur le réseau de second niveau

source: **DAPI:** A decentralized API which allows third tier users to access the network securely
ar: **DAPI:** واجهة برمجة تطبيقات لا مركزية تتيح لمستخدمي الطبقة الثالثة الوصول إلى الشبكة بأمان
de: **DAPI:** Eine dezentralisierte API, welches Nutzern der dritten Ebene den sicheren Zugang zum Netzwerk ermöglicht
fr: **DAPI** : une API décentralisée qui permet aux utilisateurs de troisième niveau d'accéder au réseau de manière sûre
ko: **DAPI:** 세 번째 계층 사용자들이 네트워크에 안전하게 액세스 할 수 있도록 도와주는 분산화된 API 입니다.
vi: **DAPI:** Là giao diện lập trình phi tập trung cho phép người dùng trên các ứng dụng bậc 3 có thể truy cập mạng lưới một cách an toàn
zh_cn: **DAPI：**\ 分布式应用程序接口，允许第三层用户安全接入网络

source: **DashPay Decentralized Wallets:** These wallets are light clients connected to the network via DAPI and run on various platforms
ar: **محافظ DashPay اللامركزية:** هذه المحافظ هي عملاء فاتحين متصلين بالشبكة عبر DAPI وتعمل على منصات متنوعة
de: **DashPay Dezentralisierte Wallets:** Diese Wallets sind Light Clients, die sich über DAPI mit dem Netzwerk verbinden und auf diversen Plattform laufen
fr: **Portefeuilles décentralisés DashPay** : ces portefeuilles sont des clients légers connectés au réseau à travers la DAPI, et qui tournent sur différentes plateformes
ko: **대시페이(DashPay) 분산형 지갑:** 이들 지갑은 라이트 클라이언트로서 DAPI를 통해 네트워크에 연결되며 다양한 플랫폼상에서 작동합니다.
vi: **DashPay Decentralized Wallets:** Là những ví nhẹ được kết nối với mạng thông qua DAPI và chạy trên nhiều nền tảng khác nhau
zh_cn: **分布式DashPay钱包：**\ 用户可通过DAPI在不同操作平台接入这些轻钱包

source: **Second Tier:** The masternode network, which provides compensated infrastructure for the project
ar: **المستوى الثاني:** شبكة ماسترنود ، التي توفر بنية تحتية معوضة للمشروع
de: **Zweite Ebene:** Das Masternode-Netzwerk, welches die vergütete Infrastruktur des Projektes ermöglicht
fr: **Second niveau** : le réseau des masternodes, qui fournit une infrastructure rétribuée au projet
ko: **두 번째 계층:** 마스터노드 네트워크를 일컫는 말로써, 프로젝트를 위한 인프라를 제공하고 보상을 받습니다.
vi: **Bậc hai:** Là mạng lưới masternode, nó cung cấp hạ tầng bổ sung cho dự án
zh_cn: **第二层网络：**\ 主节点网络 - 可为项目提供有偿的基础设施建设

source: **Budgets:** The second tier is given voting power to allocate funds for specific projects on the network via the budget system
ar: **الميزانيات:** يتم منح الطبقة الثانية القدرة على التصويت لتخصيص الأموال لمشاريع محددة على الشبكة من خلال نظام الميزانية
de: **Budgets:** Die zweite Ebene hat Wahlrecht, um bestimmten Projekten des Netzwerks die Finanzierung durch das Budgetsystem zu ermöglichen
fr: **Budgets** : le réseau de second niveau a un droit de vote pour allouer des fonds à des projets spécifiques, à travers le système budgétaire intégré au réseau
ko: **예산:** 두 번째 계층은 예산 시스템을 통해 네트워크상의 특정 프로젝트에 자금을 할당하기 위한 투표권을 부여받습니다.
vi: **Ngân sách:** Mạng bậc hai cho phép việc bỏ phiếu để cấp phát ngân sách cho những dự án cụ thể của mạng lưới qua hệ thống ngân sách
zh_cn: **预算：**\ 主节点网络被赋予了投票的权力，从而可以通过预算系统为网络上具体的项目提供资金

source: **Governance:** The second tier is given voting power to govern the currency and chart the course the currency takes
ar: **الحكم:** يتم منح الطبقة الثانية القدرة على التصويت لتنظيم العملة ورسم مسار العملة
de: **Governance:** Die zweite Ebene hat Wahlrecht, um die Währung zu verwalten und Entscheidungen über die Richtung der Währung zu treffen
fr: **Gouvernance** : le réseau de second niveau a un droit de vote pour diriger ou réorienter l'évolution de la monnaie
ko: **거버넌스:** 두 번째 계층은 대시를 운영하고, 대시가 나아갈 방향을 위한 투표권을 부여받습니다.
vi: **Quản trị:** Mạng bậc hai cho phép việc bỏ phiếu để quản trị hệ thống tiền tệ và quản lý các hoạt động cần thiết của hệ thống tiền tệ
zh_cn: **管理：**\ 主节点网络被赋予了投票的权力从而管理达世币项目及发展方向

source: **Deterministic Masternode Lists:** This feature introduces an on-chain masternode list, which can be used to calculate past and present quorums
fr: **Listes de masternodes déterministes** : cette fonctionnalité introduit une liste de masternode sur chaîne, qui peut être utilisée pour calculer les quorums passés et présents
zh_cn: **可识别主节点列表** 该功能引入一个链上主节点列表，它将被用来计算过去和现在的裁判团

source: **Social Wallet:** We introduce a social wallet, which allows friends lists, grouping of users and shared multisig accounts
fr: **Portefeuille social** : ce portefeuille permet de créer des listes d'amis, de regrouper des utilisateurs et de créer des comptes partagés multi-signés
zh_cn: **社交钱包** 我们引入一个社交钱包，它将允许好友列表，用户分组和共享多签名账户

source: Evolution Previews
ar: معاينة التورة
fr: Aperçus d'Evolution
ko: 에볼루션 미리 보기
vi: Xem trước về Evolution
zh_cn: 进化版预览

source: **Dash Dapps - Demoing Community Development on environment**, 17 August 2020
fr: **Dash Dapps - Demoing Community Development on environment**, 17 août 2020

source: **Let's Talk Dash Dapps feat. Sample Dapps & Wallet API (Ep 2)**, 6 August 2020
fr: **Let's Talk Dash Dapps feat. Sample Dapps & Wallet API (Ep 2)**, 6 août 2020

source: **Let's Talk Dash Dapps feat. Chrome Wallet (Ep 1)**, 28 July 2020
fr: **Let's Talk Dash Dapps feat. Chrome Wallet (Ep 1)**, 28 juillet 2020

source: The following videos featuring Dash Founder Evan Duffield and Head of UI/UX Development Chuck Williams describe the development process and upcoming features of the Dash Evolution platform.
ar: تصف مقاطع الفيديو التالية المقدمة من مؤسس داش ايفان دوفيلد ورئيس التطوير UI / UX تشاك وليامز عملية التطوير والميزات القادمة لمنصة تورة داش.
de: Im folgenden Video beschreiben der Dash-Gründer Evan Duffield und der UI/UX-Entwickler Chuck Williams den Entwicklungsprozess und die kommenden Funktionen der Dash Evolution Plattform.
fr: Les vidéos ci-dessous montrent Evan Duffield, le fondateur de Dash, et Chuck Williams, le responsable développement de l'interface, décrire le processus de programmation et les fonctionnalités futures de la plateforme Dash Evolution.
ko: 다음의 비디오를 통해 대시의 창립자인 에반 듀필드와 UI/UX 개발의 책임자인 척 윌리엄스가 대시 에볼루션 플랫폼의 개발 진행 상황과 기능에 관해 설명합니다.
vi: Những video sau đây được giới thiệu bởi người sáng lập Dash là Evan Duffield và trưởng nhóm phát triển UI/UX là Chuck Williams mô tả quy trình phát triển và những tính năng dự kiến của nền tảng Dash Evolution.
zh_cn: 以下的视频是达世币创始人Evan Duffield和用户体验/用户界面设计开发部门负责人Chuck Williams对Dash Evolution平台开发流程和即将呈现的功能所做的描述。

source: **Evolution Demo #1 - The First Dash DAP**, 16 March 2018
ar: **تورة تجريبية #1 - أول داش DAP**, مارس16 2018
de: **Evolution Demo #1 - Die erste Dash DAP**, 16 März 2018
fr: **Evolution Demo #1 - la première application décentralisée Dash**, 16 mars 2018
ko: **에볼루션 데모 #1 - 첫 번째 대시 DAP**, 2018년 3월 16일
vi: **Evolution Demo #1 - The First Dash DAP**, 16 tháng 3 năm 2018
zh_cn: **Evolution Demo #1 - The First Dash DAP** , 2018年3月16日

source: **Evolution Demo #2 - Mobile Evolution**, 25 April 2018
ar: **تورة تجريبية #2 - تورة الهاتف**, 25 أبريل 2018
fr: **Evolution Demo #2 - Evolution sur mobilr**, 25 avril 2018
ko: **에볼루션 데모 #2 - 모바일 에볼루션**, 2018년 4월 25일
vi: **Evolution Demo #2 - Mobile Evolution**, 25 tháng 4 năm 2018
zh_cn: **Evolution Demo #2 - Mobile Evolution**, 2018年4月25日

source: **Evolution Demo #3 - Dashpay User Experience**, 15 May 2018
ar: **تورة تجريبية #3 - خبرة مستخدمين داش**, 15 مايو 2018
de: **Evolution Demo #3 - Dashpay Benutzerfreundlichkeit**, 15 Mai 2018
fr: **Evolution Demo #3 - l'expérience utilisateur sur Dashpay**, 15 mai 2018
ko: **에볼루션 데모 #3 - 대시페이 사용자 경험**, 2018년 5월 15일
vi: **Evolution Demo #3 - Trải nghiệm người dùng Dashpay**, 15 tháng 5 năm 2018
zh_cn: **Evolution Demo #3 - Dashpay User Experience**, 2018年5月15日
