Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ar, de, fr, ko, vi, zh_cn

source: **IMPORTANT:** Your wallet only contains 1000 of these "change addresses". Every time a mixing event happens, one of your addresses is used up. Once enough of them are used, your wallet must create more addresses. It can only do this, however, if you have automatic backups enabled. Consequently, users who have backups disabled will also have PrivateSend disabled.
ar: **هام:** تحتوي محفظتك فقط على 1000 من "تغير العناوين" هذه. في كل مرة يحدث حدث خلط ، يتم استخدام أحد عناوينك. بمجرد استخدام عدد كافٍ منها ، يجب أن تنشئ محفظتك المزيد من العناوين. يمكن فقط القيام بذلك ، ومع ذلك ، إذا قمت بتمكين النسخ الاحتياطي التلقائي. وبالتالي ، سيتم تعطيل الإرسال المخفي أيضًا للمستخدمين الذين لديهم نسخ احتياطية معطلة.
de: **WICHTIG:** Eine Wallet beinhaltet lediglich 1000 „Wechselgeldadressen“. Bei jedem Mischvorgang wird eine Adresse verwendet. Sobald alle Adressen aufgebraucht sind, muss die Wallet neue generieren. Dies ist nur möglich, wenn automatische Backups aktiviert sind. Daher ist PrivatSend für Nutzer, die keine Backups aktiviert haben, deaktiviert.
fr: **IMPORTANT :** votre portefeuille ne contient que 1000 de ces "adresses de monnaie rendue". À chaque nouveau mélange de fonds, une de ces adresses sera utilisée. Une fois qu'elles sont toutes utilisées, votre portefeuille doit créer de nouvelles adresses. Il ne peut cependant le faire que si vous avez activé l'option de sauvegardes automatiques. En conséquence, les utilisateurs qui ont désactivé les sauvegardes automatiques auront également l'option PrivateSend désactivée.
ko: **주의:** 당신의 지갑은 1000개의 ‘변경 주소’만을 가지고 있습니다. 믹싱이 실행될 때마다 당신의 주소 중 한 개가 사용됩니다. 일정 수의 주소가 사용되면 당신의 지갑은 더 많은 주소를 만들어야 합니다. 그러나 이러한 작업은 당신이 자동 백업을 활성화한 경우에만 가능합니다. 따라서 자동 백업을 비활성화한 사용자는 프라이빗샌드 기능 역시 비활성화 됩니다.
vi: **QUAN TRỌNG:** Ví của bạn chỉ chứa 1000 "địa chỉ trả tiền lẻ". Mỗi khi có lần trộn xảy ra, một trong những địa chỉ được dùng hết. Khi chúng đã được sử dụng hết, ví của bạn phải tạo thêm các địa chỉ nữa. Nó chỉ có thể làm điều này, nếu bạn bật chế độ tự động sao lưu. Do đó, những ai tắt chế độ sao lưu thì cũng tắt chế độ PrivateSend.
zh_cn: **重要：**\ 你的钱包只能含有1000个“变更地址”。每一次混币发生，一个变更地址便会被用掉。一旦他们全部被用掉，你的钱包就必须创建更多的地址。但是，你只有让自动备份生效，才可以做到这一点。同样的，如果用户让备份失效，匿名支付失效。

source: Traditional decentralized cryptocurrencies must wait for certain period of time for enough blocks to pass to ensure that a transaction is both irreversible and not an attempt to double-spend money which has already been spent elsewhere. This process is time-consuming, and may take anywhere from 15 minutes to one hour for the widely accepted number of six blocks to accumulate. Other cryptocurrencies achieve faster transaction confirmation time by centralizing authority on the network to various degrees.
ar: يجب أن تنتظر العملات الرقمية التقليدية اللامركزية لفترة معينة من الزمن لتمرير كتل كافية لضمان أن المعاملة لا رجعة فيها على حد سواء وليس محاولة لمضاعفة إنفاق المال الذي تم إنفاقه بالفعل في مكان آخر. تستغرق هذه العملية وقتًا طويلاً ، وقد تستغرق ما بين 15 دقيقة وساعة واحدة للعدد المقبول على نطاق واسع من ست مجموعات للتجميع. تحقق العملات الرقمية أخرى وقت تأكيد المعاملة أسرع من خلال مركزية السلطة على الشبكة لدرجات مختلفة.
de: Klassische dezentralisierte Kryptowährungen warten eine gewisse Zeit ab, bis genügend Blöcke bestätigt wurden, damit eine Transaktion nicht rückgängig gemacht werden und kein Double-Spend stattfinden kann, bei dem ein Betrag zweimal verwendet wird. Dieser Prozess ist zeitintensiv und dauert zwischen 15 Minuten und einer Stunde, bis die 6 allgemein akzeptierten Blöcke bestätigt wurden. Andere Kryptowährungen ermöglichen schnellere Bestätigungszeiten, indem eine zentralisierte Autorität einen gewissen Grad an Kontrolle über das Netzwerk hat.
fr: Les cryptomonnaies décentralisées traditionnelles doivent attendre, pendant un certain temps, qu'un certain nombre de blocs soient générés pour pouvoir garantir qu'une transaction est irréversible, et qu'elle ne correspond pas à une tentative de dépense de fonds déjà dépensés ailleurs. Ce processus prend du temps, souvent entre 15 minutes et 1 heure, pour atteindre le nombre de 6 blocs, nombre le plus souvent considéré comme étant suffisamment sûr. D'autres cryptomonnaies proposent des temps de confirmation plus courts, en centralisant leur réseau d'une façon ou d'une autre.
ko: 전통적으로 분산화된 암호화폐는 충분한 양의 블록이 통과하도록 일정 시간을 기다려야 합니다. 이로써 거래를 되돌릴 수 없으며, 다른 곳에서 지출된 금액을 이중 지출 하지 않도록 확실히 할 수 있습니다. 이러한 과정에서 일반적으로 약 6개의 블록이 누적되며 시간은 15분에서 1시간이 소요됩니다. 다른 암호화폐의 경우 이러한 거래 속도를 향상시키기 위해 네트워크 상에서 다양한 수준으로 중앙화된 권한을 사용합니다.
vi: Các loại tiền số phi tập trung truyền thống phải đợi một khoảng thời gian nhất định để đủ các khối được thông qua để đảm bảo rằng giao dịch không thể bị đảo ngược và không bị cố tiêu lại nhiều lần một số tiền đã được tiêu trước đó ở đâu đó khác. Quá trình này rất tốn thời gian, và nó thường mất ở đâu đó vào khoảng từ 15 phút cho đến hàng giờ cho đủ số lượng được chấp nhận rộng rãi trong sáu khối nối tiếp. Những loại tiền số khác đạt được thời gian xác thực nhanh hơn bằng cách tập trung quyền hạn trên mạng ở những mức độ khác nhau.
zh_cn: 传统的去中心化加密数字货币都要等上一段时间，通过足够多的区块广播来保证交易是不可撤消的，并且验证这些币没有在别的地方已经被花掉而产生双重花费的可能。这个过程很费时，通常被广泛接受的六步确认会花上15分钟到1个小时不等的时间。其它的加密数字货币都是通过网络上不同程度的中心化处理来实现交易确认时间加速。

source: Dash suffers from neither of these limitations thanks to its second-layer network of masternodes. Masternodes regularly form voting quorums to check whether or not a submitted transaction is valid. If it is valid, the masternodes "lock" the inputs for the transaction and broadcast this information to the network, effectively promising that the transaction will be included in subsequently mined blocks and not allowing any other spending of these inputs during the confirmation time period.
fr: Dash ne souffre d'aucune de ces limitations, grâce au réseau de second niveau formé par ses masternodes. Les masternodes constituent des quorums de vote, afin de vérifier si une transaction soumise est valide ou non. Si elle est valide, les masternodes "verrouillent" les entrées de la transaction et diffusent cette information au réseau, ce qui constitue une promesse effective que la transaction sera incluse dans les blocs minés par la suite, sans qu'aucune des entrées ne puisse être dépensée pendant le délai de confirmation.

source: InstantSend technology will allow for cryptocurrencies such as Dash to compete with nearly instantaneous transaction systems such as credit cards for point-of-sale situations while not relying on a centralized authority. Widespread vendor acceptance of Dash and InstantSend could revolutionize cryptocurrency by shortening the delay in confirmation of transactions from as long as an hour (with Bitcoin) to as little as a few seconds.
ar: ستسمح تقنية الإرسال الفوري لأجهزة التشفير مثل داش بالتنافس مع أنظمة معاملات شبه فورية مثل بطاقات الائتمان لحالات نقاط البيع بينما لا تعتمد على سلطة مركزية. قد يؤدي قبول البائعين على نطاق واسع لـ داش و الإرسال الفوري إلى إحداث ثورة في استخدام العملات الرقمية عن طريق تقليل التأخير في تأكيد المعاملات من ساعة طويلة (مع بيتكوين) إلى بضع ثوانٍ.
de: Kryptowährungen wie Dash können durch die InstantSend-Technologie mit sekundenschnellen Transaktionssystemen wie Kreditkarten konkurrieren, ohne dabei auf eine zentrale Autorität vertrauen zu müssen. Eine weite Verbreitung von Dash und InstantSend könnte die Welt der Kryptowährungen revolutionieren, da hierdurch lange Bestätigungszeiten von einer Stunde (wie bei Bitcoin) auf ein paar Sekunden herabgesetzt werden können.
fr: La technologie InstantSend permettra aux cryptomonnaies telles que Dash de concurrencer les systèmes de transaction quasi instantanées tels que les cartes de paiement, dans le cadre des points de vente, et ce sans reposer sur une entité centralisée. Une large acceptation de Dash et d'InstantSend par les vendeurs pourrait révolutionner la cryptomonnaie en réduisant le délai de confirmation des transactions, parfois long d'une heure (avec Bitcoin), à quelques secondes seulement.
ko: 인스턴트샌드 기술은 대시와 같은 암호화폐가 중앙화된 권력에 의지하지 않고도 POS(Point-on-Sale)가 필요한 환경에서 사용되도록 신용카드와 같이 거의 즉각적인 거래 시스템을 구축할 수 있도록 도와줍니다. 대시와 인스턴트샌드를 수락하는 다양한 판매자들은 (비트코인처럼) 한 시간 가까이 지속될 수 있는 거래 확인 시간을 수 초로 줄임으로써 암호화폐를 혁명적으로 사용할 수 있습니다.
vi: Công nghệ InstantSend sẽ cho phép những đồng tiền như Dash có thể cạnh tranh với những hệ thống giao dịch gần như tức thời như thẻ tín dụng cho các tình huống như điểm bán hàng trong khi không cần phải dựa vào thẩm quyền tập trung. Việc có nhiều nhà kinh doanh chấp nhận rộng rãi Dash và InstantSend có thể làm nên một cuộc cách mạng về tiền số bằng việc giảm thời gian trễ của các giao dịch từ lâu như hàng giờ (với Bitcoin) xuống một khoảng thời gian rất ngắn là vài giây.
zh_cn: 即时支付技术使得像达世币这样的数字货币，在销售点的支付环境下，完全可以媲美那些接近瞬时支付的信用卡，而且不依赖任何中央集权机构。通过将交易确认时间长达几个小时（比特币）缩短到仅仅几秒，达世币被商户广泛接受的现状和即时支付技术将给加密数字货币带来一场革命。

source: You can view a practical guide to use InstantSend :ref:`here <dashcore-privatesend-instantsend>`. InstantSend was introduced in a whitepaper called `Transaction Locking and Masternode Consensus: A Mechanism for Mitigating Double Spending Attacks <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_, and further improved through the introduction of `LLMQ-based InstantSend <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__ in Dash 0.14.
fr: On peut consulter un guide pratique d'InstantSend :ref:`ici <dashcore-privatesend-instantsend>`. InstantSend a été originellement présenté dans un livre blanc intitulé `Transaction Locking and Masternode Consensus: A Mechanism for Mitigating Double Spending Attacks <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_, puis amélioré par l'introduction d' `InstantSend basé sur LLMQ <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__ avec Dash 0.14.

source: **How Dash 'InstantSend' Protects Merchants from Double Spends**, Dash Detailed by Amanda B. Johnson, 16 September 2016
ar: **كيف تحمي داش 'الإرسال الفوري' التجار من الانفاق المزدوج** ، مفصلة بواسطة، أماندا ب جونسون ، 16 سبتمبر 2016
de: **Wie Dash-'InstantSend' Händler vor Double Spends schützt**, Dash Detailed mit Amanda B. Johnson, 16. September 2016
fr: **Comment la fonction 'InstantSend' de Dash protège les vendeurs des doubles paiements**, Dash Detailed, par Amanda B. Johnson, 16 septembre 2016
ko: **대시 '인스턴트샌드'가 어떻게 이중 지출로부터 판매자들을 보호하는가**, 대시 디테일드 by 아만다 B. 존슨, 2016년 9월 16일
vi: **Làm thế nào mà cơ chế 'InstantSend' của Dash bảo vệ người bán khỏi sự tiêu lặp**, Dash Detail của Amanda B. Johnson, ngày 16 tháng 9 năm 2016
zh_cn: **达世币如何通过即时支付防止双花**，Amanda B. Johnson向你诠释，2016年9月16

source: ChainLocks are a feature provided by the Dash Network which provides certainty when accepting payments. This technology, particularly when used in parallel with :ref:`InstantSend <instantsend>`, creates an environment in which payments can be accepted immediately and without the risk of “Blockchain Reorganization Events”.
fr: ChainLocks est une fonctionnalité fournie par le réseau Dash, qui garantit totalement l'acceptation des paiements. Cette technologie, notamment lorsqu'elle est utilisée conjointement avec :ref:`InstantSend <instantsend>`, crée un environnement dans lequel les paiements peuvent être acceptés immédiatement et sans aucun risque de “réorganisation de blockchain”.

source: The risk of blockchain reorganization is typically addressed by requiring multiple “confirmations” before a transaction can be safely accepted as payment. This type of indirect security is effective, but at a cost of time and user experience. ChainLocks are a solution for this problem.
fr: Le risque de réorganisation de blockchain est classiquement mitigé par l'attente de nombreuses "confirmations" avant qu'une transaction soit acceptée en toute sécurité comme paiement. Ce type de sécurité indirecte est efficace, mais il implique une attente et une expérience utilisateur médiocre. ChainLocks est une solution à ce problème.

source: ChainLocks Process Overview
fr: Aperçu du processus ChainLocks

source: Every twelve hours a new “LLMQ” (Long-Living Masternode Quorum) is formed using a “DKG” (Distributed Key Generation) process. All members of this Quorum are responsible for observing, and subsequently affirming, newly mined blocks:
fr: Toutes les douze heures, un nouveau "quorum de masternodes de longue durée" (long-lasting masternode quorum, LLMQ) est établi au moyen d'un processus de génération de clé distribuée (distributed key generation, DKG). Tous les membres de ce quorum doivent observer, puis confirmer, les blocs nouvellement minés :

source: Whenever a block is mined, Quorum Members will broadcast a signed message containing the observed block to the rest of the Quorum.
fr: À chaque fois qu'un bloc est miné, des membres du quorum diffusent au reste du quorum un message signé contenant le bloc observé.

source: If 60% or more of the Quorum sees the same new block they will collectively form a “CLSIG” (ChainLock Signature) message which will be broadcast to the remainder of the network.
fr: Si 60% ou plus du quorum observe le même nouveau bloc, ils formeront collectivement une signature ChainLocks (“CLSIG”) sous forme de message qui sera diffusé au reste du réseau.

source: When a valid ChainLock Signature is received by a client on the network, it will reject all blocks at the same height that do not match the block specified in that message.
fr: Quand une signature ChainLocks valide est reçue par un client du réseau, il rejettera tous les blocs de même hauteur qui ne coïncident pas avec le bloc indiqué dans ce message.

source: The result is a quick and unambiguous decision on the “correct” blockchain for integrated clients and wallets. From a security perspective, this also makes reorganizations prior to this block impossible. See `DIP0008 ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ for a full description of how ChainLocks work.
fr: Le résultat est une décision rapide et sans ambiguïté, pour les clients et portefeuilles intégrés, concernant la blockchain "correcte". Du point de vue de la sécurité, cela rend impossible les réorganisations antérieures à ce bloc. Voir la `DIP0008 ChainLocks <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__ pour une description complète du fonctionnement de ChainLocks.

source: In response to unforeseen issues with the rollout of the major "RC3" update in June 2014, the Dash development team created a mechanism by which updated code is released to the network, but not immediately made active ("enforced"). This innovation allows for far smoother transitions than in the traditional hard fork paradigm, as well as the collection of test data in the live network environment. This process of multi-phased forking was originally to be called "soft forking" but the community affectionately dubbed it "the spork" and the name stuck.
ar: استجابةً للمشكلات غير المتوقعة مع تحديث التحديث الرئيسي "RC3" في يونيو 2014 ، أنشأ فريق تطوير داش آلية يتم من خلالها إصدار الشفرة المحدثة إلى الشبكة ، ولكن لم يتم تنشيطها على الفور ("مفروض"). ويسمح هذا الابتكار بتحولات أكثر سلاسة بكثير مما هو في نموذج الشوكة التقليدي الثابت ، بالإضافة إلى جمع بيانات الاختبار في بيئة الشبكة الحية. كانت هذه العملية من التزوير متعدد المراحل في الأصل تسمى "التشكُّل الناعم" ، لكن المجتمع المحلي أطلق عليها اسم "الشوكة" واسمها عالقًا.
de: Als Antwort auf unvorhergesehene Probleme bei der Veröffentlichung des wichtigen "RC3"-Updates im Juni 2014, hat das Dash-Entwicklerteam einen Mechanismus geschaffen, durch den ein Update eingespielt werden kann, ohne, dass es sofort aktiviert wird („verpflichtend“). Diese Neuerung erlaubt reibungslosere Übergänge, als dies beim traditionellen Hard Fork Vorgang der Fall ist. Zudem können hierdurch Testdaten in einer Live-Umgebung gesammelt werden. Dieses mehr-phasige Forking sollte zunächst als "soft forking" bezeichnet werden, aber die Community entschied sich für den Namen "der Spork", der seitdem beibehalten wurde.
fr: En réponse à des problèmes imprévus apparus avec la mise à jour majeure "RC3" (juin 2014), l'équipe de développement Dash a créé un mécanisme par lequel le code mis à jour est diffusé au réseau, mais pas immédiatement activé. Cette innovation permet des transitions bien plus douces que lors des “hard forks" traditionnels. Elle permet aussi de récupérer des données de test au sein de l'environnement réseau. Ce processus de fork multiphase devait à l'origine s'intituler “soft forking", mais la communauté lui a donné le petit nom de “spork" et le terme est resté.
ko: 2014년 6월에 업데이트된 'RC3'와 관련하여 예측하지 못한 이슈에 대응하기 위해 대시 개발 팀은 새로운 매커니즘을 개발하고 네트워크에 업데이트된 코드를 선보였으나 즉시 활성화시키지는 않았습니다. 이 혁신은 전통적인 하드 포크 패러다임이나 라이브 네트워크 환경의 테스트 데이터 콜렉션에 비하여 훨씬 부드러운 전환을 가능하게 합니다. 이 다단계 포크 과정은 원래 '소프트 포크'라고 불렸으나 대시 커뮤니티에서는 애정을 가지고 '스포크'라는 이름을 덧붙였으며 현재는 이 스포크로 고정되었습니다.
vi: Để đối phó với các vấn đề không lường trước được khi triển khai bản cập nhật lớn "RC3" vào tháng 6 năm 2014, nhóm phát triển Dash đã tạo cơ chế theo đó mã cập nhật được phát hành cho mạng, nhưng không được kích hoạt ngay lập tức ("thi hành"). Sự cải tiến này cho phép việc chuyển đổi trơn tru hơn hình thức hard fork truyền thống, cũng như việc thu thập dữ liệu thử nghiệm trong môi trường mạng trực tiếp. Quá trình phân chia nhiều giai đoạn này thường được gọi là "soft fork" nhưng cộng đồng trìu mến gọi nó là "spork" và thành tên như vậy.
zh_cn: 为了应对2014年6月更新"RC3"时出现意料之外的问题，达世开发团队发明了一种机制，在这种机制下，更新代码会被发布到网络上，但不马上激活（"实施"）。这种创新相比于传统的硬分叉模型，能够更平稳的过渡，并且可以收集实时网络环境中的测试信息。这种多阶段分叉过程开始时被称为软分叉，但是社区中亲切地授予它“叉勺”的称呼。
