Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ar, de, fr, ko, vi, zh_cn

source: *"The differences with Sentinel are really architectural and not easy/ interesting to explain to users as they are a bridge from 12.0 towards Evo features (but not fully implementing them), and Sentinel was only a part of 12.1 improvements anyway. Pre-Sentinel, governance functions were 'hard wired' into core code. Sentinel abstracts this process because in Evolution there are many Object types from Users to Accounts to Contacts etc, and if we didn't make this change first, future changes / improvements in Evolution (e.g. adding a new type of Object) would require changing core code. Now Core is agnostic to types of objects and we can take this forward for user experience and not just governance. In terms of documentation, there is no whitepaper specific to Sentinel, but we have various docs for Evo in an on-going RFC process which are used as the basis for Evo development."*
ar: *"الاختلافات مع حماية هي معمارية حقاً وليست سهلة / مثيرة للإهتمام لتشرح للمستخدمين لأنهم جسر من 12.0 نحو ميزات Evo (ولكن ليس التطبيق الكامل لها) ، وكان الحماية فقط جزءًا من التحسينات على 12.1 على أي حال. كانت وظائف الحوكمة "سلكيةً صلبةً" في الكود الأساسي ، حيث تستخلص "حماية" هذه العملية لأنه في التورة ، هناك العديد من أنواع الكائنات من المستخدمين إلى الحسابات إلى جهات الاتصال ، وما إلى ذلك ، وإذا لم نجر هذا التغيير أولاً ، فإن التغييرات / التحسينات المستقبلية في التطور ( تتطلب إضافة نوع جديد من الكائنات) تغيير الكود الأساسي.الآن أصبح كور ملائماً لأنواع الكائنات ويمكننا أن نأخذ هذا إلى الأمام من أجل تجربة المستخدم وليس فقط الحكم. من حيث التوثيق ، لا يوجد ورق أبيض خاص بـ الحماية ، ولكن لدينا مستندات متعددة لـ Evo في عملية RFC مستمرة والتي يتم استخدامها كأساس لتطوير Evo."*
de: *„Die Änderungen durch Sentinel sind vor allem architektonisch und können dem Nutzer nicht simpel / interessant erklärt werden, da sie eine Brücke von 12.0 zu den Evo-Funktionen darstellen (ohne sie vollständig zu implementieren) und Sentinel war zudem nur ein Teil der 12.1 Verbesserungen. Vor Sentinel waren die Governance-Objekte fest im Core-Code verankert. Sentinel abstrahiert diesen Prozess, da Evolution mehrere Objekt-Typen kennen wird, wie etwa Nutzer, Accounts, Kontakte, etc., und wenn wir diese Änderung nicht vorher eingefügt hätten, würden alle zukünftigen Änderungen / Verbesserungen an Evolution (wie etwa die Hinzufügung neuer Objekt-Typen) die Veränderung des Core-Codes voraussetzen. Core ist agnostisch gegenüber Objekt-Typen, weswegen wir diese Änderung nun auch auf der Nutzer-Ebene durchführen können und nicht nur im Bereich der Governance. Was die Dokumentation angeht, so gibt es kein Whitepaper spezifisch zu Sentinel, doch wir führen verschiedene Docs zu Evo im voranschreitenden RFC-Prozess, welche als Grundlage für die Evo-Entwicklung dienen.“*
ko: *"센티넬이 가진 매우 구조적이라는 것입니다. 또한 센티넬은 12.0에서 에볼루션 기능으로 가는(그러나 에볼루션의 전체 기능을 다 구현하지는 않는) 가교 역할을 하기 때문에 사용자들에게 설명하기 쉽지 않기도 합니다. 또한 센티넬은 12.1 개선점일 뿐이기도 하죠. 센티넬 이전에, 거버넌스 기능은 코어 코드에 '고정 배선으로 연결되어 있었다(Hard wired)'고 할 수 있습니다. 센티넬은 이러한 과정을 추출하는데, 에볼루션에는 사용자부터 계정, 연락처 목록 등에 이르기까지 많은 오브젝트 타입이 존재하기 때문입니다. 만일 우리가 우선 이러한 변화를 이끌어내지 않았다면 장래 에볼루션에서의 변경 사항이나 개선점(예: 새로운 타입의 오브젝트를 추가하는 것)을 위해서는 코어 코드 자체를 변경했어야 할 것입니다. 현재 코어는 오브젝트의 유형에 상관 없이 작동하며, 우리는 이를 거버넌스뿐만 아니라 사용자 경험에까지 연결시킬 수 있게 되었습니다. 문서적 측면에서 볼 때 센티넬에 특화된 백서는 없지만 에볼루션의 기초를 이루는 RFC 프로세스에 있어 에볼루션을 위한 다양한 문서가 존재합니다."*
vi: *"Sự khác biết với Sentinel là thực sự kiến trúc này không dễ/hay thú vị khi giải thích với người dùng về bước chuyển từ 12.0 lên các những tính năng của Evo (nhưng chưa thực hiện chúng một cách đầy đủ), và Sentinel dẫu sao chỉ là một phần của những cải tiến trong 12.1. Trước Sentinel, chức năng quản trị được "ghi cứng" vào trong mã chương trình. Sentinel làm trừu tượng hoá quá trình này bởi vì trong Evolution có nhiều kiểu đối tượng, từ người dùng đến tài khoản đến thông tin liên hệ,... và nếu chúng ta không thực hiện thay đổi này trước, thì những thay đổi trong tương lai/những cải tiến trong Evolution (ví dụ như thêm kiểu đối tượng) sẽ cần phải thay đổi mã nguồn của phần mềm lõi. Bây giờ phần Lõi là không thể biết đối với các loại đối tượng và chúng ta có thể lấy chúng ra khỏi trải nghiệm của nười dùng và nó không chỉ là quản trị. Trong phạm vi tài liệu này, không có một cáo bạch nào cụ thể về Sentinel, nhưng chúng ta có rất nhiều tài liệu cho Evo trong tiến trình RFC sắp tới nó sẽ được dùng như là phần cơ bản của quá trình phát triển Evo.*"

source: Andy Freer, Evolution Developer
ar: Andy Freer, مطور التورة
de: Andy Freer, Evolution-Entwickler
ko: 앤디 프리어, 에볼루션 개발자
vi: Andy Freer, lập trình viên cho Evolution

source: Transactions on the Dash network are recorded in blocks on the blockchain. The size of each transaction is measured in bytes, but there is not necessarily a correlation between high value transactions and the number of bytes required to process the transaction. Instead, transaction size is affected by how many input and output addresses are involved, since more data must be written in the block to store this information. Each new block is generated by a miner, who is paid for completing the work to generate the block with a block reward. In order to prevent the network from being filled with spam transactions, the size of each block is artificially limited. As transaction volume increases, the space in each block becomes a scarce commodity. Because miners are not obliged to include any transaction in the blocks they produce, once blocks are full, a voluntary transaction fee can be included as an incentive to the miner to process the transaction. Most wallets include a small fee by default, although many miners will process transactions even if no fee is included.
ar: يتم تسجيل المعاملات على شبكة داش في كتل على بلوكشين. يتم قياس حجم كل معاملة بالبايت ، ولكن لا يوجد بالضرورة ارتباط بين المعاملات ذات القيمة العالية وعدد البايتات المطلوبة لمعالجة المعاملة. بدلاً من ذلك ، يتأثر حجم المعاملة بعدد عناوين الإدخال والإخراج ، نظرًا لأنه يجب كتابة المزيد من البيانات في الكتلة لتخزين هذه المعلومات. يتم إنشاء كل كتلة جديدة بواسطة عامل مناجم ، يتم دفعه مقابل إكمال العمل لإنشاء الكتلة بمكافأة كتلة. لمنع ملء الشبكة بمعاملات البريد العشوائي ، يكون حجم كل كتلة محدودا بشكل مصطنع. مع زيادة حجم المعاملة ، يصبح المساحة في كل كتلة سلعة نادرة. نظرًا لأن عمال المناجم ليسوا ملزمين بإدراج أي معاملة في الكتل التي ينتجونها ، فبمجرد اكتمال الكتل ، يمكن تضمين رسوم المعاملات الطوعية كحافز على عامل التعدين لمعالجة الصفقة. معظم المحافظ تتضمن رسمًا صغيرًا بشكل افتراضي ، على الرغم من أن العديد من عمال المناجم سيعالجون المعاملات حتى لو لم يتم تضمين أي رسوم.
ko: 대시 네트워크상의 거래는 블록체인상의 블록에 기록됩니다. 각 거래의 크기는 바이트bytes로 측정되지만, 거래를 진행하는 데 필요한 바이트의 숫자와 거래액 사이에 연관성이 필요한 것은 아닙니다. 대신, 거래의 크기는 얼마나 많은 입력값과 출력값 주소가 관련되어 있느냐에 더욱 영향을 받는데, 이는 이러한 정보를 저장하는 데 더 많은 데이터가 블록 상에 씌어야 하기 때문입니다. 각각의 새로운 블록은 대가를 받고 블록 보상과 블록을 생성하는 일을 담당하는 채굴자에 의해 생성됩니다. 네트워크가 스팸 거래로 가득 차는 일을 방지하기 위해서 각 블록의 크기는 인위적으로 제한됩니다. 거래량이 증가하면 각 블록의 공간은 더욱 희소한 자원이 됩니다. 채굴자들이 생산하는 블록에 어떠한 거래를 포함시키도록 강제되지 않기 때문에, 일단 블록이 가득 차면 채굴자가 거래를 수행하도록 인센티브를 부여하기 위하여 자발적인 거래 수수료가 부가될 수 있습니다. 많은 채굴자들이 수수료 없이도 거래를 수행할 것이나, 대부분의 지갑은 기본값으로 적은 수수료를 포함하고 있습니다.

source: The release of Dash 0.12.2.0 and activation of DIP0001 saw a simultaneous reduction of fees by a factor of 10, while the block size was increased from 1MB to 2MB to promote continued growth of low-cost transactions even as the cost of Dash rises. Dash also supports :ref:`instantsend` and :ref:`privatesend` transactions, which operate on a different and mandatory fee schedule. The fee schedule for Dash 12.2.x as of December 2017 is as follows:
ar: شهد إصدار داش 0.12.2.0 وتنشيط DIP0001 تخفيضًا متزامنًا للرسوم بعامل 10 ، بينما زاد حجم الكتلة من 1 ميغابايت إلى 2 ميغابايت لتعزيز النمو المستمر للمعاملات منخفضة التكلفة حتى مع ارتفاع تكلفة داش. داش يدعم أيضا :ref:`الإرسال الفوري` و :ref:`الإرسال المخفي` المعاملات ، والتي تعمل على جدول الرسوم المختلفة والإلزامية. جدول الرسوم ل داش 12.2.x اعتبارًا من ديسمبر 2017 هو كالتالي:
ko: 대시의 가격이 인상되더라도 적은 거래 수수료를 유지하고 대시의 성장을 장려하기 위하여 블록 크기를 1MB에서 2MB로 증가시키는 한편, 대시 0.12.2.0이 출시되고 DIP0001이 활성화 됨에 따라 수수료는 일제히 열 배 감소하였습니다. 또한 대시는 :ref:`인스턴트샌드` 및 :ref:`프라이빗샌드` 거래를 지원하는데, 이들 기능은 각기 달리 정해진 수수료 스케줄에 따라 운영됩니다. 2017년 12월 대시 12.2.x에 따른 수수료 스케줄은 다음과 같습니다.

source: As an example, a standard and relatively simple transaction on the Dash network with one input, one output and a possible change address typically fits in the range of 200 - 400 bytes. Assuming a price of US$800 per DASH, the fee falls in the range of $0.0015 - $0.0030, or well under half a cent. Processing the transaction using InstantSend at the same price would add $0.08 or eight cents to the transaction. These fees apply regardless of the Dash or dollar value of the transaction itself.
ar: وكمثال على ذلك ، فإن المعاملة القياسية والبسيطة نسبيًا على شبكة داش مع أحد المدخلات ومخرج واحد وعنوان تغيير محتمل تتناسب عادة في نطاق 200 - 400 بايت. بافتراض سعر 800 دولار لكل داش ، فإن الرسوم تقع في نطاق 0.0015 دولار - 0.0030 دولار أو أقل من نصف سنت. ستؤدي معالجة المعاملة باستخدام الإرسال الفوري بنفس السعر إلى إضافة 0.08 دولار أو ثمانية سنتات إلى المعاملة. تنطبق هذه الرسوم بغض النظر عن قيمة الداش أو الدولار للمعاملة نفسها.
ko: 예컨대, 표준 거래이자 하나의 입력값을 가짐으로써 대시 네트워크 상에서 상대적으로 간단한 거래인 경우 일반적으로 하나의 입력값과 하나의 잠재적 변경 주소가 필요하며, 이는 약 200-400 바이트 수준입니다. 대시당 가격이 $800라고 가정하는 겨우 수수료 범위는 $0.0015~$0.0030이거나 혹은 0.5센트에 훨씬 못미치게 됩니다. 같은 가격에서 인스턴트샌드를 통한 거래를 처리하는 경우 $0.08 혹은 8센트가 수수료로서 거래에 추가될 수 있습니다. 이들 수수료는 거래 자체의 대시 혹은 달러 가치와 관계 없이 부과됩니다.

source: PrivateSend works by creating denominations of 10, 1, 0.1 and 0.01 DASH and then mixing these denominations with other users. Creation of the denominations is charged at the default fee for a standard transaction. Mixing is free, but to prevent spam attacks, an average of one in ten mixing transactions are charged a fee of 0.001 DASH. Spending inputs mixed using PrivateSend incurs the usual standard or InstantSend fees, but to avoid creating a potentially identifiable change address, the fee is always rounded up to the lowest possible denomination. This is typically .01 DASH, so it is important to deduct the fee from the amount being sent if possible to minimise fees. Combining InstantSend and PrivateSend may be expensive due to this requirement and the fact that a PrivateSend transaction may require several inputs, while InstantSend charges a fee of 0.0001 DASH per input. Always check your fees before sending a transaction.
ar: يعمل الإرسال المخفي عن طريق إنشاء فئات من 10 و 1 و 0.1 و 0.01 داش ثم مزج هذه الفئات مع مستخدمين آخرين. يتم فرض رسوم إنشاء الرسوم على الرسم الافتراضي للمعاملة القياسية. الخلط مجاني ، ولكن لمنع هجمات الرسائل غير المرغوب فيها ، يتم تحصيل رسوم قدرها 0.001 داش في المتوسط من واحد إلى عشرة من معاملات المزج. إن إنفاق الإدخالات المختلطة باستخدام الإرسال المخفي يتكبد رسوم قياسية أو الإرسال الفوري المعتادة ، ولكن لتجنب إنشاء عنوان تغيير يمكن تحديده ، يتم دومًا تقريب الرسوم إلى أدنى فئة ممكنة. هذا هو عادة .01 داش ، لذا من المهم خصم الرسوم من المبلغ الذي يتم إرساله إن أمكن لتقليل الرسوم. قد يكون الجمع بين الإرسال الفوري و الإرسال المخفي مكلفًا بسبب هذا المطلب وحقيقة أن معاملة الإرسال المخفي قد تتطلب العديد من المدخلات ، بينما تقوم الإرسال الفوري بتحصيل رسوم قدرها 0.0001 داش لكل إدخال. تحقق دائما من الرسوم الخاصة بك قبل إرسال المعاملات.
ko: 프라이빗샌드는 10, 1, 0.1 및 0.01 대시의 분할 단위를 생성함으로써 작동합니다. 이후 이러한 분할 단위를 다른 사용자들과 믹싱합니다. 분할 단위의 생성은 표준 거래를 기준으로 기본 수수료가 부과됩니다. 믹싱은 무료이나, 스팸 공격을 피하기 위해 믹싱 거래의 10분의 1은 0.001대시의 수수료가 책정됩니다. 프라이빗샌드를 사용하여 믹싱된 입력값을 사용하는 것은 일반 표준 혹은 인스턴트샌드 수수료를 발생시킬 수 있으나, 식별 가능한 변경 주소 생성을 피하기 위하여 수수료는 언제나 가장 작은 분할 단위로 라운드업 됩니다. 이는 일반적으로 0.01대시이며, 따라서 보내기 금액으로부터 이 수수료를 차감함으로써 수수료를 최소화할 수 있습니다. 인스턴트샌드와 프라이빗샌드를 결합하는 것은 이러한 요구 조건 및 프라이빗샌드 거래에 수 개의 입력값이 필요할 수 있다는 사실 때문에 값비싼 수수료를 지불해야 하는 경우가 발생할 수 있습니다. 반면 인스턴트샌드는 입력값당 0.0001대시만을 부과합니다. 거래를 진행하기 전에 언제나 수수료를 확인하실 것을 권장합니다.

source: Evolution
ar: التورة
ko: 에볼루션(Evolution)
zh_cn: 进化版

source: `Dash Evolution <https://www.dash.org/evolution/>`_ is the code name for a decentralized currency platform built on Dash blockchain technology. The goal is to provide simple access to the unique features and benefits of Dash to assist in the creation of decentralized technology. Dash introduces a tiered network design, which allows users to do various jobs for the network, along with decentralized API access and a decentralized file system.
ar: `تورة داش <https://www.dash.org/evolution/>`_ هو الاسم الرمزي لمنصة العملة اللامركزية المبنية على تقنية داش بلوكشين. الهدف هو توفير وصول بسيط للميزات الفريدة والفوائد من داش للمساعدة في خلق التكنولوجيا اللامركزية. تقدم داش تصميمًا متدرجًا للشبكة ، والذي يتيح للمستخدمين القيام بوظائف مختلفة للشبكة ، إلى جانب الوصول غير المشروط إلى واجهة برمجة التطبيقات API ونظام الملفات اللامركزية.
ko: `대시 에볼루션 <https://www.dash.org/evolution/>`_ 은 대시 블록체인 기술을 바탕으로 구축된 분산화된 통화 플랫폼의 코드 네임입니다. 에볼루션의 목표는 분산화된 기술의 창출을 돕기 위하여 대시의 독특한 기능과 이점에 쉬운 접근을 제공하는 것입니다. 대시는 분산화된 API 액세스 및 분산화된 파일 시스템과 더불어 사용자들이 네트워크를 위해 다양한 작업을 할 수 있는 계층형 네트워크 설계를 제안합니다.
vi: `Dash Evolution <https://www.dash.org/evolution/>`_ là tên mã cho một nền tảng tiền phi tập trung được xây dựng trên công nghệ blockchain của Dash. Mục đích là cung cấp cách truy cập đơn giản đến những tính năng độc đáo và lợi ích của Dash nhằm hỗ trợ việc tạo ra công nghệ phi tập trung. Dash giới thiệu một thiết kế mạng phân tầng, nó cho phép người dùng thực hiện rất nhiều công việc trên mạng lưới, cùng với việc truy cập một phi tập trung và một hệ thống file phi tập trung.

source: Dash Evolution will be released in stages. Dash Core releases 12.1 through to 12.4 will lay the groundwork for the decentralized features behind the scenes. An alpha version of Evolution is expected in the first half of 2018, including a basic implementation of DashDrive, Primitives, DAPI and a simple T3 wallet. This will be released together with a series of Dash Improvement Proposals (DIPs), followed by a testnet phase with most basic functionality, and a first stable release in summer 2018.
ar: سيتم طرح تورة داش على مراحل. إصدارات داش كور من 12.1 إلى 12.4 ستضع الأساس للميزات اللامركزية وراء الكواليس. من المتوقع إصدار نسخة ألفا من داش في النصف الأول من عام 2018 ، بما في ذلك التنفيذ الأساسي لـ حملة داش و Primitives و DAPI ومحفظة T3 بسيطة. سيتم إصدار هذا مع سلسلة من تحسينات داش لتحسين (DIPs) ، تليها مرحلة تيست نت مع معظم الوظائف الأساسية ، وأول إصدار مستقر في صيف عام 2018.
ko: 대시 에볼루션은 다양한 단계를 거쳐 출시될 예정입니다. 대시 코어는 12.1부터 12.4를 출시하여 에볼루션의 이면에 있는 분산화된 기능을 위한 발판을 다질 예정입니다. 에볼루션의 알파 버전은 2018년 초에 출시될 것으로 예상되고 있으며, 여기에는 대시드라이브(DashDrive), 기초적 요소, DAPI 및 간단한 T3 지갑의 구현 등이 포함될 예정입니다. 또한 일련의 대시 개선 제안(Dash Improvement Proposals, DIPs)이 함께 출시될 것이며, 뒤이어 가장 기본적 기능을 갖춘 테스트넷 단계를 거쳐 2018년 여름 안정적 첫 출시가 이루어질 예정입니다.
vi: Dash Evolution sẽ được công bố theo các giai đoạn. Dash Core với các phiên bản từ 12.1 đến 12.4 sẽ đặt nền tảng cho các tính năng phi tập trung ở phần hậu cảnh. Phiên bản Alpha của Evolution dự kiến sẽ ra mắt vào nửa đầu năm 2018, bao gồm tính năng cơ bản của DashDrive, Primitives, DAPI và một ví T3 đơn giản. Nó cũng được giới thiệu cùng với một loạt các Đề xuất Cải tiến Dash (DIPs), tiếp theo bởi giai đoạn testnet cùng với những tính năng cơ bản nhất, và phiên bản ổn định đầu tiên sẽ được ra mắt vào mùa hè năm 2018.

source: **DashDrive:** A decentralized shared file system for user data that lives on the second tier network
ar: **حملة داش:** نظام ملفات مشترك غير مركزي لبيانات المستخدم التي تعيش على شبكة الطبقة الثانية
ko: **대시드라이브(DashDrive):** 두 번째 계층 네트워크상의 사용자 데이터를 위한 분산화된 공유 파일 시스템 입니다.
vi: **DashDrive:** Một hệ thống chia sẻ file cho dữ liệu của người dùng được lưu trữ trên mạng bậc hai

source: **Quorum Chain:** This feature introduces a permanent stable masternode list, which can be used to calculate past and present quorums
ar: **سلسلة النصاب القانوني:** تقدم هذه الميزة قائمة ماسترنود ثابتة دائمة ، والتي يمكن استخدامها لحساب النصاب في الماضي والحاضر
ko: **쿼럼 체인(Quorum Chain):** 이 기능은 영구적으로 안정적인 마스터노드 리스트를 소개하며, 이로써 과거와 현재의 쿼럼을 계산하는 데 사용될 수 있습니다.
vi: **Chuỗi quorum:** Tính năng này đưa ra một danh sách masternode ổn định, nó có thể được dùng để tính toán những quorum trong quá khứ và hiện tại

source: **Social Wallet:** We introduce a social wallet, which allows friends lists, grouping of users and shared multisig accounts.
ar: **المحفظة الاجتماعية:** نقدم محفظة اجتماعية تسمح بقوائم الأصدقاء وتجميع المستخدمين وحسابات multisig المشتركة.
ko: **소셜 지갑:** 친구 목록, 사용자 그룹 지정 및 다중 서명 계정 공유를 지원하는 소셜 지갑을 소개합니다.
vi: **Social Wallet:** Chúng tôi giới thiệu một social wallet hay còn gọi là ví xã hội, nó cung cấp tính năng danh sách bạn bè, nhóm người dùng, và các tài khoản chia sẻ đa chữ ký.

source: In order to fully obscure your funds, your wallet must repeat this process a number of times with each denomination. Each time the process is completed, it's called a "round". Each round of PrivateSend makes it exponentially more difficult to determine where your funds originated. The user may choose between 1-16 rounds of mixing.
de: Um die Beträge wirklich zu verschleiern, muss die Wallet diesen Vorgang mehrmals mit allen Denominationen wiederholen. Jedes Mal, wenn der Prozess vollständig durchgeführt wurde, wird dies als eine „Runde“ bezeichnet. Jede PrivateSend-Runde erhöht die Schwierigkeit den Ursprung eines Betrages herauszufinden. Die Nutzer können sich dafür entscheiden, den Mischvorgang 1-16 Runden zu wiederholen.

source: The release of Dash 0.12.2.0 and activation of DIP0001 saw a simultaneous reduction of fees by a factor of 10, while the block size was increased from 1MB to 2MB to promote continued growth of low-cost transactions even as the cost of Dash rises. Dash also supports :ref:`instantsend` and :ref:`privatesend` transactions, which operate on a different and mandatory fee schedule. Dash 0.13.0.0 introduced InstantSend autolocks, which causes masternodes to automatically attempt to lock any transaction with 4 or fewer inputs — which are referred to as “simple” transactions — and removes the additional fee for InstantSend. The fee schedule for Dash 0.13.x as of December 2018 is as follows:
de: Die Veröffentlichung von Dash 0.12.2.0 und die Aktivierung von DIP0001 reduzierte gleichzeitig die Gebühr um den Faktor 10 und erhöhte die maximale Blockgröße von 1MB auf 2MB, damit eine größere Zahl an günstigen Transaktionen verarbeitet werden konnte, auch wenn der Dash-Preis steigen sollte. Dash unterstützt außerdem :ref:`instantsend` und :ref:`privatesend` Transaktionen, welche eine andere und nicht-freiwillige Gebührenstruktur verwenden. Dash 0.13.0.0 führte den automatischen InstantSend ein, durch den die Masternodes jede Transaktion mit 4 oder weniger Inputs - die auch als "einfache" Transaktion bezeichnet werden - sichern, wodurch die Zusatzkosten für InstantSend entfallen. Die Gebührenstruktur für Dash 0.13.x sieht seit Dezember 2018 wie folgt aus:

source: PrivateSend works by creating denominations of 10, 1, 0.1, 0.01 and 0.001 DASH and then mixing these denominations with other users. Creation of the denominations is charged at the default fee for a standard transaction. Mixing is free, but to prevent spam attacks, an average of one in ten mixing transactions are charged a fee of 0.0001 DASH. Spending inputs mixed using PrivateSend incurs the usual standard or InstantSend fees, but to avoid creating a potentially identifiable change address, the fee is always rounded up to the lowest possible denomination. This is typically .001 DASH, so it is important to deduct the fee from the amount being sent if possible to minimise fees. Combining InstantSend and PrivateSend may be expensive due to this requirement and the fact that a PrivateSend transaction may require several inputs, while InstantSend charges a fee of 0.0001 DASH per input. Always check your fees before sending a transaction.
de: PrivateSend kreiert Denominationen zu je 10, 1, 0.1, 0.01 und 0.001 Dash und mischt diese Denominationen mit denen anderer Nutzer. Die Schaffung der Denomination wird als normale Transaktionsgebühr verrechnet. Das Mischen ist kostenlos, doch um Spam-Angriffe zu verhindern, muss ca. jede zehnte Runde eine Gebühr von 0.0001 Dash bezahlt werden. Das Versenden einer PrivateSend-Transaktion kostet die gleiche Gebühr, wie eine normale Transaktion, doch um das Identifizieren des Nutzers durch die Wechselgeldadresse zu verhindern, wird die Gebühr immer auf die nächst-höhere Denomination aufgerundet. Dies ist typischerweise .001 Dash, weswegen es wichtig ist, die Gebühr vom Transaktionsbetrag abzuziehen, damit die Gebühr minimiert werden kann, wenn dies möglich ist. InstantSend und PrivateSend zu verbinden kann aus diesem Grund erhöhte Kosten verursachen, aber auch aus dem Grund, dass eine PrivateSend-Transaktion meistens mehrere Inputs benötigt und InstantSend pro Input 0.0001 Dash berechnet. Daher sollten die Nutzer jedes Mal die Gebühr im Auge behalten, wenn sie eine Transaktion durchführen.
