Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ar, de, fr, ko, vi, zh_cn

source: Given the speculative nature of digital currencies and their inherent uncertainties as a new field, the X11 algorithm can provide increased confidence for its users and potential investors that single-hash approaches cannot. Chained hashing solutions, like X11, provide increased safety and longevity for store of wealth purposes, investment diversification and hedging against risks associated with single-hash currencies plagued by SPOF (Single Point Of Failure).
ar: بالنظر إلى طبيعة المضاربة للعملات الرقمية وأوجه عدم اليقين المتأصلة لديها كحقل جديد ، يمكن لخوارزمية X11 أن توفر ثقة متزايدة لمستخدميها والمستثمرين المحتملين الذين لا تستطيع مقاربات التجزئة الفردية. توفر حلول التجلد المتسلسلة ، مثل X11 ، مزيدًا من الأمان وطول العمر لتخزين أغراض الثروة وتنويع الاستثمار والتحوط ضد المخاطر المرتبطة بعملات التجزئة المفردة التي تعاني من SPOF (نقطة واحدة من الفشل).
de: In der spekulativen Welt der Kryptowährungen mit ihrer innewohnenden Unsicherheit kann der Ansatz des X11-Algorithmus Nutzern und möglichen Investoren eine Sicherheit bieten, die von Algorithmen, die auf einen Hash vertrauen, nicht geboten werden kann. Verkettete Hash-Lösungen, wie X11, bieten die erhöhte Sicherheit und Langfristigkeit, die für einen Wertspeicher, Investitionsdiversifikation und Hedging gegen Preisrisiken durch SPOF (Single Point Of Failure) notwendig sind.
fr: Au vu de la nature spéculative des monnaies numériques et des incertitudes qui sont celles de ce domaine neuf, l'algorithme X11 donne une confiance accrue à ses utilisateurs et aux investisseurs potentiels, au contraire d'une approche à algorithme unique. Les solutions de hachage chaîné, telles que X11, permettent une meilleure sécurité et longévité pour des objectifs de réserve de valeur, de diversification d'investissement et de réduction des risques associés aux monnaies à algorithme unique (points de vulnérabilité uniques).
ko: 디지털 통화의 투기적 성격 및 새로운 분야로서의 내재된 불확실성을 고려하면, X11 알고리즘은 사용자와 잠재적 투자자에게 단일 해시 접근법이 보장하지 못하는 향상된 신뢰를 부여합니다. X11과 같은 체인 해싱 솔루션은 가치의 저장 및 투자 다양성 측면에서 보다 나은 안전성과 지속성을 제공하며, SPOF(Single Point Of Failure)로 인해 어려움에 직면하는 단일 해시와 관련한 헤지 위험성을 낮추어줍니다.
vi: Với đặc tính đầu cơ của các loại tiền kỹ thuật số và những tính chất không chắc chắn được thừa kế của nó như là một lĩnh vực mới, thì thuật toán X11 có thể cung cấp sự tự tin cao hơn cho người dùng cũng như những nhà đầu tư tiềm năng mà cách tiếp cận sử dụng một thuật toán đơn không giải quyết được. Giải pháp sử dụng chuỗi các thuật toán băm như X11, cung cấp sự an toàn nâng cao và tính bền vững hơn trong mục đích gìn giữ giá trị, đa dạng hoá đầu tư và bảo hiểm trước những rủi ro liên quan như vấn đề SPOF (Một điểm Chịu lỗi Đơn lẻ) của các loại tiền điện tử sử dụng một thuật toán băm đơn.
zh_cn: 鉴于数字货币的投机属性以及作为新领域固有的不确定性，X11算法能给其用户和潜在投资者增加信心，这一点是单一算法所不能做到的。链式算法解决方案，如X11，提升了安全性，延长了以财富为目的的存储寿命，增加了投资多样性，对冲了由于SPOF（单点故障）带来的单一算法货币的风险。

source: Evan Duffield, the creator of Dash and X11 chained-hash, has written on several occasions that X11 was integrated into Dash not with the intention to prevent ASIC manufacturers from creating ASICs for X11 in the future, but rather to provide a similar migratory path that Bitcoin had (CPUs, GPUs, ASICs).
ar: كتب إيفان دوفيلد ، مبتكر داش و X11 بالسلاسل ، في عدة مناسبات أن X11 قد تم دمجها في داش ليس مع نية منع مصنعي ASIC من إنشاء ASICs ل X11 في المستقبل ، بل لتوفير مسار مماثل للهجرة كان بيتكوين (وحدات المعالجة ، GPUs ، ASICs).
de: Evan Duffield, der Erfinder von Dash und des verketteten X11-Hashes, gab mehrmals an, dass X11 nicht implementiert worden sei, um zu verhindern, dass ASIC-Hertseller jemals X11-ASICs herstellen werden, sondern damit ein ähnlicher Wachstumspfad, wie beim Bitcoin beschritten werden konnte (CPUs, GPUs, ASICs)
fr: Evan Duffield, créateur de Dash et du hachage chaîné X11, a écrit à diverses reprises qu'X11 avait été intégré à Dash non pas pour empêcher les fabricants d'ASIC de créer des ASICs X11, mais plutôt pour préparer un chemin similaire à celui de Bitcoin (CPUs, GPUs, ASICs).
ko: 대시 및 X11 체인 해시를 만든 에반 듀필드는 비트코인이 걸었던 것과 유사한 이동로(CPUs, GPUs, ASICs)를 따르는 대신, 장래에 ASIC 제조사들이 X11을 위한 ASIC을 제조하는 것을 방해하지 않으면서도 X11을 대시에 통합하는 다양한 상황에 대해 기술한 바 있습니다.
vi: Evan Duffield, người sáng lập của Dash và chuỗi thuật toán băm X11, đã một số lần viết rằng việc tích hợp X11 vào Dash không nhằm mục đích ngăn chặn các nhà sản xuất tạo ra chip ASIC cho thuật toán X11 trong tương lai, mà chỉ cung cấp cách chuyển đổi tương tự như Bitcoin là có (CPU, GPU, và ASIC).
zh_cn: Evan Duffield, 达世币和X11算法的创始人，在很多场合都已经写过，将X11整合在达世币中，目的不是要阻止ASIC制造商来将来制造出针对X11的矿机，更多是提供一个跟比特币相似的发展路径（CPUs, GPUs, ASICs）。

source: **DGW** or *Dark Gravity Wave* is an open source difficulty-adjusting algorithm for Bitcoin-based cryptocurrencies that was first used in Dash and has since appeared in other digital currencies. DGW was authored by Evan Duffield, the developer and creator of Dash, as a response to a time-warp exploit found in *Kimoto's Gravity Well*. In concept, DGW is similar to the Kimoto Gravity Well, adjusting the difficulty levels every block (instead of every 2016 blocks like Bitcoin) based on statistical data from recently found blocks. This makes it possible to issue blocks with relatively consistent times, even if the hashing power experiences high fluctuations, without suffering from the time-warp exploit.
ar: **DGW** أو *موجة الجاذبية الداكنة* هو خوارزمية ضبط صعوبة مفتوحة المصدر ل العملات الرقمية المستندة إلى بيتكوين التي استخدمت لأول مرة في داش ومنذ ذلك الحين ظهرت في العملات الرقمية الأخرى. من تأليف إيفان دوفيلد ، مطور ومبدع داش ، كإستجابة لسرقة تشوه زمنًا وجدت في *بئر كيموتو الجاذبية* في المفهوم DGW مشابه ل بئر كيموتو الجاذبية ، وضبط مستويات الصعوبة في كل كتلة (بدلا من كل الكتل عام 2016 مثل بيتكوين) استناداً إلى البيانات الإحصائية من كتل تم العثور عليها مؤخرا. هذا يجعل من الممكن إصدار كتل ذات أوقات متناسقة نسبياً ، حتى إذا واجهت طاقة التجزئة تقلبات عالية ، دون المعاناة من استغلال وقت الإعوجاج.
de: **DGW** oder *Dark Gravity Wave* ist der Name des Open Source-Schwierigkeitsanpassungsalgorithmus, der von Kryptowährungen, die auf Bitcoin basieren, verwendet werden kann. Es wurde zuerst von Dash verwendet, fand in der Zwischenzeit jedoch auch Einzug in andere Protokolle. DGW wurde von Evan Duffield, dem Entwickler und Gründer von Dash, als Antwort auf die Time-Warp-Sicherheitslücke des *Kimoto Gravity Well* herausgebracht. Vom Konzept her ähnelt DGW dem Kimoto Gravity Well, wobei die Schwierigkeit mit jedem Block angepasst wird (statt mit jedem 2016ten, wie dies bei Bitcoin der Fall ist). Als Grundlage der Anpassung werden aktuelle statistische Daten aus den letzten Blöcken verwendet. Dies ermöglicht die regelmäßige Schaffung neuer Blöcke, selbst wenn die Hashrate hohen Fluktuationen unterliegen sollte, ohne, dass die Time-Warp-Sicherheitslücke ein Problem darstellen sollte.
fr: **DGW** ou *Dark Gravity Wave* est un algorithme open source d'ajustement de difficulté pour les cryptomonnaies basées sur Bitcoin. Il a été d'abord utilisé dans Dash, puis s'est répandu dans d'autres monnaies numériques. DGW a été créé par Evan Duffield, programmeur et créateur de Dash, en tant réponse à une faille “time-warp" découverte dans *Kimoto's Gravity Wave*. Dans son concept, DGW est analogue à Kimoto's Gravity Wave, en ajustant les niveaux de difficulté avec chaque bloc (au lieu de tous les 2016 blocs comme dans Bitcoin), sur la base de statistiques tirées des blocs récemment minés. Cela permet de diffuser des blocs avec une fréquence relativement constante, même si la puissance de hachage connaît de fortes variations, et sans craindre la faille “time-warp".
ko: **DGW** 혹은 *다크 그래비티 웨이브Dark Gravity Wave*\ 는 비트코인을 바탕으로 한 암호화폐를 위한 오픈 소스 난이도 조절 알고리즘으로, 대시에 처음 사용된 이래로 다른 암호화폐에서도 사용되고 있습니다. DGW 는 *키모토의 그래비티 웰Kimoto's Gravity Well* 에서 발견된 타임랩 취약점 공격에 대한 대응으로서 대시의 개발자이자 창립자인 에반 듀필드에 의해 씌었습니다. 개념상, DGW 는 최근에 발견된 블록으로부터의 통계적 데이터를 기반으로 하여 (비트코인의 2016 블록 대신)매 블록의 난이도를 조정한다는 점에서 키모토 그래비티 웰과 유사합니다. 이는 만일 해싱 파워가 심각한 변동을 겪더라도 타임랩 취약점 공격을 받지 않고 상대적으로 일관된 시간에 블록을 생성할 수 있도록 도와줍니다.
vi: **DGW** hay *Dark Gravity Wave* là một thuật toán mã nguồn mở để điều chỉnh độ khó cho các loại tiền điện tử dựa trên Bitcoin, nó lần đầu tiên được sử dụng ở Dash và sau đó xuất hiện trên nhiều loại tiền điện tử khác. DGW được sáng tạo ra bởi Evan Duffield, cũng là người sáng lập ra Dash, để xử lý cho vấn đề bù-thời-gian được tìm thấy ở *Kimoto's Gravity Well*. Khái niệm về DGW cũng tương tự như thuật toán Kimoto Gravity Well, là điều chỉnh mức độ khó ở mỗi block (thay vì mỗi 2016 block giống như ở Bitcoin) dựa trên những dữ liệu thống kê được tìm thấy từ những block gần nhất. Nó cũng làm cho việc sinh khối với khoảng thời gian tương đối đồng nhất, thậm chí ngay cả khi tổng tốc độ băm dao động mạnh, mà không phải gánh chịu lỗi bù-thời-gian.
zh_cn: **DGW**\ 或暗黑重力波是一种开源的难度可调的，为以比特币为基础的加密数字货币提供的算法，最开始时在达世币中使用，自此之后也已经出现在其它数字货币中。DGW由达世币的开发者和创建者Evan Duffield编写，以应对Kimoto’s Gravity Well算法中发现的时间隐藏剥削问题。理念上，DGW与Kimoto Gravity Well相似，基于最近发现的区块中的统计数据，调节每个区块难度级别（而不是像比特币那样每2016个区块调节）。这样，即使算力正面临很大的波动，也可以分配给每个区块相对一致的时间，避免遭受时间隐蔽剥削。

source: Version 2.0 of DGW was implemented in Dash from block 45,000 onwards in order to completely alleviate the time-warp exploit.
ar: نسخة 2.0 من DGW تم تنفيذ في داش من كتلة 45000 فصاعدا من أجل التخفيف تماما من استغلال الوقت الاعوجاج.
de: Version 2.0 der DGW wurde mit Block 45000 in Dash implementiert, damit der Time-Warp Fehler vollständig überwunden werden konnte.
fr: La version 2.0 de DGW a été implémentée dans Dash à partir du bloc 45000, afin de supprimer complètement le risque de la faille “time-warp".
ko: 버전 2.0의 DGW 는 타임랩 취약점 공격을 완전히 경감하기 위하여 대시의 45,000 블록 이래로 구현되었습니다.
vi: Phiên bản 2.0 của DGW đã được thực hiện ở Dash từ khối 45,000 trở về sau để hoàn toàn làm giảm nhẹ loại lợi dụng làm-lệch-thời-gian.
zh_cn: 达世币在45,000个区块后执行了DGW的2.0版本，为了全面减少时间隐蔽剥削的问题。

source: Version 3.0 was implemented on May 14 of 2014 to further improve difficulty re-targeting with smoother transitions. It also fixes issues with various architectures that had different levels of floating-point accuracy through the use of integers.
ar: تم تنفيذ الإصدار 3.0 في 14 مايو 2014 لزيادة تحسين صعوبة إعادة الاستهداف بتحويلات أكثر سلاسة. كما أنه يعمل على إصلاح المشكلات المتعلقة بالمعماريات المختلفة التي لها مستويات مختلفة من الدقة الفاصلة العائمة من خلال استخدام الأعداد الصحيحة.
de: Version 3.0 wurde am 14.05.2014 implementiert, damit ein glatterer Übergang beim Neuberechnen der Schwierigkeit gewährleistet werden konnte. Zudem wurden durch das Verwenden von Integers mehrere Probleme in der Konstruktion gelöst, die bis dahin verschiedene Grade an Gleitpunktgenauigkeit kannte.
fr: La version 3.0 a été implémentée le 14 mai 2014 pour améliorer davantage le recalcul de la difficulté, avec des transitions plus douces. Elle a aussi corrigé des problèmes rencontrés sur certaines architectures qui avaient différents niveaux de précision de virgule flottante.
ko: 버전 3.0은 더 부드러운 전환을 거쳐 난이도 재조정을 향상시키기 위하여 2014년 5월 14일 구현되었습니다. 이는 또한 정수의 사용을 통하여 다양한 레벨의 부동 소수점 정확성과 관련된 이슈를 개선합니다.
vi: Phiên bản 3.0 được thực hiện vào ngày 14 tháng 5 năm 2014 để tiếp tục cải tiến điều chỉnh độ khó với sự chuyển đổi mượt hơn. Nó cũng xử lý vấn đề với nhiều kiến trúc mà có nhiều cấp độ khác nhau của độ chính xác của dấu chấm động thông qua việc sử dụng số nguyên.
zh_cn: 3.0版本是在2014年5月14日执行的，通过平稳过渡，进一步提升了难度重新定位。这个版本还解决了很多架构中所出现的，由于整数算法引起的不同程度的浮点精确度问题。

source: Emission Rate
ar: معدل الانبعاثات
de: Emissionsrate
fr: Taux d'émission
ko: 방출 비율
vi: Tốc độ phát sinh
zh_cn: 发行率

source: Cryptocurrencies such as Dash and Bitcoin are created through a cryptographically difficult process known as mining. Mining involves repeatedly solving :ref:`hash algorithms <x11-hash-algorithm>` until a valid solution for the current :ref:`mining difficulty <dark-gravity-wave>` is discovered. Once discovered, the miner is permitted to create new units of the currency. This is known as the block reward. To ensure that the currency is not subject to endless inflation, the block reward is reduced at regular intervals, as `shown in this calculation <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. Graphing this data results in a curve showing total coins in circulation, known as the coin emission rate.
ar: يتم إنشاء العملات الرقمية مثل داش و بيتكوين من خلال عملية صعبة مشفرة تعرف باسم التعدين. التعدين ينطوي على حل متكرر :ref:`خوارزمية <x11-hash-algorithm>` حتى حل صالح للتيار :ref:`التعدين الصعب <dark-gravity-wave>` اكتشف. بمجرد اكتشافها ، يسمح لعمال المنجم بإنشاء وحدات جديدة للعملة. هذا هو المعروف باسم مكافأة كتلة. للتأكد من أن العملة لا تخضع للتضخم اللانهائي ، يتم تقليل مكافأة الكتلة على فترات منتظمة ، `كما هو مبين في هذا الحساب <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. يؤدي رسم هذه البيانات إلى ظهور منحنى يوضح إجمالي العملات المتداولة ، والمعروفة باسم معدل انبعاث العملة.
de: Kryptowährungen wie Dash und Bitcoin werden durch einen kryptographisch-schwierigen Prozess namens Mining geschaffen. Zum Mining gehört das wiederholte Lösen eines :ref:`Hash-Algorithmus <x11-hash-algorithm>` bis eine gültige Lösung zur momentanen :ref:`Mining-Schwierigkeit <dark-gravity-wave>` gefunden werden konnte. Sobald die Lösung gefunden wurde, darf der Miner eine neue Einheit der Währung erschaffen. Diese wird gemeinhin als Block-Reward bezeichnet. Der Block-Reward wird mit der Zeit immer geringer, damit eine fortschreitende Inflation verhindert werden kann. `Anhand dieser Berechnung <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_ kann die regelmäßige Reduktion der Block-Rewards nachvollzogen werden. Wenn diese Werte in eine Grafik umgewandelt werden, ergibt sich eine Kurve der momentan zirkulierenden Coins, die die Emissionsrate des Coins darstellt.
fr: Les cryptomonnaies telles que Dash et Bitcoin sont créées par une procédure cryptographiquement complexe, connue sous le nom de minage. Le minage suppose de résoudre des :ref:`algorithmes de hachage <x11-hash-algorithm>` jusqu'à ce que soit découverte une solution correspondant à la :ref:`difficulté de minage <dark-gravity-wave>` courante. Une fois découverte, le mineur est autorisé à créer de nouvelles unités de cryptomonnaie. Cela constitue la récompense de bloc. Pour garantir que la monnaie ne fera pas l'objet d'une inflation illimitée, la récompense de bloc est diminuée à intervalles réguliers, comme `montré dans cette simulation <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. La représentation graphique donne une courbe montrant la totalité des unités en circulation, connue sous le nom de taux d'émission des unités.
ko: 대시나 비트코인과 같은 암호화폐는 암호학적으로 어려운 과정인 채굴을 통하여 생성됩니다. 채굴은 당시의 채굴 난이도를 위한 유효한 정답이 발견될 때까지 반복적으로 해시 알고리즘을 푸는 과정을 포함합니다. 일단 이 정답이 발견되면, 채굴자는 해당 통화의 새로운 단위를 생성합니다. 이는 블록 보상이라고도 알려져 있습니다. 해당 통화가 끝없는 인플레이션을 겪지 않게 하기 위하여 블록 보상은 `이 공식에서 보이는 바와 같이 일정한 간격으로 감소합니다 <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. 이 데이터의 도식화는 현재 유통중인 총 코인을 그래프로 보여줍니다. 이는 코인 방출 비율Emission rate이라고도 불립니다.
vi: Các loại tiền kỹ thuật số như Dash và Bitcoin được tạo ra thông qua một tiến trình giải quyết vấn đề khó về lĩnh vực mật mã học gọi là đào coin. Đào coin liên quan đến việc liên tục phải giải quyết :ref:`các thuật toán băm <x11-hash-algorithm>` đến khi tìm được lời giải phù hợp cho :ref:`cái khó của đào coin<dark-gravity-wave>`. Một khi giải pháp được tìm ra, thợ mỏ được phép tạo ra một số đơn vị tiền mới. Cái này gọi là phần thưởng khối. Để đảm bảo cho việc đồng tiền không bị lạm phát vô hạn, phần thưởng khối được thiết kế để giảm dần theo thời gian, như `trong tính toán này <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. . Biểu đồ hiển thị kết quả dữ liệu trong một đường cong cho thấy tổng số lượng coin được lưu thông, nó được biết với cái tên là tỷ lệ phát sinh coin.
zh_cn: 加密数字货币如达世币和比特币，都是通过一种加密难度处理过程来产生的，称之为挖矿。挖矿需要不停地解决\ :ref:`哈希算法 <x11-hash-algorithm>`\ 直到当前\ :ref:`难题 <dark-gravity-wave>`\ 的有效解决方法被找到。一旦找到，矿工就会被允许生产新的货币单元。这就是大家都了解的区块奖励。为了保证货币不会受到无止境的通胀影响，区块奖励会被减少到一个正常的区间。以下\ `显示的是计算方式 <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_\ 。将这些数据做成图表就会形成一个显示所有流通货币的曲线，称之为货币的发行速率。

source: While Dash is based on Bitcoin, it significantly modifies the coin emission rate to offer a smoother reduction in coin emission over time. While Bitcoin reduces the coin emission rate by 50% every 4 years, Dash reduces the emission by one-fourteenth (approx. 7.14%) every 210240 blocks (approx. 383.25 days). It can be seen that reducing the block reward by a smaller amount each year offers a smoother transition to a fee-based economy than Bitcoin.
ar: بينما تستند داش على بيتكوين ، فإنها تعدِّل معدل انبعاث العملة بشكل كبير لتقديم تخفيض أكثر سلاسة في انبعاثات العملات مع مرور الوقت. في حين تعمل بيتكوين على تقليل معدل انبعاث العملة بنسبة 50٪ كل 4 سنوات ، فإن داش يقلل من الانبعاثات بمقدار واحد إلى أربعة عشر (حوالي 7.14٪) كل 210240 كتلة (حوالي 383.25 يومًا) يمكن ملاحظة أن خفض المكافأة بمقدار أقل من كل عام يوفر انتقالًا أكثر سلاسة إلى الاقتصاد القائم على الرسوم من البيتكوين.
de: Auch wenn Dash auf Bitcoin basiert, hat es doch eine sehr stark veränderte Emissionsrate, durch die die Coin-Emission wesentlich weniger abrupt vonstatten geht. Während Bitcoin seine Emissionsrate alle 4 Jahre um 50 % senkt, findet bei Dash eine Reduktion um 1/14 (ca. 7,14 %) alle 210240 Blöcke (ca. 383,25 Tage) statt. Eine glattere Reduktion der Block-Rewards durch eine geringe Menge im Jahr kann den Übergang zur Finanzierung durch Transaktionsgebühren einfacher vonstattengehen lassen.
fr: Tout en étant basé sur Bitcoin, Dash modifie significativement le taux d'émission de manière à ce que sa diminution soit mieux lissée à travers le temps. Tandis que Bitcoin diminue le taux d'émission de 50% tous les 4 ans, Dash le diminue d'un quatorzième (environ 7,14%) tous les 210240 blocs (environ tous les 383,25 jours). On peut considérer que la moindre diminution de la récompense de bloc tous les ans constitue, par rapport à Bitcoin, une transition plus douce vers une économie basée sur les frais de transaction.
ko: 대시는 비트코인을 기반으로 하지만, 시간이 흐름에 따라 코인의 공급량을 보다 부드럽게 감소하기 위하여 코인 방출 비율을 크게 조정합니다. 비트코인이 코인 방출 비율을 매 4년마다 50퍼센트씩 감소하는 반면, 대시의 경우 매 210240블록(약 383.25일)마다 1/14(약 7.14%) 비율로 그 공급량이 감소합니다. 매년 감소하는 블록 보상의 양을 줄임으로써 비트코인에 비하여 수수료 기반의 경제로 더욱 부드럽게 전환하는 것이라고 볼 수 있습니다.
vi: Trong khi Dash dựa trên Bitcoin, nó cũng thay đổi rất nhiều tỷ lệ phát sinh coin để đưa ra khả năng giảm bớt lượng coin phát sinh một cách trơn tru hơn theo thời gian. Trong khi Bitcoin giảm lượng con phát sinh theo tỷ lệ 50% cứ mỗi 4 năm, thì Dash lại giảm dần lượng coin phát sinh Theo tỷ lệ 1/14 (xấp xỉ 7.14%) cứ mỗi 210240 khối (xấp xỉ 383.25 ngày). Chúng ta có thể thấy sự giảm phần thưởng khối bởi một lượng nhỏ dần mỗi năm làm cho sự chuyển đổi được trơn tru hơn về phía phần thưởng dựa dần về phí giao dịch so với Bitcoin.
zh_cn: 虽然达世币的创立是基于比特币，但是它很大程度地修改了货币的发行率，随着时间的推移，更加平缓地降低货币发行速率。比特币每4年将发行速率降低50%，而达世币是每210240区块（大约383.25天）降低1/14（约7.14%）。这样可以看出达世币每年减少的区块奖励幅度较小，从而为将来转向收取手续费的经济模型，提供了比比特币更为平缓的过渡。

source: Bitcoin vs. Dash coin emission rate
ar: معدل البيتكوين ضد انبعاث عملة داش
de: Bitcoin vs. Dash Coin-Emissionsrate
fr: Taux d'émission comparés Bitcoin/Dash
ko: 비트코인 vs. 대시 코인 방출 비율
vi: So sánh tốc độ phát sinh coin giữa Bitcoin và Dash
zh_cn: 比特币 vs. 达世币的发型速率

source: Total coin emission
ar: مجموع انبعاثات العملة
de: Gesamte Coin-Emission
fr: Émission totale de monnaie
ko: 총 코인 방출
vi: Tổng số coin phát sinh ra
zh_cn: 总发行量

source: `Bitcoin's total coin emission <https://docs.google.com/spreadsheets/d/1 2tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_ can be calculated as the sum of a geometric series, with the total emission approaching (but never reaching) 21,000,000 BTC. This will continue until 2140, but the mining reward reduces so quickly that 99% of all bitcoin will be in circulation by 2036, and 99.9% by 2048.
ar: `مجموع معدل عملة البيتكوين <https://docs.google.com/spreadsheets/d/1 2tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_ يمكن حسابه كمجموع سلسلة هندسية ، مع اقتراب إجمالي الانبعاثات (ولكن لا تصل أبداً) 21،000،000 بيتكوين. سيستمر هذا حتى عام 2140 ، ولكن مكافأة التعدين تقل بسرعة بحيث أن 99 ٪ من جميع البيتكوين سوف يتم تداولها بحلول عام 2036 ، و 99.9 ٪ بحلول عام 2048.
de: `Die gesamte Emission des Bitcoin <https://docs.google.com/spreadsheets/d/1 2tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_ kann als die Summe einer geometrischen Folge berechnet werden, durch sich die Gesamtemission 21000000 BTC annähert (aber diesen Wert nie erreicht). Der Vorgang wird sich bis 2140 fortsetzen, doch die Mining-Rewards sinken stetig, wodurch bis 2036 99 % und bis 2048 99,9 % aller Bitcoin existieren werden.
fr: `L'émission monétaire totale de Bitcoin <https://docs.google.com/spreadsheets/d/1 2tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_ peut être calculée comme la somme d'une série géométrique, avec une émission totale approchant (sans jamais l'atteindre) les 21 millions de BTC. L'émission durera jusqu'en 2140, mais la récompense de minage diminue si vite que 99% de tous les bitcoins seront en circulation dès 2036, et 99,9% dès 2048.
ko: `비트코인의 총 코인 방출 <https://docs.google.com/spreadsheets/d/1 2tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_\ 은 약 21,000,000 BTC에 가까운(그러나 절대 이 숫자에 도달하지 않는) 총 방출을 통해 등비 급수의 총합으로 계산될 수 있습니다. 이는 2140년까지 계속될 것이나, 채굴 보상은 빠르게 감소하여 2036년까지 전체 비트코인의 99%, 2048년까지 99.9%가 공급될 예정입니다.
vi: `Tổng số coin phát sinh của Bitcoin <https://docs.google.com/spreadsheets/d/1 2tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_ có thể được tính là tổng của một chuỗi hình học, với tổng số phát sinh tiệm cận (nhưng không bao giờ chạm tới) 21,000,000 BTC. Nó sẽ tiếp tục sinh đến tận năm 2140, nhưng phần thưởng khi đào coin sẽ giảm một cách nhanh chóng mà 99% của tất cả số bitcoin sẽ được lưu thông vào năm 2036, và 99.9% vào năm 2048.
zh_cn: `比特币的总发行量 <https://docs.google.com/spreadsheets/d/12tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_\ 是按几何级数计算出来的和，无限接近总发行量（但不达到）21,000,000个比特币。这个发行过程会持续到2140年，即时如此快速地降低挖矿奖励，但到2036年时就会有99%的比特币被挖出，而到2048年时达到总量的99.9%。
