Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ar, de, fr, ko, vi, zh_cn

source: `Dash's total coin emission <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_ is also the sum of a geometric series, but the ultimate total coin emission is uncertain because it cannot be known how much of the 10% block reward reserved for budget proposals will actually be allocated, since this depends on future voting behavior. Dash will continue to emit coins for approximately 192 years before a full year of mining creates less than 1 DASH. After 2209 only 14 more DASH will be created. The last DASH will take 231 years to be generated, starting in 2246 and ending when emission completely stops in 2477. Based on these numbers, a maximum and minimum possible coin supply in the year 2254 can be calculated to be between:
ar: `مجموع معدل إنبعات عملة داش <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_ هو أيضًا مجموع سلسلة هندسية ، ولكن إجمالي الانبعاثات النهائية للعملات غير مؤكّد لأنه لا يمكن معرفة كم من 10٪ من المكافآت المخصصة لمقترحات الميزانية سيتم تخصيصها بالفعل ، لأن ذلك يعتمد على سلوك التصويت المستقبلي. ستواصل داش إصدار العملات المعدنية لما يقرب من 192 عامًا قبل أن تخلق سنة كاملة من التعدين أقل من 1 داش. بعد عام 2209 سيتم إنشاء 14 داش فقط. سيستغرق إنشاء داش الأخير 231 عامًا بدءًا من عام 2246 وينتهي عند توقف البث تمامًا في 2477. استنادًا إلى هذه الأرقام ، يمكن حساب الحد الأقصى والحد الأدنى الممكن من العملة في العام 2254 ليكون بين:
de: `Dash's gesamte Coinemission <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_ ist die Summe einer geometrischen Reihe, doch die endgültige Gesamtzahl ist nicht berechenbar, da nicht sicher ist, wie viele der 10% der Block-Rewards, die für Budget-Proposal vorgesehen sind, auch ausbezahlt werden, da dies vom zukünftigen Wahlverhalten abhängt. Dash wird noch etwa 192 Jahre regelmäßig neue Coins herausgeben, bis die Rate so weit gesunken sein wird, dass in einem Jahr weniger als 1 neuer Dash entsteht. In den Jahrhunderten nach 2209 werden nur noch 14 neue Dash gemined werden, wobei das Mining des letzten Coins 231 Jahre dauern wird, also von 2246 bis 2477. Auf Grundlage dieser Nummern kann gesehen werden, dass bis 2254 folgende Zahlen als Maximum oder Minimum angenommen werden müssen:
fr: `L'émission monétaire totale de Dash <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_ est également la somme d'une série géométrique, mais l'émission totale et définitive reste incertaine, car on ne peut pas savoir combien des 10% de récompense de bloc réservés aux propositions budgétaires seront effectivement alloués (car cela dépend des futurs votes). Dash continuera à émettre de nouvelles pièces pour environ 192 années avant qu'une année entière de minage génère moins d'1 dash. Après 2209, seuls 14 nouveaux dashs seront générés. Le dernier dash prendra 231 ans à être généré, avec un début en 2246 et une fin complète d'émission en 2477. Sur la base de ces chiffres, une masse monétaire minimale et maximale en 2254 peut être estimée entre :
ko: `대시의 총 코인 방출 <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_ 역시 등비 급수의 총합으로 계산될 수 있으나, 궁극적인 총 코인 방출은 불확실합니다. 이는 예산 제안서를 위한 10퍼센트의 블록 보상이 얼만큼이 될 것인지가 불확실하기 때문입니다. 예산 제안서에 할당되는 금액은 미래의 투표 성향에 달려 있습니다. 대시는 채굴이 1 대시 이하를 생성하게 될 때까지 약 192년 동안 계속해서 코인을 방출할 예정입니다. 2209년 이후에는 약 14대시만이 생성될 예정입니다. 마지막 대시를 채굴하는 데는 2246년에 시작하여 방출이완전히 멈추는 2477년 까지 약 231년이 걸릴 예정입니다. 이러한 숫자들에 근거할 때 2254년의 잠재적인 코인 공급 최대 및 최소치는 다음과 같습니다.
vi: `Tổng số Dash được phát sinh <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_ cũng sẽ là tổng của chuỗi hình học, nhưng tổng số tiền phát sinh là không chắc chắn bởi vì không thể biết bao nhiêu của 10% phần thưởng khối dự trữ cho các đề xuất ngân sách sẽ thực tế được cấp phát, vì nó còn phụ thuộc vào việc bỏ phiếu trong tương lai. Dash sẽ tiếp tục phát sinh coin trong vòng xấp xỉ 192 năm trước khi mà tổng số coin phát sinh cho cả một năm là ít hơn 1 DASH. Sau năm 2209 chỉ còn có 14 DASH sẽ được tạo ra. Đồng DASH cuối cùng sẽ mất đến 231 năm để sinh ra, bắt đầu từ năm 2246 và việc sinh ra đồng cuối cùng này sẽ dừng lại vào năm 2477. Dựa trên các con số đó, nguồn cung cấp số coin tối đa và tối thiểu vào năm 2254 có thể được tính trong khoảng như sau:
zh_cn: `达世币的总发行量 <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_\ 也是按几何级数计算出来的和，但是最终的数量是不确定的，因为留给预算提案的10%的区块奖励不知道会有多少能被实际花掉，而这部分取决于将来的投票行为。达世币会持续发行约192年，直到每年产出的货币少于1个DASH。2209年后只剩下14个DASH会被产出。最后一个DASH的产出将会耗时231年，从2246年开始，到2477年发行全部结束。基于这些数字，2254年最大和最小的可能发行量在这之间：

source: Assuming zero treasury allocation
ar: على افتراض صفر تخصيص الخزانة
de: Falls keine Budgetzahlungen stattfinden
fr: En supposant une allocation budgétaire nulle
ko: 재무 시스템 할당을 고려하지 않은 경우
vi: Giả sử không phân bổ ngân quỹ
zh_cn: 假设未分配任何预算资金

source: Assuming full treasury allocation
ar: على افتراض تخصيص الخزانة الكاملة
de: Falls jedes Budget vollständig ausbezahlt wird
fr: En supposant une allocation budgétaire intégrale
ko: 재무 시스템의 완전한 할당을 고려하는 경우
vi: Giả sử phân bổ toàn bộ quỹ
zh_cn: 假设全部预算资金都被分配

source: Block reward allocation
ar: حظر توزيع المكافآت
de: Blockreward-Verteilung
fr: Allocation de la récompense de bloc
ko: 블록 보상 할당
vi: Phân phối phần thưởng khối
zh_cn: 区块奖励分配

source: Unlike Bitcoin, which allocates 100% of the block reward to miners, Dash holds back 10% of the block reward for use in the decentralized :ref:`budget system <decentralized-governance>`. The remainder of the block, as well as any transaction fees, are split 50/50 between the :ref:`miner <mining>` and a :ref:`masternode <masternodes>`, which is deterministically selected according to the :ref:`payment logic <payment-logic>`. Dash features superblocks, which appear every 16616 blocks (approx. 30.29 days) and can release up to 10% of the cumulative budget held back over that :ref:`budget cycle period <budget-cycles>` to the winning proposals in the budget system. Depending on budget utilization, this results in an approximate coin reward allocation over a budget cycle as follows:
ar: على عكس بيتكوين ، الذي يخصص 100 ٪ من المكافأة إلى عمال المناجم ، يعيد داش 10 ٪ من مكافأة الكتلة لاستخدامها في اللامركزية :ref:`نظام الميزانية <decentralized-governance>`. يتم تقسيم ما تبقى من الكتلة ، وكذلك أي رسوم المعاملات ، 50/50 بين :ref:`تعدين <mining>` و :ref:`ماسترنود <masternodes>`, الذي تم تحديده بشكل حاسم وفقا ل :ref:`منطق الدفع <payment-logic>`. تتميز داش بميزات رائعة ، والتي تظهر كل 16616 قطعة تقريبًا (30.29 يومًا تقريبًا) ويمكنها إطلاق ما يصل إلى 10٪ من الميزانية التراكمية المحفوظة فوق ذلك :ref:`فترة دورة الميزانية <budget-cycles>` إلى المقترحات الفائزة في نظام الميزانية. اعتمادًا على استخدام الميزانية ، ينتج عن ذلك تخصيصًا تقريبيًا لمكافأة العملات على دورة ميزانية كما يلي:
de: Anders als Bitcoin, welches 100% der Block-Rewards an Miner auszahlt, reserviert Dash 10% der Block-Rewards für ein dezentralisiertes :ref:`Budget <decentralized-governance>`. Der Rest des Blocks wird zusammen mit Transaktionsgebühren 50/50 an die :ref:`Miner <mining>` und :ref:`Masternodes <masternodes>` ausbezahlt, welche, der :ref:`Zahlungslogik <payment-logic>` folgend, deterministisch ausgewählt werden. Dash verwendet einen Superblock, der alle 16616 Blöcke (etwa alle 30,29 Tage) vorkommt und bis zu 10% der gesamten Blockrewards, die über den Verlauf der :ref:`Budgetzyklusperiode <budget-cycles>` zustande gekommen sind, an die erfolgreichen Proposal des Budgetsystems ausbezahlt. Je nach Umfang, in dem das Budget in Anspruch genommen wird, ergibt sich die folgende Reward-Verteilung über den Verlauf eines Budgetzyklus:
fr: Contrairement à Bitcoin, qui alloue 100% de la récompense de bloc aux mineurs, Dash retient 10% de la récompense de bloc pour la consacrer à son :ref:`système budgétaire décentralisé <decentralized-governance>`. Le reste du bloc, ainsi que les frais de transaction, sont divisés à parts égales entre le :ref:`mineur <mining>` et un :ref:`masternode <masternodes>`, qui est choisi de manière déterministe selon la :ref:`logique de paiement <payment-logic>`. Dash comporte des “superblocs", qui apparaissent tous les 16616 blocs (env. 30,29 jours) et distribuent jusqu'à 10% du budget cumulé retenu lors de ce :ref:`cycle budgétaire <budget-cycles>` aux propositions budgétaires gagnantes. Selon l'utilisation du budget, une allocation approximative de la récompense de bloc sur un cycle budgétaire ressemble à ceci :
ko: 100퍼센트의 블록 보상을 채굴자에게 할당하는 비트코인과 달리, 대시는 분산화된 :ref:`예산 시스템 <decentralized-governance>`\ 에 10퍼센트의 블록 보상이 책정됩니다. 나머지 블록 보상과 거래 수수료는 :ref:`채굴자 <mining>` 와 :ref:`마스터노드 <masternodes>`\ 에 50대 50으로 분할되는데, 이는 :ref:`지불 로직 <payment-logic>`\ 에 따라 결정됩니다. 대시는 수퍼블록Super Block을 특징으로 합니다. 이 수퍼블록은 매 16616블록(약 30.29일)마다 출현하며 :ref:`예산 사이클 주기 <budget-cycles>` 동안 쌓인 누적 예산의 10퍼센트를 예산 시스템에서 투표를 통과한 제안서에 릴리즈 합니다. 예산 활용에 따라, 예산 주기 동안의 코인 보상 할당은 다음과 같은 형태로 이루어질 수 있습니다.
vi: Không giống như Bitcoin, đã cấp phát 100% phần thưởng khối cho các thợ mỏ, Dash giữ lại 10% của phần thưởng khối để dùng cho :ref:`hệ thống ngân sách <decentralized-governance>` phi tập trung. Phần còn lại của phần thưởng khối, cũng như các khoản phí giao dịch, được chia 50/50 giữa :ref:`thợ mỏ <mining>` và một :ref:`masternode <masternodes>`, nó được chọn bằng việc áp dụng :ref:`logic thanh toán <payment-logic>`. Dash có các siêu khối, nó sẽ xuất hiện cứ mỗi 16616 khối (xấp xỉ 30.29 ngày) và sẽ giải ngân khoản lên đến 10% của ngân sách tích luỹ được giữ lại trong suốt :ref:`chu kỳ thanh toán <budget-cycles>` cho những đề xuất thắng cử trong hệ thống ngân sách. Tùy thuộc vào việc sử dụng ngân sách, điều này dẫn đến cấp phát một lượng coin tương đương trong một chu kỳ ngân sách như sau:
zh_cn: 比特币是将区块奖励100%分配给矿工，与此不同，达世币保留了10%的区块奖励用于去中心化\ :ref:`预算管理系统 <decentralized-governance>`\ 。区块奖励剩下的部分同交易费用，被50/50地分配给了\ :ref:`矿工 <mining>`\ 和\ :ref:`主节点 <masternodes>`\ ，这些都是根据\ :ref:`支付逻辑 <payment-logic>`\ 被确定选择的。达世币特有的超级块，每16616个区块（差不多30.29天）就出现一个超级块，可以将高达10%的在\ :ref:`预算周期 <budget-cycles>`\ 内累积预算分发给预算系统中通过的提案。根据预算的使用情况，一个预算周期内的区块奖励分配如下：

source: Mining Reward
ar: مكافئة التعدين
fr: Récompense de minage
ko: 채굴 보상
vi: Phần thưởng cho việc đào
zh_cn: 挖矿奖励

source: Masternode Reward for Proof-of-service
ar: مكافأة ماسترنود لإثبات الخدمة
de: Masternode-Reward für Proof-of-Service
fr: Récompense de preuve de service du masternode
ko: 서비스 증명Proof-of-service을 위한 마스터노드 보상
vi: Phần thưởng của Masternode cho Bằng-chứng-phục-vụ
zh_cn: 提供服务量证明的主节点奖励

source: Decentralized Governance Budget
ar: موازنة الحوكمة اللامركزية
de: Dezentralisiertes Governance Budget
fr: Budget de gouvernance décentralisée
ko: 분산화된 거버넌스 예산
vi: Cơ chế quản trị ngân sách phi tập trung
zh_cn: 去中心化预算管理

source: This documentation is based on calculations and posts by moocowmoo. Please see `this reddit post <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`_ for more details, or run your own `emission calculations using this tool <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_. See `this site <https://stats.masternode.me>`_ for live data on current network statistics.
ar: يعتمد هذا المستند على الحسابات والمشاركات من قبل moocowmoo. يرجى الاطلاع `منشور ريديت <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`_ لمزيد من التفاصيل ، أو تشغيل الخاصة بك `حسابات الانبعاثات باستخدام هذه الأداة <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_. أنظر `هذا الموقع <https://stats.masternode.me>`_ للبيانات الحية على إحصائيات الشبكة الحالية.
de: Diese Dokumentation basiert auf Rechnungen und Veröffentlichungen von moocowmoo. Weitere Details befinden sich in `diesem Post auf Reddit <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`_ oder können über die selbstständige `Berechnung der Emission mit diesem Tool <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_ gewonnen werden. `Diese Seite <https://stats.masternode.me>`_ bietet Live-Daten zu aktuellen Netzwerksstatistiken.
fr: Cette documentation est basée sur des calculs et publications de Moocowmoo. Voir `cet article Reddit <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`_ pour en savoir plus. Vous pouvez aussi lancer vos propres `calculs d'émission avec l'outil <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_. Voir aussi `ce site <https://stats.masternode.me>`_ pour des statistiques en direct sur le réseau.
ko: 이 문서는 계산에 의거하고 있으며 moocowmoo에 의해 작성되었습니다. 더 자세한 내용을 위해서는 `이 레딧 게시물 <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`\ 을 확인하시거나 `이 도구를 통한 자신만의 방출 계산 <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_\ 을 하십시오. `이 웹사이트 <https://stats.masternode.me>`_ 를 통해 현재의 네트워크 통계에 대한 라이브 데이터를 확인하세요.
vi: Tài liệu này là dựa trên tính toán và bài viết của moocowmoo. Hãy xem `bài viết trên reddit này <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`_ để có thêm thông tin chi tiết, hoặc tự chạy `tính toán việc phát sinh coin của riêng bạn bằng việc sử dụng công cụ <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_. Xem `website này <https://stats.masternode.me>`_ để có dữ liệu trực tiếp về những thông tin thống kê hiện tại của mạng.
zh_cn: 这个文档是基于moocowmoo的计算和帖子。详情请见\ `这个Reddit的帖子 <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`_\ 或者利用\ `此工具计算货币发行量 <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_\ 。现行网络统计的实时数据请看\ `这个站点 <https://stats.masternode.me>`_\ 。

source: Decentralized Governance
ar: الحكم اللامركزي
de: Dezentralisierte Entscheidungsfindung
fr: Gouvernance décentralisée
ko: 분산화된 거버넌스(Decentralized Governance)
vi: Quản trị Phi tập trung
zh_cn: 分布式管理

source: Decentralized Governance by Blockchain, or DGBB, is Dash's attempt to solve two important problems in cryptocurrency: governance and funding. Governance in a decentralized project is difficult, because by definition there are no central authorities to make decisions for the project. In Dash, such decisions are made by the network, that is, by the owners of masternodes. The DGBB system allows each masternode to vote once (yes/no/abstain) for each proposal. If a proposal passes, it can then be implemented (or not) by Dash's developers. A key example is early in 2016, when Dash's Core Team submitted a proposal to the network asking whether the blocksize should be increased to 2 MB. Within 24 hours, consensus had been reached to approve this change. Compare this to Bitcoin, where debate on the blocksize has been raging for nearly three years.
ar: الإدارة اللامركزية من قبل بلوكشين، أو دغبب، هو محاولة داش لحل مشكلتين مهمتين في العملة الرقمية: الحكم والتمويل. والحكم في مشروع لامركزي صعب، لأنه لا توجد سلطات مركزية لاتخاذ قرارات بشأن المشروع. في اندفاعة، يتم اتخاذ هذه القرارات من قبل الشبكة، وهذا هو، من قبل أصحاب ماسنوديس. ويسمح نظام دغب بالتصويت مرة واحدة (نعم / لا / الامتناع) لكل اقتراح. إذا تم تمرير مقترح، فإنه يمكن بعد ذلك تنفيذها (أو لا) من قبل مطوري داش. ومن الأمثلة الرئيسية في أوائل عام 2016، عندما قدم فريق داش الأساسي اقتراحا إلى الشبكة يسأل عما إذا كان ينبغي زيادة الكتل إلى 2 ميغابايت. وفي غضون 24 ساعة، تم التوصل إلى توافق في الآراء للموافقة على هذا التغيير. قارن هذا إلى بيتكوين، حيث النقاش حول كتل تم مستعرة منذ ما يقرب من ثلاث سنوات.
de: Decentralized Governance by Blockchain, oder DGBB, ist Dashs Versuch zwei große Probleme des Kryptowährungssektors zu lösen: Entscheidungsfindung und Finanzierung. Ein dezentralisiertes Projekt steht häufig vor dem Problem, dass Entscheidungen getroffen werden müssen. Im Dash-Ökosystem werden Entscheidungen durch das Netzwerk, also durch die Besitzer der Masternodes getroffen. Das DGBB-System erlaubt es jeder Masternode einmal (ja/nein/Enthaltung) über den Ausgang eines Proposals abzustimmen. Nach Ablauf der Wahlperiode wird das Proposal von den Dash-Entwicklern umgesetzt (oder verworfen). Ein wichtiges Beispiel ist ein Proposal des Dash Core Teams, welches sich Anfang 2016 dafür aussprach, die Größe der Blöcke auf 2 MB zu erhöhen. Die Zustimmung dauerte in diesem Fall weniger als 24 Stunden, wobei das gleiche Problem in der Bitcoin-Community 3 Jahre lang diskutiert wurde.
fr: La gouvernance décentralisée par blockchain (DGBB) est la façon dont Dash résout deux problèmes importants des cryptomonnaies : la gouvernance et le financement. La gouvernance d'un projet décentralisé est une chose difficile car, par définition, il n'y a aucune autorité centrale qui puisse prendre des décisions sur le projet. Avec Dash, de telles décisions sont prises par le réseau, c'est-à-dire par les opérateurs de masternode. Le système DGBB permet à chaque masternode de voter une fois (oui/non/abstention) sur chaque proposition budgétaire. Si une proposition est adoptée, elle peut alors être mise en œuvre (ou non) par les développeurs Dash. Un exemple clé a eu lieu en 2016 : l'équipe Dash Core a soumis au réseau une proposition demandant si la taille de bloc devait être agrandie à 2 Mo. En vingt-quatre heures, un consensus avait été atteint en faveur de cette mesure. Il faut comparer cela à Bitcoin, où le débat sur la taille de bloc fait rage depuis presque trois ans.
ko: 블록체인에 의한 분산화된 거버넌스(Decentralized Governance by Blockchain, DGBB)는 거버넌스와 펀딩이라는 암호화폐의 두 가지 문제점을 해결하기 위한 대시의 노력의 산물입니다. 분산화된 프로젝트에 있어 거버넌스는 매우 어렵습니다. 이는 의미상 중앙화된 힘이 존재하지 않아 프로젝트를 위한 결정을 내리는 기관이 없기 때문입니다. 대시에 있어서 이와 같은 결정은 네트워크에 의해 이루어지며, 네트워크는 곧 마스터노드의 소유자들을 일컫습니다. 각 마스터노드는 DGBB 시스템을 통해 각 제안서에 한 개의 투표권을 행사할 수 있습니다(예/아니오/기권). 만일 하나의 제안서가 통과한다면, 대시 개발자들은 프로젝트에 구축할 지의 여부를 결정합니다. 주요 사례는 2016년 초에 있었던 대시 코어 팀의 제안서로, 당시 대시 코어 팀은 블록 사이즈를 2MB로 증가할 것인지에 관한 제안서를 제출하였고, 24시간 내에 이 변화를 승인하는 컨센서스에 도달하였습니다. 동일한 문제에 관하여 비트코인의 경우 블록사이즈에 관한 토론에 약 3년여 가량의 맹렬한 토론이 진행된 바 있습니다.
vi: Hệ Quản trị Phi tập trung trên Blockchain, hay DGBB, là một nỗ lực của Dash nhằm giải quyết hai vấn đề quan trọng trong lĩnh vực tiền số: đó là quản trị và cấp vốn. Quản trị một dự án phi tập trung là rất khó, bởi vì theo định nghĩa thì nó không có một thẩm quyền tập trung nào để ra những quyết định cho dự án. Ở Dash, những quyết định như vậy được thực hiện bởi chính mạng lưới, đó chính là các chủ masternode. Hệ thống DGBB cho phép mỗi masternode được bỏ phiếu một lần (yes/no/bỏ qua) cho mỗi một đề xuất. Nếu một đề xuất được thông qua, nó có thể được thực hiện (hoặc không) bởi những người phát triển của Dash. Một ví dụ điển hình là đầu năm 2016, khi nhóm Dash Core gửi đề xuất cho mạng lưới và đề nghị tăng kích thước khối lên 2 MB. Chỉ trong vòng 24 giờ, mạng lưới đã đạt được sự đồng thuận và cho phép sự thay đổi này. So với mạng lưới Bitcoin, nơi mà tranh cãi về kích thước khối này kéo dài đến gần ba năm.
zh_cn: 基于区块链的去中心化管理，或称DGBB，是达世币的一个创新尝试，即解决加密数字货币中的两个重要问题：管理和资金。在去中心化的项目中，实现管理很困难，因为从定义上讲没有中央集权去为项目做决定。在达世币中，这种决定通过网络来实现，即由主节点持有者来决定。DGBB系统允许每一个主节点对每一个提案投一次票（同意/不同意/弃权）。如果提案通过，它可以被达世币的开发者执行（或者不执行）。一个重要的例子就是2016年初，当达世币核心团队向网络递交一个提案，询问区块的大小是否应该提高到2MB时，在24小时内批准此变更的共识便已经达成。与之相比，比特币关于区块大小的争论已经激烈进行了将近三年。

source: DGBB also provides a means for Dash to fund its own development. While other projects have to depend on donations or premined endowments, Dash uses 10% of the block reward to fund its own development. Every time a block is mined, 45% of the reward goes to the miner, 45% goes to a masternode, and the remaining 10% is not created until the end of the month. During the month, anybody can make a budget proposal to the network. If that proposal receives net approval of at least 10% of the masternode network, then at the end of the month a series of "superblocks" will be created. At that time, the block rewards that were not paid out (10% of each block) will be used to fund approved proposals. The network thus funds itself by reserving 10% of the block reward for budget projects.
ar: كما يوفر DGBB وسيلة ل داش لتمويل التطوير الخاص بها. في حين أن المشروعات الأخرى تعتمد على التبرعات أو الهبات المسبقة ، فإن داش تستخدم 10٪ من مكافأة المكافآت لتمويل التطوير الخاص بها. في كل مرة يتم استخراج كتلة ، 45 ٪ من المكافأة يذهب إلى عامل التعدين ، 45 ٪ يذهب إلى ماسترنود ، والباقي 10 ٪ لا يتم إنشاء حتى نهاية الشهر. خلال الشهر ، يمكن لأي شخص تقديم اقتراح ميزانية للشبكة. إذا حصل هذا الاقتراح على موافقة صافية بنسبة 10٪ على الأقل من شبكة ماسترنود ، فسيتم إنشاء سلسلة من "الكتلة" في نهاية الشهر. في ذلك الوقت ، سيتم استخدام المكافآت التي لم يتم دفعها (10 ٪ من كل كتلة) لتمويل المقترحات المعتمدة. وهكذا تقوم الشبكة بتمويل نفسها من خلال حجز 10٪ من المكافأة المجمعة للمشروعات الموازنة.
de: DGBB bietet zudem Dash die Möglichkeit sich selbst zu finanzieren. Während andere Projekte auf Spenden oder einen Premine vertrauen müssen, verwendet Dash 10 % der eigenen Block-Rewards um die Entwicklung zu finanzieren. Bei jedem neuen Block werden 45 % der Block-Rewards an die Miner und 45 % an die Masternodes ausbezahlt. Die restlichen 10 % werden erst zum Ende des Monats erschaffen. Während des Monats kann jedes Mitglied der Community beim Netzwerk ein Budget-Proposal einreichen. Sollte diesem Proposal von mindestens 10% des Masternodes-Netzwerks zugestimmt werden, so wird am Ende des Monats eine Reihe von „Superblöcken“ erschaffen. Zu diesem Zeitpunkt werden die Block-Rewards, die bisher nicht ausbezahlt wurden (10 % jedes Blocks), dazu verwendet die bestätigten Proposal zu finanzieren. Dadurch finanziert sich das Netzwerk selbst, da 10% der Block-Rewards für Budgetprojekt aufgewandt werden.
fr: Le DGBB est aussi pour Dash un moyen de financer son propre développement. Alors que d'autres projets dépendent de dons ou de fonds préminés, Dash utilise 10% de la récompense de bloc pour financer son propre développement. À chaque minage d'un bloc, 45% de la récompense va au mineur, 45% au masternode, et les 10% restants ne sont pas créés avant la fin du mois en cours. Si telle proposition budgétaire est approuvée par au moins 10% du réseau des masternodes, alors, à la fin du mois, une série de “superblocs" est créée. À ce moment-là, les récompenses de bloc mises de côté (10% de chaque bloc) sont utilisées pour financer les propositions adoptées. Ainsi le réseau se finance lui-même en réservant 10% de la récompense de bloc aux propositions budgétaires.
ko: 또한 DGBB는 대시가 자체적 개발에 자금을 지원할 수 있는 도구가 되기도 합니다. 다른 프로젝트들이 기부나 사전 채굴된 자원에 의존할 때, 대시는 블록 보상의 10퍼센트를 동원하여 자체적 개발에 자금을 지원합니다. 매 블록이 채굴될 때마다 블록 보상의 45퍼센트는 채굴자에게, 45퍼센트는 마스터노드에 할당되며, 나머지 10퍼센트는 월말이 될 때까지 생성되지 않습니다. 제안서가 전체 마스터노드 네트워크 중 최소 10퍼센트의 순 승인을 얻으면 월말에 일련의 '슈퍼블록'이 생성됩니다. 이 때 아직 지불 되지 않은 블록 보상(각 블록 보상의 10퍼센트)가 승인된 제안서에 자금을 지원하기 위한 용도로 사용됩니다. 따라서 대시 네트워크는 10퍼센트의 블록 보상을 예산 프로젝트에 스스로 지원하게 됩니다.
vi: Hệ thống DGBB cũng cung cấp một ý nghĩa cho Dash là cấp vốn cho sự phát triển của chính nó. Trong khi những dự án khác phải phụ thuộc kinh phí vào sự tài trợ hoặc sự hiến tặng, thì Dash dành 10% của phần thưởng khối để cấp vốn cho sự phát triển của chính nó. Khi mỗi khối được đào, 45% phần thưởng sẽ trả cho thợ mỏ, 45% được trả cho masternode, và 10% còn lại không được tạo ngay mà chờ đến cuối tháng. Trong tháng, bất kỳ ai cũng có thể tạo một đề xuất xin kinh phí từ mạng lưới. Nếu đề xuất được thông qua với bởi nhất 10% của mạng lưới masternode, thì cuối tháng một chuỗi gọi là "siêu khối" sẽ được tạo ra. Tại thời điểm đó, phần thưởng khối mà đã chưa được chi trả (10% của mỗi khối) sẽ được sử dụng để cấp vốn cho những đề xuất được thông qua. Như vậy mạng lưới tự cấp vốn cho chính nó bằng việc dành riêng 10% của phần thưởng khối cho ngân sách các dự án.
zh_cn: 为了达世币的发展，DGBB还提供了资金自足的途径。在其它项目还只能依赖于资助和捐款时，达世币已经可以利用10%的区块奖励来资助开发。当每一个区块被挖出来后，45%的区块奖励分配给矿工，45%分配给主节点，剩下的10%在月底前不会被分配。在这一个月中，任何人都可以向网络提出自己的预算提案。如果超过10%的主节点批准了这个预案，那么在月底时，一个“超级块”便被生成。那时，当初没有被花掉的区块奖励（每个区块的10%）就会被用于预案。网络通过预留10%区块奖励的方式为自己的预算项目融资。
