Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ar, de, fr, ko, vi, zh_cn

source: **Chuck Williams on Evolution**, Dash Conference London, 14 September 2017
ar: **تورة شوك ويليامس** ملتقى داش في لندن 14 سبتمبر 2017
de: **Chuck Williams über Evolution**, Dash Conference London, 14 September 2017
fr: **Chuck Williams à propos d'Evolution**, conférence Dash de Londres, 14 septembre 2017
ko: **에볼루션에 관하여 척 윌리엄스**, 대시 컨퍼런스 런던, 2017년 9월 14일
vi: **Chuck Williams với Evolution**, Hội thảo của Dash ở London, 14 tháng 9 năm 2017
zh_cn: **Chuck Williams on Evolution**, Dash Conference London, 2017年9月14日

source: **Evan Duffield on the Evolution Roadmap**, Dash Force News, 28 June 2017
ar: **تورة إيفان ديفيلد**, أخبار داش, 28 يونيو 2017
de: **Evan Duffield über die Evolution Roadmap**, Dash Force News, 28 Juni 2017
fr: **Evan Duffield à propos de la feuille de route d'Evolution**, Dash Force News, 28 juin 2017
ko: **에볼루션 로드맵에 관하여 에반 듀필드**, 대시 포스 뉴스, 2017년 6월 28일
vi: **Evan Duffield Lộ trình của Evolution**, Dash Force News, 28 tháng 6 năm 2017
zh_cn: **Evan Duffield on the Evolution Roadmap**, Dash Force News, 2017年6月28日

source: Superior transaction anonymity using PrivateSend
ar: عدم الكشف عن هويته في المعاملة الفائقة باستخدام الإرسال المخفي
de: Besonders anonyme Transaktionen durch PrivateSend
ko: 프라이빗샌드를 사용한 우수한 거래 익명화 시스템
vi: Cơ chế ẩn danh ưu việt sử dụng PrivateSend

source: Masternodes
ar: ماسترنود
ko: 마스터노드(Masternodes)
vi: Các masternode
zh_cn: 主节点

source: **PrivateSend** gives financial privacy by obscuring the source of funds on the blockchain.
ar: **الإرسال المخفي** يعطي الخصوصية المالية عن طريق حجب مصدر الأموال على بلوكشين.
de: **PrivateSend** schützt die Privatsphäre der Nutzer, indem der Ursprung der Zahlung auf der Blockchain nicht ersichtlich ist.
ko: **프라이빗샌드** 는 블록체인상의 자금의 출처를 가림으로써 금융 프라이버시를 제공합니다.
vi: **PrivateSend** cho khả năng riêng tư về tài chính bằng việc che mờ nguồn cung của nguồn tiền trên blockchain.

source: **Governance and Treasury** allows stakeholders in Dash to determine the direction of the project and devotes 10% of the block reward to development of the project and ecosystem (as of May 2018, our annual budget exceeds $30 million).
ar: **الحوكمة والخزينة** تسمح لأصحاب المصلحة في داش لتحديد اتجاه المشروع وتخصص 10 ٪ من مكافأة المكافأة لتطوير المشروع والنظام البيئي (اعتبارًا من مايو 2018 ، تتجاوز ميزانيتنا السنوية 30 مليون دولار).
de: **Entscheidungsfindung und Budget** erlauben es den Dash-Investoren die Richtung des Projekts mitzubestimmen und 10% der Block-Rewards an Entwickler und andere Projekte auszubezahlen (Im Mai 2018 belief sich das jährliche Budget auf über $30 Millionen).
ko: **거버넌스와 재무 시스템** 을 통해 대시의 이해 관계자는 프로젝트의 방향을 결정하고 블록 보상의 10%를 프로젝트 및 대시 생태계 개발에 충당합니다(2018년 4월 현재 연간 예산은 3천만 달러 이상).
vi: **Quản trị và ngân quỹ** cho phép các cổ đông của Dash khả năng định hướng cho các dự án và dành 10% phần thưởng khối cho công việc phát triển các dự án và phát triển hệ sinh thái (ví dụ vào tháng 5 năm 2018, ngân sách hàng năm vượt quá 30 triệu đô la Mỹ).

source: Masternode owners must have possession of 1000 DASH, which they prove by signing a message and broadcasting to the network. Those coins can be moved at any time, but moving them will cause the masternode to fall out of queue and stop earning rewards. Masternode users are also given **voting rights** on proposals. Each masternode has one vote and this vote can be used on budget proposals or important decisions that affect Dash.
ar: يجب أن يملك مالكو ماسترنود 1000 داش ، والتي يثبتونها من خلال التوقيع على رسالة والبث إلى الشبكة. يمكن نقل هذه القطع النقدية في أي وقت ، ولكن نقلها سيؤدي إلى سقوط ماسترنود من قائمة الانتظار والتوقف عن كسب المكافآت. يتم منح مستخدمي ماسترنود **حقوق التصويت** على المقترحات. كل صوت له صوت واحد ويمكن استخدام هذا التصويت على مقترحات الميزانية أو القرارات المهمة التي تؤثر على داش.
de: Der Besitzer einer Masternode muss 1000 Dash besitzen, was er dadurch beweisen kann, dass er eine Nachricht signiert und diese an das Netzwerk übermittelt. Der Besitzer behält die volle Kontrolle über die Coins und kann sie jederzeit verschieben, was jedoch dazu führen würde, dass die Masternode abgeschalten und ihren Platz in der Auszahlungswarteschlange verlieren würde. Masternodes haben zudem das Recht über Proposal **abzustimmen** . Jede Masternode hat eine Stimme und kann über Budgetauszahlungen und richtungsweisende Entscheidungen abstimmen.
ko: 마스터노드 소유자들은 반드시 1000대시를 소유해야 합니다. 이는 메시지에 사인하고 네트워크에 송출함으로써 증명됩니다. 이들 코인은 어느 때나 옮길 수 있지만, 코인을 옮기면 보상을 받을 수 없습니다. 마스터노드 사용자들은 또한 제안서에 대한 **투표권** 을 얻습니다. 각 마스터노드는 한 개의 투표권을 지니며, 이 투표권은 예산 제안서 및 대시에 영향을 미치는 중요한 결정에 행사합니다.
vi: Các chủ masternode cần phải sở hữu 1000 DASH, để chứng minh họ cần phải ký một thông điệp và phát tán nó lên mạng lưới. Những coin trong khoản đó có thể chuyển đi bất cứ khi nào, nhưng khi chuyển chúng đi thì sẽ làm cho masternode bị đẩy khỏi hàng đợi và không được trao thưởng nữa. Người chủ masternode cũng được cấp **quyền bỏ phiếu** cho các đề xuất. Mỗi một masternode có một phiếu bầu và phiếu bầu này có thể dùng cho các đề xuất kinh phí hoặc các quyết định quan trọng ảnh hưởng đến Dash.

source: Masternodes cost money and effort to host so they are paid a percentage of the block reward as an incentivize. With current masternode numbers and rewards, masternodes earn approximately a 8% return on 1000 Dash (which means 6.97 Dash or USD1360 in July 2017) for the year of 2017. This `tool <https://stats.masternode.me/>`_ shows a live calculation of masternode earnings. These rewards decrease by 7% each year, but the rising value of Dash may offset these reductions. As a matter of fact, masternodes were receiving 140 Dash per month at the beginning of 2016, but this was actually less money than today: USD600 per month. There is also the possibility for masternodes to earn money from fees in the future.
ar: تكلفة ماسترنود المال والجهد لاستضافة بحيث يتم دفع نسبة مئوية من مكافأة كتلة كحافز. مع أرقام ومكافآت ماسترنود الحالية ، يكسب ماسترنود ما يقرب من 8 ٪ عائد على 1000 داش (وهذا يعني 6.97 داش أو 1360 دولار في يوليو 2017) لعام 2017.هذه `الأداة <https://stats.masternode.me/>`_ يعرض حسابًا مباشرًا لأرباح الماسترود. هذه المكافآت تنخفض بنسبة 7 ٪ كل عام ، ولكن ارتفاع قيمة داش قد يعوض هذه التخفيضات. في الواقع ، كان ماسترنود يتلقى 140 داش شهريًا في بداية عام 2016 ، ولكن هذا كان في الواقع أقل من المال اليوم: 600 دولار أمريكي في الشهر. هناك أيضا إمكانية لجني ماسترنود المال من الرسوم في المستقبل.
de: Eine Masternode zu betreiben kostet Geld und Arbeitszeit, weswegen diesen ein prozentualer Anteil der Block-Rewards ausbezahlt wird. Bei der damaligen Anzahl an Masternodes erhielten deren Betreiber im Jahr 2017 etwa 8% auf die 1000 hinterlegten Dash (dies entsprach im Juli 2017 etwa 6,97 Dash, bzw. $1360). Dieses `Tool <https://stats.masternode.me/>`_ zeigt die aktuell zu erwartenden Auszahlungen an. Die Rewards sinken jedes Jahr um 7%, wobei der steigende Wert des Dash diese Reduktion auffangen könnte. Dies kann etwa daran gesehen werden, dass Masternodes Anfang 2016 etwa 140 Dash im Monat ausbezahlt bekamen, was damals allerdings gerade einmal $600 entsprach und damit deutlich unter den aktuellen Rewards lag. Zudem könnten Masternodes in der Zukunft mehr Geld durch Transaktionsgebühren erlangen, als dies momentan der Fall ist.
ko: 마스터노드를 호스트하는 데는 비용과 노력이 발생합니다. 따라서 이를 위한 인센티브로서 블록 보상의 일부 퍼센티지가 지급됩니다. 현재 마스터노드의 숫자와 보상을 고려할 때, 마스터노드는 2017년 1000대시의 약 8%를 보상으로 받았습니다(2017년 7월 6.97대시 혹은 1,360 USD). 이들 보상은 매 해 7%씩 감소하지만, 대시의 가치가 증가하면 이러한 감소량을 상쇄할 수 있을 것으로 보입니다. 사실, 2016년 초 마스터노드는 매월 140대시를 보상으로 받았습니다. 그러나 이는 600 USD로 오늘날보다 적은 가치를 지닙니다. 또한 마스터노드는 장래에 수수료를 통해 수입을 증대할 수 있는 가능성을 가지고 있습니다.
vi: Masternode làm tốn kém tiềm bạc và nỗ lực để vận hành và nó cũng được trả bằng một phần của phần thưởng khối như là cách tạo động lực. Với số lượng masternode và phần thưởng khối hiện tại, thì các masternode sẽ kiếm được xấp xỉ 8% cho khoản đầu tư 1000 Dash (nó có nghĩa là 6.97 Dash hoặc USD 1360 vào tháng 7 năm 2017) cho năm 2017. `Công cụ này <https://stats.masternode.me/>`_ hiển thị tính toán tức thời về khoản tiền mà masternode kiếm được. Phần thưởng sẽ giảm đi khoảng 7% mỗi năm, nhưng việc tăng giá của Dash có thể bù đắp cho sự giảm này. Như thực tế đã xảy ra, các masternodes đã nhận được 140 Dash mỗi tháng vào đầu năm 2016, nhưng điều này thực sự là ít tiền hơn so với ngày nay: 600 đô la Mỹ mỗi tháng. Ngoài ra còn có khả năng cho các masternode kiếm tiền từ các khoản phí giao dịch trong tương lai.

source: PrivateSend
ar: الإرسال المخفي
ko: 프라이빗샌드(PrivateSend)
zh_cn: 匿名支付

source: PrivateSend gives you true financial privacy by obscuring the origins of your funds. All the Dash in your wallet is comprised of different "inputs", which you can think of as separate, discrete coins. PrivateSend uses an innovative process to mix your inputs with the inputs of two other people, without having your coins ever leave your wallet. You retain control of your money at all times.
ar: يمنحك الإرسال المخفي الخصوصية المالية الحقيقية عن طريق حجب أصول أموالك. تتكون جميع داش في محفظتك من "مدخلات" مختلفة ، والتي يمكن أن تفكر في عملات نقدية منفصلة منفصلة. يستخدم الإرسال المخفي عملية مبتكرة لخلط المدخلات الخاصة بك مع مدخلات شخصين آخرين ، دون أن تترك العملات المعدنية الخاصة بك من أي وقت مضى محفظتك. أنت تحتفظ بالسيطرة على أموالك في جميع الأوقات.
de: PrivateSend sichert die finanzielle Privatsphäre der Nutzer, indem die Ursprünge ihrer Coins verwischt werden. Die Dash in einer Wallet stammen normalerweise aus verschiedenen "Inputs", die jeweils als eigenständige Münze gesehen werden können. PrivateSend verwendet einen innovativen Prozess um die verschiedenen Inputs eines Nutzers mit denen von zwei anderen Nutzern zu mischen, ohne, dass die Coins seine Wallet verlassen müssen. Dadurch behält der Nutzer zu jeder Zeit die Kontrolle über sein Guthaben.
ko: 프라이빗샌드는 당신이 가진 자금의 출처를 가림으로써 진정한 금융 프라이버시를 제공합니다. 당신의 지갑에 있는 모든 대시는 다양한 '입력값'으로 구성되어 있습니다. 이 입력값은 각각 별개의 코인으로 생각할 수 있습니다. 프라이빗샌드는 혁신적 프로세스를 통해 당신의 코인이 지갑을 떠나지 않도록 하면서도 당신의 입력값을 다른 두 사람의 입력값과 믹스합니다. 이로써 당신의 자금에 대한 통제는 언제나 당신에게 있습니다.
vi: PrivateSend cho bạn thực sự riêng tư về tài chính bằng việc che khuất nguồn gốc nguồn tiền của bạn. Tất cả số Dash trong ví của bạn gồm có "các đầu vào" khác nhau, mà bạn có thể nghĩ chúng là các coin tách rời, phân biệt. PrivateSend sử dụng một quy trình trộn tiên tiến để trộn lẫn các đầu vào của bạn với những đầu vào của hai hay nhiều người khác, mà không làm cho số coin của bạn đi ra khỏi ví. Bạn vẫn giữ quyền kiểm soát tiền của bạn ở bất cứ thời điểm nào.

source: PrivateSend begins by breaking your transaction inputs down into standard denominations. These denominations are 0.01 Dash, 0.1 DASH, 1 DASH and 10 DASH -- much like the paper money you use every day.
ar: يبدأ الإرسال المخفي عن طريق كسر المدخلات الخاصة بالمعاملات إلى فئات قياسية. هذه الفئات هي 0.01 داش ، 0.1 داش ، 1 داش و 10 داش - يشبه إلى حد كبير النقود الورقية التي تستخدمها كل يوم.
ko: 프라이빗샌드는 당신의 거래 입력값을 표준 단위로 분할하는 것으로 시작됩니다. 이와 같은 단위 분할은 0.01 대시, 0.1 대시, 1 대시 및 10 대시로, 우리가 일상 생활에서 사용하는 지폐와 비슷합니다.

source: In order to fully obscure your funds, your wallet must repeat this process a number of times with each denomination. Each time the process is completed, it's called a "round". Each round of PrivateSend makes it exponentially more difficult to determine where your funds originated. The user may choose between 2-8 rounds of mixing.
ar: من أجل حجب أموالك بشكل كامل ، يجب أن تكرر محفظتك هذه العملية عدة مرات مع كل فئة. في كل مرة يتم الانتهاء من العملية ، يطلق عليها "جولة". كل جولة من الإرسال المخفي تجعل من الصعب بشكل كبير تحديد المكان الذي نشأت فيه أموالك. يمكن للمستخدم الاختيار بين 2-8 جولات من الخلط.
ko: 당신의 자금을 완전히 가리기 위해서, 당신의 지갑은 이 과정을 각 대시 분할 단위만큼 여러번 반복합니다. 매번 이 과정이 끝나는 것을 ‘라운드’라고 부릅니다. 프라이빗샌드의 각 라운드가 진행됨에 따라 당신의 자금의 출처는 기하급수적으로 높은 수준으로 가려집니다. 사용자는 2-8 라운드 사이에서 믹싱 횟수를 선택할 수 있습니다.

source: This mixing process happens in the background without any intervention on your part. When you wish to make a transaction, your funds will already be anonymized. No additional waiting is required.
ar: تحدث عملية الاختلاط هذه في الخلفية دون أي تدخل من جانبك. عندما ترغب في إجراء معاملة ، ستكون أموالك مجهولة المصدر بالفعل. مطلوب أي انتظار إضافي.
de: Der Mischvorgang findet im Hintergrund statt, ohne, dass der Nutzer eingreifen müsste. Wenn die Beträge für eine Transaktion verwendet werden sollen, sind sie bereits anonymisiert. Die Transaktion erfordert kein zusätzliches Abwarten.
ko: 이 믹싱 과정은 당신이 개입할 필요 없이 백그라운드에서 진행됩니다. 당신이 거래를 원하시는 경우, 당신의 자금은 이미 익명화가 진행되는 중입니다. 추가적으로 대기할 필요 역시 없습니다.
vi: Quá trình trộn xảy ra ở chế độ nền mà không cần bạn can thiệp. Khi bạn muốn gửi một giao dịch, lúc ngân quỹ của bạn đã được ẩn danh. Thì lúc đó không còn cần phải chờ đợi gì thêm.

source: InstantSend
ar: إرسال فوري
ko: 인스턴트샌드(InstantSend)
zh_cn: 即时支付

source: Dash suffers from neither of these limitations thanks to its second-layer network of masternodes. Masternodes can be called upon to form voting quorums to check whether or not a submitted transaction is valid. If it is valid, the masternodes "lock" the inputs for the transaction and broadcast this information to the network, effectively promising that the transaction will be included in subsequently mined blocks and not allowing any other spending of these inputs during the confirmation time period.
ar: لا تعاني داش من أي من هذه القيود بفضل شبكة الطبقة الثانية من ماسترنود. يمكن استدعاء ماسترنود لتشكيل نصاب التصويت للتحقق ما إذا كانت المعاملة المقدمة صالحة أم لا. إذا كان صحيحاً ، يقوم "ماسترنود" "بإغلاق" المدخلات الخاصة بالمعاملة وبث هذه المعلومات إلى الشبكة ، مما يعد بفعالية أنه سيتم تضمين المعاملة في كتل ملغومة لاحقاً وعدم السماح بأي إنفاق آخر لهذه المدخلات أثناء فترة التأكيد.
de: Dash kann diese beiden Probleme durch die zweite Netzwerksebene, also die Masternodes, überwinden. Masternodes können in ein Quorum berufen werden, welches bestätigt, dass eine Transaktion gültig ist. Wenn die Transaktion gültig ist „sperren“ die Masternodes die Inputs der Transaktion und geben diese Information an das Netzwerk weiter. Dadurch wird sichergestellt, dass die Transaktion in den nächsten Block eingetragen wird. Hierdurch wird sichergestellt, dass die gleichen Inputs nicht ein zweites Mal verwendet werden, während der Empfänger auf die Bestätigung wartet.
ko: 대시는 마스터노드를 통한 2계층 네트워크 덕분에 이러한 제한에서 벗어날 수 있습니다. 우선 제출된 거래가 유효한지 여부를 확인하기 위해 투표 쿼럼을 조직하는 데 마스터노드가 사용됩니다. 만일 유효하다면 마스터노드는 거래를 위해 입력값을 '잠그고' 이러한 정보를 네트워크에 송출합니다. 이로써 거래가 채굴된 블록에 포함되고 거래 확인 시간 동안 이들 입력값이 다른 곳에 지출되지 않도록 합니다.
vi: Dash không phải chịu những giới hạn này nhờ có mạng lưới bậc hai của các masternode. Các Masternode có thể được gọi để hình thành các quorum bỏ phiếu để kiểu tra rằng liệu các giao dịch được gửi có hợp lệ không. Nếu nó hợp lệ, các masternode sẽ "khoá" những đầu vào của những giao dịch này và phát tán thông tin này lên mạng, điều này hứa hẹn rằng giao dịch sẽ được gộp vào trong khối được khai thác và không cho phép những chi tiêu khác trên những đầu vào đó trong khoảng thời gian xác thực.

source: You can view a practical guide to use InstantSend :ref:`here <dashcore-privatesend-instantsend>`. InstantSend was introduced in a whitepaper called `Transaction Locking and Masternode Consensus: A Mechanism for Mitigating Double Spending Attacks <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_.
ar: يمكنك عرض دليل عملي لاستخدام الإرسال الفوري :ref:`هنا <dashcore-privatesend-instantsend>`. مثنتم تقديم الإرسال الفوري في ورق أبيض يسمى `قفل المعاملات و توافق ماسترنود: آلية لتخفيف هجمات الانفاق المزدوج <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_.
de: Eine praktische Anleitung zur Verwendung von InstantSend findet sich :ref:`hier <dashcore-privatesend-instantsend>`. InstantSend wurde zuerst in einem Whitepaper mit dem Titel `Transaction Locking and Masternode Consensus: A Mechanism for Mitigating Double Spending Attacks <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_ vorgestellt.
ko: 인스턴트샌드에 관한 실용적인 가이드는 :ref:`이곳<dashcore-privatesend-instantsend>`\ 에서 확인하세요. 인스턴트샌드는 `거래 잠금 및 마스터노드 컨센서스: 이중 지출 공격을 경감하기 위한 매커니즘 <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_\ 이라는 제목의 백서에 소개되었습니다.
vi: Bạn có thể xem hướng dẫn thực hành việc sử dụng InstantSend :ref:`ở đây <dashcore-privatesend-instantsend>`. InstantSend được giới thiệu trong một bản cáo bạch gọi là `Khoá giao dịch và Đồng thuận Masternode: Cơ chế giảm thiểu các cuộc tấn công chi tiêu lặp <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transactionckingnd%20Masternode%20Consensus.pdf>`_.

source: Sporks
ar: الرميات
ko: 스포크(Sporks)
zh_cn: 叉勺技术

source: Dark Gravity Wave
ar: موجة الجاذبية الداكنة
ko: 대시 그래비티 웨이브(Dark Gravity Wave)
zh_cn: 暗黑重力波

source: 17,742,696 DASH
ar: 17,742,696 داش
ko: 17,742,696 대시

source: 18,921,005 DASH
ar: 18,921,005 داش
ko: 18,921,005 대시

source: Sentinel
ar: الحماية
ko: 센티넬(Sentinel)
zh_cn: 哨兵

source: Sentinel is an autonomous agent for persisting, processing and automating Dash 12.1 governance objects and tasks, and for expanded functions in the upcoming Dash V13 release (Evolution). Sentinel is implemented as a Python application that binds to a local version 12.1 dashd instance on each Dash 12.1 masternode.
ar: الحماية هو عامل مستقل لاستمرارية وتجهيز وأتمتة كائنات ومهام الحوك 12.1 ، وللوظائف الموسعة في إصدار داش V13 القادم (التورة). يتم تنفيذ الحماية كتطبيق بايتون الذي يربط إلى نسخة داش إصدار محلي 12.1 على كل ماسترنود داش 12.1.
ko: 센티넬은 대시 12.1 거버넌스 오브젝트와 태스크 및 곧 출시되는 대시 V13(에볼루션)에 부속하는 확장된 기능을 지속, 처리 및 자동화 하기 위한 자율 에이전트 입니다. 센티넬은 각 대시 12.1 마스터노드에 로컬 버전 12.1 dashd instance를 결합하기 위한 파이톤 응용 프로그램으로서 도입되었습니다.
vi: SentinelSentinel là một tác nhân động để duy trì, xử lý và tự động hóa các đối tượng quản trị và các nhiệm vụ của Dash 12.1 và các chức năng mở rộng phiên bản Dash V13 sắp tới (Evolution). Sentinel được thực hiện như một ứng dụng Python liên kết với một phiên phiên bản cục bộ của dashd 12.1 hiện diện trên mỗi Dash masternode 12.1.

source: A Governance Object (or "govObject") is a generic structure introduced in Dash Core 12.1 to allow for the creation of Budget Proposals, Triggers, and Watchdogs. Class inheritance has been utilized to extend this generic object into a "Proposal" object to supplant the current Dash budget system.
ar: إن هدف الحوكمة (أو "govObject") هو بنية عامة تم إدخالها في داش كور 12.1 للسماح بإنشاء المقترحات الخاصة بالموازنة ، والمشغلات ، و Watchdogs. تم استخدام توريث الفئة لتوسيع هذا الكائن العام إلى كائن "اقتراح" لاستبدال نظام ميزانية داش الحالي.
de: Ein Governance-Objekt (oder "govObject") ist eine generische Struktur, die in Dash Core 12.1 eingefügt wurde und durch die Budget Proposal, Trigger und Watchdogs erschaffen werden können. Durch Klassenvererbung wird aus diesem generischen Objekt ein "Proposal"-Objekt, wodurch das bisherige Dash-Budgetsystem ersetzt wird.
ko: 거버넌스 오브젝트(혹은 'govObject')는 예산 제안서, 트리거Triggers 및 와치독Watchdogs의 생성을 고려하여 대시 코어 12.1에 소개된 포괄적 구조입니다. 클래스 상속은 현재의 대시 예산 시스템을 대체하기 위해 포괄적인 오브젝트를 '제안서' 오브젝트로 확장하고자 활용되어왔습니다.
vi: Một Đối tượng Quản trị (hoặc "govObject") là một cấu trúc chung được giới thiệu trong Dash Core 12.1 cho phép việc tạo ra các đề xuất ngân sách, các Trigger, và các Watchdogs. Lớp kế thừa cũng sử dụng để mở rộng đối tượng chung này thành một đối tượng "Đề xuất" để thay thế hệ thống ngân sách hiện nay của Dash.
