Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ar, de, fr, ko, vi, zh_cn

source: Dash features several unique value propositions including masternodes, PrivateSend, InstantSend and a decentralized governance system
ar: تتميز داش بالعديد من عروض القيمة الفريدة بما في ذلك ماسترنود و الإرسال المخفي و الإرسال الفوري ونظام إدارة لامركزي
de: Dash bietet eine Reihe von einzigartigen Funktionen, wie etwa Masternodes, PrivateSend, InstantSend und ein dezentralisiertes System der Entscheidungsfindung.
fr: Dash offre plusieurs caractéristiques uniques, dont les masternodes, InstantSend, PrivateSend et un système de gouvernance décentralisée
ko: 대시는 masternodes, 프라이빗샌드, 인스턴트샌드 및 분산된 거버넌스 시스템을 포함한 대시만의 유일한 제안을 제공합니다.
vi: Dash đặc trưng bởi cung cấp nhiều những giá trị độc đáo như các masternode, PrivateSend, InstantSend và hệ thống quản trị phi tập trung
zh_cn: 达世币具备一系列新颖的特色功能，其中包括主节点、匿名发送、即时发送和去中心化管理系统。

source: dash, cryptocurrency, features, masternodes, privatesend, instantsend, sporks, x11, dgw, governance, sentinel, evolution
ar: داش، العملات الرقمية، الميزات، ماسترنود، الإرسال المخفي، الإرسال الفوري sporks، x11، dgw، الحكم، الحراسة، التورة
de: dash, kryptowährung, funktionen, masternodes, privatesend, instantsend, sporks, x11, dgw, governance, sentinel, evolution
fr: dash, cryptomonnaie, caractéristiques, masternodes, privatesend, instantsend, sporks, x11, dgw, gouvernance, sentinel, evolution
ko: 대시, 암호화폐, 기능, masternodes, 프라이빗샌드, 인스턴트샌드, 스포크, x11, dgw, 거버넌스, 센티넬, 진화
vi: dash, tiền kỹ thuật số, tính năng, masternode, privatesend, instantsend, sporks, x11, dgw, hệ quản trị, sentinel, evolution
zh_cn: 达世币，加密数字货币，特点，主节点，匿名发送，即时发送，sporks，x11，dgw，管理，哨兵，evolution

source: Features
ar: المميزات
de: Funktionen
fr: Caractéristiques
ko: 기능
vi: Các tính năng
zh_cn: 特性

source: Specifications
ar: مواصفات
de: Spezifikationen
fr: Spécifications
ko: 사양
vi: Những đặc tả
zh_cn: 参数

source: First block mined at 11PM EST, 18th January 2014
ar: أول كتلة في 11 مساءً بتوقيت شرق الولايات المتحدة ، 18 يناير 2014
de: Der erste Block wurde am 18.01.2014 um 11 Uhr EST gemined
fr: Premier bloc miné le 18 janvier 2014 à 23 h (EST)
ko: 2014년 1월 18일 오후 11시(EST)에 첫 블록이 채굴됨
vi: Khối đầu tiên được đào vào lúc 11 giờ tối giờ bờ đông Mỹ, Ngày 18 tháng 1 năm 2014
zh_cn: 原始块产生于2014年1月18日，东部时间晚11点

source: No premine
ar: بدون تعدين
de: Kein Premine
fr: Aucun préminage
ko: 사전 채굴 해당 없음
vi: Không đào trước
zh_cn: 无预挖

source: X11 hashing algorithm, CPU/GPU/ASIC mining available
ar: X11 خوارزمية التجزئة ، التعدين وحدة المعالجة المركزية / GPU / ASIC المتاحة
de: X11 Hashing-Algorithmus, CPU-/GPU-/ASIC-Mining möglich
fr: Algorithme de hachage X11, minage CPU/GPU/ASIC disponible
ko: X11 해싱 알고리즘, CPU/GPU/ASIC 채굴 가능
vi: Thuật toán băm X11, hiện có thể đào được với CPU/GPU/ASIC
zh_cn: X11算法，CPU/GPU/ASIC均可用

source: 2.6 minute block time, 2MB blocks, ~56 transactions per second
ar: 2.6 دقيقة كتلة الوقت ، وكتل 2MB ، ~ 56 المعاملات في الثانية الواحدة
de: 2,6 Minuten Blockzeit, 2MB Blocks, ~56 Transaktionen in der Sekunde
fr: Fréquence de bloc 2,6 minutes, blocs de 2 Mo, environ 56 transactions par seconde
ko: 블록 간격 2.6분, 블록 크기 2MB, 초당 ~56회 거래 처리
vi: Thời gian khối 2.6 phút, kích thước khối 2MB, ~56 giao dịch mỗi giây
zh_cn: 区块时间2.6 分钟, 区块大小2MB, ~56 笔交易每秒

source: Block reward decreases by 7.14% per year
ar: انخفاض المكافأة بنسبة 7.14٪ سنوياً
de: Block-Rewards werden jedes Jahr um 7,14% reduziert
fr: La récompense de bloc décroît de 7,14% par an
ko: 매년 7.14%의 블록 보상 감소
vi: Phần thưởng khối giảm 7.14% mỗi năm
zh_cn: 每年区块奖励减产率7.14%

source: Dark Gravity Wave difficulty adjustment algorithm
ar: جاذبية الظلام موجة صعوبة التكيف خوارزمية
de: Dark Gravity Wave Algorithmus zur Anpassung der Schwierigkeit
fr: Algorithme d'ajustement de la difficulté Dark Gravity Wave
ko: Dark Difficulty Wave 난이도 조정 알고리즘
vi: Thuật toán điều chỉnh độ khó Dark Gravity Wave
zh_cn: 暗黑重力波难度调节算法

source: Between 17.74M and 18.92M total coin supply
ar: بين 17.74M و 18.92M إجمالي المعروض من العملات
de: Maximal zwischen 17,74 und 18,92 Millionen Coins
fr: Masse monétaire totale entre 17,74 et 18,92 millions d'unités
ko: 총 코인 공급량 1,774만~1,892만개 사이
vi: Tổng lượng coin có thể sinh ra vào khoảng từ 17.74 triệu đến 18.92 triệu
zh_cn: 总发行量在17.74M到18.92M之间

source: Decentralized second-tier masternode network
ar: شبكة ماسترنود من الدرجة الثانية اللامركزية
de: Dezentralisiertes Masternode-Netzwerk als zweite Ebene
fr: Réseau décentralisé de second niveau (masternodes)
ko: 분산화된 2계층 마스터노드 네트워크
vi: Mạng lưới bậc hai phi tập trung của các masternode
zh_cn: 分布式双层主节点网络

source: Superior privacy using PrivateSend
fr: Une meilleure confidentialité des transactions avec PrivateSend

source: Instant transactions using InstantSend
ar: معاملات فورية باستخدام الإرسال الفوري
de: Sekundenschnelle Transaktionen durch InstantSend
fr: Transactions instantanées avec InstantSend
ko: 인스턴트샌드를 이용한 즉각적인 거래
vi: Giao dịch tức thời sử dụng InstantSend
zh_cn: 通过即时支付实现瞬时交易

source: Protection against blockchain reorganization events (commonly called 51% attacks) using ChainLocks
fr: Protection contre les opérations de réorganisation de chaîne (plus connues sous le nom d'attaques 51%) avec la fonctionnalité ChainLocks

source: Decentralized Governance By Blockchain allows masternode owners to vote on budget proposals and decisions that affect Dash
ar: الحوكمة اللامركزية من خلال بلوكشين يسمح لمالكي ماسترنود للتصويت على مقترحات الميزانية والقرارات التي تؤثر على داش
de: Die dezentralisierte Entscheidungsfindung durch die Blockchain (Decentralized Governance By Blockchain) erlaubt es den Besitzern der Masternodes über Budget-Proposal abzustimmen und Entscheidungen, die für Dash von Bedeutung sind, zu treffen
fr: Le système de gouvernance décentralisé permet aux opérateurs de masternode de voter sur les propositions budgétaires et sur les décisions qui affectent Dash.
ko: 블록체인에 의한 분산화된 거버넌스를 통해 마스터노드 소유자가 예산 제안서와 대시에 영향을 미치는 결정에 투표를 진행
vi: Hệ quản trị phi tập trung bởi Blockchain cho phép các chủ masternode bỏ phiếu cho các đề xuất ngân sách và các quyết định mà ảnh hưởng đến Dash
zh_cn: 基于区块链的去中心化管理系统使得主节点持有者可以对预案进行投票，成为达世币发展的决策者。

source: In addition to traditional Proof of Work (PoW) rewards for mining Dash, users are also rewarded for running and maintaining special servers called masternodes. Thanks to this innovative two tier network, Dash can offer innovative features in a trustless and decentralized way. Masternodes are used to power PrivateSend, InstantSend, and the governance and treasury system. Users are rewarded for running masternodes; 45% of the block reward is allocated to pay the masternode network. You can view practical guides on all topics relating to masternodes :ref:`here <masternodes>`.
ar: بالإضافة إلى مكافآت (Pow) التقليدية للتعدين داش ، تتم مكافأة المستخدمين أيضًا لتشغيل وصيانة خوادم خاصة تسمى ماسترنود. بفضل هذه الشبكة المبتكرة ثنائية الطبقة ، يمكن أن تقدم داش ميزات مبتكرة بطريقة لا مركز لها وغير مركزية. يتم استخدام ماسترنود لتشغيل الإرسال المخفي و الإرسال الفوري ونظام الحوكمة والخزانة. تتم مكافأة المستخدمين لتشغيل ماسترنود. يتم تخصيص 45 ٪ من مكافأة الكتلة لدفع شبكة ماسترنود. يمكنك عرض أدلة عملية حول جميع المواضيع المتعلقة ماسترنود :ref:`هنا <masternodes>`.
de: Zusätzlich zu den traditionellen Proof of Work (PoW) Auszahlungen des Dash-Minings werden Nutzer auch für das Betreiben und Warten von speziellen Masternode-Servern entschädigt. Dank der innovativen zweiten Netzwerksebene kann Dash dezentralisierte und von Dritten unabhängige Funktionen anbieten. Die Masternodes sind für das Funktionieren von PrivateSend, InstantSend und des Entscheidungsfindungs-/Finanzierungs-Systems notwendig. Um Zuverlässigkeit zu gewährleisten, werden die Nutzer für das Betreiben der Masternodes mit 45% der Block-Rewards entschädigt. Praktische Fragen zum Thema Masternodes werden :ref:`hier<masternodes>` beantwortet.
fr: En plus des récompenses classiques de preuve de travail (PoW) pour le minage de Dash, les utilisateurs sont aussi rétribués pour la mise en place et la maintenance de serveurs spéciaux, appelés masternodes. Grâce à ce réseau innovant de second niveau, Dash propose des fonctions novatrices d'une façon décentralisée et sans recours à des tiers de confiance. Les masternodes servent également aux fonctions PrivateSend, InstantSend, à la gouvernance et au système budgétaire. Les utilisateurs sont rétribués pour leur opération de masternodes : 45% de la récompense de bloc sert à payer le réseau des masternodes. Des guides pratiques sur les masternodes sont disponibles :ref:`ici <masternodes>`.
ko: 사용자들은 대시 채굴에 대한 전통적인 작업 증명(Proof of Work, PoW) 보상뿐만 아니라 마스터노드라고 불리는 특별한 서버를 운영하고 유지하는 데에 대해서도 보상을 받습니다. 이러한 혁신적인 2계층 네트워크 덕분에 대시는 신뢰가 필요없고 분산화된 방식으로 혁신적 기능을 제공할 수 있습니다. 마스터노드는 프라이빗샌드, 인스턴트샌드 및 거버넌스와 재무 시스템을 운영하는 데 사용됩니다. 사용자는 마스터노드를 운영하는 데에 대한 대가로 보상을 받습니다. 블록 보상의 45%는 마스터노드 네트워크에 할당됩니다. 마스터노드와 관련된 모든 실용적인 가이드는 :ref:`이곳 <masternodes>`\ 에서 확인하세요 .
vi: Ngoài phần thưởng của Proof of Work (PoW) truyền thống cho việc đào Dash, người dùng cũng được thưởng cho việc vận hành và duy trì các máy chủ đặc biệt được gọi là masternode. Nhờ mạng hai tầng tiên tiến này, Dash có thể cung cấp các tính năng sáng tạo theo cách không cần tin tưởng và phi tập trung. Các Masternode được sử dụng cho PrivateSend, InstantSend và hệ thống quản trị và ngân quỹ. Người dùng được trả thưởng cho việc vận hành các masternode; 45% của phần thưởng khối được phân bổ để trả cho mạng lưới masternode. Bạn có thể xem hướng dẫn cụ thể về tất cả các chủ đề liên quan đến masternodes :ref:`tại đây <masternodes>`.
zh_cn: 除了传统的工作量证明（PoW）挖矿回报外，达世币的用户还可以通过运行和维护一种称为主节点的特殊服务来获得回报。感谢这种革新的双层网络，使达世币能够以非信任制和去中心化的方式提供创新的功能。主节点可以用于驱动匿名支付，即时支付以及预算管理系统。用户可以通过运行主节点获得回报，45%的区块奖励被分配支付给主节点网络。你们可以\ :ref:`浏览一下 <masternodes>`\ 所有与主节点相关的操作指南。

source: Masternodes enable the following services:
ar: ماسترنود تمكين الخدمات التالية:
de: Masternodes ermöglichen die folgenden Funktionen:
fr: Les masternodes rendent possibles les fonctions suivantes :
ko: 마스터노드는 다음의 서비스에 활용됩니다.
vi: Masternode cung cấp những dịch vụ sau đây:
zh_cn: 主节点实现以下服务：

source: **InstantSend** allows for near-instant transactions. Dash InstantSend transactions are fully confirmed within two seconds.
ar: **الإرسال الفوري** يسمح للمعاملات شبه الفورية. يتم تأكيد معاملات داش الإرسال الفوري بشكل كامل خلال ثانيتين
de: **InstantSend** erlaubt sekundenschnelle Transaktionen. Durch Dash-InstantSend ist eine Transaktion innerhalb von zwei Sekunden bestätigt.
fr: **InstantSend** permet des transactions quasi instantanées. Les transactions InstantSend Dash sont entièrement confirmées en moins de deux secondes.
ko: **인스턴트샌드** 를 통해 즉각적인 거래가 가능합니다. 대시 인스턴트샌드 거래는 2초 내에 완전한 확인이 가능합니다.
vi: **InstantSend** cho phép có những giao dịch gần như tức thời. Các giao dịch InstantSend của Dash được xác thực đầy đủ chỉ trong vòng hai giây đồng hồ.
zh_cn: **即时支付**\ 实现几乎瞬间的交易。达世币的即时支付功能可以在两秒内完成所有交易确认。

source: **PrivateSend** gives financial privacy through a decentralized implementation of CoinJoin.
fr: **PrivateSend** rend possible une meilleure confidentialité financière en obscurcissant la source des fonds sur la blockchain.

source: **ChainLocks**, which protects the blockchain against 51% mining attacks by signing blocks as they are mined.
fr: **ChainLocks**, qui protège la blockchain contre les attaques de minage 51% en signant les blocs lorsqu'ils sont minés.

source: **Governance and Treasury** allows stakeholders in Dash to determine the direction of the project and devotes 10% of the block reward to development of the project and ecosystem.
fr: **La gouvernance et le trésor*** permettent aux investisseurs Dash de choisir la direction du projet et allouent 10% de la récompense de bloc au développement du projet et de son écosystème.

source: **Dash Evolution** will make using cryptocurrency as easy as using PayPal.
ar: **تورة الداش** سيجعل استخدام العملات الرقمية سهل مثل استخدام بايبال.
de: **Dash Evolution** wird Kryptowährungen so benutzerfreundlich wie PayPal machen.
fr: **Dash Evolution** rendra l'utilisation des cryptomonnaies aussi simple que PayPal.
ko: **대시 에볼루션** 은 암호화폐 사용을 페이팔 사용만큼 쉽게 만들 것입니다.
vi: **Dash Evolution** sẽ làm cho việc sử dụng tiền kỹ thuật số trở nên dễ dàng như dùng PayPal
zh_cn: **达世币进化版**\ 将会使数字货币变得如PayPal一样简单易用。

source: Masternode owners must have possession of 1000 DASH, which they prove by signing a message included in a special transaction written to the blockchain. The Dash can be moved or spent at any time, but doing so will cause the masternode to fall out of queue and stop earning rewards. Masternode users are also given **voting rights** on proposals. Each masternode has one vote and this vote can be used on budget proposals or important decisions that affect Dash.
fr: Les opérateurs de masternode doivent posséder 1000 dashs, ce qu'ils prouvent en signant un message dans une transaction spéciale écrite sur la blockchain. Ces fonds peuvent être déplacés à tout moment, mais leur déplacement fera sortir le masternode de la file d'attente et arrêtera sa rémunération. Les opérateurs de masternode ont aussi des **droits de vote** sur les propositions budgétaires. Chaque masternode représente une voix, et cette voix porte sur les propositions budgétaires ou les décisions importantes affectant Dash.

source: Masternodes cost money and effort to host so they are paid a percentage of the block reward as an incentive. Because only one masternode is paid in each block, the frequency of the payment can vary, as well as the value of the Dash paid out. This `tool <https://stats.masternode.me/>`_ shows a live calculation of masternode earnings. These rewards decrease by 7% each year, together with the block reward. There is also the possibility for masternodes to earn money from fees in the future.
fr: Les masternodes représentent un coût financier et un travail d'hébergement, ils perçoivent donc à titre de rétribution une part de la récompense de bloc. Puisqu'un seul masternode est payé avec chaque bloc, la fréquence des paiements peut varier, tout comme la valeur des dashs versés. Cet `outil <https://stats.masternode.me/>`_ propose une estimation en temps réel des gains des masternodes. Les récompenses décroissent de 7% par an, en même temps que la récompense de bloc. Les masternodes ont aussi la possibilité future de gagner de l'argent sur les frais de transaction.

source: PrivateSend gives you true financial privacy by obscuring the origins of your funds. All the Dash in your wallet is comprised of different "inputs", which you can think of as separate, discrete coins. PrivateSend uses an innovative process to mix your inputs with the inputs of at least two other people in a single transaction, so the value in Dash never leaves your wallet. You retain control of your money at all times.
fr: PrivateSend propose une véritable confidentialité financière en obscurcissant l'origine de vos fonds. Tous les dashs de votre portefeuilles sont rangés dans différentes “entrées", qu'on peut imaginer comme des pièces de monnaie distinctes. PrivateSend utilise un procédé innovant pour mélanger vos entrées avec les entrées d'au moins deux autres personnes dans une seule transaction, sans que jamais vos fonds Dash ne quittent votre portefeuille. Vous gardez le contrôle de vos fonds à tout moment.

source: You can view a practical guide to use PrivateSend :ref:`here <dashcore-privatesend-instantsend>`.
ar: يمكنك عرض دليل عملي لاستخدام الإرسال المخفي :ref:`هنا <dashcore-privatesend-instantsend>`.
de: Eine praktische Anleitung zur Verwendung von PrivateSend findet sich :ref:`hier <dashcore-privatesend-instantsend>`.
fr: Un guide pratique de PrivateSend est consultable :ref:`ici <dashcore-privatesend-instantsend>`.
ko: 프라이빗샌드의 사용에 관한 실용적인 가이드는 :ref:`이곳 <dashcore-privatesend-instantsend>`\ 에서 확인하세요.
vi: Bạn có thể xem hướng dẫn thực hành việc sử dụng PrivateSend :ref:`ở đây <dashcore-privatesend-instantsend>`.
zh_cn: 你可以在\ :ref:`这里 <dashcore-privatesend-instantsend>`\ 浏览使用匿名支付的操作指南。

source: The PrivateSend process works like this:
ar: تعمل عملية الإرسال المخفي على النحو التالي:
de: Der PrivateSend-Prozess funktioniert wie folgt:
fr: Le processus PrivateSend se déroule ainsi :
ko: 프라이빗샌드는 다음과 같은 방식으로 처리됩니다:
vi: Tiến trình làm việc của PrivateSend hoạt động như sau:
zh_cn: 匿名支付的实现原理时这样的：

source: PrivateSend begins by breaking your transaction inputs down into standard denominations. These denominations are 0.001, 0.01, 0.1, 1 and 10 DASH -- much like the paper money you use every day.
de: Für PrivateSend ist es notwendig, dass die ungeraden Transaktions-Inputs in standardisierte Denominationen aufgespalten werden. Diese Denominationen sind 0,001 Dash, 0,01 Dash, 0,1 Dash, 1 Dash und 10 Dash -- sie ähneln dabei den Scheinen und Münzen, die im Alltag verwendet werden
fr: PrivateSend commence par fractionner les entrées de votre transaction en coupures standard. Ces coupures sont de 0,001, 0,01, 0,1, 1 et 10 dashs -- un peu à la manière des billets de banque que vous utilisez tous les jours.
zh_cn: 匿名发送首先将你的交易输入打乱面额化。这些面额包含0.001, 0.01, 0.1, 1 和 10 DASH -- 就像日常使用中的纸币一样。

source: Your wallet then sends requests to specially configured software nodes on the network, called "masternodes". These masternodes are informed then that you are interested in mixing a certain denomination. No identifiable information is sent to the masternodes, so they never know "who" you are.
ar: عندئذٍ ترسل محفظتك طلبات إلى عقد برامج تم تكوينها خصيصًا على الشبكة ، تُسمى "ماسترنود". يتم إخبار هذه الألفاظ بأنك مهتم بخلط فئة معينة. يتم إرسال أي معلومات يمكن تحديدها إلى ماسترنود ، لذلك لا يعرفون أبدا "من" أنت.
de: Die Wallet des Nutzers sendet darauf hin Anfragen an speziell konfigurierte Software-Nodes, die sog. "Masternodes". Diese Masternodes wissen darauf hin, welche Denominationen gemischt werden sollen. Dabei werden jedoch keine Identitäts-bezogenen Informationen an die Masternodes weitergeleitet, weswegen diesen nicht bekannt ist, "wer" die Anfragen gesendet hat.
fr: Ensuite, votre portefeuille envoie des requêtes à des serveurs spécifiques sur le réseau, appelés les "masternodes". Ces masternodes sont informés que vous souhaitez mélanger certaines coupures. Aucune information d'identification n'est envoyée aux masternodes, qui ne savent jamais "qui" vous êtes.
ko: 이후 당신의 지갑은 ‘마스터노드’라고 불리는 네트워크의 특수 구성 소프트웨어 노드에 요청을 전송합니다. 이로써 이들 마스터노드는 당신이 특정 금액을 믹싱하고자 한다는 정보를 수신합니다. 마스터노드에는 당신의 개인 정보를 식별할 수 있는 어떤 내용도 전송되지 않습니다. 즉 당신이 ‘누구’인지 알 수 있는 방법은 없습니다.
vi: Ví của bạn sau đó sẽ gửi yêu cầu cho một nút có phần mềm được cấu hình đặc biệt trên mạng, được gọi là "masternode". Các masternode được thông báo rằng bạn đang muốn trộn một mệnh giá nhất định. Không có thông tin nhận dạng nào được gửi cho các masternode, và họ không bao giờ biết bạn "là ai".
zh_cn: 然后你的钱包会将需求发送到网络中的特殊节点上，称之为主节点服务器。这些主节点会接到通知你有兴趣混合一定的面额。不会有可识别的信息发送给主节点，所以主节点也不会知道你是谁。

source: When two other people send similar messages, indicating that they wish to mix the same denomination, a mixing session begins. The masternode mixes up the inputs and instructs all three users' wallets to pay the now-transformed input back to themselves. Your wallet pays that denomination directly to itself, but in a different address (called a change address).
ar: عندما يرسل شخصان آخران رسائل مشابهة ، تشير إلى أنهما يرغبان في خلط نفس المذهب ، تبدأ جلسة الخلط. يمزج ماسترنود يصل المدخلات ويكلف محافظ المستخدمين الثلاثة لدفع المدخلات تحولت الآن إلى أنفسهم. تدفع محفظتك تلك التسمية مباشرة لنفسها ، ولكن في عنوان مختلف (يسمى عنوان التغيير).
de: Wenn zwei weitere Nutzer signalisieren, dass sie dieselbe Denomination mischen wollen, wird der Mischvorgang eingeleitet. Die Masternodes mischen die Inputs und instruieren die Wallets der Nutzer die gemischten Inputs an sich selbst zurück zu überweisen. Die Wallet zahlt sich die Denomination selbst aus, schickt sie aber an eine andere Adresse (die Wechselgeldadresse).
fr: Quand deux autres personnes envoient des requêtes similaires, indiquant qu'ils souhaitent mélanger les mêmes coupures, une séance de mélange commence. Le masternode mélange les entrées et demande aux portefeuilles des trois utilisateurs de se verser à eux-mêmes l'entrée désormais transformée. Votre portefeuille s'auto-envoie cette coupure, mais à une adresse différente (appellée adresse de monnaie rendue).
ko: 두 명의 다른 사람이 비슷한 메시지를 보내어 그들 역시 같은 분할 단위의 금액을 믹싱하고 싶다는 정보를 표시하면 믹싱 세션이 시작됩니다. 마스터노드는 이들 입력값을 믹싱하여 세 사용자의 지갑에 변환된 입력값을 지불하도록 지시합니다. 당신의 지갑은 해당 입력값을 지불하지만, 지불되는 주소는 '변경 주소'라고 불리는 다른 주소로 보내집니다.
vi: Khi có hai người khác gửi các thông điệp tương tự, cho biết họ muốn trộn cùng một mệnh giá, thì một phiên trộn sẽ bắt đầu. Masternode trộn những đầu vào và ra lệnh cho tất cả các ví của ba người dùng bắt đầu biến đổi đầu vào để trả cho chính họ. Ví của bạn trả mệnh giá đó trực tiếp cho chính nó, nhưng trong một địa chỉ khác (gọi là địa chỉ đổi tiền hay địa chỉ trả tiền lẻ).
zh_cn: 当有其他两个人发出了类似的信息，显示他们也希望混合同样的面额时，混币便开始了。主节点将币混在一起，并给这三个用户的钱包指令，让它们把这些现在已经转化了的币回付给自己。你的钱包将这些面额直接付给自己，但是地址已经改变（称为变更地址）。

source: Your wallet must repeat this process a number of times with each denomination. Each time the process is completed, it's called a "round". Each round of PrivateSend makes it exponentially more difficult to determine where your funds originated. The user may choose between 1-16 rounds of mixing.
fr: Votre portefeuille répète ce processus un certain nombre de fois avec chaque coupure. On appelle "cycle" chaque processus accompli. Chaque cycle PrivateSend rend exponentiellement plus difficile de savoir d'où proviennent vos fonds. L'utilisateur peut choisir entre 1 et 16 cycles de mélange.

source: This mixing process happens in the background without any intervention on your part. When you wish to make a private transaction, your funds will be ready to spend. No additional waiting is required.
fr: Le processus de mélange a lieu en arrière-plan, sans aucune intervention de votre part. Quand vous souhaiterez envoyer une transaction, vos fonds auront déjà été anonymisés. Aucune autre attente ne sera nécessaire.

source: Note that PrivateSend transactions will be rounded up so that all transaction inputs are spent. Any excess Dash will be spent on the transaction fee.
ar: لاحظ أنه سيتم تقريب معاملات الإرسال المخفي بحيث يتم إنفاق كافة مدخلات المعاملة. سيتم إنفاق أي زيادة في داش على رسوم المعاملة.
de: Es ist wichtig zu beachten, dass PrivateSend-Transaktionen aufgerundet werden, da der gesamte Input einer Adresse versandt wird. Alles überzählige Dash wird in die Transaktionskosten integriert.
fr: À noter : les transactions InstantSend seront arrondies à la hausse, de telle manière que toutes les entrées de la transaction soient dépensées. Tous les dashs éventuellement en excès seront dépensés en frais de transaction.
ko: 프라이빗샌드 거래는 반올림되어 모든 거래 입력값을 사용한다는 점에 주의하세요. 초과되는 대시는 거래 수수료에 사용됩니다.
vi: Chú ý rằng những giao dịch PrivateSend sẽ được làm tròn để tất cả các đầu vào giao dịch đều được chi tiêu. Bất kỳ số Dash dư thừa sẽ được chi tiêu vào phí giao dịch.
zh_cn: 注意匿名支付的交易都会取整数，所以所有的交易输入都会被使用。任何超出部分都会被用于交易手续费。
