Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/information.po
Languages: fr

source: The number of confirmations for a specific Dash transaction. Zero confirmations means that the **transaction is unconfirmed**. One confirmation means that the transaction is included in the latest block in the blockchain. Two confirmations means the transaction is included in two blocks, three confirmations for three blocks, and so on. The probability of a transaction being reversed (double spent) diminishes exponentially with every block and subsequent confirmation. Six confirmations is usually considered "safe" and irreversible.
fr: Le nombre de confirmations pour une transaction Dash donnée. Zéro confirmation signifie que la **transaction n'est pas confirmée**. Une seule confirmation signifie que la transaction est incluse dans le plus récent bloc de la blockchain. Deux confirmations signifient que la transaction est incluse dans deux blocs, trois confirmations dans trois blocs, et ainsi de suite. La probabilité qu'une transaction soit inversée (double dépense) diminue exponentiellement avec chaque bloc et chaque confirmation. Six confirmations sont en général considérées comme "sûres" et irréversibles.

source: Confirmed Transactions
fr: Transactions confirmées

source: Transactions that are processed by miners and considered irreversible, usually after six confirmations. In the case of InstantSend, funds can be considered irreversible after a few seconds, but must still be written to the blockchain (and thus "confirmed").
fr: Ce sont les transactions traitées par les mineurs et considérées comme irréversibles, en général après six confirmations. Dans le cas d'InstantSend, les fonds peuvent être considérés comme transmis irréversiblement au bout de quelques secondes, mais doivent encore être écrits sur la blockchain (et donc "confirmés").

source: CPU
fr: Processeur (CPU)

source: A `central processing unit (CPU) <https://en.wikipedia.org/wiki/Central_processing_unit>`_ is the electronic circuitry within a computer that carries out the instructions of a computer program by performing the basic arithmetic, logical, control and input/output (I/O) operations specified by the instructions. The term has been used in the computer industry at least since the early 1960s. Traditionally, the term "CPU" refers to a processor, more specifically to its processing unit and control unit (CU), distinguishing these core elements of a computer from external components such as main memory and I/O circuitry.
fr: Un `processeur (CPU) <https://fr.wikipedia.org/wiki/Processeur>`_ est le circuit électronique d'un ordinateur qui se charge des instructions données par un programme, en accomplissant les opérations basiques arithmétiques, logiques, de contrôle et d'entrée-sortie (I/O) spécifiées par ces instructions. Le terme est en usage en informatique au moins depuis le début des années 60. Traditionnellement, le mot "CPU" fait référence à un processeur et plus particulièrement à son unité processeur et de contrôle (CU), dans une distinction entre ces éléments de base d'un ordinateur et des éléments externes tels que la mémoire principale et les circuits d'entrée-sortie.

source: Cryptocurrency
fr: Cryptomonnaie

source: A `cryptocurrency <https://en.wikipedia.org/wiki/Cryptocurrency>`_ (or crypto currency or crypto-currency) is a medium of exchange using cryptography to secure the transactions and to control the creation of new units.
fr: Une `cryptomonnaie <https://fr.wikipedia.org/wiki/Cryptomonnaie>`_ (ou cryptodevise, ou cryptoactif) est un moyen d'échange basé sur la cryptographie afin de sécuriser les transactions et de contrôler la création de nouvelles unités.

source: Cryptography
fr: Cryptographie

source: Cryptography or cryptology (from Greek κρυπτός *kryptós*, "hidden, secret"; and γράφειν *graphein*, "writing," or -λογία *-logia*, "study," respectively) is the practice and study of techniques for secure communication in the presence of third parties called adversaries. More generally, cryptography is about constructing and analyzing protocols that prevent third parties or the public from reading private messages; various aspects in information security such as data confidentiality, data integrity, authentication, and non- repudiation are central to modern cryptography. Modern cryptography exists at the intersection of the disciplines of mathematics, computer science, and electrical engineering. Applications of cryptography include ATM cards, computer passwords, and electronic commerce.
fr: La cryptographie ou cryptologie (du grec κρυπτός *kryptós*, "caché, secret", et γράφειν *graphein*, "écriture", or -λογία *-logia*, "raison", respectivement) est la pratique et l'étude de techniques de communication sécurisée en la présence de tierces parties nommées adversaires. Plus généralement, la cryptographie se consacre à bâtir et analyser des protocoles qui empêchent les tierces parties ou le public de lire des messages confidentiels ; certains aspects de la sécurité informatique, telles que la confidentialité des données, leur intégrité, leur authenticité et leur non-répudiation, sont centraux dans la cryptographie moderne. Cette dernière est à l'intersection des mathématiques, de l'informatique et de l'ingénierie électronique. Les applications de la cryptographie incluent par exemple les cartes bancaires, les mots de passe informatiques et le commerce électronique.

source: Decentralized Application Protocol. This term describes an application running on top of the Dash DAPI platform.
fr: Protocole d'application décentralisé (Decentralized Application Protocol). Ce terme décrit une application tournant sur la plateforme Dash DAPI.

source: DAP Client
fr: Client DAP

source: An HTTP Client that connects to DAPI and enables Dash blockchain users to read and write data to their DAP Space.
fr: Client HTTP qui se connecte à la DAPI et permet aux utilisateurs de la blockchain Dash de lire et d'écrire des données sur leur espace DAP.

source: DAP Schema
fr: Schème DAP

source: A Dash Schema document extending the Dash System Schema to define consensus data and rules within a DAP contract.
fr: Document sur le schème Dash améliorant le schème du système Dash, en vue de définir les données et les règles de consensus au sein d'un contrat DAP.

source: DAP Space
fr: Espace DAP

source: The part of a DAP State that is owned by a specific blockchain user. Data in a DAP Space can only be changed by the owner.
fr: Partie d'un état DAP qui est la propriété d'un utilisateur donné de la blockchain. Les données d'un espace DAP ne peuvent être modifiées que par leur propriétaire.

source: DAP State
fr: État DAP

source: The total set of data stored in a DAP. This data consists of user DAP Spaces.
fr: Jeu complet de données stockées dans une DAP. Ces données sont constituées d'espaces DAP utilisateur.

source: Decentralized Application Programming Interface. See above for a definition of API. DAPI will perform the same functions as an API, but with quorums of masternodes acting as the endpoints for API communication.
fr: Interface de programmation d'application décentralisée (Decentralized Application Programming Interface). Voir ci-dessus la définition d'API. La DAPI aura les mêmes fonctionnalités, mais avec des quorums de masternodes agissant comme interlocuteurs dans la communication API.

source: In concept, :ref:`Dark Gravity Wave (DGW) <dark-gravity-wave>` is similar to *Kimoto Gravity Well*, adjusting the difficulty levels every block (instead of every 2016 blocks like Bitcoin) by using statistical data of the last blocks found. In this way block issuing times can remain consistent despite fluctuations in hashpower. However it doesn't suffer from the time-warp exploit.
fr: :ref:`Dark Gravity Wave (DGW) <dark-gravity-wave>` est conceptuellement analogue à Kimoto Gravity Well, par son ajustement de la difficulté à chaque bloc (au lieu de tous les 2016 blocs dans Bitcoin), en se basant sur les données statistiques des blocs les plus récemment trouvés. Cela permet de forger des blocs à des fréquences assez régulières même si la puissance de hachage fluctue beaucoup, et ce sans être menacé par la faille “time-warp".

source: Dash was initially launched as XCoin and then rebranded to Darkcoin and finally Dash.
fr: Dash a été originellement lancé sous le nom d'XCoin, puis a vu son nom changé en Darkcoin, et finalement en Dash.

source: Originally launched as Xcoin and later renamed to Darkcoin, the currency was later renamed "Dash" to avoid association with the darknet markets. Dash is a portmanteau of "Digital Cash." Dash is an open source peer-to- peer cryptocurrency that solves many of Bitcoin's problems. Dash's features include PrivateSend, InstantSend, Decentralized Governance by Blockchain (DGBB), a 2nd tier network (referred to as the masternode network). See the :ref:`Features <features>` page for a full list of Dash's features.
fr: Lancée à l'origine sous le nom d'"XCoin" et renommée plus tard "Darkcoin", la monnaie a été par la suite rebaptisée "Dash" pour éviter l'association avec les marchés du "darknet". Dash est un mot-valise de "digital cash" (argent liquide numérique). Dash est une cryptomonnaie open source et pair à pair qui résout beaucoup des problèmes de Bitcoin. Les caractéristiques de Dash incluent PrivateSend, InstantSend, la gouvernance décentralisée par blockchain (DGBB), un réseau de second niveau (connu sous le nom de réseau des masternodes). Voir la page des :ref:`caractéristiques <features>` pour une liste complète des fonctionnalités de Dash. Voir aussi l'article Wikipédia : https://fr.wikipedia.org/wiki/Dash_(crypto-monnaie)

source: Dash network data storage backend service used by masternodes for off-chain data relating to Evolution. DashDrive implements `IPFS <https://ipfs.io>`_, a type of distributed file storage system.
fr: Service backend de stockage de données réseau Dash, utilisé par les masternodes pour des données hors chaîne relatives à Evolution. DashDrive implémente `IPFS <https://ipfs.io>`_, un type de système distribué de stockage de fichiers.

source: Dash Client
fr: Client Dash

source: Dash clients are software programs used to interface with the Dash network. They store the private keys needed to conduct Dash transactions as well as a copy of the entire blockchain. A Dash client connects to the Dash network and becomes a node in the network. A node shares and propagates new transactions with the rest of the network, creating a robust decentralized infrastructure.
fr: Les clients Dash sont des logiciels utilisés pour accéder au réseau Dash. Ils conservent les clés privées nécessaires pour faire des transactions Dash, ainsi qu'une copie de la blockchain entière. Un client Dash se connecte au réseau Dash et devient un nœud du réseau. Un nœud partage et propage les nouvelles transactions au reste du réseau, créant ainsi une infrastructure décentralisée robuste.

source: Dash Core Wallet
fr: Portefeuille Dash Core

source: The :ref:`Dash Core Wallet <dash-core-wallet>` (known also as the QT wallet) is the "official" Dash wallet that is compiled by the Dash Core Team and allows both PrivateSend and InstantSend. The DashCore wallet will download the entire blockchain and serve it over the internet to any peers who request it.
fr: Le :ref:`portefeuille officiel Dash Core <dash-core-wallet>` (également connu sous le nom de portefeuille QT) est le portefeuille Dash officiel, compilé par l'équipe Dash Core, et permettant les fonctionnalités PrivateSend et InstantSend. Le portefeuille Dash Core télécharge entièrement la blockchain et la fournit sur Internet à tous les pairs qui la demandent.

source: This is a 3 tier network Dash developers are presently building. It will make Dash as easy to use as PayPal, while still remaining decentralized. See the :ref:`Evolution <evolution>` page for more information.
fr: Il s'agit d'un réseau de troisième niveau, actuellement élaboré par les développeurs Dash. Il rendra l'utilisation de Dash aussi simple que celle de PayPal, tout en préservant sa décentralisation. Voir la page :ref:`Evolution <evolution>` pour en savoir plus.

source: Dash Schema
fr: Schème Dash

source: A JSON-based language specification for defining and validating consensus data in Evolution.
fr: Spécification de langage basée sur JSON, définissant et validant les données de consensus dans Evolution.

source: DDoS
fr: Attaque de déni de service (DDoS)

source: A distributed denial of service attack uses large numbers of computers under an attacker’s control to drain the resources of a central target. They often send small amounts of network traffic across the Internet to tie up computing and bandwidth resources at the target, which prevents it from providing services to legitimate users. Dash exchanges have sometimes been hit with DDoS attacks.
fr: Une attaque distribuée de déni de service utilise un grand nombre d'ordinateurs, sous le contrôle d'un attaquant, pour épuiser les ressources d'une cible centrale. Ils envoient le plus souvent de petites quantités de trafic Internet pour paralyser les ressources de calcul et la bande passante de la cible, ce qui l'empêche de fournir ses services à ses utilisateurs légitimes. Des plateformes de change proposant Dash ont parfois été la cible d'attaques DDoS.

source: Decentralized
fr: Décentralisé

source: `Decentralized computing <https://en.wikipedia.org/wiki/Decentralized_computing>`_ is the allocation of resources, both hardware and software, to each individual workstation or office location. In contrast, centralized computing exists when the majority of functions are carried out or obtained from a remote centralized location. Decentralized computing is a trend in modern-day business environments. This is the opposite of centralized computing, which was prevalent during the early days of computers. A decentralized computer system has many benefits over a conventional centralized network. Desktop computers have advanced so rapidly that their potential performance far exceeds the requirements of most business applications. This results in most desktop computers remaining nearly idle most of the time. A decentralized system can use the potential of these systems to maximize efficiency. However, it is debatable whether these networks increase overall effectiveness.
fr: `L'informatique décentralisée <https://en.wikipedia.org/wiki/Decentralized_computing>`_ consiste à allouer les ressources, aussi bien matérielles que logicielles, à chaque station de travail individuelle ou site professionnel. Par contraste, on parle d'informatique centralisée quand la majorité des fonctions sont assurées par ou obtenues depuis un lieu centralisé distant. L'informatique décentralisée est une tendance forte dans les environnements de travail modernes. Elle s'oppose à l'informatique centralisée dominante aux débuts de l'informatique. Un système informatique décentralisé a beaucoup d'avantages par rapport à un réseau centralisé traditionnel. Les ordinateurs de bureau ont fait de tels progrès que leurs performances potentielles excèdent de loin les besoins de la plupart des applications professionnelles. En conséquence, la plupart des ordinateurs de bureau sont inactifs la majeure partie du temps. Un système décentralisé peut mettre à profit le potentiel de ces systèmes pour optimiser leur efficacité. Toutefois, l'augmentation de l'efficacité globale est sujette à débat.

source: Desktop Wallet
fr: Portefeuille logiciel

source: A wallet is a piece of software that stores your Dash. There are many different wallet options, but it is imperative to choose a secure one. We recommend any of the following: :ref:`Dash Core Wallet <dash-core-wallet>` / :ref:`Dash Electrum Wallet <dash-electrum-wallet>` / :ref:`Hardware Wallets <hardware-wallets>`
fr: Un portefeuille est un logiciel qui stocke vos dashs. Il en existe beaucoup, mais il est important d'en choisir un sûr. Nous recommandons les portefeuilles suivants : :ref:`portefeuille officiel Dash Core <dash-core-wallet>` / :ref:`portefeuille Dash Electrum <dash-electrum-wallet>` / :ref:`portefeuilles matériels <hardware-wallets>`

source: Difficulty
fr: Difficulté

source: This number determines how difficult it is to hash a new block. It is related to the maximum allowed number in a given numerical portion of a transaction block’s hash. The lower the number, the more difficult it is to produce a hash value that fits it. Difficulty varies based on the amount of computing power used by miners on the Dash network. If large numbers of miners leave a network, the difficulty would decrease. Dash's increasing popularity and the availability of specialized ASIC miners have caused the difficulty to increase over time.
fr: Ce nombre détermine la difficulté de produire un hachage pour un nouveau bloc. Il est lié au nombre maximum autorisé dans la partie numérique donnée du hash de bloc d'une transaction. Plus ce nombre est petit, plus il est difficile de produire un hachage correspondant. La difficulté varie selon la quantité de puissance de calcul utilisée par les mineurs sur le réseau Dash. Si beaucoup de mineurs abandonnent un réseau, la difficulté diminuera. La popularité croissante de Dash et la disponibilité de mineurs ASIC spécialisés ont fait croître la difficulté avec le temps.

source: Digital Wallet
fr: Portefeuille numérique

source: See :ref:`this link <wallets>` for full documentation on wallets.
fr: Voir :ref:`this link <wallets>` pour une documentation complète sur les portefeuilles.

source: A digital wallet is similar to a physical wallet except that it is used to hold **digital currency**. A Dash wallet holds your private keys, which allow you to spend your Dash. You are also able to make backups of your wallet in order to ensure that you never lose access to your Dash. Digital wallets can exist in many different forms and on many devices:
fr: Un portefeuille numérique est analogue à un portefeuille physique, sauf en ceci qu'il contient de la **monnaie numérique**. Un portefeuille Dash contient vos clés privées, qui vous permettent de dépenser vos dashs. Vous pouvez également faire des copies de sauvegarde de votre portefeuille pour vous assurer de ne jamais perdre l'accès à vos fonds. Les portefeuilles numériques existent sous différentes formes et sur de nombreux appareils :

source: **Desktop Wallet** (:ref:`Dash Electrum Wallet <dash-electrum-wallet>`, :ref:`Dash Core Wallet <dash-core-wallet>`): Wallet programs that you install on a laptop or desktop computer. You are solely responsible for protecting the wallet file and the private keys it contains. Make backup copies of your wallet files to ensure that you don't lose access to your funds.
fr: **Portefeuille logiciel de bureau** (:ref:`portefeuille Dash Electrum <dash-electrum-wallet>`, :ref:`portefeuille officiel Dash Core <dash-core-wallet>`) : des portefeuilles logiciels que vous pouvez installer sur un ordinateur de bureau ou portable. Vous êtes le seul responsable de la protection de votre fichier portefeuille et des clés privées qu'il contient. Faites des copies de sauvegarde de vos fichiers portefeuille pour vous assurer de ne pas perdre l'accès à vos fonds.

source: **Mobile Wallet** (:ref:`Android <dash-android-wallet>`, :ref:`iOS <dash-ios-wallet>`): These wallets can be downloaded through Google Play or Apple (iTunes) App Stores. Mobile wallets allow you to use Dash on-the-go by scanning a QR code to send payment. Make backup copies of your mobile wallet files to ensure that you don't lose access to your funds. Due to security issues with mobile phones, it is advised that you don't store large amounts of funds on these wallets.
fr: **Portefeuille logiciel mobile** (:ref:`Android <dash-android-wallet>`, :ref:`iOS <dash-ios-wallet>`) : ces portefeuilles peuvent être téléchargés à travers les boutiques Google Play ou l'App Store d'Apple. Les portefeuilles mobiles vous permettent d'utiliser Dash en déplacement, en scannant un code QR pour envoyer un paiement. Veuillez faire des copies de sauvegarde des fichiers de votre portefeuille mobile, pour vous assurer de ne pas perdre l'accès à vos fonds. En raison de certains problèmes de sécurité des téléphones mobiles, il est recommandé de ne pas stocker de larges sommes sur ces portefeuilles.

source: **Online/Cloud/Web Wallet** (:ref:`Exodus <third-party-wallets>`, :ref:`MyDashWallet <web-wallets>`): Third parties that will store your Dash on their servers for you or provide an interface to access your Dash with you providing the keys, so that you can access your Dash from any device connected to the internet. If their website is hacked or if their servers are damaged, you run the risk of losing your Dash. Any online wallets should be secured with strong passphrases and 2FA. You cannot make backup copies of your online wallet, because you do not have access to the private keys. We strongly urge that you NEVER store large amounts of Dash in any online wallet or cryptocurrency exchange.
fr: **Portefeuille en ligne, dans le nuage, sur le web** (:ref:`Exodus <third-party-wallets>`, :ref:`MyDashWallet <web-wallets>`) : il s'agit de tierces parties qui stockent vos dashs pour vous sur leurs serveurs, ou bien qui vous fournissent une interface pour accéder à vos dashs quand vous leur fournissez vos clés, de telle manière que vous pouvez accéder à vos fonds depuis n'importe quel appareil connecté à Internet. Si leur site web est piraté ou leurs serveurs endommagés, vous courez le risque de perdre vos dashs. Tout portefeuille en ligne devrait être sécurisé par des phrases de passe fortes et une double authentification (2FA). Vous ne pouvez pas faire de sauvegardes de votre portefeuille en ligne, car vous n'avez pas accès à ses clés privées. Nous vous recommandons fortement de ne JAMAIS stocker de sommes importantes en Dash sur un portefeuille en ligne ou une plateforme de change cryptomonétaire.

source: **Hardware Wallets** (:ref:`Trezor <hardware-wallets>`, KeepKey, Ledger, Nano): A hardware wallet is a specialized, tamper-proof, hardware device that stores your private keys. This device is able to sign transactions with your private key without being connected to the internet. However, you must have an internet connection to send the transaction to the Dash network. This allows your private keys to be accessed easily while still keeping them securely protected. This is widely regarded to be the safest form of storage for your Dash.
fr: **Portefeuilles matériels** (:ref:`Trezor <hardware-wallets>`, KeepKey, Ledger, Nano) : un portefeuille matériel est un appareil spécialisé, protégé contre les intrusions, qui stocke vos clés privées. L'appareil est capable de signer des transactions avec votre clé privée, sans être connecté à Internet. Cependant, vous devez disposer d'une connexion Internet pour envoyer la transaction au réseau Dash. Cet appareil permet d'accéder facilement à vos clés privées en les gardant sous une excellente protection. Cela est généralement considéré comme la meilleure forme de stockage pour vos fonds Dash.
