Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/information.po
Languages: fr

source: Glossary and collection of links to other parts of the Dash ecosystem and network
fr: Glossaire et collection de liens vers d'autres éléments du réseau Dash et de son écosystème

source: dash, cryptocurrency, glossary, links, community, official, github, roadmap, chat, discord, facebook, twitter, telegram, social media
fr: dash, cryptomonnaie, glossaire, liens, communauté, officiel, github, feuille de route, chat, discord, facebook, twitter, telegram, réseaux sociaux

source: Links and Information
fr: Liens et informations

source: Links
fr: Liens

source: Official sites
fr: Sites officiels

source: **Website:** https://www.dash.org
fr: **Site web :** https://www.dash.org

source: **User documentation:** https://docs.dash.org
fr: **Documentation utilisateur :** https://docs.dash.org

source: **Dash Core Documentation:** https://dashcore.readme.io
fr: **Documentation Dash Core :** https://dashcore.readme.io

source: **Dash Platform Documentation:** https://dashplatform.readme.io
fr: **Documentation Dash Platform :** https://dashplatform.readme.io

source: **Foundation:** https://www.dashfoundation.io
fr: **Fondation :** https://www.dashfoundation.io

source: **Roadmap:** https://www.dash.org/roadmap/
fr: **Feuille de route :** https://www.dash.org/fr/feuille-de-route

source: **DIPs:** https://github.com/dashpay/dips
fr: **DIP (Dash Improvement Proposals) :** https://github.com/dashpay/dips

source: Community sites
fr: Sites communautaires

source: **Dash Forum**: https://www.dash.org/forum/
fr: **Forum Dash** : https://www.dash.org/forum/

source: **BitcoinTalk thread:** https://bitcointalk.org/index.php?topic=421615.0
fr: **File de discussion BitcoinTalk :** https://bitcointalk.org/index.php?topic=421615.0

source: **链节点 (ChainNode) Forum:** https://www.chainnode.com/forum/115
fr: **链节点 (forum ChainNode) :** https://www.chainnode.com/forum/115

source: **Dash Nation Discord:** https://discord.com/invite/9z8zX5j
fr: **Discord Dash Nation :** https://discord.com/invite/9z8zX5j

source: **Dash Talk Discord:** https://discord.com/invite/PXbUxJB
fr: **Discord Dash Talk :** https://discord.com/invite/PXbUxJB

source: **Dash Dapp Devs Discord:** https://chat.dashdevs.org
fr: **Discord des développeurs d'applications décentralisées Dash :** https://chat.dashdevs.org

source: **Dash Embassy D-A-CH auf Deutsch Telegram:** https://t.me/dashembassydach
fr: **Ambassade Dash D-A-CH sur Deutsch Telegram:** https://t.me/dashembassydach

source: **Dash Telegram News Bot:** https://telegram.me/dashnews
fr: **Robot d'actualités Dash Telegram :** https://telegram.me/dashnews

source: Social media
fr: Réseaux sociaux

source: **English (Official):** https://www.facebook.com/DashPay
fr: **En anglais (officiel) :** https://www.facebook.com/DashPay

source: **Dash News En Español:** https://www.facebook.com/DashNewsEspanol
fr: **Actualités Dash en espagnol :** https://www.facebook.com/DashNewsEspanol

source: **Brazil:** https://www.facebook.com/DashBrazil
fr: **Brésil :** https://www.facebook.com/DashBrazil

source: **Denmark:** https://www.facebook.com/DashDenmark
fr: **Danemark :** https://www.facebook.com/DashDenmark

source: **Germany:** https://www.facebook.com/dashgermany
fr: **Allemagne :** https://www.facebook.com/dashgermany

source: **Greece:** https://www.facebook.com/DashGreece
fr: **Grèce :** https://www.facebook.com/DashGreece

source: **Poland:** https://www.facebook.com/Dash.Polska
fr: **Pologne :** https://www.facebook.com/Dash.Polska

source: **Russia:** https://www.facebook.com/Dash.Russia
fr: **Russie :** https://www.facebook.com/Dash.Russia

source: **Thailand:** https://www.facebook.com/groups/dashembassythailand
fr: **Thaïlande :** https://www.facebook.com/groups/dashembassythailand

source: **Venezuela:** https://www.facebook.com/groups/DarkcoinVenezuela
fr: **Vénézuela :** https://www.facebook.com/groups/DarkcoinVenezuela

source: **Dash Official Account:** https://twitter.com/dashpay
fr: **compte Dash officiel :** https://twitter.com/dashpay

source: **Ryan Taylor, CEO of Dash Core Group:** https://twitter.com/RTaylor05
fr: **Ryan Taylor, directeur de Dash Core :** https://twitter.com/RTaylor05

source: **Joël Valenzuela, Chief Editor, Dash Force News:** https://twitter.com/TheDesertLynx
fr: **Joël Valenzuela, rédacteur en chef, Dash Force News :** https://twitter.com/TheDesertLynx

source: **Mark Mason, Director of Media & PR, Dash Force News:** https://twitter.com/StayDashy
fr: **Mark Mason, directeur de la communication, Dash Force News :** https://twitter.com/StayDashy

source: **Amanda B. Johnson, Dash Superfan and DAO-funded contractor:** https://twitter.com/AmandaB_Johnson
fr: **Amanda B. Johnson, superfan Dash et partenaire financé par la DAO :** https://twitter.com/AmandaB_Johnson

source: **Tao of Satoshi, Dash Nation Founder and DAO-funded contractor:** `https://twitter.com/Dash_Nation <https://twitter.com/Dash_Nation>`__
fr: **Tao of Satoshi, fondateur de Dash Nation et contractant financé par la D.A.O. :** `https://twitter.com/Dash_Nation <https://twitter.com/Dash_Nation>`__

source: **とみ三（Samurai33）, Dash Japan:** https://twitter.com/samurai3311
fr: **とみ三（Samurai33), Dash Japon :** https://twitter.com/samurai3311

source: News
fr: Actualités

source: **Dash News En Español:** https://dashnewsespanol.com
fr: **Actualités Dash en espagnol :** https://dashnewsespanol.com

source: **Dash News En Español (YouTube):** https://www.youtube.com/channel/UCG6Cuh8Q2eUt4NlZu4K-u8g
fr: **Actualités Dash en espagnol (YouTube) :** https://www.youtube.com/channel/UCG6Cuh8Q2eUt4NlZu4K-u8g

source: **Dash News Korea:** https://dashnewskorea.com
fr: **Actualités Dash en Corée :** https://dashnewskorea.com

source: **Dash News Germany:** https://dash-news.de
fr: **Actualités Dash en Allemagne :** https://dash-news.de

source: **Dash News China (Wechat):** dashnews (or scan QR below)
fr: **Actualités Dash en Chine (Wechat) :** dashnews (ou scannez le code QR ci-dessous)

source: **Evan Duffield's blog:** https://medium.com/@eduffield222
fr: **Le blog d'Evan Duffield :** https://medium.com/@eduffield222

source: Wikipedia
fr: Wikipédia

source: `https://en.wikipedia.org/wiki/Dash_(cryptocurrency) <https://en.wikipedia.org/wiki/Dash_(cryptocurrency)>`_
fr: `https://fr.wikipedia.org/wiki/Dash_(crypto-monnaie) <https://fr.wikipedia.org/wiki/Dash_(crypto-monnaie)>`_

source: Inactive
fr: Inactif

source: **Bitcoin.com forum:** https://forum.bitcoin.com/dash-f67
fr: **Forum Bitcoin.com :** https://forum.bitcoin.com/dash-f67

source: **Crypto-city.com page:** https://www.crypto-city.com/index.php/dash-dash-coin
fr: **Page Crypto-city.com :** https://www.crypto-city.com/index.php/dash-dash-coin

source: **Bitco.in forum:** https://bitco.in/forum/threads/dash-digitalcash.891
fr: **Forum Bitco.in :** https://bitco.in/forum/threads/dash-digitalcash.891

source: Tools
fr: Outils

source: Block explorers, statistics and visualizations
fr: Explorateurs de blocs, statistiques et visualisations

source: Treasury tools
fr: Outils relatifs au Trésor

source: Masternode management
fr: Gestion de masternode

source: Price monitoring and statistics
fr: Suivi du cours et statistiques

source: Dash Community project
fr: Projet Dash Community

source: DarkNet pages
fr: Pages sur le DarkNet

source: **Dash (Mirror of Main Page):** http://dashorg64cjvj4s3.onion
fr: **Dash (miroir du site principal) :** http://dashorg64cjvj4s3.onion

source: **The Hidden Wiki:** `http://zqktlwi4fecvo6ri.onion/wiki/Dash_-_DigitalCash <http://zqktlwi4fecvo6ri.onion/wiki/Dash_-_DigitalCash>`_
fr: **Le wiki caché :** `http://zqktlwi4fecvo6ri.onion/wiki/Dash_-_DigitalCash <http://zqktlwi4fecvo6ri.onion/wiki/Dash_-_DigitalCash>`_

source: Mobile Apps
fr: Applications mobiles

source: **Dash Wallet:** https://apps.apple.com/app/id1206647026
fr: **Portefeuille officiel Dash Wallet :** https://apps.apple.com/app/id1206647026

source: **Dash Wallet:** https://play.google.com/store/apps/details?id=hashengineering.darkcoin.wallet
fr: **Portefeuille mobile officiel Dash :** https://play.google.com/store/apps/details?id=hashengineering.darkcoin.wallet

source: **Bitcoin Ticker Widget:** https://play.google.com/store/apps/details?id=st.brothas.mtgoxwidget
fr: **Widget Bitcoin Ticker :** https://play.google.com/store/apps/details?id=st.brothas.mtgoxwidget

source: Glossary
fr: Glossaire

source: 51% Attack
fr: Attaque 51%

source: A condition in which more than half the computing power on a cryptocurrency network is controlled by a single miner or group of miners. That amount of power theoretically makes them the authority on the network. This means that every client on the network believes the attacker’s hashed transaction block.
fr: Situation dans laquelle plus de la moitié de la puissance de calcul d'un réseau cryptomonétaire est contrôlée par un seul mineur ou groupe de mineurs. Cette puissance de calcul les rend en théorie maîtres du réseau. Cela signifie que chaque client sur le réseau approuve le bloc de transactions calculé par l'attaquant.

source: Address
fr: Adresse

source: A Dash address is used to :ref:`Send/Receive a Payment <dashcore-send-receive>` on the Dash network. It contains a string of alphanumeric characters, but can also be represented as a scannable QR code. A Dash address is also the public key in the pair of keys used by Dash holders to digitally sign transactions (see Public key).
fr: Une adresse Dash sert à :ref:`envoyer ou recevoir un paiement <dashcore-send-receive>` sur le réseau Dash. Elle est constituée d'une chaîne de caractères alphanumériques, mais peut aussi être représentée par un code QR scannable. Une adresse Dash est aussi la clé publique d'une paire de clés utilisée par les détenteurs de dashs pour signer numériquement les transactions (voir Clé publique).

source: Algorithm
fr: Algorithme

source: In mathematics and computer science, an `algorithm <https://en.wikipedia.org/wiki/Algorithm>`_ is a self-contained step-by-step set of operations to be performed. Algorithms perform calculation, data processing, and/or automated reasoning tasks.
fr: En mathématiques et informatique, un `algorithme <https://en.wikipedia.org/wiki/Algorithm>`_ est une série autonome d'opérations successives à effectuer. Les algorithmes effectuent des calculs, du traitement de données et/ou des tâches automatisées.

source: Since Bitcoin was the first cryptocurrency and has the largest market capitalization, it is considered as the reference. An altcoin, or alternative coin, is any cryptocurrency other than Bitcoin.
fr: Bitcoin est historiquement la première cryptomonnaie et a la plus grande capitalisation, il est donc considéré comme une référence. Une altcoin, ou cryptomonnaie alternative, est toute cryptomonnaie autre que Bitcoin.

source: Anti-Money Laundering techniques are used to stop people from making illegally obtained funds appear as though they have been earned legally. AML mechanisms can be legal or technical in nature. Regulators frequently apply AML techniques to Dash exchanges.
fr: Les mécanismes AML (Anti-Money Laundering, anti-blanchiment d'argent) servent à empêcher les gens de faire passer des fonds perçus illégalement pour des fonds gagnés légalement. Les mécanismes AML peuvent être de nature juridique ou technique. Les régulateurs imposent couramment les mécanismes AML aux plateformes de change Dash.

source: In computer programming, an `application programming interface (API) <https://en.wikipedia.org/wiki/Application_programming_interface>`_ is a set of routines, protocols, and tools for building software and applications.
fr: En programmation informatique, une `application programming interface (API) <https://en.wikipedia.org/wiki/Application_programming_interface>`_ est une série de procédures, de protocoles et d'outils servant à bâtir des logiciels et des applications.

source: An API expresses a software component in terms of its operations, inputs, outputs, and underlying types, defining functionalities that are independent of their respective implementations, which allows definitions and implementations to vary without compromising the interface. A good API makes it easier to develop a program by providing all the building blocks, which are then put together by the programmer.
fr: Une API constitue l'expression d'un composant logiciel en termes d'opérations, entrées, sorties et types sous-jacents, définissant des fonctionnalités indépendantes de leurs implémentations respectives, ce qui autorise les définitions et implémentations à varier sans impacter l'interface. Une bonne API rend plus simple de concevoir un programme en fournissant tous les blocs de base, qui sont ensuite assemblés par le programmeur.

source: An application-specific integrated circuit (ASIC), is an integrated circuit (IC) customized for a particular use, rather than intended for general-purpose use. For example, a chip designed to run in a digital voice recorder or for :ref:`high-efficiency Dash mining <asic-mining>` is an ASIC.
fr: Un ASIC (application-specific integrated circuit) est un circuit intégré spécialisé dans un usage particulier, plutôt que conçu pour des tâches générales. Par exemple, un processeur conçu pour tourner dans un enregistreur audio numérique, ou pour un :ref:`minage Dash hautement performant <asic-mining>`, est un ASIC.

source: ATM / BTM
fr: ATM / BTM (distributeur de cryptomonnaie)

source: A Dash ATM is a physical machine that allows a customer to buy Dash with cash. There are many manufacturers, some of which enable users to sell Dash for cash. They are also sometimes called 'BTMs' or 'Dash AVMS.' Dash is supported on several :ref:`ATMs <how-to-buy>`.
fr: Un distributeur Dash (ATM) est une machine physique qui permet au client d'acheter des dashs avec de l'argent liquide. Il existe beaucoup de fabricants, et certains permettent aux utilisateurs de vendre leurs dashs contre de l'argent liquide. Ils sont aussi parfois appelés "BTM" ou "AVMS Dash". Dash est proposé par plusieurs :ref:`ATM <how-to-buy>`.

source: Backlog
fr: Arriéré

source: Backlog generally refers to an accumulation over time of work waiting to be done or orders to be fulfilled.
fr: Un arriéré désigne généralement une accumulation de travail en attente d'être exécuté, ou de commandes à traiter.

source: Backup
fr: Sauvegarde

source: The process of making copies of a computer file to ensure its integrity in case of loss, theft, or damage. Dash allows users to :ref:`make backup copies <dashcore-backup>` of their digital wallets. This protects against losing one's money in the event of a computer crashing or losing one’s mobile device. This would be the equivalent of being able to backup the cash in your wallet, so that if you lost it, you could restore the cash from a backup.
fr: Il s'agit du fait de créer des copies d'un fichier informatique, pour assurer son intégrité en cas de perte, vol ou dégâts. Dash permet aux utilisateurs de :ref:`faire des copies de sauvegarde <dashcore-backup>` de leurs portefeuilles numériques. Cela les protège contre la perte de fonds, dans l'hypothèse d'un crash d'ordinateur ou de la perte d'un appareil mobile. C'est en quelque sorte l'équivalent de ce que serait la sauvegarde de l'argent liquide dans un portefeuille : si vous le perdez, vous pouvez retrouver vos fonds.

source: This is a term explaining the next new level of Bitcoin projects which started as a fork of Bitcoin but extended their code into the next level of Blockchain Projects (Smart Contracts, Decentralised Voting,....)
fr: Ce terme désigne la nouvelle génération des projets Bitcoin, nés d'un fork de Bitcoin et améliorant leur code (contrats intelligents, vote décentralisé...).

source: A `blockchain <https://en.wikipedia.org/wiki/Block_chain_(database)>`_ is a distributed database that maintains a continuously-growing list of data records hardened against tampering and revision. It consists of data structure blocks — which exclusively hold data in initial blockchain implementations, and both data and programs in some of the more recent implementations — with each block holding batches of individual transactions and the results of any blockchain executables. Each block contains a timestamp and information linking it to a previous block.
fr: Une `blockchain <https://fr.wikipedia.org/wiki/Blockchain>`_ (chaîne de blocs) est une base de données distribuée qui agrège une liste d'enregistrements en augmentation constante, en rendant impossible leur modification ou leur contrefaçon. Elle consiste en blocs structurés de données — uniquement des données dans les premières blockchains, mais désormais également des programmes dans les implémentations plus récentes. Chaque bloc comporte des lots de transactions individuelles et les résultats des éventuels exécutables de la blockchain. Chaque bloc contient aussi un horodatage et des informations le liant au bloc précédent.

source: Blocks
fr: Blocs

source: Transactions on the Blockchain are collected in "`blocks <https://en.wikipedia.org/wiki/Block_chain_(database)#Blocks>`_" which record and confirm when and in what sequence transactions enter and are logged in the block chain. Blocks are created by users known as "miners" who use specialized software or equipment designed specifically to create blocks.
fr: Les transactions sur la blockchain sont organisées en "`blocs <https://fr.wikipedia.org/wiki/Blockchain#Blocs>`_" qui enregistrent et confirment la date et l'ordre d'entrée des transactions inscrites. Les blocs sont créés par des utilisateurs appelés "mineurs" qui utilisent des logiciels et du matériel spécialisés, conçus spécifiquement pour créer des blocs.

source: Budget System / DGBB
fr: Système budgétaire (DGBB)

source: The development of Dash and the Dash ecosystem is self-funded by the network. Each time a block is discovered, 45% of the block reward goes to miners and 45% goes to masternodes. Ten percent is withheld by the network and used to fund projects that are approved by the masternode network. This process is known as :ref:`Decentralized Governance by Blockchain <governance>` (DGBB). For a fee, anybody can submit a proposal to the network, and will be paid directly by the blockchain if approved by the masternodes. The Budget System is sometimes called the Treasury System; the two terms are interchangeable.
fr: Le développement de Dash et de son écosystème est autofinancé par le réseau. À chaque découverte d'un bloc, 45% de la récompense de bloc va aux mineurs et 45% aux masternodes. 10% sont retenus par le réseau et utilisés pour financer des projets approuvés par le réseau des masternodes. Ce processus est connu sous le nom de :ref:`gouvernance décentralisée par blockchain <governance>` (DGBB). En s'acquittant de frais, n'importe qui peut soumettre une proposition au réseau et sera rémunéré directement par la blockchain si les masternodes l'approuvent. Le système budgétaire est parfois appelé le "Trésor" ; les deux termes sont interchangeables.

source: Defined in `DIP8 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__, ChainLocks are a method of using an LLMQ to threshold sign a block immediately after it is propogated by the miner in order to enforce the first-seen rule. This is a powerful method of mitigating 51% mining attacks, which are associated with double spending.
fr: Définie par la `DIP8 <https://github.com/dashpay/dips/blob/master/dip-0008.md>`__, ChainLock est une méthode d'utilisation d'un LLMQ pour signer par seuil un bloc immédiatement après sa diffusion par le mineur, afin de mettre en œuvre la règle du "premier vu". Il s'agit d'une méthode d'une très grande efficacité pour contrer les attaques de minage 51%, associées aux doubles dépenses.

source: Cloud Wallet
fr: Portefeuille dans le nuage

source: Third parties that will store your Dash on their servers for you, so that you can access your funds from any device connected to the internet. If their website is hacked or if their servers are damaged, you run the risk of losing your Dash. Any online wallets should be secured with strong passphrases and 2FA. You cannot make backup copies of your online wallet, because you do not have access to the private keys. We do not recommend that you store large quantities of funds in online wallets.
fr: Il s'agit de tierces parties qui stockeront vos dashs pour vous sur leurs serveurs, de telle manière que vous pourrez accéder à vos fonds depuis n'importe quel appareil connecté à Internet. Si leur site web est piraté ou leurs serveurs endommagés, vous courez le risque de perdre vos dashs. Tout portefeuille en ligne devrait être sécurisé par des phrases de passe fortes et une double authentification (2FA). Vous ne pouvez pas faire de sauvegardes de votre portefeuille en ligne, car vous n'avez pas accès à ses clés privées. Il n'est pas recommandé de stocker des fonds importants dans les portefeuilles en ligne.

source: Coinbase transaction
fr: Transaction coinbase

source: The first transaction in a block. Always created by a miner, it includes a single input which constitutes the block reward. This is split between the miner and a deterministically chosen masternode.
fr: La première transaction d'un bloc. Elle est toujours créée par un mineur et comporte une seule entrée, qui constitue la récompense de bloc. Celle-ci est partagée entre le mineur et un masternode choisi de manière déterministe.

source: Cold Storage
fr: Chambre froide

source: A method of generating and storing private keys completely offline. One could use a desktop or laptop computer disconnected from the internet, a dedicated hardware wallet, a USB stick, or a :ref:`paper wallet <dash-paper-wallet>`.
fr: La chambre froide (cold storage) est une méthode de génération et de stockage entièrement hors ligne des clés privées. On peut utiliser un ordinateur portable ou de bureau déconnecté de l'Internet, un portefeuille matériel dédié, une clé USB ou un :ref:`portefeuille papier <dash-paper-wallet>`.

source: Confirm(ed) Transaction
fr: Transaction confirmée

source: When a Dash transaction is made, a miner must verify that the transaction is valid. When the inputs and outputs are verified, the transaction is included in a block in the blockchain. The transaction can then be considered complete and irreversible. The confirmation number increases as more blocks are added to the blockchain.
fr: Quand une transaction Dash est faite, un mineur doit vérifier qu'elle est valide. Quand les entrées et sorties sont vérifiées, la transaction est incluse dans un bloc, sur la blockchain. La transaction peut alors être considérée achevée et irréversible. Le nombre de confirmations croît à mesure que de nouveaux blocs sont ajoutés à la blockchain.

source: Confirmation Number
fr: Nombre de confirmations
