Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/information.po
Languages: fr

source: **Offline/Cold Storage** (:ref:`Paper wallet <dash-paper-wallet>`): A special wallet that is created offline and is never exposed to the internet. Accomplished by using software to generate a public and private key offline and then recording the generated keys. They keys can be printed out on paper or even laser-etched in metal. Copies can be made and stored in a personal safe or bank deposit box. This is an extremely secure way to store Dash. There is no risk of using software wallet files, which can become corrupt, or web wallets, which can be hacked. NOTE: USB sticks are not safe for long-term (multi-year) storage because they degrade over time.
fr: **Chambre froide, stockage hors ligne** (:ref:`Portefeuille papier <dash-paper-wallet>`) : un portefeuille spécial qui est créé hors ligne et n'est jamais en contact avec Internet. Cela est possible en utilisant un logiciel qui génère hors ligne une clé privée et sa clé publique puis les enregistre. Ces clés peuvent être imprimées sur papier, voire gravées sur métal. Des copies peuvent en être faites et stockées dans un coffre personnel ou dans une banque. C'est un moyen très sûr de stocker vos dashs. Il ne présente pas les risques d'utilisation des fichiers de portefeuille logiciel, qui peuvent se corrompre, ou des portefeuilles en ligne, qui peuvent être piratés. À NOTER : les clés USB ne sont pas sûres pour un stockage de long terme (plusieurs années) car elles se dégradent avec le temps.

source: Defined in `DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, Distributed Key Generation (`DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__) is a method of generating a BLS key pair for use in an LLMQ to perform threshold signing on network messages. It is based on BLS M-of-N Threshold Scheme and Distributed Key Generation, which is an implementation of Shamir’s Secret Sharing.
fr: Définie par la `DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, la génération de clé distribuée (Distributed Key Generation, `DKG <https://github.com/dashpay/dips/blob/master/dip-0006.md#llmq-dkg-network-protocol>`__) est une méthode de génération d'une paire de clés BLS pour utilisation dans un LLMQ, afin d'opérer une signature par seuil des messages réseau. Cette méthode se base sur la méthode de signature BLS M-sur-N et sur la génération de clé distribuée, qui est une implémentation du secret partagé de Shamir (Shamir's Secret Sharing).

source: Digital Signature
fr: Signature numérique

source: A digital signature is a mathematical mechanism that allows someone to prove their identity or ownership of a digital asset. When your digital wallet signs a transaction with the appropriate private key, the whole network can see that the signature matches the address of the Dash being spent, without the need to reveal the private key to the network. You can also digitally sign messages using your private key, to prove for instance that you are the owner of a certain Dash address.
fr: Une signature numérique est un procédé mathématique permettant à quelqu'un de prouver son identité ou sa propriété d'un actif numérique. Quand votre portefeuille numérique signe une transaction avec la clé privée appropriée, le réseau entier peut vérifier que la signature correspond à l'adresse des dashs dépensés, sans besoin que la clé privée soit révélée au réseau. Vous pouvez aussi signer numériquement avec votre clé privée, par exemple pour prouver que vous êtes le propriétaire d'une adresse Dash donnée.

source: Electrum Wallet
fr: Portefeuille Electrum

source: :ref:`Dash Electrum Wallet <dash-electrum-wallet>` is a lightweight wallet that does not require you to download or sync the entire blockchain, making the wallet lighter and faster. However, it is missing certain features such as PrivateSend and InstantSend.
fr: Le :ref:`portefeuille Dash Electrum <dash-electrum-wallet>` est un portefeuille dit "léger", qui ne vous oblige pas à télécharger ou à vous synchroniser avec la blockchain entière, ce qui rend le portefeuille plus souple et plus rapide. Cependant, il ne propose pas certaines fonctions telles que PrivateSend ou InstantSend.

source: Encryption
fr: Chiffrage

source: In cryptography, `encryption <https://en.wikipedia.org/wiki/Encryption>`_ is the process of encoding messages or information in such a way that only authorized parties can read it. Encrypted messages which are intercepted by a third-party are indecipherable gibberish without the private key. In an encryption scheme, the *plaintext* message is encrypted using an encryption algorithm, generating *ciphertext* that can only be read if decrypted by the intended recipient. For technical reasons, an encryption scheme usually uses a pseudo-random encryption key generated by an algorithm. Increases in computing power have "broken" many past encryption algorithms, but a well-designed modern system such as AES-256 is considered essentially "uncrackable."
fr: En cryptographie, le `chiffrage <https://en.wikipedia.org/wiki/Encryption>`_ est le processus consistant à coder des messages ou des informations de telle manière que seules des personnes autorisées puissent les lire. Les messages chiffrés interceptés par des tierces parties sont du charabia indéchiffrable sans la clé privée. Dans un processus de chiffrage, le message *en clair* est chiffré par un algorithme de chiffrage, ce qui génère un *message chiffré* qui ne peut être lu qu'après déchiffrage par le destinataire souhaité. Pour des raisons techniques, un processus de chiffrage utilise en général une clé de chiffrage pseudo-aléatoire générée par un algorithme. Les progrès dans la puissance de calcul ont permis de "casser" de nombreux algorithmes de chiffrage passés, mais un système moderne et bien conçu tel que AES-256 est considéré à peu près "incassable".

source: Escrow Services
fr: Services de dépôt fiduciaire

source: An `escrow <https://en.wikipedia.org/wiki/Escrow>`_ is:
fr: Un service de `dépôt fiduciaire <https://fr.wikipedia.org/wiki/D%C3%A9p%C3%B4t_fiduciaire>`_ ou de séquestre est :

source: a contractual arrangement in which a third party receives and disburses money or documents for the primary transacting parties, with the disbursement dependent on conditions agreed to by the transacting parties; or
fr: un arrangement contractuel dans lequel une tierce partie reçoit et délivre des fonds ou des documents pour deux autres parties, la délivrance dépendant de conditions agréées par les deux parties ; ou

source: an account established by a broker for holding funds on behalf of the broker's principal or some other person until the consummation or termination of a transaction; or
fr: un compte établi par un courtier pour retenir des fonds au nom du courtier ou d'une autre personne, jusqu'à exécution ou fin d'une transaction ; ou

source: a trust account held in the borrower's name to pay obligations such as property taxes and insurance premiums.
fr: un compte de confiance tenu au nom d'un emprunteur pour régler un dû, tel que des taxes immobilières ou des primes d'assurance.

source: A trusted escrow service is often used when purchasing cryptocurrency or other goods/services over the internet. Both the buyer and seller will choose a trusted third-party, the seller will send the item (or currency) to the escrow agent, and the buyer will send the purchasing funds to the escrow agent as well. Once the escrow agent is satisfied that both parties have satisfied the terms of the agreement, he/she will forward the funds and the product (or currency) being purchased to the appropriate party.
fr: Un service de dépôt fiduciaire de confiance est souvent utilisé lors de l'achat de cryptomonnaie ou d'autres biens et services sur Internet. L'acheteur et le vendeur choisissent une tierce partie de confiance, le vendeur lui envoie l'article ou les fonds, et l'acheteur lui envoie son paiement. Dès que l'agent de dépôt fiduciaire considère que les deux autres parties ont rempli leurs obligations dans l'accord, il ou elle transmet le paiement au vendeur, et l'article ou les fonds à l'acheteur.

source: Founder and first Lead Developer of Dash. Inventor of X11, InstantSend and PrivateSend. Before creating Dash, Evan was a financial advisor and holds a Series 65 license.
fr: Fondateur et premier programmeur en chef de Dash. Inventeur de X11, InstantSend et PrivateSend. Avant de créer Dash, Evan Duffield était conseiller financier. Il détient une licence Series 65.

source: Exchange
fr: Plateforme de change

source: The current price of one Dash compared to the price of other currencies, like the US dollar, Yen, Euro, or Bitcoin. Because most trading volume takes place on the BTC/DASH markets, price is often quoted in fractions of a bitcoin. For instance, the price of one Dash at the end of March 2017 was 0.08 (bitcoins per Dash). An excellent site for following the exchange rate of Dash is `CoinMarketCap <https://coinmarketcap.com/>`_. Businesses wishing to reduce the risk of holding a volatile digital currency can avoid that risk altogether by having a payment processor do an instant exchange at the time of each transaction.
fr: Le cours actuel d'1 dash par rapport à celui d'autres monnaies, telles que le dollar, le yen, l'euro ou le bitcoin. Le plus grand volume de change ayant lieu sur les marchés Bitcoin/Dash, le cours est souvent mentionné en fractions de bitcoin. Par exemple, le cours d'1 dash à la fin mars 2017 était de 0,08 (bitcoin par dash). Un excellent site pour suivre le cours de Dash est `CoinMarketCap <https://coinmarketcap.com/>`_. Les entreprises qui veulent réduire le risque de volatilité d'une monnaie numérique peuvent l'éviter entièrement en recourant aux services d'un processeur de paiement, qui fait une conversion instantanée au moment de chaque transaction.

source: Faucet
fr: Robinet

source: Faucets are a reward system, in the form of a website or app, that dispenses rewards in the form of a microdash or Duff, which is a hundredth of a millionth Dash, for visitors to claim in exchange for completing a captcha or task as described by the website.
fr: Les robinets sont un système de récompense, sous la forme d'un site web ou d'une application qui distribue des microdashs (dits aussi duffs), soit un centième de millionième de dash, pour les visiteurs qui acceptent d'accomplir une tâche proposée par le site.

source: Fiat Gateway
fr: Passerelle fiduciaire

source: `Fiat money <https://en.wikipedia.org/wiki/Fiat_money>`_ has been defined variously as:
fr: La `monnaie fiduciaire <https://fr.wikipedia.org/wiki/Monnaie_fiduciaire>`_ a été définie de différentes façons, telles que :

source: Any money declared by a government to be legal tender.
fr: Toute monnaie dont un gouvernement déclare qu'elle a cours légal.

source: State-issued money which is neither convertible by law to any other thing, nor fixed in value in terms of any objective standard.
fr: Monnaie émise par l'Etat qui n'est ni légalement convertible en quoi que ce soit d'autre, ni d'une valeur fixe par rapport à quelque standard objectif que ce soit.

source: Intrinsically valueless money used as money because of government decree.
fr: Monnaie sans valeur intrinsèque, utilisée comme monnaie parce que le gouvernement le décrète.

source: Examples include the US dollar, the Euro, the Yen, and so forth.
fr: Exemples : le dollar américain, l'euro, le yen, et ainsi de suite.

source: `Financial technology <https://en.wikipedia.org/wiki/Financial_technology>`_, also known as FinTech, is an economic industry composed of companies that use technology to make financial services more efficient. Financial technology companies are generally startups trying to make financial processes more efficient or eliminate middle- men. Recently many fintech companies have begun utilizing blockchain technology, which is the same technology that underpins Dash and Bitcoin.
fr: La `technologie financière <https://fr.wikipedia.org/wiki/Technologie_financi%C3%A8re>`_, également connue sous le nom de FinTech, est un secteur de l'économie composé d'entreprises utilisant la technologie pour rendre les services financiers plus efficaces. Les entreprises de technologie financière sont en général des startups qui essaient de rendre les opérations financières plus efficaces ou d'éliminer les intermédiaires. Ces derniers temps, beaucoup d'entreprises fintech se sont mises à utiliser la technologie blockchain, celle sous-jacente à Dash et Bitcoin.

source: When the blockchain diverges or splits, with some clients recognizing one version of the blockchain as valid, and other clients believing that a different version of the blockchain is valid. Most forks resolve themselves without causing any problems, because the longest blockchain is always considered to be valid. In time, one version of the blockchain will usually "win" and become universally recognized as valid. Forks can, however, be extremely dangerous and should be avoided if possible.
fr: Désigne le fait qu'une blockchain diverge et se sépare en deux, avec certains clients reconnaissant comme valide une version de la blockchain, et d'autres clients croyant qu'une version différente de la blockchain est valide. La plupart des forks ("embranchements") se résolvent d'eux-mêmes sans susciter de problèmes, car la blockchain la plus longue est toujours celle qui est considérée valide. Le temps passant, une seule version de la blockchain "gagnera" en général, et deviendra universellement reconnue comme étant valide. Les forks peuvent, cependant, être extrêmement dangereux, et devraient être évités autant que possible.

source: Forking is most likely to occur during software updates to the network. Dash uses a Multi-Phased Fork (“:ref:`Spork <sporks>`”) system for greater flexibility and safety.
fr: Un fork est plus susceptible de se produire lors des mises à jour logicielles du réseau. Dash utilise un système de fork à phases multiples (“:ref:`Spork <sporks>`”) pour plus de souplesse et de sécurité.

source: Full Nodes
fr: Nœuds complets

source: Any Dash client that is serving a full version of the blockchain to peers. This can be a user running a Dash Core wallet on his/her desktop, or it could be a :ref:`masternode <masternodes>`. Full nodes promote decentralization by allowing any user to double check the validity of the blockchain.
fr: Désigne tout client Dash qui rend disponible aux pairs une version complète de la blockchain. Cela peut être un utilisateur faisant tourner un portefeuille Dash Core sur son ordinateur personnel, ou bien cela peut être un :ref:`masternode <masternodes>`. Les nœuds complets améliorent la décentralisation en permettant à n'importe quel utilisateur de vérifier et revérifier la validité de la blockchain.

source: Fungible
fr: Fongible

source: Every unit of the currency is worth the same as any other unit.
fr: Chaque unité monétaire a la même valeur qu'une autre unité monétaire.

source: Genesis Block
fr: Bloc de genèse

source: The very first block in the block chain.
fr: Le tout premier bloc dans la blockchain.

source: A `graphics processing unit (GPU) <https://en.wikipedia.org/wiki/Graphics_processing_unit>`_, also occasionally called visual processing unit (VPU), is a specialized electronic circuit designed to rapidly manipulate and alter memory to accelerate the creation of images in a frame buffer intended for output to a display. GPUs are used in embedded systems, mobile phones, personal computers, workstations, and game consoles. Modern GPUs are very efficient at manipulating computer graphics and image processing, and their highly parallel structure makes them more efficient than general- purpose CPUs for algorithms where the processing of large blocks of data is done in parallel. In a personal computer, a GPU can be present on a video card, or it can be embedded on the motherboard or — in certain CPUs — on the CPU die. Certain cryptocurrencies use mining algorithms which are most efficiently run on GPUs.
fr: Un `processeur graphique (GPU) <https://fr.wikipedia.org/wiki/Processeur_graphique>`_, parfois appelé une unité processeur vidéo (VPU), est un circuit électronique spécialisé, conçu pour manipuler et modifier rapidement la mémoire afin d'accélérer la création d'images dans un tampon mémoire destiné à être affiché sur un écran. Les GPU sont utilisés dans les systèmes embarqués, les téléphones mobiles, les ordinateurs personnels, les stations de travail et les consoles de jeu. Les GPU modernes sont très efficaces dans la gestion des graphiques informatiques et dans le calcul d'images, et leur structure hautement parallèle les rend plus efficaces que les processeurs (CPU) à visée générale, grâce à des algorithmes où la manipulation de grandes quantités de données est exécutée en parallèle. Dans un ordinateur personnel, un GPU peut se trouver sur une carte vidéo, ou il peut être embarqué sur la carte-mère, voire, pour certains processeurs, sur ceux-ci. Certaines cryptomonnaies utilisent des algorithmes de minage qui tournent plus efficacement sur des GPU.

source: Hardware Wallet
fr: Portefeuille matériel

source: :ref:`Hardware wallets <hardware-wallets>` are among the safest type of wallet for storing your Dash. Your private key is protected inside a piece of hardware, and is never exposed to the internet. You are still able to sign transactions as normal, making it both safe and convenient.
fr: Les :ref:`portefeuilles matériels <hardware-wallets>` sont parmi les portefeuilles les plus sûrs pour stocker vos dashs. Votre clé privée est protégée par un composant matériel, et n'est jamais exposée à l'Internet. Il vous est toujours possible de signer des transactions, ce qui rend l'ensemble à la fois sûr et pratique.

source: Hash
fr: Fonction de hachage

source: A mathematical process that takes a variable amount of data and produces a shorter, fixed-length output. A hashing function has two important characteristics. First, it is mathematically difficult to work out what the original input was by looking at the output. Second, changing even the tiniest part of the input will produce an entirely different output.
fr: Désigne un procédé mathématique qui, à partir d'une quantité variable de données, génère une sortie plus courte, d'une longueur définie. Une fonction de hachage a deux caractéristiques importantes. Tout d'abord, il est mathématiquement difficile de déterminer ce qu'étaient les données de départ simplement en regardant les données de sortie. Ensuite, modifier même un élément négligeable de l'entrée produira une sortie entièrement différente.

source: Hashrate
fr: Taux de hachage

source: The number of hashes that can be performed by a Dash miner in a given period of time (usually a second).
fr: Le nombre de hashs (empreintes numériques) que peut produire un mineur Dash dans une période de temps donnée (en général une seconde).

source: Blockchain information server used to power block explorers and respond to transaction queries.
fr: Serveur d'information sur la blockchain, utilisé pour faire tourner les explorateurs de bloc et répondre aux requêtes de transaction.

source: See InstantSend
fr: Voir InstantSend

source: :ref:`InstantSend <instantsend>` technology uses the masternode network to "lock" transaction inputs, preventing Dash from being double-spent. Unlike Bitcoin, where it takes an hour or longer for transactions to fully confirm, transactions using InstantSend are "locked" and irreversible after only a few seconds.
fr: La technologie :ref:`InstantSend <instantsend>` utilise le réseau des masternodes pour "verrouiller" des entrées de transaction, empêchant les dashs d'être dépensés deux fois. Au contraire de Bitcoin, où il faut une heure ou plus pour que les transactions soient entièrement confirmées, les transactions utilisant InstantSend sont "verrouillées" et irréversibles après seulement quelques secondes.

source: Liquidity
fr: Liquidité

source: The ability to buy and sell an asset easily, with pricing that stays roughly similar between trades. A suitably large community of buyers and sellers is important for liquidity. The result of an illiquid market is price volatility, and the inability to easily determine the value of an asset.
fr: Désigne la possibilité de vendre ou d'acheter facilement un actif, à un cours qui reste à peu près identique entre deux opérations. Une communauté suffisamment large d'acheteurs et de vendeurs est importante pour assurer une bonne liquidité. Les conséquences d'un marché illiquide sont la volatilité du cours et l'impossibilité de déterminer facilement la valeur d'un actif.

source: Defined in `DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, A Long- Living Masternode Quorum (LLMQ) is a deterministic subset of the global deterministic masternode list. Such a quorum is formed with the help of a distributed key generation (DKG) protocol and is supposed to be active for a long time (e.g. days). Multiple quorums are kept alive at the same time, allowing load balancing between these quorums. The main task of a LLMQ is to perform threshold signing of consensus related messages.
fr: Défini par la `DIP6 <https://github.com/dashpay/dips/blob/master/dip-0006.md>`__, un quorum de masternode à longue durée (Long- Living Masternode Quorum, LLMQ) est un sous-ensemble déterministe de la liste déterministe complète des masternodes. Un tel quorum est déterminé par un protocole de génération de clé distribuée (DKG) et il est conçu pour être actif un certain temps (par ex. plusieurs jours). Plusieurs quorums sont maintenus en vie en même temps, ce qui permet de répartir la charge entre eux. La tâche principale d'un LLMQ est d'exécuter des signatures par seuil des messages relatifs au consensus.

source: A :ref:`masternode <masternode-network>` is special type of full node that performs services for the network and is paid a portion of the block reward. Masternodes require proof of ownership of 1000 DASH.
fr: Un :ref:`masternode <masternode-network>` (nœud-maître) est un type spécial de nœud complet qui exécute des services pour le réseau, et qui est rétribué par une part de la récompense de bloc. Les masternodes requièrent la preuve de la propriété de 1000 dashs.

source: Masternodes serve as the second tier of the Dash network, and power InstantSend, PrivateSend, the Budget System.
fr: Les masternodes constituent le second niveau du réseau Dash, et rendent possibles InstantSend, PrivateSend et le système budgétaire décentralisé.

source: Mining
fr: Minage

source: :ref:`Miners <mining>` process transactions on the Dash network and publish them on the blockchain. As a reward for doing this, miners are paid 45% of the block reward.
fr: Les :ref:`mineurs <mining>` traitent les transactions sur le réseau Dash et les écrivent sur la blockchain. En rétribution pour ce travail, les mineurs reçoivent 45% de la récompense de bloc.

source: Mobile Wallet
fr: Portefeuille mobile

source: These are wallets available on mobile devices (iOS + Android).
fr: Voici les portefeuilles disponibles sur les appareils mobiles (iOS et Android).
