Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/introduction/information.po
Languages: fr

source: Multi-signature addresses provide additional security by requiring multiple people to sign a transaction with their private key before the transaction can be sent. For example, in :ref:`2 of 3 multisig <dashcore-multisig>`, two out of three possible signatories have to sign a transaction for it to be processed. Multi-signature addresses are commonly used by exchanges and other organizations that are in possession of large sums of cryptocurrency, since it makes theft much more difficult.
fr: Les adresses à multisignature représentent une sécurité supplémentaire car elles requièrent que plusieurs personnes signent une transaction avec leur clé privée pour que la transaction puisse être envoyée. Par exemple, :ref:`une multisignature 2 sur 3 <dashcore-multisig>` implique que deux signataires sur trois possibles doivent signer une transaction pour qu'elle soit effectuée. Les adresses à multisignature sont couramment utilisées par les plateformes de change et d'autres organisations en possession d'importantes sommes de cryptomonnaie, car cela rend le vol beaucoup plus difficile.

source: Node
fr: Nœud

source: A node is any device running Dash wallet software. Full nodes are software clients that have downloaded the entire blockchain and serve it to other clients on Dash's peer-to-peer network.
fr: On appelle nœud n'importe quel appareil sur lequel tourne le portefeuille logiciel Dash. Les nœuds complets sont des clients logiciels qui ont téléchargé la blockchain entière et la diffusent aux autres clients sur le réseau pair à pair Dash.

source: OTC
fr: Gré à gré (Over the Counter, OTC)

source: Over the counter (OTC) trades are trades that occur off exchanges. In an OTC trade, a buyer and seller trade with each other directly, or through an intermediary. OTC trading is useful when a person wants to either buy or sell a large amount of cryptocurrency and is afraid that a large buy or sell order will move the price (called "slippage").
fr: Les changes de gré à gré (Over the Counter, OTC) sont des changes qui ont lieu en-dehors des plateformes de change. Dans un change de gré à gré, un acheteur et un vendeur changent directement de l'un à l'autre, ou à travers un intermédiaire. Le change de gré à gré est utile quand une personne veut vendre ou acheter une large quantité de cryptomonnaie, et craint que son opération importante ne fasse bouger le cours (ce qu'on appelle le "glissement").

source: P2P
fr: Pair à pair (P2P)

source: Peer-to-peer. Decentralized interactions that happen between at least two parties in a highly interconnected network. An alternative system to a 'hub-and-spoke' arrangement, in which all participants in a transaction deal with each other through a single mediation point.
fr: On appelle interactions pair à pair les interactions décentralisées qui se produisent au moins entre deux parties dans un réseau hautement interconnecté. Un système alternatif peut être appelé "hub and spoke" : dans ce cas, tous les participants dans une transaction s'arrangent entre eux à travaux un seul intermédiaire central.

source: Paper Wallet
fr: Portefeuiille papier

source: :ref:`Paper wallets <dash-paper-wallet>` are offline wallets, printed on paper for safety. If properly secured and stored they are considered the safest way to store cryptocurrency.
fr: Les :ref:`portefeuilles papier <dash-paper-wallet>` sont des portefeuilles hors ligne, imprimés sur papier pour des raisons de sécurité. S'ils sont faits et stockés correctement, ils sont considérés comme le moyen le plus sûr de stocker de la cryptomonnaie.

source: Privacy
fr: Confidentialité

source: `Privacy <https://en.wikipedia.org/wiki/Privacy>`_ is the ability of an individual or group to seclude themselves, or information about themselves, and thereby express themselves selectively. The boundaries and content of what is considered private differ among cultures and individuals, but share common themes. When something is private to a person, it usually means that something is inherently special or sensitive to them. The domain of privacy partially overlaps security (confidentiality), which can include the concepts of appropriate use, as well as protection of information. Dash includes PrivateSend, which allows users to maintain financial privacy.
fr: La `confidentialité ou vie privée <https://fr.wikipedia.org/wiki/Vie_priv%C3%A9e>`_ est la possibilité pour un individu ou un groupe de s'isoler, ou d'occulter l'information les concernant, et donc de se révéler de manière choisie. Les frontières et le contenu de ce qui est considéré comme relevant de la vie privée changent selon les cultures et les individus, mais partagent certains aspects. Quand quelque chose relève du privé pour quelqu'un, cela signifie en général que cette chose est particulièrement spéciale ou sensible pour lui. Le domaine de la vie privée recouvre pour partie la sécurité (la confidentialité), qui peuvent inclure les notions d'usage approprié ou de protection de l'information. Dash offre la fonctionnalité PrivateSend, qui permet aux utilisateurs de conserver une confidentialité financière.

source: Private Key
fr: Clé privée

source: A `private key <https://en.wikipedia.org/wiki/Public- key_cryptography>`_ is a long alphanumeric passcode that allows Dash to be spent. Every Dash wallet contains one or more private keys which are saved in the wallet file. The private keys are mathematically related to all Dash addresses generated for the wallet. Because the private key is the "ticket" that allows someone to spend Dash, it is important that these are kept secure and secret.
fr: Une `clé privée <https://fr.wikipedia.org/wiki/Cryptographie_asym%C3%A9trique>`_ est un long code alphanumérique qui permet de dépenser des dashs. Chaque portefeuille Dash contient une ou plusieurs clés privées, enregistrées dans le fichier portefeuille. Les clés privées sont liées mathématiquement à toutes les adresses Dash générées par le portefeuille. Puisque la clé privée permet à n'importe qui de dépenser les dashs associés, il est important qu'elle soit gardée secrète et en sécurité.

source: :ref:`PrivateSend <privatesend>` obscures the source of funds in order to maintain financial privacy between users. It can be turned on or off at the users' discretion.
fr: :ref:`PrivateSend <privatesend>` occulte la source des fonds afin de garantir la confidentialité financière entre les utilisateurs. Cette fonction peut être activée ou désactivée librement par les utilisateurs.

source: Proof of Service - PoSe
fr: Preuve de service (proof of service, PoSe)

source: Consensus mechanism used in Dash to verify that a masternode has provided uninterrupted service meeting a minimum quality level to the network. Maintaining this service allows a masternode to enter and move up through the global list and eventually into the selection pool to receive payment.
fr: Mécanisme de consensus utilisé par Dash pour vérifier qu'un masternode a fourni un service ininterrompu qui réponde à un certain niveau minimal de qualité pour le réseau. Assurer ce service permet à un masternode d'être inséré puis de monter dans la liste globale pour, finalement, atteindre le groupe de sélection et recevoir un paiement.

source: Proof of Stake - PoS
fr: Preuve d'enjeu (proof of stake, PoS)

source: Consensus mechanism that relies on ownership of a cryptocurrency to maintain the blockchain. In Proof of Stake systems, each owner of the currency can use their wallet to "stake," and there's a small chance that they will be chosen to create the next block and add it to the chain. In this way consensus is maintained across all nodes. Proof of Stake saves electricity and does not require specialized computer hardware. It does however suffer from several pitfalls, including the "nothing at stake" problem. Since no electricity is consumed, in the event of an attack it is actually beneficial for Proof of Stake nodes to "vote" to accept both the legitimate chain and the attacker's chain.
fr: Il s'agit du mécanisme de consensus qui fait de la possession d'une cryptomonnaie la condition pour gérer la blockchain. Dans les systèmes à preuve d'enjeu, chaque possesseur de la monnaie peuvent utiliser leur portefeuille comme "enjeu", et ils ont chacun une petite chance d'être choisis pour créer le prochain bloc et l'ajouter à la chaîne. De cette façon, le consensus est maintenu entre tous les nœuds. La preuve d'enjeu permet d'économiser de l'électricité et ne demande pas de matériel informatique spécialisé. Elle souffre cependant de plusieurs défauts, dont le problème dit "rien comme enjeu". Puisqu'il n'y a pas d'électricité consommée, dans l'hypothèse d'une attaque il est profitable pour les nœuds à preuve d'enjeu de "voter" pour accepter à la fois la chaîne légitime et la chaîne de l'attaquant.

source: Proof of Work - PoW
fr: Preuve de travail (proof of work, PoW)

source: Consensus mechanism that keeps all nodes honest by requiring computational power to be expended in order to create new blocks. Miners must use expensive equipment and burn electricity to add blocks to the blockchain. Without a consensus mechanism of some sort, any node could add blocks to the chain and the network's nodes would never agree on which chain was valid.
fr: Il s'agit du mécanisme de consensus qui garantit l'honnêteté des nœuds en leur demandant de dépenser une certaine puissance de calcul pour créer de nouveaux blocs. Les mineurs doivent utiliser du matériel coûteux et consommer de l'électricité pour ajouter des blocs à la blockchain. Sans mécanisme de consensus, n'importe quel nœud pourrait ajouter des blocs à la chaîne, et les nœuds du réseau ne pourraient jamais s'accorder pour choisir la seule chaîne valide.

source: Public Key
fr: Clé publique

source: The `public key <https://en.wikipedia.org/wiki/Public- key_cryptography>`_ is derived from the private key but is not secret and can be revealed to anybody. When a private key is used to sign messages, the public key is used to verify that the signature is valid.
fr: La `clé publique <https://fr.wikipedia.org/wiki/Cryptographie_asym%C3%A9trique>`_ est calculée à partir de la clé privée mais n'est pas secrète, elle peut être révélée à quiconque. Quand une clé privée est utilisée pour signer un message, la clé publique est utilisée pour vérifier que la signature est valide.

source: Pump and dump
fr: Gonflage et largage (pump and dump)

source: Inflating the value of a financial asset that has been produced or acquired cheaply, often using aggressive publicity and misleading statements. The publicity causes others to acquire the asset, forcing up its value. When the value is high enough, the perpetrator sells their assets, cashing in and flooding the market, which causes the value to crash. This is particularly common in markets with low liquidity, such as some altcoins.
fr: Désigne le fait de faire gonfler la valeur d'un actif financier qui a été produit ou acquis à faible coût, souvent par l'utilisation d'une publicité agressive et de déclarations trompeuses. La publicité incite les autres à acquérir l'actif, entraînant la montée de son cours. Quand le cours est suffisamment haut, le manipulateur vend ses actifs, encaisse le bénéfice et inonde le marché, ce qui cause l'effondrement du cours. Cela est particulièrement courant dans les marchés à faible liquidité, comme ceux de certaines altcoins.

source: Group of masternodes signing or voting on some action, with the formation of the group determined by some determiniation algorithm.
fr: Groupe de masternodes signant ou votant sur une action donnée, la formation du groupe étant déterminée par un algorithme donné de détermination.

source: QR Code
fr: Code QR

source: A two-dimensional graphical block containing a monochromatic pattern representing a sequence of data. QR codes are designed to be scanned by cameras, including those found in mobile phones, and are frequently used to encode Dash addresses.
fr: Un bloc graphique bidimensionnel, contenant une trame monochrome qui représente une série de données. Les codes QR sont conçus pour être scannés par des caméras, dont celles qui équipent les téléphones mobiles. Ils sont fréquemment utilisés pour encoder des adresses Dash.

source: `Satoshi Nakamoto <https://en.wikipedia.org/wiki/Satoshi_Nakamoto>`_ is the name used by the person or people who designed Bitcoin and created its original reference implementation.
fr: `Satoshi Nakamoto <https://fr.wikipedia.org/wiki/Satoshi_Nakamoto>`_ est le nom utilisé par la personne ou le groupe de personnes qui a conçu Bitcoin et créé son implémentation de référence originelle.

source: SDK
fr: Kit de développement logiciel (SDK)

source: Software Development Kit. A set of tools, code and documentation used by developers to create apps targeting a specific hardware or software platform.
fr: Ensemble d'outils, de code et de documentations utilisé par les programmeurs pour créer des applications propres à un matériel donné ou à une plateforme logicielle donnée.

source: Signaling
fr: Signalement

source: An indication, flag, or signal of support for a feature or fork. The term signaling is most often used in the context of miners delivering this indication of support or agreement. The message is generally delivered through their adoption of updated software in support of a particular protocol and/or by setting a specific version bit within discovered blocks.
fr: Une indication, un drapeau, ou un signal de compatibilité avec une fonctionnalité ou un "fork". Le terme de signalement est le plus souvent employé dans le contexte du minage, lorsque les mineurs expriment leur compatibilité ou leur accord. Cette expression se fait en général par leur adoption d'une mise à jour logicielle et d'un protocole particulier, et/ou en définissant un bit de version spécifique dans les blocs découverts.

source: State View
fr: Vue d'état

source: The current state of all data objects once all changes from state transitions have been applied. Used in Evolution to determine what should be displayed in a given social wallet, for example.
fr: État actuel de tous les objets de données, une fois que toutes les modifications issues des transitions d'état ont été appliquées. Utilisé par Evolution, par exemple pour déterminer ce qui doit être affiché dans un portefeuille social donné.

source: The Dash development team created a mechanism known as a ":ref:`spork <sporks>`" by which updated code is released to the network, but not immediately made active (or “enforced”). Communication is sent out to users informing them of the change and the need for them to update their clients. Those who update their clients run the new code, but in the event of errors occurring with that new code, the client’s blocks are not rejected by the network and unintended forks are avoided. Data about the error can then be collected and forwarded to the development team. Once the development team is satisfied with the new code’s stability in the mainnet environment – and once acceptable network consensus is attained – enforcement of the updated code can be activated remotely. Should problems arise, the code can be deactivated in the same manner, without the need for a network-wide rollback or client update.
fr: L'équipe de développement de Dash a créé un mécanisme nommé ":ref:`spork <sporks>`" par lequel le code mis à jour est diffusé au réseau, mais pas immédiatement activé (ou "imposé"). Une communication est faite auprès des utilisateurs pour les informer du changement et de la nécessité qu'ils mettent à jour leurs clients. Ceux qui mettent à jour leurs clients font tourner le nouveau code, mais dans le cas d'erreurs se manifestant dans le nouveau code, les blocs des clients ne sont pas rejetés par le réseau, et ainsi des “forks" non souhaités sont évités. Les données sur les erreurs peuvent alors être récupérées et transmises à l'équipe de développement. Une fois que l'équipe est satisfaite de la stabilité du nouveau code dans le réseau principal — et que le consensus acceptable est atteint dans le réseau —, l'activation du code mis à jour se fait à distance. Si des problèmes apparaissent, le code peut être désactivé de la même façon, sans nécessité d'un retour en arrière de l'ensemble du réseau, ni d'une mise à jour du client.

source: Tainted Coins
fr: Pièces marquées

source: Taint is a measure of correlation between two (wallet) addresses. It is only important if the user is trying to remain anonymous.
fr: Le marquage est une mesure de corrélation entre deux adresses de portefeuille. Il est d'une certaine importance si l'utilisateur essaie de demeurer anonyme.

source: Test Dash, used on :ref:`testnet <testnet>`.
fr: Dash de test, utilisé uniquement sur le :ref:`réseau de test <testnet>`.

source: Testnet
fr: Réseau de test

source: :ref:`Testnet <testnet>` is a network only for testing (parallel to the mainnet), test wallets, test coins, test masternodes, test miners, and test users all simulate their mainnet counterparts in a safe environment where errors or forks are not harmful.
fr: Le :ref:`réseau de test (testnet) <testnet>` est un réseau dédié aux tests (parallèle au réseau principal), aux portefeuilles de test, aux pièces de test, aux masternodes de test, aux mineurs de test et aux utilisateurs de test, qui simulent tous leurs contreparties du réseau principal mais dans un environnement sûr où les erreurs et les forks ne peuvent pas faire de dégâts.

source: An anonymous routing protocol used by people wanting to hide their identity online.
fr: Protocole de routage anonyme utilisé par les personnes souhaitant masquer leur identité en ligne.

source: Some movement of data on the distributed blockchain ledger. Transactions may be divided into classical and special transactions. Similar to Bitcoin, classical transactions move balances between addresses on the blockchain. Special transactions contain an extra payload in the format defined by `DIP2 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_, and can be used to manage blockchain users, for example.
fr: Déplacement quelconque de données sur le registre distribué de la blockchain. On distingue les transactions classiques des transactions spéciales. Comme dans Bitcoin, les transactions classiques déplacent des soldes entre adresses de la blockchain. Les transactions spéciales comportent des données supplémentaires selon le format défini par la `DIP2 <https://github.com/dashpay/dips/blob/master/dip-0002.md>`_ et elles peuvent être utilisées, par exemple, pour gérer les utilisateurs sur la blockchain.

source: Transaction Block
fr: Bloc de transactions

source: A collection of transactions on the Dash network, gathered into a block that can then be hashed and added to the blockchain.
fr: Série de transactions sur le réseau Dash, rassemblées en un bloc qui peut alors être "haché" et ajouté à la blockchain.

source: Transaction Fee
fr: Frais de transaction

source: A :ref:`small fee <fees>` imposed on some transactions sent across the Dash network. The transaction fee is awarded to the miner that successfully hashes the block containing the relevant transaction.
fr: De :ref:`faibles frais <fees>` sont nécessaires à certaines transactions envoyées sur le réseau Dash. Les frais de transaction sont reversés au mineur qui trouve le bon hachage pour le bloc contenant la transaction.

source: Unconfirmed Transactions
fr: Transactions non confirmées

source: Transactions that are not yet processed by miners or held via InstantSend are "unconfirmed on the blockchain." Unconfirmed transactions can be reversed and should not be considered as "final."
fr: Les transactions qui ne sont pas encore traitées par les mineurs ou qui sont retenues par InstantSend sont dites "non confirmées sur la blockchain". Les transactions non confirmées peuvent être inversées et ne doivent pas être considérées comme définitives.

source: Vanity Address
fr: Adresse vanity

source: A Dash address with a desirable pattern, such as a name.
fr: Adresse Dash avec une forme particulière, contenant par exemple un nom.

source: Virgin Dash
fr: Dash vierge

source: Dash received as a reward for mining a block or running a masternode. These have not yet been spent anywhere and are "virgin."
fr: Désigne les dashs reçus comme récompense de minage de bloc ou de gestion de masternode. Ils n'ont été dépensés encore nulle part et sont "vierges".

source: Volatility
fr: Volatilité

source: The measurement of price movements over time for a traded financial asset (including Dash).
fr: Mesure des mouvements du cours sur une période de temps pour un actif financier (dont Dash).

source: Wallet
fr: Portefeuille

source: A method of storing Dash for later use. A wallet holds the private keys associated with Dash addresses. The blockchain is the record of the Dash balances (and transactions) associated with those addresses.
fr: Moyen de stocker des dashs pour une utilisation ultérieure. Un portefeuille détient les clés privées associées aux adresses Dash correspondantes. La blockchain est le registre de tous les soldes Dash (et des transactions) associés à ces adresses.

source: Whitepaper
fr: Livre blanc

source: A `white paper <https://en.wikipedia.org/wiki/White_paper>`_ is an authoritative report or guide that informs readers concisely about a complex issue and presents the issuing body's philosophy on the matter. It is meant to help readers understand an issue, solve a problem, or make a decision.
fr: Un `livre blanc <https://fr.wikipedia.org/wiki/Livre_blanc>`_ est un rapport ou guide de référence, qui informe de manière concise les lecteurs sur un problème complexe, et qui expose les conceptions de l'auteur à ce sujet. Il est destiné à aider les lecteurs à comprendre un problème, à le résoudre, et à prendre des décisions.

source: :ref:`X11 <x11-hash-algorithm>` is a hashing algorithm created by Dash Core developer Evan Duffield.
fr: :ref:`X11 <x11-hash-algorithm>` est un algorithme de hachage créé par Evan Duffield, développeur Dash Core.

source: Zero Confirmations
fr: Zéro confirmation

source: This is a transaction without any confirmations from the blockchain. It is technically reversible (unless InstantSend was used).
fr: Il s'agit d'une transaction sans aucune confirmation sur la blockchain. Techniquement, elle est réversible (sauf en cas d'utilisation d'InstantSend).

source: A transaction (tx) consists of one or more inputs and one or more outputs. The vin is the list of inputs to the transaction, and vout is the list of outputs. Masternodes require a 1000 DASH vin (exactly that amount) in order to work.
fr: Une transaction ("tx") consiste en une ou plusieurs entrées et une ou plusieurs sorties. Le "vin" est la liste des entrées de la transaction, et le "vout" est la liste de ses sorties. Les masternodes requièrent un "vin" de 1000 dashs (exactement) pour pouvoir fonctionner.

source: VMN
fr: Masternode virtuel (VMN)

source: Virtual Masternode - a standalone masternode emulator in JavaScript that simulates Layer 1-3 Evolution functions for DAP design, development and testing.
fr: Émulateur autonome de masternode, écrit en JavaScript, qui simule les fonctions de couches 1 à 3 d'Evolution pour faciliter la conception, la programmation et les tests.
