Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/ios/getting-started.po
Languages: de, fr, it, pt, ru

source: Getting started with sending and receiving Dash on your iOS device
de: Dash auf einem iOS-Gerät empfangen und versenden
fr: Apprendre comment envoyer et recevoir des dashs sur votre appareil iOS
it: Iniziare a inviare e ricevere Dash sul tuo dispositivo iOS
pt: Primeiros passos no envio e recebimento do Dash no seu dispositivo iOS
ru: Знакомство с методом отправки и получения Dash на ваше iOS устройство

source: dash, mobile, wallet, ios, send, receive, addresses, getting started
de: dash, mobile, wallet, ios, senden, empfangen, adressen, starten
fr: dash, mobile, portefeuille, iOS, envoyer, recevoir, adresses, apprendre
it: dash, mobile, wallet, android, invia, ricevi, indirizzi, iniziare
pt: dash, mobile, carteira, ios, enviar, receber, endereço, começando
ru: dash, мобильный, кошелёк, ios, отправить, получить, адреса, начало работы

source: Getting started
de: Implementierung beginnen
fr: Démarrage
it: Iniziare
pt: Começando
ru: Начало работы

source: Creating a new wallet
de: Eine neue Wallet erstellen
fr: Création d'un nouveau portefeuille
it: Creazione di un nuovo portafoglio
pt: Criando uma nova carteira
ru: Создание нового кошелька

source: When you first start your Dash Wallet, you will be prompted to choose between creating a new wallet or recovering an existing wallet. Choose **New Wallet** to create a new wallet unless you have existing funds stored in another wallet using a recovery phrase. Your new wallet will be generated, and a recovery phrase will appear so you can recover the funds later if you lose or damage your phone or need to transfer the account to another device. Write the phrase down and store it in a safe place - if you lose this, you will also lose access to your funds forever.
de: Beim ersten Starten der Dash Wallet kann entweder eine neue Wallet erstellt oder eine bereits existierende wiederhergestellt werden. Die Funktion **Neue Wallet** sollte verwendet werden, solange der Nutzer nicht über die Wiederherstellungsphrase einer bereits benutzten Wallet verfügt. Nach dem Erstellen der neuen Wallet muss die Wiederherstellungsphrase aufgeschrieben werden. Diese Phrase ist notwendig um den Zugang zum Guthaben wiederherzustellen, wenn das Gerät zerstört wird oder verloren geht. Sie kann zudem verwendet werden, wenn das gesamte Guthaben auf ein neues Gerät übertragen werden soll. Die Phrase muss niedergeschrieben und an einem sicheren Ort aufbewahrt werden - wer sie verliert, verliert eventuell den Zugang zu seinem gesamten Guthaben.
fr: Au premier démarrage, l'application Dash Wallet vous demandera si vous souhaitez créer un nouveau portefeuille ou récupérer un portefeuille existant. Choisissez **Nouveau portefeuille** pour en créer un nouveau, sauf si vous avez déjà des fonds stockés dans un autre portefeuille et disposez d'une phrase de récupération. Votre nouveau portefeuille sera généré, et une phrase de récupération s'affichera pour que vous puissiez récupérer ultérieurement vos fonds si jamais vous perdez ou endommagez votre téléphone, ou bien si vous avez besoin de les transférer sur un autre appareil. Écrivez la phrase quelque part et stockez-la dans un endroit sûr — si vous la perdez, vous perdrez également et pour toujours l'accès à vos fonds.
it: Quando avvii per la prima volta il tuo Dash Wallet, ti verrà chiesto di scegliere tra la creazione di un nuovo wallet o il recupero di un portafoglio esistente. Scegli **Nuovo wallet** per creare un nuovo wallet a meno che tu non abbia fondi esistenti archiviati in un altro wallet utilizzando una frase di recupero. Verrà generato il tuo nuovo wallet e verrà visualizzata una frase di recupero in modo da poter recuperare i fondi in un secondo momento se perdi o danneggi il telefono o devi trasferire l'account su un altro dispositivo. Scrivi la frase e conservala in un luogo sicuro: se la perdi, perderai per sempre anche l'accesso ai tuoi fondi.
pt: Quando você iniciar a sua carteira do Dash pela primeira vez, você será solicitado a escolher entre criar uma nova carteira ou recuperar uma carteira existente. Escolha **Nova Carteira** para criar uma nova carteira, a menos que você tenha fundos existentes armazenados em outra carteira usando uma frase de recuperação. Sua nova carteira será gerada e uma frase de recuperação aparecerá para que você possa recuperar os fundos posteriormente se perder ou danificar seu telefone ou precisar transferir a conta para outro dispositivo. Escreva a frase e guarde-a em um lugar seguro, se você perder isso, você também perderá o acesso aos seus fundos para sempre.
ru: При первом запуске кошелька Dash Wallet вам будет предложено выбрать между созданием нового кошелька или восстановлением существующего кошелька. Выберите **Новый кошелёк**, чтобы создать новый кошелёк, если у вас нет средств, хранящихся на другом кошельке, который можно восстановить с помощью фразы восстановления. Ваш новый кошелёк будет создан, и появится фраза восстановления, чтобы вы могли восстановить средства позже, если вы потеряете или повредите свой телефон, или вам потребуется перенести аккаунт на другое устройство. Запишите фразу и храните её в надёжном месте - если вы её потеряете, то вы навсегда утратите доступ к своим средствам.

source: *Creating a new wallet and generating the recovery phrase in iOS Dash Wallet*
de: *Eine neue Wallet erstellen und die Wiederherstellungsphrase der iOS Dash Wallet generieren*
fr: *Création d'un nouveau portefeuille et génération d'une phrase de récupération dans Dash Wallet pour iOS*
it: *Creazione di un nuovo wallet e generazione della frase di recupero in iOS Dash Wallet*
pt: *Criando uma nova carteira e gerando a frase de recuperação no iOS Dash Wallet*
ru: *Создание нового кошелька и создание фразы восстановления в кошельке Dash для iOS*

source: You may also be asked to specify a PIN or link the app with your TouchID. You can tap the Dash logo at the top of the app to view your balance. You will need to unlock your wallet for this, as well as to view your transaction history or send Dash.
de: Es ist außerdem möglich eine PIN zu erstellen oder die App mit der TouchID zu verbinden. Das aktuelle Guthaben kann über das Dash Logo am oberen Rand der App abgerufen werden. Hierfür, zum Ansehen der Transaktionsgeschichte und zum Versenden von Dash muss die Wallet entsperrt werden.
fr: Il vous sera aussi peut-être demandé de choisir un code PIN ou d'associer l'application à votre TouchID. Vous pouvez toucher le logo Dash en haut de l'application pour voir votre solde. Pour cela vous devez déverrouiller votre portefeuille, tout comme pour voir l'historique de vos transactions ou envoyer des fonds Dash.
it: Potrebbe anche esserti chiesto di specificare un PIN o collegare l'app al tuo TouchID. Puoi toccare il logo Dash nella parte superiore dell'app per visualizzare il tuo saldo. Per farlo dovrai sbloccare il tuo wallet, nonché visualizzare la cronologia delle transazioni o inviare Dash.
pt: Você também pode ser solicitado a especificar um PIN ou vincular o aplicativo ao seu TouchID. Você pode tocar no logotipo do painel na parte superior do aplicativo para ver seu saldo. Você precisará desbloquear sua carteira para isso, bem como visualizar seu histórico de transações ou enviar o Dash.
ru: Так же вам может поступить запрос указать PIN или запрос на привязку приложения к TouchID. Можно увидеть свой баланс, нажав на логотип Dash в верхней части приложения. Для просмотра баланса необходимо разблокировать кошелёк, также разблокировка необходима для просмотра истории транзакций или отправки Dash.

source: Receiving
de: Empfangen
fr: Recevoir des fonds
it: Ricezione
pt: Recebendo
ru: Получение

source: Once you have set up your wallet, you will have two screens available to send and receive Dash. You can swipe left and right between the screens. To receive Dash, the app will generate an address which appears at the bottom of the screen. You can tap this to copy and share, or scan the QR code directly. Once the transfer is complete, you can view your balance, transaction history and the status of any pending transactions by clicking the menu button at the top left.
de: Nach dem Einrichten der Wallet stehen zwei Bildschirme zum Senden und Empfangen von Dash zur Verfügung. Diese Bildschirme werden durch das Wischen nach rechts oder links aufgerufen. Zum Empfangen von Dash generiert die App eine Adresse, welche am unteren Rand des Bildschirms erscheint. Diese kann kopiert, geteilt oder als QR-Code eingescannt werden. Nach dem Abschluss der Transaktion ist es möglich das aktuelle Guthaben, die Transaktionsgeschichte und den Status der aktuellen Transaktionen durch Druck auf den Menüknopf oben links abzurufen.
fr: Une fois votre portefeuille configuré, vous disposez de deux écran pour envoyer et recevoir des dashs. Vous pouvez balayer vers la gauche et vers la droite pour changer d'écran. Pour recevoir des dashs, l'application générera une adresse qui apparaîtra au bas de l'écran. Vous pouvez la toucher pour la copier et la partager, ou bien scanner directement le QR-code. Une fois la transaction achevée, vous pouvez consulter votre solde, votre historique de transactions et l'état de toute transaction en cours, en touchant le bouton menu en haut à gauche.
it: Una volta configurato il tuo wallet, avrai a disposizione due schermate per inviare e ricevere Dash. Puoi scorrere verso sinistra e verso destra tra le schermate. Per ricevere Dash, l'app genererà un indirizzo che apparirà nella parte inferiore dello schermo. Puoi toccarlo per copiare e condividere oppure scansionare direttamente il codice QR. Una volta completato il trasferimento, puoi visualizzare il saldo, la cronologia delle transazioni e lo stato di eventuali transazioni in sospeso facendo clic sul pulsante del menu in alto a sinistra.
pt: Depois de ter configurado sua carteira, você terá duas telas disponíveis para enviar e receber Dash. Você pode deslizar para a esquerda e direita entre as telas. Para receber o Dash, o aplicativo irá gerar um endereço que aparece na parte inferior da tela. Você pode tocar para copiar e compartilhar ou escanear o código QR diretamente. Quando a transferência estiver concluída, você poderá ver seu saldo, histórico de transações e o status de qualquer transação pendente clicando no botão de menu no canto superior esquerdo.
ru: Как только вы настроите кошелёк, будут доступны два экрана- для отправки и получения Dash. Вы можете перемещаться между экранами, сдвигая их влево или вправо. Для получения Dash приложением будет создан адрес, который появится внизу экрана. При нажатии, адрес можно будет скопировать и отправить или же можно напрямую отсканировать QR-код. По завершению восстановления счёта из фразы, вам будет доступен просмотр баланса, история транзакций и статуса незавершённых транзакций путём нажатия на кнопку меню в левом верхнем углу экрана.

source: *Receiving Dash and viewing your balance in iOS Dash Wallet*
de: *Dash erhalten und das aktuelle Guthaben in der iOS Dash Wallet betrachten*
fr: *Réception de dashs et consultation de solde dans Dash Wallet pour iOS*
it: *Ricevere Dash e visualizzare le transazioni e il saldo in Dash Wallet per iOS*
pt: *Recebendo Dash e exibindo seu saldo na Carteira Dash no IOS*
ru: *Получение Dash и промотр баланса в кошелька Dash для iOS*

source: Sending
de: Senden
fr: Envoyer des fonds
it: Invio
pt: Enviando
ru: Отправка

source: The Send DASH screen gives you two options to enter the payment address: **Scan QR Code** or **Pay Address From Clipboard**. You can choose to use **InstantSend** for instant confirmation, or disable this to send a normal transaction which will require more time for confirmation. Depending on the code you are scanning, the amount of Dash requested may be included, or you can enter it yourself. A confirmation screen will appear to explain the fee structure and request your unlock code (PIN or TouchID). The transaction will then be sent.
de: Der Bildschirm zum Versenden von Dash bietet zwei Möglichkeiten eine Adresse einzugeben: **Scan QR Code** oder **Pay Address From Clipboard**. Für schnelle Transaktionen ist es möglich **InstantSend** zu aktivieren, wobei auch normale Transaktionen, die länger brauchen, möglich sind. Abhängig vom eingescannten Code ist das angefragte Guthaben enthalten oder muss manuell eingegeben werden. Auf dem Bestätigungsbildschirm wird die Gebührenstruktur erklärt und ein Code (PIN oder TouchID) abgefragt. Die Transaktion wird nun durchgeführt.
fr: L'écran Envoyer des dashs vous propose deux options pour indiquer l'adresse du destinataire : **Scanner un QR-code** ou **Payer à l'adresse du presse-papiers**. Vous pouvez choisir d'utiliser **InstantSend** pour une confirmation instantanée, ou bien le désactiver pour une transaction normale qui demandera un peu plus de temps à être confirmée. Selon le code que vous scannerez, le montant de dashs demandés peut être inclus ou non, ou bien vous pouvez le saisir vous-même. Un écran de confirmation apparaîtra pour vous détailler les frais de transaction et vous demander votre code de déverrouillage (code PIN ou TouchID). La transaction sera ensuite envoyée.
it: La schermata Invia DASH ti offre due opzioni per inserire l'indirizzo di pagamento: **Scansione codice QR** o **Indirizzo di pagamento dagli appunti**. Puoi scegliere di utilizzare **InstantSend** per la conferma immediata o disabilitarlo per inviare una transazione normale che richiederà più tempo per la conferma. A seconda del codice che stai scansionando, la quantità di Dash richiesta potrebbe essere inclusa oppure puoi inserirla tu stesso. Apparirà una schermata di conferma per spiegare la struttura delle tariffe e richiedere il codice di sblocco (PIN o TouchID). La transazione verrà quindi inviata.
ru: Экран перевода DASH даёт вам два варианта для ввода адреса получения: **Scan QR Code** или **Pay Address From Clipboard**. Для мгновенного подтверждения вы можете выбрать использование **InstantSend** или же отключить его для обычной транзакции, но такая транзакция потребует больше времени для подтверждения. В зависимости от того, какой код вы сканируете, количество запрашиваемых Dash может быть как уже включено в него, так и нет и в этом случае, его необходимо будет ввести вручную. Появится экран подтверждения, разъясняющий величину комиссии, далее появится запрос ввести код разблокировки (PIN или TouchID). Затем транзакция отправится.

source: *Sending Dash from iOS Dash Wallet*
de: *Dash mit der iOS Dash Wallet versenden*
fr: *Envoi de dashs depuis Dash Wallet pour iOS*
it: *Invio di Dash da Dash Wallet iOS*
pt: *Envio de Dash da iOS Dash Wallet*
ru: *Отправка Dash из кошелька Dash для iOS*
