Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/governance/using.po
Languages: fr, zh_cn

source: Practical guide to using the Dash governance system and treasury
fr: Guide pratique d'utilisation du système de gouvernance et du Trésor de Dash
zh_cn: 使用达世币预算管理系统的实用手册

source: dash, dgbb, governance, funding, voting, proposals, masternodes
fr: dash, dgbb, gouvernance, financement, vote, propositions budgétaires, masternodes
zh_cn: 达世币，dgbb，管理，资金，投票，提案，主节点

source: Using Dash Governance
fr: Utilisation de la gouvernance Dash
zh_cn: 使用达世币管理系统

source: Dash's Decentralized Governance by Blockchain (DGBB) is a novel voting and funding platform. This documentation introduces and details the theory and practice to use the system.
fr: La gouvernance décentralisée par blockchain de Dash (DGBB) est une plateforme novatrice de vote et de financement. Cette documentation présente et détaille la théorie et la pratique pour utiliser ce système.
zh_cn: 达世币区块链去中心化管理（DGBB）是一个新颖的平台，它可以实现投票和赞助功能。本文档详细地介绍了它的相关理论和实践。

source: Understanding the process
fr: Comprendre le processus
zh_cn: 对达世币区块链去中心化管理的理解

source: DGBB consists of three components: Proposals, Votes, and Budgets
fr: La DGBB consiste en trois éléments : les propositions budgétaires, les votes et les budgets.
zh_cn: DGBB包括三大主要部分：提案、投票和预算资金

source: Anyone can submit a proposal for a small fee
fr: N'importe qui peut soumettre une proposition budgétaire en réglant des frais limités
zh_cn: 任何个人都可以支付小额费用发起预算提案

source: Masternode owners can cast for, against or abstain votes on proposals
fr: Les opérateurs de masternode peuvent voter pour ou contre les propositions budgétaires, ou s'abstenir

source: Approved proposals become budgets
fr: Les propositions budgétaires approuvées deviennent des enveloppes budgétaires
zh_cn: 获准执行的提案将获得预算

source: Budgets are paid directly from the blockchain to the proposal owner
fr: Les enveloppes budgétaires sont payées directement depuis la blockchain aux propriétaires des propositions
zh_cn: 预算提案的发起人将从区块链上直接获得赞助

source: Proposals
fr: Propositions budgétaires
zh_cn: 提案

source: Proposals are a request to receive funds
fr: Les propositions budgétaires sont une sollicitation de fonds
zh_cn: 提案指的是预算资金的申请

source: Proposals can be submitted by anyone for a fee of 5 Dash. The proposal fee is irreversibly destroyed on submission.
fr: Les propositions budgétaires peuvent être soumises par n'importe qui, contre des frais de 5 dashs. Les frais de proposition sont détruits irrémédiablement au moment de la soumission.
zh_cn: 只需5达世币，任何个人都可以递交提案。这5达世币的费用在提案递交的时候就已经被销毁了。

source: Proposals cannot be altered once submitted
fr: Les propositions budgétaires ne peuvent pas être modifiées après soumission
zh_cn: 提案一经递交就无法修改

source: Votes are cast by masternode owners
fr: Les votes sont exprimés par les opérateurs de masternode

source: Votes can be changed at any time
fr: Les votes peuvent être modifiés à tout moment
zh_cn: 投票可以随时更改

source: Votes are counted every 16616 blocks (approx. 30.29 days)
fr: Les votes sont décomptés tous les 16616 blocs (tous les 30,29 jours environ)
zh_cn: 每逢16616个区块就计票一次（时间周期约为30.29天）

source: Budgets
fr: Enveloppes budgétaires
zh_cn: 预算提案

source: Budgets are proposals which receive a net total of yes votes equal to or greater than 10% of the total possible votes (for example over 448 out of 4480)
fr: Les enveloppes budgétaires sont des propositions qui ont réuni un total net de votes "oui" égal ou supérieur à 10% de tous les votes possibles (par exemple, 448 sur 4480)
zh_cn: 预算提案指的是在投票过程中获得的赞成票等于或大于总票数的10%的提案。（例如，在主节点总数达到4480的情况下取得448张赞成票。）

source: Budgets can be nullified at any time if vote totals (cast or re-cast) fall below the approval threshold
fr: Les enveloppes budgétaires peuvent être annulées à tout moment si le total des votes (exprimés ou ré-exprimés) tombe sous le seuil minimal d'approbation
zh_cn: 如果提案获得的赞成票（投或重投的）不能满足上述要求，则无法成为预算提案。

source: Budgets are processed (paid) in order of yes minus no votes. More popular budgets get payment priority.
fr: Les enveloppes budgétaires sont traitées (payées) dans l'ordre du nombre de votes "oui" soustrait du nombre de votes "non". Les enveloppes les plus populaires sont prioritaires pour le paiement.
zh_cn: 预算提案的优先赞助权（支付）按以下方法确定。以提案获得的赞成票减去反对票，差值越大的优先级别越高。

source: Approximately 6176 dash (in 2018) are available for each budget cycle, decreasing by 7.14% every 210240 blocks (approx. 383.25 days).
fr: Environ 6176 dashs (en 2018) sont disponibles pour chaque cycle budgétaire, avec une diminution de 7,14% tous les 210240 blocs (soit environ tous les 383,25 jours).
zh_cn: （在2018年）每个预算周期大约产生6176达世币的预算资金。这一数字会以每210240个区块（即383.25天）下降7.14%的速度递减。

source: Object structure
fr: Structure d'objet
zh_cn: 对象结构

source: The following information is required to create a proposal:
fr: Les informations suivantes sont nécessaires pour créer une proposition budgétaire :
zh_cn: 创下提案需具备以下信息：

source: proposal-name: a unique label, 20 characters or less
fr: proposal-name : nom de la proposition, unique, 20 caractères ou moins
zh_cn: 提案名称：提案名称应是不超过20个字符的、独一无二的标签。

source: url: a proposer-created webpage or forum post containing detailed proposal information
fr: url : adresse web d'une page créée par le proposeur ou d'un billet de forum contenant des informations détaillées sur la proposition budgétaire
zh_cn: 链接：一个由提案发起人创建的页面或论坛网帖，其中包含有关提案的细节信息。

source: payment-count: how many cycles the proposal is requesting payment
fr: payment-count : nombre de cycles pendant lequel la proposition budgétaire sollicite un paiement
zh_cn: 支付周期：预算提案申请分多少次支付预算资金。

source: block-start: the requested start of proposal payments
fr: block-start : début sollicité pour les paiements de la proposition budgétaire
zh_cn: 支付起始时间：预算提案申请开始支付预算资金的时间。

source: dash-address: the address to receive proposal payments
fr: dash-address : l'adresse Dash où seront versés les paiements de la proposition budgétaire
zh_cn: 达世币地址：用于接收预算资金的地址。

source: monthly-payment-dash: the requested payment amount
fr: monthly-payment-dash : le montant mensuel du paiement sollicité
zh_cn: 按月支付的达世币：预算提案申请按月支付的达世币金额。

source: Persistence
fr: Durée de vie
zh_cn: 留存时间

source: Proposals become active one day after submission
fr: Les propositions budgétaires deviennent actives un jour après leur soumission
zh_cn: 提案将在递交一天后予以激活。

source: Proposals will remain visible on the network until they are either disapproved or the proposal's last payment-cycle is reached
fr: Les propositions budgétaires restent visibles sur le réseau jusqu'à ce qu'elles soient désapprouvées, ou bien à la fin du dernier cycle de la proposition
zh_cn: 在提案获准通过、予以驳回或提案周期结束之前，提案都会在网络上保持可见状态。

source: Approval occurs when yes votes minus no votes equals 10% or more of the total available votes.
fr: L'approbation a lieu lorsque le nombre de votes "oui" moins celui de votes "non" est égal à 10% ou plus du nombre total de votes possibles.
zh_cn: 当提案获得的赞成票等于或大于总票数的10%，则提案获准通过。

source: Disapproval occurs when no votes minus yes votes equals 10% or more of the total available votes.
fr: La désapprobation a lieu lorsque le nombre de vites "non" moins celui de votes "oui" est égal à 10% ou plus du nombre total de votes possibles.
zh_cn: 当提案获得的赞成票小于总票数的10%，则提案不予通过。

source: The total available votes is the count of online and responding masternodes and can be seen by running the command ``masternode count`` in the Dash Core wallet debug window. A graph of the total masternode count can be found `here <http://178.254.23.111/~pub/masternode_count.png>`__
fr: Le nombre total de votes possibles est celui des masternodes en ligne et détectables. Il peut être connu par la commande ``masternode count`` dans la console de débogage du portefeuille logiciel Dash Core. Un graphique du nombre total de masternodes peut être consulté `ici <http://178.254.23.111/~pub/masternode_count.png>`__
zh_cn: 总票数指的是在线统计的主节点数量，用户可以在Dash Core钱包的调试窗口运行``masternode count``命令来查询主节点数量。用户可以点击\ `此处 <http://178.254.23.111/~pub/masternode_count.png>`__\ 查看达世币主节点数量。

source: Templates
fr: Modèles
zh_cn: 模板

source: The following two Microsoft Word templates are available from Dash Core Group to help facilitate standardized proposal submission and updates. Usage is recommended, but not required.
fr: Les deux modèles Microsoft Word suivants sont mis à disposition par l'équipe Dash Core pour faciliter les soumissions et les mises à jour de propositions budgétaires standardisées. Son utilisation est recommandée mais n'est pas obligatoire.
zh_cn: 以下两个网址上的微软Word文档模板由Dash Core团队提供，可以帮助用户了解标准化的提案递交及更新流程。建议但不强制要求用户使用这两个模板：

source: `Project Proposal Template <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v1.0.docx>`_
fr: `Modèle de projet de proposition budgétaire <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v1.0.docx>`_

source: `Project Status Update Template <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v1.0.docx>`_
fr: `Modèle de mise à jour de projet <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v1.0.docx>`_

source: Budget cycles
fr: Cycles budgétaires
zh_cn: 预算周期

source: When preparing a proposal, be aware of when the next cycle will occur and plan accordingly. It is recommended to choose your proposal payment start block at least one cycle in the future to allow time for discussion and gathering support and votes. Note that votes will no longer be tallied 1662 blocks (approximately 3 days) prior to the superblock.
fr: Pendant la préparation d'une proposition budgétaire, soyez bien conscient de la date du début du prochain cycle, et organisez-vous selon elle. Il est recommandé de choisir un bloc de début de paiement de votre proposition qui soit éloigné d'au moins un cycle dans le futur, afin que le débat puisse avoir lieu ainsi que le rassemblement de vos soutiens et votes. Veuillez noter que les votes ne seront plus décomptés 1662 blocs (environ 3 jours) avant le "superbloc".
zh_cn: 在撰写提案时，发起人应当关注下一个预算周期并进行相应的规划。建议提案发起人将支付的起始时间设定在下一个周期，以便为社区讨论和获取支持预留时间。需要注意的是，超级块出现前的1662个区块（大约3天之内）不计票。

source: Block height
fr: Hauteur de bloc
zh_cn: 区块高度

source: Approximate date
fr: Date approximative
zh_cn: 大致时间

source: Tue Oct 3 20:17:56 UTC 2017
fr: Mar Oct 3 20:17:56 UTC 2017

source: Fri Nov 3 03:22:58 UTC 2017
fr: Ven Nov 3 03:22:58 UTC 2017

source: Sun Dec 3 10:28:00 UTC 2017
fr: Dim Dec 3 10:28:00 UTC 2017

source: Tue Jan 2 17:33:02 UTC 2018
fr: Mar Jan 2 17:33:02 UTC 2018

source: Fri Feb 2 00:38:04 UTC 2018
fr: Ven Fév 2 00:38:04 UTC 2018

source: Sun Mar 4 07:43:06 UTC 2018
fr: Dim Mar 4 07:43:06 UTC 2018

source: Tue Apr 3 14:48:08 UTC 2018
fr: Mar Avr 3 14:48:08 UTC 2018

source: Thu May 3 21:53:10 UTC 2018
fr: Jeu Mai 3 21:53:10 UTC 2018

source: Sun Jun 3 04:58:12 UTC 2018
fr: Dim Juin 3 04:58:12 UTC 2018

source: Tue Jul 3 12:03:14 UTC 2018
fr: Mar Juil 3 12:03:14 UTC 2018

source: Thu Aug 2 19:08:16 UTC 2018
fr: Jeu Août 2 19:08:16 UTC 2018

source: Sun Sep 2 02:13:18 UTC 2018
fr: Dim Sep 2 02:13:18 UTC 2018

source: Tue Oct 2 09:18:20 UTC 2018
fr: Mar Oct 2 09:18:20 UTC 2018

source: Thu Nov 1 16:23:22 UTC 2018
fr: Jeu Nov 1 16:23:22 UTC 2018

source: Sat Dec 1 23:28:24 UTC 2018
fr: Sam Dec 1 23:28:24 UTC 2018

source: Tue Jan 1 06:33:26 UTC 2019
fr: Mar Jan 1 06:33:26 UTC 2019

source: You can view the source code for this calculation at this `GitHub gist <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_
fr: Le code source de ce calcul est disponible sur `GitHub <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_
zh_cn: 用户可以在 `GitHub gist <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_ 查看源代码并计算。

source: Creating proposals
fr: Création de propositions budgétaires
zh_cn: 创建提案

source: Once you have prepared the text of your proposal and set up a website or forum post, it is time to submit your proposal to the blockchain for voting. While all tasks involved with creating a budget proposal can be executed from the Dash Core wallet console, several tools providing a user interface have been developed to simplify this procedure.
fr: Une fois que vous avez préparé le texte de votre proposition budgétaire et mis en place un site web ou un billet de forum, il sera temps de soumettre votre proposition budgétaire au vote, sur la blockchain. Toutes les tâches de création d'une proposition budgétaire peuvent être menées depuis la console du portefeuille logiciel Dash Core, mais plusieurs utilitaires avec une interface utilisateur ont été conçus pour simplifier cette procédure.
zh_cn: 一旦完成了提案文本的撰写且创建了相关的网页或论坛帖子，提案发起人就可以向区块链递交提案并等待投票了。虽然用户可以通过Dash Core钱包的控制台执行所有有关创建预算提案的操作，但其它工具也可以通过用户界面简化创建流程。

source: Dash Budget Proposal Generator
fr: Générateur de proposition budgétaire Dash
zh_cn: 达世币预算提案生成器

source: The `Dash Budget Proposal Generator <https://proposal.dash.org>`__ supports creating budget proposals on both mainnet and testnet. In the first step, you must enter a short, clear and unique name for the proposal as it will appear on the blockchain. Proposal names are limited to 40 characters. You can then provide a link to the forum or DashCentral where your proposal is described in more detail (use a `URL shortening service <https://goo.gl>`_ if necessary), as well as select the amount of payment you are requesting, how often the payment should occur, and the superblock date on which you are requesting payment. This allows you to control in which budget period your proposal will appear, and gives you enough time to build support for your proposal by familiarising voters with your project. Note that the payment amount is fixed and cannot be modified after it has been submitted to the blockchain.
fr: Le `générateur de proposition budgétaire Dash <https://proposal.dash.org>`__ permet de créer des propositions budgétaires sur le réseau principal ou sur le réseau de test. À la première étape, vous devez saisir un nom bref, clair et unique pour la proposition, telle qu'elle apparaîtra sur la blockchain. Les noms de proposition budgétaire sont limités à 40 caractères. Vous pouvez ensuite fournir un lien vers le forum Dash ou vers DashCentral où votre proposition est décrite plus en détail (utilisez un `service de raccourcissement d'URL <https://goo.gl>`_ si nécessaire), et vous devez indiquer le montant du paiement sollicité, le nombre de fois qu'il doit être versé, et la date du "superbloc" pour laquelle vous sollicitez le paiement. Cela vous permet de contrôler dans quel cycle budgétaire apparaîtra votre proposition, et cela vous donne un temps suffisant pour promouvoir votre proposition et familiariser les électeurs avec votre projet. Veuillez noter que le montant du paiement est fixé une fois pour toutes, et qu'il ne peut plus être modifié après soumission à la blockchain.

source: Steps 1 & 2: Creating your proposal and preparing the command
fr: Étapes 1 & 2 : Création de votre proposition budgétaire et préparation de la commande
zh_cn: 步骤 1 & 2： 创建个人提案并准备命令

source: Next, the proposal generator will provide you with a command to run from the console of your Dash Core wallet to prepare your budget proposal governance object. Running this command will cost you 5 DASH, which will be "burnt" or permanently removed from circulation. This one-time fee protects the governance system from becoming overwhelmed by spam, poorly thought out proposals or users not acting in good faith. A small transaction fee is charged as well, so make sure slightly more than 5 DASH is available in your wallet. Many budget proposals request reimbursement of the 5 DASH fee.
fr: Ensuite, le générateur de proposition budgétaire vous communiquera une commande à lancer dans la console de votre portefeuille logiciel Dash Core, pour préparer votre objet de gouvernance de proposition budgétaire. Lancer cette commande vous coûtera 5 dashs, lesquels seront "brûlés", c'est-à-dire retirés définitivement de la circulation. Ces frais perçus une seule fois protègent le système de gouvernance des attaques de spam, des propositions budgétaires manquant de sérieux, ou des utilisateurs malveillants. De petits frais de transaction sont également perçus, donc assurez-vous qu'un peu plus de 5 dashs soient disponibles dans votre portefeuille logiciel. Beaucoup de propositions budgétaires sollicitent le remboursement des frais de 5 dashs.
zh_cn: 接下来，提案生成器将为用户提供从Dash Core钱包控制台运行的命令，以便为用户准备预算提案管理对象。运行这个命令需要花费5个达世币，这5个达世币在支付后将被焚毁或永远移除在流通之外。这种一次性的收费确保了管理系统不会受到大批垃圾提案、低俗劣质的提案或不怀好意的用户的干扰。除了5个达世币的费用之外，提案的创建和递交还需要小额的手续费，因此用户需要确保钱包里有稍多于5个达世币的资金。很多预算提案都可以在提案中申请报销5个达世币的费用。

source: First unlock your wallet by clicking **Settings > Unlock wallet**, then open the console by clicking **Tools > Debug console** and paste the generated command. The transaction ID will appear. Copy and paste this into the proposal generator response window. As soon as you do this, the system will show a progress bar as it waits for 6 confirmations as follows:
fr: Déverrouillez d'abord votre portefeuille logiciel en cliquant sur le menu **Réglages > Déverrouiller le portefeuille**, puis ouvrez la console en allant sur **Outils > Console de débogage** et collez-y la commande générée. L'identifiant de transaction apparaîtra. Copiez-collez-le dans la fenêtre de réponse du générateur de proposition. Dès lors, le système affichera une barre de progression, dans l'attente de 6 confirmations, comme suit :
zh_cn: 首先用户需要点击 **设置 > 解锁钱包** ，然后点击 **工具 > 调试控制台** 并粘贴生成的命令。交易ID此时就会出现。用户应当将交易ID复制并粘贴到提案生成器的相应窗口。在执行这项操作之后，系统将显示一个6次确认的进度条：

source: Step 3: Creating the proposal transaction and waiting for 6 confirmations of the transaction ID
fr: Étape 3 : Création de la transaction de proposition budgétaire et attente des 6 confirmations de l'identifiant de transaction
zh_cn: 步骤3：创建提案交易并等待交易ID的6次确认

source: Once 6 block confirmations exist, another command will appear to submit the prepared governance object to the network for voting. Copy and paste this command, and your governance object ID will appear as follows:
fr: Une fois que les 6 confirmations de bloc ont eu lieu, une autre commande s'affichera pour soumettre l'objet de gouvernance préparé au réseau, en vue du vote. Copiez-collez cette commande, et votre identifiant d'objet de gouvernance apparaîtra comme suit :
zh_cn: 一旦完成6次确认，用户将会看到另一个命令。借助这个命令，用户将准备好的管理对象递交到网络并等待投票。复制并粘贴这个命令，用户将会看到如下所示的管理对象ID：

source: Step 4: Submitting the governance object to the network
fr: Étape 4 : Soumission de l'objet de gouvernance au réseau
zh_cn: 步骤4：将管理对象提交到网络上

source: You can use this ID to track voting on the proposal until the budget closes and you receive your payout. You can also submit the ID to DashCentral to claim your proposal and enable simplified voting for masternodes using DashCentral voting services.
fr: Vous pouvez utiliser cet identifiant pour suivre le vote sur la proposition budgétaire, jusqu'à ce que le cycle budgétaire se termine et que vous receviez votre paiement. Vous pouvez aussi soumettre l'identifiant à DashCentral pour revendiquer votre proposition budgétaire et activer le vote simplifié pour les masternodes, au moyen des services de vote de DashCentral.
zh_cn: 用户可以使用管理对象ID来跟进提案的投票情况，直到提案周期终结且用户收到赞助资金。用户还可以使用这个管理对象ID在DashCentral上递交提案，并借助DashCentral的投票服务简化主节点投票流程。

source: DashCentral Proposal Generator
fr: Générateur de proposition budgétaire de DashCentral
zh_cn: DashCentral预案提案生成器

source: DashCentral also includes a tool to create budget proposals, or claim existing proposals so you can add a description on DashCentral and begin discussion with the community. The steps to be taken are almost identical to the procedure described above, and documentation is available `here <https://www.dashcentral.org/about/contact>`_.
fr: DashCentral propose aussi un outil de création de propositions budgétaires, ou de revendication de propositions existantes afin que vous puissiez ajouter une description sur DashCentral et lancer le débat avec la communauté. Les étapes à suivre sont presque identiques à la procédure décrite ci-dessus, et la documentation est disponible `ici <https://www.dashcentral.org/about/contact>`_.
zh_cn: DashCentral也为用户提供创建或确认现有预算提案的工具，以便用户在DashCentral上添加对提案的描述并推动社区内部有关提案的讨论。使用DashCentral的步骤与上述流程基本相同，相关文档请参阅\ `这里 <https://www.dashcentral.org/about/contact>`_\ 。

source: Voting on proposals
fr: Voter sur les propositions budgétaires
zh_cn: 为预算提案投票

source: **You must vote at least three days before the superblock is created or your vote will not be counted. The exact deadline is 1662 blocks before the superblock.**
fr: **Vous devez voter au moins trois jours avant la création du "superbloc", sinon votre vote ne sera pas décompté. La limite précise est 1662 blocs avant le "superbloc".**
zh_cn: **用户必须在超级块产出的三天前为提案投票，否则投票将不计入结果。准确来说，投票须在超级块创建前的1662个区块前完成。**

source: Note that if you do not operate a masternode, you may still be able to vote on DashBoost proposals. See https://www.dashboost.org for more information.
fr: À noter que, si vous n'opérez pas de masternode, vous pouvez quand même voter sur des propositions DashBoost. Pour en savoir plus, voir https://www.dashboost.org .

source: Voting on DGBB proposals is an important part of operating a masternode. Since masternodes are heavily invested in Dash, they are expected to critically appraise proposals each month and vote in a manner they perceive to be consistent with the best interests of the network. Each masternode may vote once on each proposal, and the vote can be changed at any time before the voting deadline. The following sites and tools are available to view and manage proposals and voting:
fr: Voter sur les propositions budgétaires du système de gouvernance décentralisée est un rôle important des opérateurs de masternode. Puisque les masternodes sont lourdement investis dans Dash, il est attendu qu'ils évaluent chaque mois les propositions budgétaires d'un œil critique, et qu'ils votent d'une façon correspondant aux meilleurs intérêts du réseau. Chaque masternode peut voter une fois sur chaque proposition budgétaire, et le vote peut être modifié à tout moment avant la date limite. Les sites et outils suivants sont disponibles pour visualiser et gérer les propositions budgétaires et le vote :
zh_cn: 在达世币DGBB上为预算提案投票是主节点持有人的主要任务之一。由于主节点持有人进行了大量的达世币投资，因此他们将会对每个月的预算提案进行审慎的思考，并以网络的最大利益为出发点进行投票。每个主节点可以为每个提案投上一票，在投票结束前投票都是可更改的。下列网站和工具可用于提案和投票的查看与管理：

source: `Dash Ninja - Governance <https://www.dashninja.pl/governance.html>`__
fr: `Dash Ninja - Gouvernance <https://www.dashninja.pl/governance.html>`__

source: `Dash Masternode Tool - Proposals <https://github.com/Bertrand256/dash-masternode-tool/releases>`__
fr: `Dash Masternode Tool - Propositions budgétaires <https://github.com/Bertrand256/dash-masternode-tool/releases>`__

source: For information on how to create a proposal, see :ref:`here <creating-proposals>`.
fr: Pour savoir comment créer une proposition budgétaire, voir :ref:`ici <creating-proposals>`.
zh_cn: 如需了解如何创建提案的更多信息，请查看\ :ref:`此处 <creating-proposals>`\ 。
