Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/governance/using.po
Languages: fr, zh_cn

source: Many masternode operators store their password-protected masternode private key on `DashCentral <https://www.dashcentral.org>`__ to enable simple voting with a user-friendly interface. The popularity of this site has made it a common place for discussion of the proposals after they are submitted to the governance system. To vote from the DashCentral web interface, first add your masternode private key to your account according to the instructions here. Note that the masternode private key is not the same as the private key controlling the 1000 DASH collateral, so there is no risk of losing your collateral. A separate password is required to unlock the masternode private key for voting, so the risk of the site operator voting in your name is minimal.
fr: Beaucoup d'opérateurs de masternode stockent leur clé privée de masternode (protégée par mot de passe) sur `DashCentral <https://www.dashcentral.org>`__ pour activer le vote simplifié depuis une interface utilisateur conviviale. La popularité de ce site en a fait un endroit habituel pour le débat sur les propositions budgétaires, après leur soumission au système de gouvernance. Pour voter depuis l'interface web DashCentral, ajoutez d'abord votre clé privée de masternode à votre compte, selon les instructions disponibles ici. Veuillez noter que la clé privée de masternode n'est pas la clé privée qui contrôle votre caution de 1000 dashs, il n'y a donc aucun risque de perdre votre caution. Un mot de passe distinct est obligatoire pour déverrouiller votre clé privée de masternode en vue de voter, donc le risque que le webmestre du site vote à votre place est très faible.
zh_cn: 很多主节点的运营者都将由密码保护的主节点私钥存储到\ `DashCentral <https://www.dashcentral.org>`__\ ，以便使用简单的投票流程和用户友好的界面。这个网站日益流行，成为了社区成员探讨新提案的最佳平台。如需从DashCentral网页界面上进行投票，用户首先要点击此处并根据操作指南将主节点私钥添加到个人账户。请注意，主节点私钥和掌管1000达世币的主节点保证金的私钥并不相同，因此个人的保证金不存在丢失的风险。如果想要解锁投票所需的主节点私钥，用户需要用到一个独立的密码，这样才能将网站运营商冒名顶替用户投票的风险降到最低。

source: When you are ready to vote, go to the `budget proposals page <https://www.dashcentral.org/budget>`_. Simply click to view the proposals, then click either **Vote YES**, **Vote ABSTAIN** or **Vote NO**.
fr: Quand vous êtes prêt à voter, allez sur la `page des propositions budgétaires <https://www.dashcentral.org/budget>`_. Cliquez simplement pour afficher les propositions, puis cliquez selon votre choix sur **Voter OUI**, **Voter ABSTENTION** ou **Voter NON**.
zh_cn: 如果已经做好了投票的准备，用户可以前往\ `预算提案页面 <https://www.dashcentral.org/budget>`_\ 完成投票。用户只需点击浏览提案，再选择\ **赞成**\ 、\ **反对**\ 或\ **弃权**\ 。

source: Voting interface on DashCentral
fr: Interface de vote sur DashCentral
zh_cn: DashCentral的投票界面

source: If you started your masternode from a hardware wallet using `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, you can also use the tool to cast votes. Click **Tools > Proposals** and wait for the list of proposals to load. You can easily see the voting status of each proposal, and selecting a proposal shows details on the **Details** tab in the lower half of the window. Switch to the **Vote** tab to **Vote Yes**, **Vote No** or **Vote Abstain** directly from DMT.
fr: Si vous avez démarré votre masternode depuis un portefeuille matériel au moyen de `DashMasternodeTool (DMT) <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, vous pouvez aussi utiliser cet utilitaire pour voter. Cliquez sur **Outils > Propositions budgétaires** et attendez le chargement de la liste des propositions. Vous pouvez facilement consulter l'état du vote sur chaque proposition budgétaire, et en sélectionner une affiche des détails dans l'onglet **Détails** de la partie inférieure de la fenêtre. Allez sur l'onglet **Vote** pour **Voter Oui**, **Voter Non** ou **Voter Abstention** directement depuis DMT.
zh_cn: 如果用户通过\ `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_\ 和硬件钱包来管理主节点，那么用户也可以使用DMT来完成投票。点击 **工具 > 提案** 并等待提案名单下载。用户可以轻松查阅各个提案的投票状态，只需点击窗口下半部分的 **详细信息** 标签就可以阅读提案的具体细节了。用户还可以直接将 **投票** 标签切换到 **赞成** 、 **反对** 或 **弃权** 。

source: Voting interface in DMT
fr: Interface de vote dans DMT
zh_cn: DMT的投票界面

source: Dash Core wallet or masternode
fr: Portefeuille logiciel Dash Core ou masternode
zh_cn: Dash Core钱包和主节点

source: If you started your masternode using the Dash Core Wallet (not recommended), you can vote manually from **Tools > Debug console**, or directly from your masternode via SSH using ``dash-cli``. First click on the proposal you want to vote on at either `DashCentral <https://www.dashcentral.org/budget>`__ or `Dash Ninja <https://www.dashninja.pl/governance.html>`__. You will see a command for manual voting below the proposal description. Copy and paste the command and modify it as necessary. As an example, take this proposal from `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ (or `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). The voting code for Dash Core Wallet is as follows::
fr: Si vous avez démarré votre masternode en utilisant le portefeuille logiciel Dash Core (ce qui n'est pas recommandé), vous pouvez voter manuellement depuis le menu **Outils > Console de débogage**, ou directement depuis le VPS de votre masternode, via SSH, en utilisant la commande ``dash-cli``. D'abord, cliquez sur la proposition budgétaire sur laquelle vous souhaitez voter, soit dans `DashCentral <https://www.dashcentral.org/budget>`__, soit dans `Dash Ninja <https://www.dashninja.pl/governance.html>`__. Vous verrez une commande de vote manuel sous la description de la proposition budgétaire. Copiez-collez la commande et modifiez-le selon vos besoins. En guise d'exemple, prenez cette proposition sur `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ (ou `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). Le code de vote pour le portefeuille logiciel Dash Core est comme suit ::
zh_cn: 如果用户通过Dash Core钱包（不建议这样操作）来管理主节点，用户可以通过 **工具 > 调试控制台** 或直接使用SSH和 ``dash-cli`` 来完成操作。首先，用户在\ `DashCentral <https://www.dashcentral.org/budget>`__\ 或\ `Dash Ninja <https://www.dashninja.pl/governance.html>`__\ 上点击要投票的提案。 接下来，用户将在提案描述的下方看到人工投票的命令。用户需要对这个命令进行复制、粘贴和更改。以\ `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__\ (或\ `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__\ ）上的这个提案为例。Dash Core钱包的投票代码如下::

source: Note that to vote from your masternode directly, you need to prefix the command with ``dash-cli``, which is usually found in the ``.dashcore`` folder. The command should be similar to the following::
fr: Veuillez noter que, pour voter directement depuis votre masternode, vous devrez préfixer la commande avec ``dash-cli``, utilitaire qui se trouve en général dans le répertoire ``.dashcore``. La commande devrait ressembler à cela ::
zh_cn: 请注意，如果直接通过达世币主节点来投票，用户需要在命令中前缀``dash-cli``，这个前缀通常可以在``.dashcore``文件夹中找到。该命令应类似于以下示例::

source: Note this command will trigger a vote from all masternodes configured in ``dash.conf``. If you have multiple masternodes each with its own .conf file, or if you want to vote with only some of your masternodes, you must change the command from ``vote-many`` to ``vote``. If your vote was successful, you should see a confirmation message reading **Voted successfully**.
fr: Veuillez noter que cette commande enverra un vote pour tous les masternodes configurés dans ``dash.conf``. Si vous avez plusieurs masternodes disposant chacun de son propre fichier ".conf", ou si vous souhaitez voter seulement avec certains de vos masternodes, vous devez changer la commande ``vote-many`` en ``vote``. Si votre vote s'est bien passé, vous devriez voir un message de confirmation disant **Vote réussi**.
zh_cn: 请注意：上述命令会触发 ``dash.conf`` 中配置的所有主节点的投票。换言之，如果用户持有多个主节点，而每个主节点又都有对应的 .conf 文件，那么用户如必须将命令从 ``vote-many`` 改为 ``vote`` 才能以某些主节点的名义投票。如果投票成功，用户将看到一条确认消息，显示 **投票成功** 。

source: Voting from the debug console in Dash Core Wallet
fr: Vote depuis la console de débogage du portefeuille logiciel Dash Core
zh_cn: 通过Dash Core钱包的调试控制台投票

source: You can also view a list of proposals in JSON format from the console to copy and paste the proposal hash for voting as follows::
fr: Vous pouvez aussi afficher une liste des propositions budgétaires au format JSON depuis la console, afin de copier-coller l'empreinte de la proposition pour voter, comme suit ::
zh_cn: 用户还可以借助控制台查看JSON格式的提案列表，并复制和粘贴提案哈希值来完成投票。具体操作如下所示::

source: Introduction
zh_cn: 介绍

source: Each valid masternode can vote for, against or abstain on proposals
zh_cn: 每个合法的主节点都可为提案投票支持，反对和弃权

source: Votes
zh_cn: 投票

source: Votes are cast using the registered voting address
zh_cn: 使用已注册的投票地址进行投票

source: The voting address can be delegated to a third party
zh_cn: 投票地址可委托给第三方

source: Dash Masternode Tool (DMT)
zh_cn: 达世币主节点工具（以下简称DMT）

source: Delegating votes
zh_cn: 委托投票

source: :ref:`DIP003 masternodes <dip3-changes>` feature a separate voting key, which makes it possible to delegate your vote to a representative. Simply enter a Dash address provided by the delegate when :ref:`registering your masternode <masternode-setup>`, or :ref:`update <dip3-update-registrar>` your masternode registration to delegate the vote of a running masternode. The wallet controlling the private key to this address will then cast votes on behalf of this masternode owner simply by following the :ref:`Dash Core voting procedure <dash-core-voting>` described above. No further configuration is required.
zh_cn: :ref:`DIP003 主节点 <dip3-changes>` 提供一个独立的投票 Key, 它可以让你让投票委托给你的代表。输入你的委托方给你的投票地址 :ref:`注册你的主节点 <masternode-setup>`, 或 :ref:`升级 <dip3-update-registrar>` 你的主节点注册来为一个已运行的节点进行委托。 拥有该地址密钥的钱包将代表节点所有者进行投票按照以下方式 :ref:`Dash Core 投票过程 <dash-core-voting>` 。无需额外配置。
