Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/dashcore/coinjoin-instantsend.po
Languages: fr, it, ru

source: Since Dash 0.14, all user-facing interface options to create an InstantSend transaction have been removed, because all transactions are effectively InstantSend transactions. As before, the recipient is responsible for monitoring the network for the InstantSend lock and implementing user-facing logic and interfaces to continue with transaction processing after payment has been recieved. See the :ref:`InstantSend Integration <integration-instantsend>` documentation for more information on how to monitor for InstantSend locks.
it: A partire dalla versione 0.14 di Dash, tutte le opzioni dell'interfaccia utente per creare una transazione InstantSend sono state rimosse, poiché tutte le transazioni sono effettivamente transazioni InstantSend. Come in precedenza, il destinatario è responsabile del monitoraggio della rete per il blocco InstantSend e dell'implementazione della logica e delle interfacce rivolte all'utente per continuare con l'elaborazione della transazione dopo aver ricevuto il pagamento. Consulta la documentazione :ref:`InstantSend Integration <integration-instantsend>` per ulteriori informazioni su come monitorare i blocchi InstantSend.
ru: Начиная с версии Dash 0.14, все возможности пользовательского интерфейса для создания транзакции InstantSend были удалены, поскольку все транзакции фактически являются транзакциями InstantSend. Как и прежде, получатель отвечает за мониторинг сети на предмет блокировки InstantSend и реализацию пользовательской логики и интерфейсов для продолжения обработки транзакции после получения платежа. Более подробную информацию о том, как отслеживать блокировки InstandSend, см. в документации :ref:`InstantSend Integration <integration-instantsend>`.
