Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/dashcore/coinjoin-instantsend.po
Languages: fr, it, ru

source: Using InstantSend and CoinJoin with Dash
fr: Utilisation d'InstantSend et de CoinJoin avec Dash
it: Utilizzo di InstantSend e CoinJoin con Dash
ru: Использование функций InstantSend и CoinJoin с Dash

source: dash, core, mobile, wallet, coinjoin, privatesend, instantsend
fr: dash, core, mobile, portefeuille, coinjoin, privatesend, instantsend
ru: dash, core, мобильный, кошелёк, coinjoin, privatesend, instantsend

source: CoinJoin and InstantSend
fr: CoinJoin et InstantSend
it: CoinJoin e InstantSend
ru: CoinJoin и InstantSend

source: This documentation describes how to use the CoinJoin feature to create CoinJoin transactions with your Dash for consumer grade privacy.
fr: Cette documentation explique comment utiliser la fonctionnalité CoinJoin pour créer des transactions CoinJoin avec vos dashs, et garantir une confidentialité de vos transactions commerciales.
it: Questa documentazione descrive come utilizzare la funzione CoinJoin per creare transazioni CoinJoin con il tuo Dash per la privacy di livello consumer.
ru: В этой документации описано, как использовать функцию CoinJoin для создания транзакций CoinJoin с помощью Dash для обеспечения конфиденциальности потребительского уровня.

source: Background
fr: Panorama
ru: Справочный материал

source: CoinJoin is a trustless (i.e. non-custodial) method of running a sequence of transactions such that an observer has difficulty tracing transaction history. The current implementation of CoinJoin in the Dash Core wallet allows any amount of Dash to be processed. CoinJoin is also available in the :ref:`Dash Electrum <dash-electrum-wallet>` wallet.
fr: CoinJoin est une méthode autonome (c'est-à-dire non confiée à une entité tierce) pour mener une série de transactions difficiles à suivre par un observateur extérieur. La version actuelle de CoinJoin dans le portefeuille Dash Core permet de traiter n'importe quel montant de dashs. CoinJoin est également disponible dans le :ref:`portefeuille Dash Electrum <dash-electrum-wallet>`.
it: CoinJoin è un metodo trustless (cioè non custodito) per eseguire una sequenza di transazioni in modo tale che un osservatore abbia difficoltà a tracciare la cronologia delle transazioni. L'attuale implementazione di CoinJoin nel wallet Dash Core consente di elaborare qualsiasi quantità di Dash. CoinJoin è disponibile anche nel wallet :ref:`Dash Electrum <dash-electrum-wallet>`.
ru: CoinJoin - это бездоверительный (т.е. не хранимый) метод проведения последовательности транзакций, при котором наблюдателю сложно отследить историю транзакций. Текущая реализация CoinJoin в кошельке Dash Core позволяет обрабатывать любое количество Dash. CoinJoin также доступен в кошельке :ref:`Dash Electrum <dash-electrum-wallet>`.

source: Knowledge of the exact number of rounds of CoinJoin has a quantifiable effect on the confidence an adversary may have when attempting to guess transaction history. For this reason, the recommended (and default) number of rounds of CoinJoin is set to four, and some inputs may pass through additional rounds to further improve privacy.
fr: La connaissance du nombre exact de cycles de mélange CoinJoin a un effet mesurable sur la probabilité qu'a un adversaire de deviner l'historique d'une transaction. Pour cette raison, le nombre de cycles de mélange CoinJoin recommandé (et celui par défaut) est fixé à quatre, et certaines entrées peuvent être mélangées lors de cycles supplémentaires pour améliorer encore davantage la confidentialité.
it: La conoscenza del numero esatto di round di CoinJoin ha un effetto quantificabile sulla fiducia che un avversario può avere quando tenta di indovinare la cronologia delle transazioni. Per questo motivo, il numero di round consigliato (e predefinito) di CoinJoin è impostato su quattro e alcuni input potrebbero passare attraverso round aggiuntivi per migliorare ulteriormente la privacy.
ru: Знание точного количества раундов CoinJoin оказывает количественное влияние на уверенность противника при попытке угадать историю транзакций. По этой причине рекомендуемое (и используемое по умолчанию) число раундов CoinJoin равно четырем, а некоторые вводимые данные могут проходить дополнительные раунды для дальнейшего повышения конфиденциальности.

source: You can read more about CoinJoin theory and processes :ref:`here <coinjoin>`.
fr: Vous pouvez en savoir plus sur le concept et les procédures CoinJoin :ref:`ici <coinjoin>`.
it: Puoi leggere ulteriori informazioni sulla teoria e sui processi di CoinJoin :ref:`qui <coinjoin>`.
ru: Более подробно о теории и процессах CoinJoin можно прочитать :ref:`здесь <coinjoin>`.

source: Configuration
it: Configurazione
ru: Конфигурация

source: Open your Dash Core wallet, go to **Settings** and select **Options**. Go to the **CoinJoin** tab.
fr: Ouvrez votre portefeuille logiciel Dash Core, allez à **Réglages** et choisissez **Options**. Allez sur l'onglet **CoinJoin**.
it: Apri il tuo wallet Dash Core, vai su **Impostazioni** e seleziona **Opzioni**. Vai alla scheda **CoinJoin**.
ru: Откройте кошелек Dash Core, перейдите в раздел **Настройки** и выберите пункт **Опции**. Перейдите на вкладку **CoinJoin**.

source: Next to **Mixing rounds**, enter a value between 2-16. Each round of CoinJoin performs one CoinJoin transaction, known as a denomination. Higher numbers of rounds increase your overall level of privacy while decreasing the chance of detection via node collusion. 16 is the highest number of rounds currently available.
fr: Dans **Cycles de mélange**, saisissez un nombre entre 2 et 16. Chaque cycle CoinJoin opère une transaction CoinJoin, identifiée comme une coupure. Un nombre élevé de cycles améliore votre niveau général de confidentialité tout en réduisant le risque d'une détection par collusion de nœuds. 16 est le plus grand nombre de cycles actuellement possible.
it: Accanto a **Cicli di miscelazione**, inserisci un valore compreso tra 2-16. Ogni round di CoinJoin esegue una transazione CoinJoin, nota come denominazione. Un numero maggiore di round aumenta il livello generale di privacy riducendo al contempo la possibilità di rilevamento tramite collusione dei nodi. 16 è il numero più alto di round attualmente disponibili.
ru: Рядом с пунктом **Раунды смешивания** введите значение в диапазоне от 2 до 16.Каждый раунд CoinJoin выполняет одну транзакцию CoinJoin, называемую деноминацией. Большее число раундов повышает общий уровень конфиденциальности и одновременно снижает вероятность обнаружения через сговор узлов. Наибольшее количество раундов, доступное в настоящее время, составляет 16.

source: NOTE: To prevent system abuse, an average of one in ten rounds incurs a fee of .0001 DASH.
fr: À NOTER : pour dissuader un abus du système, un cycle de mélange sur dix en moyenne comporte des frais de 0,0001 dash.
it: NOTA: per prevenire abusi del sistema, in media un round su dieci comporta una commissione di 0,0001 DASH.
ru: ПРИМЕЧАНИЕ: Для предотвращения злоупотреблений в системе в среднем за каждый десятый патрон взимается плата в размере .0001 DASH.

source: Enter a **Target balance**. This value provides a lower boundary on the final amount of funds to be processed. Depending on how the client splits your wallet balance, you may end up with denominated inputs whose sum total is slightly greater than the target amount.
fr: Saisissez un **Solde cible**. Cette valeur indique la limite inférieure du montant final de fonds qui doivent être traités. Selon la façon dont le client traite votre solde de portefeuille, vous pouvez finir avec des coupures d'entrées dont la somme totale est légèrement supérieure au solde cible.
it: Inserisci un **Saldo target**. Questo valore fornisce un limite inferiore all'importo finale dei fondi da elaborare. A seconda di come il cliente divide il saldo del tuo wallet, potresti ritrovarti con input denominati la cui somma totale è leggermente superiore all'importo target.
ru: Введите **Целевой баланс**. Это значение задает нижнюю границу конечной суммы обрабатываемых средств. В зависимости от того, как клиент разделит баланс вашего кошелька, вы можете получить деноминированные вводы, сумма которых будет немного больше целевой суммы.

source: Click **OK** to save settings.
fr: Cliquez sur **OK** pour enregistrer les réglages.
it: Fare clic su **OK** per salvare le impostazioni.
ru: Нажмите **OK** для сохранения настроек.

source: CoinJoin is disabled by default when you open the wallet. It will only start after you set the number of rounds and number of Dash to process under settings and click **Start CoinJoin** on the **Overview** tab of your wallet.
fr: La fonction CoinJoin est désactivée par défaut quand vous ouvrez votre portefeuille. Elle ne démarrera que lorsque vous aurez décidé, dans les Réglages, du nombre de cycles de mélange et du montant à mélanger, et que vous aurez cliqué sur **Commencer CoinJoin** dans l'onglet **Vue d'ensemble** de votre portefeuille.
it: CoinJoin è disabilitato per impostazione predefinita quando apri il wallet. Si avvierà solo dopo aver impostato il numero di round e il numero di Dash da elaborare nelle impostazioni e aver fatto clic su **Avvia CoinJoin** nella scheda **Panoramica** del tuo wallet.
ru: По умолчанию при открытии кошелька функция CoinJoin отключена. Он запустится только после того, как вы установите количество раундов и количество Dash для обработки в разделе настроек и нажмете кнопку **Start CoinJoin** на вкладке **Overview** вашего кошелька.

source: Several advanced options are also available on this screen for users that require more control:
it: In questa schermata sono disponibili anche diverse opzioni avanzate per gli utenti che richiedono un maggiore controllo:
ru: На этом экране также доступны несколько дополнительных опций для пользователей, которым требуется больше контроля:

source: **Inputs per denomination** values allow limiting how many inputs are created. This can be helpful if you end up with too many small denominations.
it: I valori **Input per denominazione** consentono di limitare il numero di input creati. Questo può essere utile se ti ritrovi con troppe piccole denominazioni.
ru: Значения **Входы на один номинал** позволяют ограничить количество создаваемых входов. Это может быть полезно, если в итоге получается слишком много мелких номиналов.

source: **Parallel sessions** sets how many separate masternodes should be used in parallel if multi-session mixing is enabled.
it: **Sessioni parallele** imposta quanti masternode separati devono essere utilizzati in parallelo se è abilitato il mixaggio multisessione.
ru: **Параллельные сессии** устанавливает, сколько отдельных мастернод должно использоваться параллельно, если включено смешивание с мультисессией.

source: Starting CoinJoin
fr: Démarrer CoinJoin
it: Avvia CoinJoin
ru: Начала CoinJoin

source: The CoinJoin process is initiated by clicking the **Start CoinJoin** button on the **Overview** tab of the Dash Core wallet. CoinJoin is possible once the following conditions have been met:
fr: La procédure CoinJoin est démarrée en cliquant sur le bouton **Démarrer CoinJoin** dans l'onglet **Vue d'ensemble** du portefeuille logiciel Dash Core. CoinJoin est possible dès que les conditions suivantes sont réunies :
it: Il processo CoinJoin viene avviato facendo clic sul pulsante **Avvia CoinJoin** nella scheda **Panoramica** del wallet Dash Core. CoinJoin è possibile una volta soddisfatte le seguenti condizioni:
ru: Процесс CoinJoin инициируется нажатием кнопки **Start CoinJoin** на вкладке **Overview** кошелька Dash Core. CoinJoin возможен при выполнении следующих условий:

source: The wallet contains sufficient non-denominated funds to create the minimum required denominated values.
fr: Le portefeuille contient suffisamment de fonds non mélangés pour créer les coupures minimales exigibles.
it: Il wallet contiene fondi non denominati sufficienti per creare i valori denominati minimi richiesti.
ru: Кошелек содержит достаточное количество неденоминированных средств для создания минимально необходимых деноминированных значений.

source: The user has not disabled CoinJoin in the Options dialog.
fr: L'utilisateur n'a pas désactivé la fonction CoinJoin dans le dialogue Options
it: L'utente non ha disabilitato CoinJoin nella finestra di dialogo Opzioni.
ru: Пользователь не отключил CoinJoin в диалоговом окне "Параметры".

source: The target value for processed funds in the Options dialog is greater than zero.
fr: La valeur cible des fonds traités dans le dialogue Option est supérieure à zéro.
it: Il valore target per i fondi elaborati nella finestra di dialogo Opzioni è maggiore di zero.
ru: Целевое значение для обработанных средств в диалоговом окне "Параметры" больше нуля.

source: If your wallet is encrypted (highly recommended), you will be asked to enter your wallet passphrase. Enable the **Only for mixing via CoinJoin** checkbox to unlock the wallet for CoinJoin only.
fr: Si votre portefeuille est chiffré (ce qui est chaudement recommandé), il vous sera demandé de saisir sa phrase de passe. Cochez la case **Seulement pour le mélange CoinJoin** si vous souhaitez déverrouiller le portefeuille uniquement pour CoinJoin.
it: Se il tuo wallet è crittografato (altamente raccomandato), ti verrà chiesto di inserire la passphrase del tuo wallet. Abilita la casella di controllo **Solo per il mixaggio tramite CoinJoin** per sbloccare il wallet solo per CoinJoin.
ru: Если ваш кошелек зашифрован (что настоятельно рекомендуется), вам будет предложено ввести кодовую фразу. Установите флажок **Только для смешивания через CoinJoin**, чтобы разблокировать кошелек только для CoinJoin.

source: Entering a password for CoinJoin processing only
fr: Saisie d'un mot de passe uniquement pour la procédure CoinJoin
it: Immissione di una password solo per l'elaborazione CoinJoin
ru: Ввод пароля только для обработки CoinJoin

source: This will unlock your wallet, and the CoinJoin process will begin. The wallet will remain unlocked until CoinJoin processing is complete, at which point it will be locked automatically.
fr: Cela déverrouillera votre portefeuille, et le processus CoinJoin démarrera. Le portefeuille restera déverrouillé jusqu'à ce que le processus CoinJoin soit terminé, puis il sera automatiquement verrouillé.
it: Questo sbloccherà il tuo wallet e inizierà il processo CoinJoin. Il wallet rimarrà sbloccato fino al completamento dell'elaborazione CoinJoin, a quel punto verrà bloccato automaticamente.
ru: В результате кошелек будет разблокирован, и начнется процесс CoinJoin. Кошелек будет оставаться разблокированным до завершения процесса CoinJoin, после чего он будет автоматически заблокирован.

source: CoinJoin interface after clicking the **Start CoinJoin** button. Note the **Status** is **Enabled**.
fr: Interface CoinJoin après avoir cliqué sur le bouton **Commencer CoinJoin**. À noter, l'**État** est **Activé**.
it: Interfaccia CoinJoin dopo aver fatto clic sul pulsante **Avvia CoinJoin**. Tieni presente che lo **Stato** è **Abilitato**.
ru: Интерфейс CoinJoin после нажатия кнопки **Start CoinJoin**. Обратите внимание на **Статус** - **Включено**.

source: CoinJoin will begin creating transactions and your CoinJoin balance will gradually increase. This process can take some time, so be patient. You can monitor the process in more detail as described in the following section.
fr: CoinJoin commencera à créer des transactions et votre solde CoinJoin augmentera progressivement. Ce processus peut prendre un certain temps, alors soyez patient. Vous pouvez suivre ce processus en détail, comme l'explique la section suivante.
it: CoinJoin inizierà a creare transazioni e il tuo saldo CoinJoin aumenterà gradualmente. Questo processo può richiedere del tempo, quindi sii paziente. È possibile monitorare il processo in modo più dettagliato come descritto nella sezione seguente.
ru: CoinJoin начнет создавать транзакции, и ваш баланс CoinJoin будет постепенно увеличиваться. Этот процесс может занять некоторое время, поэтому будьте терпеливы. Более подробно этот процесс можно отслеживать, как описано в следующем разделе.

source: Any of the following actions will interrupt the process. Because the transactions are atomic (they either take place completely, or do not take place at all), it is possible to safely interrupt CoinJoin at any time.
fr: N'importe laquelle des actions suivantes interrompra le processus. Comme les transactions sont atomiques (elles ont entièrement lieu, ou bien n'ont pas lieu du tout), il doit être possible d'interrompre CoinJoin à tout moment, en toute sécurité.
it: Una qualsiasi delle seguenti azioni interromperà il processo. Poiché le transazioni sono atomiche (avvengono completamente o non avvengono affatto), è possibile interrompere in sicurezza CoinJoin in qualsiasi momento.
ru: Любое из следующих действий приведет к прерыванию процесса. Поскольку транзакции являются атомарными (они либо выполняются полностью, либо не выполняются вообще), можно безопасно прервать CoinJoin в любой момент.

source: Clicking the **Stop CoinJoin** button on the Overview tab
fr: Cliquer sur le bouton **Arrêter CoinJoin**, dans l'onglet Vue d'ensemble
it: Facendo clic sul pulsante **Interrompi CoinJoin** nella scheda Panoramica
ru: Нажатие кнопки **Stop CoinJoin** на вкладке Overview (Обзор)

source: Closing the client before CoinJoin is completed
fr: Fermer le logiciel avant que CoinJoin soit terminé
it: Chiusura del client prima del completamento di CoinJoin
ru: Закрытие клиента до завершения CoinJoin

source: Sending CoinJoin funds from the wallet before CoinJoin rounds are completed
fr: Envoyer des fonds CoinJoin depuis le portefeuille avant que les cycles CoinJoin soient terminés
it: Invio di fondi CoinJoin dal wallet prima del completamento dei round CoinJoin
ru: Отправка средств CoinJoin с кошелька до завершения раундов CoinJoin

source: Disabling CoinJoin before the process is complete
fr: Désactiver CoinJoin avant que le processus soit terminé
it: Disabilitare CoinJoin prima che il processo sia completato
ru: Отключение CoinJoin до завершения процесса

source: Monitoring CoinJoin
fr: Suivi de CoinJoin
it: Monitoraggio CoinJoin
ru: Мониторинг CoinJoin

source: If you want to monitor CoinJoin in more detail, you need to enable some advanced features of the wallet. Go to **Settings**, select **Options** and go to the **Wallet** tab. Check the **Enable advanced interface** checkbox. This will allow you to monitor progress and see which individual operations CoinJoin is carrying out in the background.
fr: Si vous souhaitez suivre le processus CoinJoin en détail, vous devez activer certaines fonctions avancées du portefeuille. Allez dans **Réglages**, choisissez **Options** puis allez sur l'onglet **Portefeuille**. Cochez la case **Activer l'interface avancée**. Cela vous permettra de suivre la procédure et de voir quelles opérations individuelles CoinJoin sont menées en arrière-plan.
it: Se desideri monitorare CoinJoin in modo più dettagliato, devi abilitare alcune funzionalità avanzate del wallet. Vai su **Impostazioni**, seleziona **Opzioni** e vai alla scheda **Wallet**. Seleziona la casella di controllo **Abilita interfaccia avanzata**. Ciò ti consentirà di monitorare i progressi e vedere quali singole operazioni CoinJoin sta eseguendo in background.
ru: Для более детального мониторинга CoinJoin необходимо включить некоторые дополнительные возможности кошелька. Перейдите в раздел **Настройки**, выберите пункт **Опции** и перейдите на вкладку **Кошелек**. Установите флажок **Включить расширенный интерфейс**. Это позволит вам следить за ходом работы и видеть, какие отдельные операции CoinJoin выполняет в фоновом режиме.

source: Monitoring CoinJoin progress
fr: Suivi de la progression de CoinJoin
it: Monitoraggio dei progressi del CoinJoin
ru: Мониторинг хода выполнения смешивания CoinJoin

source: Since CoinJoin creates a lot of new address keys to send and receive the denominations, you may receive a warning when the number of remaining keys runs low. This is nothing to be worried about, since the wallet will simply create more keys as necessary. However, for non-HD wallets these keys will not exist in any previous backups of your wallet. For this reason, it is important to backup your wallet again after the process is complete if using a non-HD wallet. When using an HD wallet, all keys will be derived from the wallet mnemonic so extra backups during CoinJoin are not necessary. You can check the status bar for the "HD" icon to determine if you are using an HD wallet or not.
it: Poiché CoinJoin crea molte nuove chiavi di indirizzo per inviare e ricevere i tagli, potresti ricevere un avviso quando il numero di chiavi rimanenti sta per esaurirsi. Non c'è nulla di cui preoccuparsi, poiché il wallet creerà semplicemente più chiavi se necessario. Tuttavia, per i wallet non HD queste chiavi non esisteranno in nessun backup precedente del tuo wallet. Per questo motivo, è importante eseguire nuovamente il backup del wallet una volta completato il processo se si utilizza un wallet non HD. Quando si utilizza un wallet HD, tutte le chiavi verranno derivate dal mnemonico del wallet, quindi non sono necessari backup aggiuntivi durante CoinJoin. Puoi controllare la barra di stato per l'icona "HD" per determinare se stai utilizzando un wallet HD o meno.
ru: Поскольку CoinJoin создает большое количество новых адресных ключей для отправки и получения деноминаций, вы можете получить предупреждение, когда количество оставшихся ключей закончится. В этом нет ничего страшного, поскольку кошелек просто будет создавать новые ключи по мере необходимости. Однако для кошельков, не являющихся HD-кошельками, эти ключи не будут существовать в предыдущих резервных копиях вашего кошелька. По этой причине при использовании не HD-кошелька необходимо повторно создать резервную копию кошелька после завершения процесса. При использовании HD-кошелька все ключи будут получены из мнемоники кошелька, поэтому дополнительное резервное копирование в процессе CoinJoin не требуется. Чтобы определить, используете ли вы HD-кошелек или нет, можно посмотреть в строке состояния на значок "HD".

source: You can also monitor CoinJoin progress by viewing the transactions created by the process on the **Transactions** tab.
fr: Vous pouvez aussi suivre la progression de CoinJoin en consultant les transactions créées par le processus, dans l'onglet **Transactions**.
it: Puoi anche monitorare l'avanzamento di CoinJoin visualizzando le transazioni create dal processo nella scheda **Transazioni**.
ru: Вы также можете следить за ходом выполнения CoinJoin, просматривая созданные в процессе транзакции на вкладке **Транзакции**.

source: Transactions created by CoinJoin on the Transactions tab
fr: Transactions créées par CoinJoin, dans l'onglet Transactions
it: Transazioni create da CoinJoin nella scheda Transazioni
ru: Транзакции, созданные CoinJoin, на вкладке Транзакции

source: The following table describes the CoinJoin-related transactions displayed in the Type column of the **Transactions** tab:
fr: Le tableau suivant décrit les transactions relatives à CoinJoin, telles qu'affichées dans la colonne Type de l'onglet **Transactions** :
it: La tabella seguente descrive le transazioni relative a CoinJoin visualizzate nella colonna Tipo della scheda **Transazioni**:
ru: В следующей таблице описаны транзакции, связанные с CoinJoin, которые отображаются в колонке Тип на вкладке **Транзакции**:

source: Transaction Type
fr: Type de transaction
it: Tipo di transazione
ru: Типы транзакций

source: Transaction Description
fr: Description de la transaction
it: Descrizione delle Transazioni
ru: Описание транзакции

source: CoinJoin Make Collateral Inputs
fr: Entrées de caution créées par CoinJoin
it: CoinJoin Effettua input collaterali
ru: CoinJoin Внести залоговые средства
