Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/dashcore/coinjoin-instantsend.po
Languages: fr, it, ru

source: Wallet funds were moved to collateral inputs that will be used to make collateral payments. This is done to minimize traceability of collaterals.
fr: Les fonds du portefeuille ont été déplacés dans des entrées de caution qui seront utilisées pour créer des paiements de caution. Cela est opéré pour minimiser le traçabilité des cautions.
it: I fondi del wallet sono stati spostati in input collaterali che verranno utilizzati per effettuare pagamenti collaterali. Questo viene fatto per ridurre al minimo la tracciabilità delle garanzie.
ru: Средства из кошелька перемещены на входы обеспечения, которые будут использованы для совершения платежей по обеспечению. Это сделано для минимизации отслеживаемости залогов.

source: CoinJoin Create Denominations
fr: Coupures créées par CoinJoin
it: CoinJoin Crea Denominazioni
ru: CoinJoin Создание деноминаций

source: Wallet funds were broken into CoinJoin denominations (Step 1 :ref:`here <coinjoin>`)
fr: Des fonds du portefeuille ont été divisés en coupures CoinJoin (étape 1 :ref:`ici <coinjoin>`)
it: I fondi del portafoglio sono stati suddivisi in denominazioni CoinJoin (Passaggio 1:ref:`qui <coinjoin>`)
ru: Средства кошелька были разбиты на деноминации CoinJoin (Шаг 1 :ref: `здесь <coinjoin>`)

source: CoinJoin Mixing
fr: Mélange CoinJoin
ru: CoinJoin смешивание

source: A transaction was sent to a masternode in order to participate in a CoinJoin session (Step 3 :ref:`here <coinjoin>`)
fr: Une transaction a été envoyée à un masternode afin de participer à une session CoinJoin (étape 3 :ref:`ici <coinjoin>`)
it: Una transazione è stata inviata a un masternode per partecipare a una sessione CoinJoin (Step 3 :ref:`here <coinjoin>`)
ru: На мастерноду была отправлена транзакция для участия в сессии CoinJoin (Шаг 3 :ref:`тут <coinjoin>`)

source: CoinJoin Collateral Payment
fr: Paiement de caution CoinJoin
it: Pagamento collaterale CoinJoin
ru: Залоговый платеж CoinJoin

source: The CoinJoin session collateral was claimed. This fee is charged in ~10% of sessions to prevent spam attacks.
fr: La caution de session CoinJoin a été perçue. Ces frais sont imputés à environ 10% des sessions de mélange pour empêcher les attaques spam.
it: È stata rivendicata la garanzia della sessione CoinJoin. Questa tariffa viene addebitata in circa il 10% delle sessioni per prevenire attacchi di spam.
ru: Залог сессии CoinJoin был востребован. Эта плата взимается в ~10% сессий для предотвращения спам-атак.

source: CoinJoin Send
fr: Envoyer CoinJoin
it: CoinJoin Invia
ru: Отправка CoinJoin

source: Denominated funds were used to send a payment to someone. Note: Unlike the previous 4 transaction types, this is not a CoinJoin transaction.
fr: Des fonds mélangés ont été utilisés pour envoyer un paiement à quelqu'un. À noter : au contraire des 4 précédents types de transaction, il ne s'agit pas d'une transaction CoinJoin.
it: I fondi denominati venivano utilizzati per inviare un pagamento a qualcuno. Nota: a differenza dei 4 tipi di transazione precedenti, questa non è una transazione CoinJoin.
ru: Средства в деноминации были использованы для отправки кому-либо платежа. Примечание: В отличие от предыдущих 4 типов транзакций, эта транзакция не является транзакцией CoinJoin.

source: You can also use the coin control feature to view which addresses hold denominations ready to be used for CoinJoin transactions. Go to the **Send** tab of your wallet and click **Inputs** to view the possible input addresses for your transactions. You can see how each address holds given denominations of Dash, and how many rounds have been completed. This is to ensure that an efficient combination of addresses can be used as inputs in CoinJoin transactions without too much change, since an amount in a CoinJoin transaction must be rounded up to completely spend all inputs. The current minimum balance for an input used in a CoinJoin transaction is 0.00100010 DASH.
fr: Vous pouvez aussi utiliser la fonction de contrôle des pièces pour voir quelles adresses contiennent des coupures prêtes à être utilisées dans des transactions CoinJoin. Allez sur l'onglet **Envoyer** de votre portefeuille et cliquez sur le bouton **Entrées** pour voir les adresses d'entrée possibles pour vos transactions. Vous pouvez savoir combien chaque adresse contient de coupures mélangées Dash, et combien de cycles y ont été appliqués. Ceci permet d'assurer qu'une combinaison efficace d'adresses peut être utilisée comme entrées dans les transactions CoinJoin sans générer trop de monnaie rendue, puisque le montant d'une transaction CoinJoin doit être arrondi à la coupure supérieure pour dépenser l'intégralité des entrées. Le solde minimum actuel pour une entrée utilisée dans une transaction CoinJoin est de 0,00100010 dash.
it: Puoi anche utilizzare la funzione di controllo delle monete per visualizzare quali indirizzi contengono denominazioni pronte per essere utilizzate per le transazioni CoinJoin. Vai alla scheda **Invia** del tuo wallet e fai clic su **Ingressi** per visualizzare i possibili indirizzi di input per le tue transazioni. Puoi vedere come ciascun indirizzo contiene determinate denominazioni di Dash e quanti round sono stati completati. Questo per garantire che una combinazione efficiente di indirizzi possa essere utilizzata come input nelle transazioni CoinJoin senza troppe modifiche, poiché un importo in una transazione CoinJoin deve essere arrotondato per spendere completamente tutti gli input. Il saldo minimo attuale per un input utilizzato in una transazione CoinJoin è 0,00100010 DASH.
ru: Вы также можете воспользоваться функцией контроля монет, чтобы узнать, на каких адресах хранятся деноминации, готовые к использованию в транзакциях CoinJoin. Перейдите на вкладку **Отправить** вашего кошелька и нажмите **Вводы**, чтобы просмотреть возможные адреса ввода для ваших транзакций. Вы можете увидеть, что на каждом адресе хранятся заданные деноминации Dash и сколько раундов было завершено. Это сделано для того, чтобы обеспечить эффективную комбинацию адресов, которые можно использовать в качестве входов в транзакции CoinJoin без особых изменений, поскольку для полного расходования всех входов сумма в транзакции CoinJoin должна быть округлена в большую сторону. В настоящее время минимальный баланс для входа в транзакцию CoinJoin составляет 0,00100010 Dash.

source: Coin Selection dialog showing addresses holding CoinJoin balances in different denominations
fr: Dialogue Contrôle des pièces affichant les adresses contenant des fonds CoinJoin sous différentes coupures
it: Finestra di dialogo Selezione monete che mostra gli indirizzi che detengono saldi CoinJoin in diversi tagli
ru: Диалог выбора монет показывает адреса, на которых хранятся балансы CoinJoin в различных деноминациях

source: Paying with CoinJoin
fr: Payer avec CoinJoin
it: Pagare con CoinJoin
ru: Переводы с CoinJoin

source: You can only use CoinJoin for payments once you have processed enough Dash to make up the amount you are trying to send. Because the process takes time, it must be done in advance before you create the send transaction. A CoinJoin transaction is effectively the same as any other transaction on the blockchain, but it draws only from input addresses where the denomination has previously been processed to ensure privacy of funds. Because several input addresses are usually required to make up the amount you are trying to send, a CoinJoin transaction will usually take up more space (in kilobytes) on the blockchain, and therefore will be charged a slightly higher fee.
fr: Vous pouvez utiliser CoinJoin pour les paiements uniquement lorsque vous disposez d'assez de dashs mélangés pour constituer le montant que vous souhaitez envoyer. Comme le processus de mélange prend du temps, il doit être exécuté à l'avance, avant de créer la transaction d'envoi. Une transaction CoinJoin est en pratique identique à toute autre transaction sur la blockchain, mais elle n'utilise que des adresses d'entrée dont les coupures ont été précédemment mélangées, afin de garantir la confidentialité des fonds. Puisque plusieurs adresses d'entrée sont en général indispensables pour constituer le montant que vous souhaitez envoyer, une transaction CoinJoin consommera en général plus d'espace (en kilo-octets) sur la blockchain, et fera donc l'objet de frais de transaction légèrement plus élevés.
it: Puoi utilizzare CoinJoin per i pagamenti solo dopo aver elaborato abbastanza Dash per recuperare l'importo che stai tentando di inviare. Poiché il processo richiede tempo, è necessario eseguirlo in anticipo prima di creare la transazione di invio. Una transazione CoinJoin è effettivamente uguale a qualsiasi altra transazione sulla blockchain, ma attinge solo da indirizzi di input in cui la denominazione è stata precedentemente elaborata per garantire la privacy dei fondi. Poiché di solito sono necessari diversi indirizzi di input per comporre l'importo che stai tentando di inviare, una transazione CoinJoin di solito occuperà più spazio (in kilobyte) sulla blockchain e pertanto verrà addebitata una commissione leggermente più alta.
ru: Вы можете использовать CoinJoin для платежей только после того, как обработаете достаточное количество Dash, чтобы составить сумму, которую вы пытаетесь отправить. Поскольку этот процесс требует времени, его необходимо выполнить заранее, до создания транзакции отправки. Транзакция CoinJoin фактически ничем не отличается от любой другой транзакции на блокчейне, однако для обеспечения конфиденциальности средств она проводится только с тех входных адресов, на которых ранее была обработана деноминация. Поскольку для отправки суммы обычно требуется несколько адресов ввода, транзакция CoinJoin обычно занимает больше места (в килобайтах) на блокчейне, и поэтому за нее взимается несколько большая плата.

source: To send a payment using CoinJoin, go to the **CoinJoin** tab of the Dash Core wallet. The balance displayed is your CoinJoin balance instead of the total balance as shown on the **Send** tab. You can then enter the **Pay To** address, **Label**, **Amount** and click **Send mixed funds**. Your payment will be rounded up to completely spend the lowest possible denomination of denominated balance available (currently to the nearest 0.001 DASH). You will be prompted to enter your password and receive a detailed breakdown of the fee structure for CoinJoin before sending.
fr: Pour envoyer un paiement avec CoinJoin, allez sur l'onglet **CoinJoin** du portefeuille logiciel Dash Core. Le solde affiché est votre solde CoinJoin au lieu de votre solde total visible sur l'onglet **Envoyer**. Vous pouvez ensuite saisir l'adresse dans le champ **Payer à**, l'**Étiquette**, le **Montant**, et cliquer sur le bouton **Envoyer des fonds mélangés**. Votre paiement sera légèrement arrondi pour dépenser complètement la plus petite coupure possible de fonds mélangés disponibles (actuellement, à hauteur de 0,001 dash). Il vous sera demandé de saisir votre mot de passe et il vous sera affiché un détail complet des frais CoinJoin, avant l'envoi.
it: Per inviare un pagamento utilizzando CoinJoin, vai alla scheda **CoinJoin** del wallet Dash Core. Il saldo visualizzato è il tuo saldo CoinJoin anziché il saldo totale come mostrato nella scheda **Invia**. Puoi quindi inserire l'indirizzo **Paga a**, **Etichetta**, **Importo** e fare clic su **Invia fondi misti**. Il tuo pagamento verrà arrotondato per eccesso fino a spendere completamente la denominazione più bassa possibile del saldo denominato disponibile (attualmente allo 0,001 DASH più vicino). Ti verrà richiesto di inserire la tua password e ricevere una ripartizione dettagliata della struttura delle commissioni per CoinJoin prima dell'invio.
ru: Чтобы отправить платеж с помощью CoinJoin, перейдите на вкладку **CoinJoin** кошелька Dash Core. На вкладке **Отправить** отображается не общий баланс, а баланс CoinJoin. Затем вы можете ввести адрес **Pay To**, **Label**, **Amount** и нажать **Send mixed funds**. Сумма платежа будет округлена в большую сторону, чтобы полностью израсходовать наименьший возможный деноминированный остаток (в настоящее время с точностью до 0,001 DASH). Перед отправкой вам будет предложено ввести пароль и получить подробную информацию о структуре комиссии CoinJoin.

source: Dash Core ready to send a CoinJoin transaction. Note use of the CoinJoin tab and the amount to be sent is less than the available CoinJoin balance
fr: Logiciel Dash Core prêt à envoyer une transaction CoinJoin. À noter que l'onglet CoinJoin est utilisé et que le montant à envoyer est inférieur au solde CoinJoin disponible
it: Dash Core pronto per inviare una transazione CoinJoin. Tieni presente che l'utilizzo della scheda CoinJoin e l'importo da inviare sono inferiori al saldo CoinJoin disponibile
ru: Dash Core готов к отправке транзакции CoinJoin. Обратите внимание на использование вкладки CoinJoin и на то, что отправляемая сумма меньше доступного баланса CoinJoin

source: Inputs
fr: Entrées
it: Input
ru: Входы

source: Like all Dash transactions, CoinJoin transactions are composed of a number of inputs and one or more outputs. CoinJoin transactions do not use change addresses, so any remaining Dash will be spent on the transaction fee.
fr: Comme toutes les transactions Dash, les transactions CoinJoin sont composées d'un certain nombre d'entrées et d'une ou plusieurs sorties. Les transactions CoinJoin n'utilisent pas d'adresses de monnaie rendue, donc les éventuels dashs restants seront dépensés dans les frais de transaction.
it: Come tutte le transazioni Dash, le transazioni CoinJoin sono composte da un numero di input e uno o più output. Le transazioni CoinJoin non utilizzano indirizzi di modifica, quindi l'eventuale Dash rimanente verrà speso per la commissione di transazione.
ru: Как и все транзакции с Dash, транзакции CoinJoin состоят из нескольких входов и одного или нескольких выходов. В транзакциях CoinJoin не используются сменные адреса, поэтому весь оставшийся Dash будет потрачен на комиссию за транзакцию.

source: Due to the probabilistic nature of the CoinJoin process, increasing the number of inputs in a transaction may marginally reduce privacy. For this reason, using CoinJoin is not recommended for users requiring a high level of privacy. While it is not possible to link a CoinJoin transaction to a single source address with absolute certainty, using more inputs may make a transaction more vulnerable to different potential linking attacks. There are a number of `chain analysis companies <https://www.dash.org/regulatory#kyc>`__ that possess tools that can provide transaction risk scoring services for transactions on the Dash blockchain, including CoinJoin transactions.
fr: En raison de la nature probabiliste de la procédure CoinJoin, augmenter le nombre d'entrées dans une transaction peut réduire partiellement la confidentialité. Pour cette raison, utiliser CoinJoin n'est pas recommandé aux utilisateurs souhaitant un degré élevé de confidentialité. Même s'il est impossible de relier une transaction CoinJoin à une seule adresse source avec une certitude absolue, utiliser plus d'entrées peut rendre une transaction plus vulnérable à diverses tentatives potentielles d'identification des liens. Il existe un certain nombre d'`entreprises d'analyse de chaînes <https://www.dash.org/regulatory#kyc>`__ qui disposent d'outils qui peuvent fournir des scores de risques de transactions sur la réseau Dash, y compris les transactions CoinJoin.
it: A causa della natura probabilistica del processo CoinJoin, aumentare il numero di input in una transazione può ridurre marginalmente la privacy. Per questo motivo, l’utilizzo di CoinJoin non è consigliato agli utenti che richiedono un elevato livello di privacy. Sebbene non sia possibile collegare una transazione CoinJoin a un unico indirizzo di origine con assoluta certezza, l'utilizzo di più input può rendere una transazione più vulnerabile a diversi potenziali attacchi di collegamento. Esistono numerose `società di analisi della catena <https://www.dash.org/regulatory#kyc>`__ che possiedono strumenti in grado di fornire servizi di valutazione del rischio di transazione per le transazioni sulla blockchain di Dash, comprese le transazioni CoinJoin.
ru: Из-за вероятностного характера процесса CoinJoin увеличение количества входов в транзакцию может незначительно снизить уровень конфиденциальности. По этой причине использование CoinJoin не рекомендуется пользователям, требующим высокого уровня конфиденциальности. Хотя невозможно с абсолютной уверенностью привязать транзакцию CoinJoin к одному адресу источника, использование большего количества входов может сделать транзакцию более уязвимой для различных потенциальных атак на привязку. Существует ряд компаний, занимающихся анализом цепочек <https://www.dash.org/regulatory#kyc>`__, которые обладают инструментами, позволяющими оценивать риски транзакций на блокчейне Dash, включая транзакции CoinJoin.

source: You can reduce the number of inputs in a CoinJoin transaction by defining the transaction amount in such a way that it consumes your available input denominations more efficiently, or by processing more Dash to ensure enough appropriately denominated inputs are available. Use the :ref:`Coin Control <coin-control>` function in the CoinJoin tab to view and select or deselect CoinJoin UTXOs currently available for use as transaction inputs.
fr: Vous pouvez réduire le nombre d'entrées d'une transaction CoinJoin en définissant le montant de la transaction de telle manière qu'elle utilise vos coupures disponibles plus efficacement, ou en opérant sur plus de dashs pour assurer que des entrées-coupures appropriées sont disponibles en nombre suffisant. Utilisez la fonction :ref:`Contrôle des pièces <coin-control>` dans l'onglet CoinJoin pour voir, sélectionner ou désélectionner les sorties (UTXO) CoinJoin actuellement disponibles à l'utilisation comme entrées de transaction.
it: Puoi ridurre il numero di input in una transazione CoinJoin definendo l'importo della transazione in modo tale da consumare i tagli di input disponibili in modo più efficiente o elaborando più Dash per garantire che siano disponibili input sufficienti denominati in modo appropriato. Utilizza la funzione :ref:`Coin Control ` nella scheda CoinJoin per visualizzare e selezionare o deselezionare gli UTXO CoinJoin attualmente disponibili per l'uso come input di transazione.
ru: Вы можете уменьшить количество входов в транзакцию CoinJoin, определив сумму транзакции таким образом, чтобы она более эффективно расходовала имеющиеся у вас деноминации, или обработав большее количество Dash, чтобы обеспечить достаточное количество входов с соответствующими деноминациями. Используйте функцию :ref:`Coin Control 1` на вкладке CoinJoin для просмотра, выбора или отмены выбора UTXO CoinJoin, доступных в данный момент для использования в качестве входов транзакции.

source: Introduction
it: Introduzione
ru: Введение

source: This documentation describes how to use InstantSend to instantly send funds to any other Dash user around the world. Since the release of InstantSend based on Long Living Masternode Quorums (`LLMQ-IS <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__) in Dash 0.14, the Dash network itself will attempt to generate an InstantSend lock for almost every transaction processed by the network, according to :ref:`these rules <is-broadcast>`. Unlike the prior implementation of InstantSend, which required a higher fee, LLMQ-IS locks transactions without any action taken by the user. For this reason, only the recipient needs to monitor the network for the transaction lock in order to be able to receive funds and process transactions with immediate settlement.
fr: Cette documentation explique comment utiliser InstantSend pour envoyer instantanément des fonds à tout autre utilisateur Dash dans le monde. Depuis la sortie d'InstantSend basé que les quorums de masternode à longue durée de vie (`LLMQ-IS <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__) dans Dash 0.14, le réseau Dash lui-même essaiera de générer un verrou InstantSend pour quasiment chaque transaction traitée par le réseau, en suivant :ref:`ces règles <is-broadcast>`. Contrairement à la précédente version d'InstantSend, qui demandait des frais plus élevés, les transactions InstantSend basées sur LLMQ ne réclament aucune action particulière de la part de l'utilisateur. Pour cette raison, seul le destinataire doit surveiller la réseau pour y détecter le verrou de transaction, afin d'être capable de recevoir les fonds et de traiter les transactions immédiatement.
it: Questa documentazione descrive come utilizzare InstantSend per inviare istantaneamente fondi a qualsiasi altro utente Dash in tutto il mondo. Dal rilascio di InstantSend basato sui quorum Masternode di lunga durata (`LLMQ-IS <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__) in Dash 0.14, la rete Dash stessa tenterà di generare un blocco InstantSend per quasi ogni transazione elaborata dalla rete, secondo :ref:`queste regole <is-broadcast>`. A differenza della precedente implementazione di InstantSend, che richiedeva una tariffa più elevata, LLMQ-IS blocca le transazioni senza alcuna azione da parte dell'utente. Per questo motivo solo il destinatario deve monitorare la rete per il blocco delle transazioni per poter ricevere fondi ed elaborare transazioni con regolamento immediato.
ru: В этой документации описано, как использовать InstantSend для мгновенной отправки средств любому другому пользователю Dash по всему миру. С момента выпуска InstantSend на основе Long Living Masternode Quorums (`LLMQ-IS <https://github.com/dashpay/dips/blob/master/dip-0010.md>`__) в Dash 0.14 сеть Dash сама будет пытаться генерировать блокировку InstantSend почти для каждой транзакции, обрабатываемой сетью, в соответствии с :ref:`этими правилами 1`. В отличие от предыдущей реализации InstantSend, которая требовала более высокой платы, LLMQ-IS блокирует транзакции без каких-либо действий со стороны пользователя. По этой причине только получателю необходимо следить за блокировкой транзакций в сети, чтобы иметь возможность получать средства и обрабатывать транзакции с немедленным расчетом.

source: Dash InstantSend is supported by many wallets and vendors, including (but not limited to) the following:
fr: Dash InstantSend est possible avec beaucoup de portefeuilles et d'éditeurs de logiciels, parmi lesquels les suivants (liste non exhaustive) :
it: Dash InstantSend è supportato da molti wallet e fornitori, inclusi (ma non limitati a) quanto segue:
ru: Dash InstantSend поддерживается многими кошельками и продавцами, включая (но не ограничиваясь) следующие:

source: Dash Core Wallet
fr: Portefeuille logiciel Dash Core
ru: Кошелёк Dash Core

source: Dash Android Wallet
fr: Portefeuille Android Dash
it: Portafoglio Dash Android
ru: Кошелёк Dash для Android

source: Dash iOS Wallet
fr: Portefeuille IOS Dash
it: Portafoglio Dash iOS
ru: Кошелёк Dash для iOS

source: and many more...
fr: et beaucoup d'autres
it: e molti altri...
ru: и многие другие...

source: You can read more about InstantSend theory and processes :ref:`here <instantsend>`.
fr: Pour en savoir plus sur le concept et le processus InstantSend, voir :ref:`ici <instantsend>`.
it: Puoi leggere ulteriori informazioni sulla teoria e sui processi di InstantSend :ref:`qui <instantsend>`.
ru: Подробнее теоретическую часть и о процессах функции InstantSend вы можете почитать :ref:`здесь <instantsend>`.

source: InstantSend Transactions
fr: Transactions InstantSend
it: Transazioni InstantSend
ru: Транзакции InstantSend
