Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/wallets/dashcore/send-receive.po
Languages: it

source: Guide to sending and receiving Dash using the Dash Core wallet
it: Guida per inviare e ricevere Dash utilizzando il portafoglio Dash Core

source: dash, core, wallet, send, receive, transaction
it: dash, core, wallet, invia, ricevi, transazione

source: Sending and receiving
it: Invia e ricevi

source: Your Dash Core Wallet is associated with a number of unique addresses that can be used to send and receive Dash. Each address holds its own balance, and the sum of all your balances is what appears on the **Overview** tab. When you send Dash, your wallet will automatically transfer funds from as many of your addresses as necessary to the destination address, which is controlled by another Dash user and associated with their wallet. You can control which addresses you use using the Coin Control feature.
it: Il tuo wallet Dash Core è associato a una serie di indirizzi univoci che possono essere utilizzati per inviare e ricevere Dash. Ogni indirizzo contiene il proprio saldo e la somma di tutti i tuoi saldi è ciò che appare nella scheda **Panoramica**. Quando invii Dash, il tuo wallet trasferirà automaticamente i fondi da tutti i tuoi indirizzi necessari all'indirizzo di destinazione, che è controllato da un altro utente Dash e associato al suo wallet. Puoi controllare quali indirizzi utilizzi utilizzando la funzione Coin Control.

source: When you confirm a transaction, Dash Core will enter the transaction in a block, which will then be added to the blockchain for other clients to confirm. A transaction is generally considered confirmed once six blocks have been added after the block containing your transaction, although masternode and mining payments are only released after 101 blocks. Note that a different process is used for InstantSend and CoinJoin transactions.
it: Quando confermi una transazione, Dash Core inserirà la transazione in un blocco, che verrà quindi aggiunto alla blockchain affinché altri clienti possano confermarlo. Una transazione è generalmente considerata confermata dopo che sono stati aggiunti sei blocchi dopo il blocco contenente la transazione, sebbene i pagamenti masternode e mining vengano rilasciati solo dopo 101 blocchi. Tieni presente che per le transazioni InstantSend e CoinJoin viene utilizzato un processo diverso.

source: Dash addresses are 34 characters long and begin with an uppercase X.
it: Gli indirizzi dash sono lunghi 34 caratteri e iniziano con una X maiuscola.

source: Sending Dash
it: Invio di Dash

source: You can use Dash Core to send Dash from your balance to another user. The receiving user will provide you with a Dash address to which you should send the funds. Click the **Send** tab in the tab bar and enter the destination address in the **Pay To** field.
it: Puoi utilizzare Dash Core per inviare Dash dal tuo saldo a un altro utente. L'utente ricevente ti fornirà un indirizzo Dash a cui inviare i fondi. Fai clic sulla scheda **Invia** nella barra delle schede e inserisci l'indirizzo di destinazione nel campo **Paga a**.

source: The Dash Core Send tab
it: La scheda Invio di Dash Core

source: You can also use the three icons |sendicons| to the right of the **Pay To** field to select a previously used address, paste an address from the clipboard, or clear the current address. If this is a new address, you can enter a name for the address in the **Label** field to help identify it again later. Finally, enter the amount of Dash you want to transfer in the **Amount** field.
it: Puoi anche utilizzare le tre icone |sendicons| a destra del campo **Paga a** per selezionare un indirizzo utilizzato in precedenza, incollare un indirizzo dagli appunti o cancellare l'indirizzo corrente. Se si tratta di un nuovo indirizzo, puoi inserire un nome per l'indirizzo nel campo **Etichetta** per identificarlo nuovamente in seguito. Infine, inserisci l'importo di Dash che desideri trasferire nel campo **Importo**.

source: The other options relate to fees. You can choose if you want to pay the network fee in addition to the amount sent, or subtract it from the amount sent. You can also increase your fee to encourage nodes on the network to prioritize your transaction.
it: Le altre opzioni riguardano le commissioni. Puoi scegliere se vuoi pagare la tariffa di rete in aggiunta all'importo inviato, oppure sottrarla dall'importo inviato. Puoi anche aumentare la tua commissione per incoraggiare i nodi della rete a dare priorità alla tua transazione.

source: Let’s try an example. Say you have received an invoice which you now want to pay with Dash. The writer of the invoice has included a Dash address, which can be seen in the following window beginning with *yWa*. The invoice is for 2.5 Dash, which you fill in the **Amount** field.
it: Proviamo un esempio. Supponiamo che tu abbia ricevuto una fattura che ora desideri pagare con Dash. L'autore della fattura ha incluso un indirizzo Dash, che può essere visto nella finestra seguente che inizia con *yWa*. La fattura è per 2,5 Dash, che dovrai compilare nel campo **Importo**.

source: The Send tab filled out for a transaction
it: La scheda Invia è stata compilata per una transazione

source: Once you have entered the destination address and the amount, click the **Send** button. If you have encrypted your wallet, you will now be required to enter your password to unlock the wallet.
it: Una volta inserito l'indirizzo di destinazione e l'importo, clicca sul pulsante **Invia**. Se hai crittografato il tuo wallet, ora ti verrà richiesto di inserire la password per sbloccare il wallet.

source: Entering the password to unlock the wallet
it: Immissione della password per sbloccare il wallet

source: Finally, you are given one final confirmation and chance to cancel your send transaction before Dash Core processes the transaction on the blockchain.
it: Infine, ti viene data un'ultima conferma e la possibilità di annullare la transazione di invio prima che Dash Core elabori la transazione sulla blockchain.

source: Final confirmation window
it: Finestra di conferma finale

source: If you respond with **Yes**, your transaction will be processed. Your operating system may display a notification, and the transaction will appear on the Transactions tab, where you can monitor its progress.
it: Se rispondi con **Sì**, la transazione verrà elaborata. Il tuo sistema operativo potrebbe visualizzare una notifica e la transazione apparirà nella scheda Transazioni, dove potrai monitorarne l'avanzamento.

source: The Windows 10 sent transaction confirmation notification
it: Windows 10 ha inviato una notifica di conferma della transazione

source: Note that the amount of the transaction increased by .00003926 Dash. This is the transaction fee. In the next section, we will see what this procedure looks like from the receiving side.
it: Da notare che l'importo della transazione è aumentato di .00003926 Dash. Questa è la commissione di transazione. Nella prossima sezione vedremo come si presenta questa procedura dal lato ricevente.

source: Stuck transactions can be resent one-by-one using the "Resend transactions" option in the menu.
it: Le transazioni bloccate possono essere rinviate una per una utilizzando l'opzione "Rinvia transazioni" nel menu.

source: Resending transactions
it: Nuovo invio delle transazioni

source: Receiving Dash
it: Ricevere Dash

source: To receive Dash, you must first create a receiving address to give to the sending party. To do this, click the **Receive** tab in the tab bar.
it: Per ricevere Dash, devi prima creare un indirizzo di ricezione da fornire alla parte mittente. Per fare ciò, fai clic sulla scheda **Ricevi** nella barra delle schede.

source: The Receive tab
it: La scheda Ricevi

source: Create a new address by clicking the **Request new receiving address** button.
it: Crea un nuovo indirizzo facendo clic sul pulsante **Richiedi nuovo indirizzo di ricezione**.

source: The Request payment window
it: La finestra Richiedi pagamento

source: Click **Copy Address** on the Request payment window that opens and give this address to the person who will send you Dash. Your wallet does not need to be open to receive funds, but if it is, you can watch the transaction arrive in real time. This is because your wallet constantly watches for new blocks on the blockchain when it is open, and will recognize a new transaction involving your receiving address when it occurs.
it: Fai clic su **Copia indirizzo** nella finestra Richiedi pagamento che si apre e fornisci questo indirizzo alla persona che ti invierà Dash. Non è necessario che il tuo wallet sia aperto per ricevere fondi, ma se lo è, puoi vedere la transazione arrivare in tempo reale. Questo perché il tuo wallet controlla costantemente la presenza di nuovi blocchi sulla blockchain quando è aperta e riconoscerà una nuova transazione che coinvolge il tuo indirizzo di ricezione quando si verifica.

source: The Windows 10 received transaction confirmation notification
it: Windows 10 ha ricevuto una notifica di conferma della transazione

source: Once you have been paid, you can see the balance both on the **Overview** tab and on the **Transactions** tab.
it: Una volta ricevuto il pagamento, potrai visualizzare il saldo sia nella scheda **Panoramica** che nella scheda **Transazioni**.

source: The received transaction
it: La transazione ricevuta

source: Viewing Addresses
it: Visualizzazione degli indirizzi

source: To view all previously created receiving addresses, click **Window > Receiving addresses**. In the same way, sending addresses can be seen by clicking **Window > Sending addresses**.
it: Per visualizzare tutti gli indirizzi di ricezione creati in precedenza, fare clic su **Finestra > Indirizzi di ricezione**. Allo stesso modo, gli indirizzi di invio possono essere visualizzati facendo clic su **Finestra > Indirizzi di invio**.

source: The Receiving addresses window
it: La finestra Indirizzi di ricezione

source: You can edit an existing address by right clicking and selecting **Edit** address from the context menu.
it: Puoi modificare un indirizzo esistente facendo clic con il pulsante destro del mouse e selezionando **Modifica** indirizzo dal menu contestuale.
