Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/ios/advanced-functions.po
Languages: ar, de, es, fr, ru, zh_cn

source: URL scheme, master public key and requesting payment in Dash on your iOS device
ar: نظام عنوان URL والمفتاح العام الرئيسي وطلب الدفع في داش على جهاز الأيفون الخاص بك
de: URL-Schema, Master Public Key und Dash-Zahlungen über dein iOS-Gerät anfragen
es: Esquema URL, llave publica maestra y solicitar pago en Dash en su dispositivo iOS
fr: Schéma d'URL, clé publique maître et requête de paiement dans le portefeuille Dash sur votre appareil iOS
ru: Схема URL, главный публичный ключ и запрос платежа в Dash на вашем iOS устройстве
zh_cn: 个人iOS设备上的达世币URL方案、主公钥和支付请求

source: dash, mobile, wallet, ios, send, receive, payment, url, public key
ar: داش ، الهاتف ، محفظة ، الأيفون ، إرسال ، استلام ، دفع ، رابط ، مفتاح عام
de: dash, mobile, wallet, ios, senden, empfangen, zahlung, url, public key
es: dash, móvil, billetera, ios, enviar, recibir, pago, url, llave publica
fr: dash, mobile, portefeuille, ios, envoyer, recevoir, paiement, url, clé publique
ru: dash, кошелёк, ios, отправить, платёж, url, публичный ключ
zh_cn: 达世币，移动，钱包，ios，发送，接收，支付，url，公钥

source: Advanced functions
ar: الوظائف المتقدمة
de: Erweiterte Funktionen
es: Funciones Avanzadas
fr: Fonctions avancées
ru: Продвинутые функции
zh_cn: 高级功能

source: URL Scheme
ar: مخطط عنوان الرابط
de: URL-Schema
es: Esquema URL
fr: Schéma d'URL
ru: URL-схема
zh_cn: URL方案

source: iOS allows apps to communicate with one another through URL schemes. The Dash Wallet for iOS implements the dashwallet:// scheme, allowing you to call the wallet to complete a transaction denominated in Dash. This page documents the methods available using the URL scheme.
ar: يسمح نظام الأيفون للتطبيقات بالتواصل مع بعضها البعض من خلال مخططات عناوين الرابط. تقوم محفظة داش في الأيفون بتنفيذ dashwallet: // scheme ، مما يسمح لك بالاتصال بالمحفظة لإكمال معاملة محددة في داش. توثق هذه الصفحة الطرق المتاحة باستخدام نظام عنوان الرابط
de: Apps haben über iOS die Möglichkeit miteinander durch URL-Schemata zu kommunizieren. Die Dash Wallet für iOS verwendet das Schema dashwallet://, durch welches die Wallet angefragt werden kann, um Transaktionen in Dash durchzuführen. Diese Seite dokumentiert die Methoden, die über das URL-Schema verwendet werden können.
es: iOS permite que las aplicaciones se comuniquen entre sí a través de esquemas URL. La billetera de Dash para iOS implementa el esquema dashwallet://, lo que te permite llamar a la billetera para completar una transacción denominada en Dash. Esta página documenta los métodos disponibles utilizando el esquema URL.
fr: iOS permet aux applications de communiquer entre elles en utilisant des schémas d'URL. Le portefeuille logiciel Dash pour iOS implémente le schéma dashwallet://, ce qui permet d'appeler le portefeuille pour accomplir une transaction libellée en dashs. Cette page explique les méthodes disponibles avec ce schéma d'URL.
ru: iOS позволяет приложениям обмениваться друг с другом информацией через URL-схемы. В кошелёк Dash для iOS внедрена схема dashwallet:// , позволяющая вам запросить кошелёк о завершении транзакции, деноминированной в Dash. На данной странице представлены доступные для этого способы через URL-схему.
zh_cn: iOS允许应用程序通过URL方案建立关联并互相沟通。适用于iOS系统的达世币钱包践行的是 dashwallet:// scheme，它允许用户通过钱包完成以达世币计价的交易。本页面介绍了使用URL方案的方法。

source: Payment
ar: دفع
de: Zahlung
es: Pago
fr: Paiement
ru: Платёж
zh_cn: 支付

source: Payment request URL format::
ar: تنسيق عنوان رابط لطلب الدفع ::
de: Zahlungsanfrage im URL-Format::
es: Formato URL de solicitud de pago::
fr: Format d'URL de requête de paiement ::
ru: Формат запроса платежа в URL:
zh_cn: 支付请求URL格式::

source: Notes:
ar: ملاحظات
de: Hinweis:
es: Notas:
ru: Примечания:
zh_cn: 备注：

source: ``sender`` is both your callback URL and the name of the app that you show to the user. This is to prevent 3rd party apps from phishing.
ar: ``sender`` هو عنوان رابط لاستدعائك واسم التطبيق الذي تعرضه للمستخدم. هذا لمنع 3 تطبيقات الجهات الخارجية من التصيد الاحتيالي.
de: ``sender`` ist gleichzeitig die Callback-URL und der Name der App, die du dem Nutzer zeigst. Dies dient dazu, Phishing von Drittanbieter-Apps zu verhindern.
es: ``Remitente`` es tu URL de devolución de llamada y el nombre de la aplicación que muestras al usuario. Esto es para evitar que las aplicaciones de 3ros sean objeto de suplantación de identidad.
fr: ``sender`` est à la fois votre URL de retour et le nom de l'application affiché à l'utilisateur. Cela sert à empêcher le hameçonnage depuis des applications tierces.
ru: ``sender`` является одновременно вашим ответным URL и названием приложения, которые вы показываете пользователю. Это сделано для предотвращения фишинга со стороны 3-их лиц.
zh_cn: ``发送方`` 既是用户的回调地址，也是向其它用户展示的应用程序名称。这有助于防止第3方应用程序遭到网络钓鱼攻击。

source: ``req-`` can be added before IS to force use of InstantSend for the transaction. If the user doesn’t have InstantSend enabled and doesn’t want to enable it, he will not be offered the option to send as a normal transaction.
ar: يمكن إضافة ``req-`` قبل لفرض استخدام الإرسال الفوري للمعاملة. إذا لم يقم المستخدم بتمكين الإرسال الفوري ولا يريد تمكينه ، فلن يتم عرض خيار إرساله كمعاملة عادية.
de: ``req-`` kann vor IS aktiviert werden, um eine InstantSend-Transaktion zu erzwingen. Wenn der Nutzer InstantSend deaktiviert hat und es nicht aktivieren will, wird ihm das Versenden einer normalen Transaktion nicht angeboten.
es: `` req-`` se puede agregar antes de IS para forzar el uso de InstantSend en la transacción. Si el usuario no tiene InstantSend habilitado y no desea habilitarlo, no se le ofrecerá la opción de enviar como una transacción normal.
fr: ``req-`` peut être ajouté avant IS pour forcer l'utilisation d'InstantSend pour la transaction. Si l'utilisateur n'a pas activé InstantSend et ne veut pas l'activer, il ne lui sera pas proposé d'envoyer la transaction comme transaction normale.
ru: ``req-`` может быть добавлен перед IS, чтобы принудительно использовать InstantSend для транзакции. Если у пользователя не включён IntantSend и он не хочет его задействовать, то у пользователя не появится возможности отправить обычную транзакцию.
zh_cn: ``req-`` 可以添加在IS之前，以便启用即时发送功能。如果用户没有而且也不打算启用即时发送功能，那么用户将无法享有即时发送功能带来的便利。

source: The user will see something similar to this:
ar: سيرى المستخدم شيئًا مشابهًا لهذا:
de: Der Nutzer wird etwas sehen, das dem folgenden ähnelt::
es: El usuario verá algo similar a esto:
fr: L'utilisateur verra quelque chose comme ceci ::
ru: Пользователь увидет что-то вроде этого:
zh_cn: 用户将会看到如下所示的类似内容：

source: Payment request in iOS
ar: طلب الدفع في الأيفون
de: Zahlungsanfrage in iOS
es: Solicitud de pago en iOS
fr: Requête de paiement dans iOS
ru: Запрос платежа в iOS
zh_cn: iOS版达世币钱包中的支付请求

source: If the user enters the correct passcode, then the transaction is sent and the user is returned to the sender app following the callback URL.
ar: إذا أدخل المستخدم رمز المرور الصحيح ، فسيتم إرسال المعاملة ويتم إرجاع المستخدم إلى تطبيق المرسل بعد عنوان رابط للإرجاع.
de: Wenn der Nutzer das richtige Passwort eingibt, wird die Transaktion gesendet und der Nutzer kehrt zur Absende-App über die Callback-URL zurück.
es: Si el usuario ingresa la contraseña correcta, se envía la transacción y el usuario regresa a la aplicación del remitente siguiendo la URL de devolución de llamada.
fr: Si l'utilisateur saisit le bon mot de passe, la transaction est envoyée et l'utilisateur est renvoyé vers l'application émettrice, selon l'URL de retour.
ru: Если пользователь вводит правильный пароль, то транзакция отправляется и пользователь возвращается в приложение для отправки, следуя ответному URL.
zh_cn: 如果用户输入了正确的密码，那么交易款项将会予以发送，并在回调地址后返回到发款方的应用程序。

source: Callback URL format::
ar: تنسيق عنوان رابط للمعاودة ::
es: Formato URL de devolución de llamada::
fr: Format de l'URL de retour ::
ru: Формат ответного URL:
zh_cn: 回调地址格式::

source: Master public key
ar: المفتاح العام
es: Llave pública maestra
fr: Clé publique maître
ru: Главный публичный ключ
zh_cn: 主公钥

source: Master public key request format::
ar: تنسيق طلب المفتاح العام الرئيسي ::
de: Master Public Key Anfrageformat::
es: Formato de solicitud de llave pública maestra::
fr: Format de requête de clé publique maître ::
ru: Формат запроса главного публичного ключа:
zh_cn: 主公钥请求格式::

source: Note: account is optional and corresponds to BIP32/BIP44 account, most of the time this should be 0. If account is not specified, we use account 0. This will send back both the extended public key at ``44’/5’/<account>’`` and ``<account>’``
ar: ملاحظة: الحساب اختياري ويتوافق مع حساب BIP32 / BIP44 ، معظم الوقت يجب أن يكون 0. إذا لم يتم تحديد الحساب ، فنحن نستخدم الحساب 0. سيؤدي هذا إلى إرسال كل من المفتاح العام الموسع في ``44'/5'/ <account>’`` و ``<account>’``
de: Hinweis: Account ist optional und entspricht dem BIP32/BIP44 Account. In den meisten Fällen sollte dieser auf 0 stehen. Solange der Account nicht spezifiziert wurde, werden wir Account 0 verwenden. Hierdurch wird der erweiterte Public Key über ``44’/5’/<account>’`` und ``<account>’`` ausgegeben.
es: Nota: la cuenta es opcional y corresponde a la cuenta BIP32/BIP44, la mayoría de las veces debe ser 0. Si no se especifica la cuenta, usamos la cuenta 0. Esto enviará la llave pública extendida al ``44’/5’/<account>’`` y ``<account>’``
fr: À noter : le compte est facultatif et correspond au compte BIP32/BIP44, la plupart du temps il s'agit de 0. Si le compte n'est pas indiqué, on utilise le compte 0. Cela renverra la clé publique étendue à la fois à ``44’/5’/<account>’`` et à ``<account>’``
ru: Обратите внимание, что профиль пользователя является опциональным и соответствует профилю BIP32/BIP44, большую часть времени его значение должно быть 0. Если профиль не указан, то мы используем профиль 0. При выплнении этого условия, назад отправятся и расширенный публичный ключ ``44’/5’/<account>’`` и ``<account>’``
zh_cn: 注意：帐户是可选的，它们分别对应BIP32或 BIP44帐户。在大部分时间内，数值应为0。如果用户没有指定账户，钱包默认使用账户0。在这种情况下，钱包将返回 ``44’/5’/<account>’`` 和 ``<account>’`` 的公钥。

source: Callback::
ar: أتصل مرة أخرى::
es: Llamada de devolución::
fr: Retour ::
ru: Ответ::
zh_cn: 回调::

source: Get address for payment
ar: الحصول على عنوان للدفع
de: Adresse für Zahlung erhalten
es: Obtener dirección para pagos
fr: Obtenir une adresse de paiement
ru: Получите адрес для платежа
zh_cn: 获取支付地址
