Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/wallets/ios/getting-started.po
Languages: ar, zh_cn

source: Getting started with sending and receiving Dash on your iOS device
ar: الشروع في إرسال واستقبال داش على جهاز الأيفون الخاص بك.
zh_cn: 通过个人的IOS设备开始发送或接收达世币

source: dash, mobile, wallet, ios, send, receive, addresses, getting started
ar: داش، الهاتف، المحفظة، الأيفون، إرسال، إستقبال، العناوين، هيا لنبدأ
zh_cn: 达世币、移动、钱包、ios、发送、接收、地址、入门

source: Getting started
ar: لنبدأ
zh_cn: 入门

source: Creating a new wallet
ar: إنشاء محفظة جديدة
zh_cn: 创建新钱包

source: When you first start your Dash Wallet, you will be prompted to choose between creating a new wallet or recovering an existing wallet. Choose **New Wallet** to create a new wallet unless you have existing funds stored in another wallet using a recovery phrase. Your new wallet will be generated, and a recovery phrase will appear so you can recover the funds later if you lose or damage your phone or need to transfer the account to another device. Write the phrase down and store it in a safe place - if you lose this, you will also lose access to your funds forever.
ar: عند بدء تشغيل محفظة داس ، ستتم مطالبتك بالاختيار بين إنشاء محفظة جديدة أو استعادة محفظة موجودة. اختر **محفظة جديدة** لإنشاء محفظة جديدة ما لم يكن لديك أموال موجودة مخزنة في محفظة أخرى باستخدام عبارة الاسترداد. سيتم إنشاء محفظتك الجديدة ، وستظهر عبارة الاسترداد حتى تتمكن من استرداد الأموال لاحقًا في حالة فقد الهاتف أو تلفه أو الحاجة إلى نقل الحساب إلى جهاز آخر. اكتب العبارة إلى أسفل وخزنها في مكان آمن - إذا فقدت هذا ، ستفقد أيضًا إمكانية الوصول إلى أموالك إلى الأبد.
zh_cn: 在用户第一次登陆达世币钱包的时候，软件将提示用户选择 **创建新钱包** 或复原已有的钱包。如果用户已有钱包且钱包中存有余额，那么用户可以使用恢复密码来复原已有的钱包；如果之前没有钱包，那么用户应选择新建钱包。在用户选择新建钱包后，软件将生成新钱包和恢复密码。如果用户由于资金丢失、手机故障或转移账户到另一设备而需要恢复资金，那么用户就要用到这个恢复短语。因此，建议用户将它写下来并妥善保存。如果丢失了这个短语，那么用户就会完全丢失个人的资金。

source: *Creating a new wallet and generating the recovery phrase in iOS Dash Wallet*
ar: *إنشاء محفظة جديدة وإنشاء عبارة الاسترداد في محفظة داش في الأيفون*
zh_cn: *创建iOS版达世币钱包及其恢复短语*

source: You may also be asked to specify a PIN or link the app with your TouchID. You can tap the Dash logo at the top of the app to view your balance. You will need to unlock your wallet for this, as well as to view your transaction history or send Dash.
ar: قد يُطلب منك أيضًا تحديد رقم تعريف شخصي أو ربط التطبيق بـ TouchID. يمكنك النقر على شعار داش أعلى التطبيق لعرض رصيدك. سوف تحتاج إلى إلغاء قفل محفظتك لهذا ، وكذلك لعرض تاريخ المعاملات الخاص بك أو إرسال داش.
zh_cn: 钱包软件也有可能会要求用户指定PIN码或将应用软件与TouchID关联起来。 用户可以点击应用程序顶端的达世币图标来浏览余额。在浏览余额、交易历史记录或发送达世币之前，用户需要解锁钱包。

source: Receiving
ar: إستقبال
zh_cn: 接收

source: Once you have set up your wallet, you will have two screens available to send and receive Dash. You can swipe left and right between the screens. To receive Dash, the app will generate an address which appears at the bottom of the screen. You can tap this to copy and share, or scan the QR code directly. Once the transfer is complete, you can view your balance, transaction history and the status of any pending transactions by clicking the menu button at the top left.
ar: بمجرد إعداد محفظتك ، سيكون لديك شاشتان متاحتان لإرسال واستقبال داش. يمكنك التمرير إلى اليسار واليمين بين الشاشات. لتلقي داش ، سيعمل التطبيق على إنشاء عنوان يظهر في أسفل الشاشة. يمكنك النقر على هذا للنسخ والمشاركة أو مسح رمز الاستجابة السريعة ضوئيًا مباشرةً. بمجرد اكتمال النقل ، يمكنك عرض رصيدك ، سجل المعاملات وحالة أي معاملات معلقة عن طريق النقر على زر القائمة في أعلى اليسار.
zh_cn: 在达世币钱包安装完毕后，用户可以通过两个界面来发送或接收达世币，这两个界面可以左右滑动。在接收达世币的时候，应用程序会生成一个地址，并显示在屏幕下方。用户可以点击地址，以便复制并共享或直接扫描二维码。在交易完成后，用户可以点击左上角的菜单按键，以便浏览余额、交易历史记录或任何等待处理的交易的当前状态。

source: *Receiving Dash and viewing your balance in iOS Dash Wallet*
ar: *تلقي داش وعرض رصيدك في محفظة داش في الأندرويد*
zh_cn: *在iOS 版达世币钱包中接收达世币并查看余额*

source: Sending
ar: إرسال
zh_cn: 发送

source: The Send DASH screen gives you two options to enter the payment address: **Scan QR Code** or **Pay Address From Clipboard**. You can choose to use **InstandSend** for instant confirmation, or disable this to send a normal transaction which will require more time for confirmation. Depending on the code you are scanning, the amount of Dash requested may be included, or you can enter it yourself. A confirmation screen will appear to explain the fee structure and request your unlock code (PIN or TouchID). The transaction will then be sent.
ar: تمنحك شاشة إرسال داس خيارين لإدخال عنوان الدفع: **مسح الضوئي** أو **عنوان الدفع من الحافظة**. يمكنك اختيار استخدام **الإرسال الفوري** للتأكيد الفوري ، أو تعطيل هذا لإرسال معاملة عادية تتطلب مزيدًا من الوقت للتأكيد. اعتمادًا على الرمز الذي تم مسحه ضوئيًا ، قد يتم تضمين مقدار داش المطلوب ، أو يمكنك إدخاله بنفسك. ستظهر شاشة التأكيد لتوضيح هيكل الرسوم وطلب رمز إلغاء القفل (رقم السري أو TouchID). سيتم بعد ذلك إرسال المعاملة.
zh_cn: 达世币的发送页面为用户提供了两个输入支付地址的途径： **扫描二维码** 或 **从剪贴板中获取支付地址** 。用户可以选用 **即时发送** 功能，从而实现交易的立即确认；也可以禁用即时发送功能，而只使用交易确认时间相对略长的普通交易。在扫描二维码时，用户是否需要手动输入金额取决于二维码中是否已经包含了金额的相关信息。此时，钱包中将出现一个确认界面，界面上说明了各项费用并请求用户提供解锁密码（PIN或TouchID）。交易将在随后被发送出去。

source: *Sending Dash from iOS Dash Wallet*
ar: *إرسال داش من محفظة داش في الأيفون*
zh_cn: *在iOS 版达世币钱包中发送达世币*

source: Sending to a Bitcoin address
ar: إرسال البيتكوين لهذا العنوان
zh_cn: 向比特币地址发送达世币

source: You can also send from your Dash Wallet directly to a Bitcoin address using services provided by ShapeShift that are integrated directly in the wallet. If you scan or enter a Bitcoin address, you will be asked to enter the amount to be send in Bitcoin instead of Dash. Once you have entered the amount, click the **Shapeshift!** button shown an additional confirmation screen to confirm the ShapeShift fees before the transaction is processed. Make sure your destination Bitcoin address on this screen is correct. (If you see an error message about the value being too low, tap the greyed out Dash amount at the top to specify the amount to be transferred in Dash instead of Bitcoin.) Once your transaction is accepted, the Dash Wallet for iOS will display **Shapeshift in progress** until the transaction is complete.
ar: يمكنك أيضًا الإرسال من محفظة داش الخاصة بك مباشرةً إلى عنوان البتكوين باستخدام الخدمات المقدمة من قِبل ShapeShift والمتكاملة مباشرةً في المحفظة. إذا قمت بإجراء المسح الضوئي أو إدخال عنوان البيتكوين ، فستتم مطالبتك بإدخال المبلغ المراد إرساله في البيتكوين بدلاً من داش. بمجرد إدخال المبلغ ، انقر فوق الزر **Shapeshift!** الذي يظهر شاشة تأكيد إضافية لتأكيد رسوم ShapeShift قبل معالجة المعاملة. تأكد من صحة عنوان البيتكوين الوجهة على هذه الشاشة. (إذا ظهرت لك رسالة خطأ حول القيمة منخفضة جدًا ، فانقر على مبلغ داش الرمادي في الأعلى لتحديد المبلغ المراد نقله في داش بدلاً من البيتكوين.) بمجرد قبول المعاملة ، ستعرض محفظة داش لنظام التشغيل الأيفون **shapeshift قيد التقدم** حتى اكتمال المعاملة.
zh_cn: 用户还可以借助ShapeShift的服务直接从达世币钱包中向比特币地址发送资金。如果用户扫描或输入比特币地址，那么用户需要输入的是比特币金额，而不是达世币金额。在输入金额后，用户需点击 **Shapeshift!** 按键。此时，钱包将会显示一个额外的确认页面，以便用户在交易推进前确认ShapeShift的服务费用。用户需要确认页面上的比特币地址准确无误（如果出现数值过低的错误信息，用户可点击顶部以灰色显示的达世币金额，从而选定以达世币而非比特币的形式转移的资金）。一旦用户的交易得到认可，iOS 版达世币钱包将显示 ** Shapeshift 正处于服务进程当中** ，直到交易完成。

source: *Sending Dash to a Bitcoin address via ShapeShift from iOS Dash Wallet*
ar: *إرسال داش إلى عنوان بيتكوين عبر ShapeShift من محفظة داش في الأندرويد*
zh_cn: *借助ShapeShift将iOS 版达世币钱包中的达世币发送到比特币地址*
