Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/network/dash-evo-tool/index.po
Languages: ru

source: The My Tokens screen shows all tokens currently being tracked. Click the **Refresh** button to update the screen at any time or **Add Token** to follow additional tokens.
ru: На экране «Мои токены» отображаются все токены, которые в настоящее время отслеживаются. Нажмите кнопку **«Обновить»**, чтобы в любой момент обновить экран, или **«Добавить токен»**, чтобы отслеживать дополнительные токены.

source: You can view token information and access token-related commands by clicking on a token name to open the Token Details screen.
ru: Вы можете просмотреть информацию о токене и получить доступ к командам, связанным с токеном, щелкнув по имени токена, чтобы открыть экран «Сведения о токене».

source: My Tokens screen
ru: Экран мои токены

source: The Token Details screen shows the balance for each of your identities and provides access to token-related :hoverxref:`actions <evo-tool-token-actions>` (e.g., transfer).
ru: На экране «Сведения о токене» отображается баланс для каждой из ваших личностей и предоставляется доступ к связанным с токеном :hoverxref:`действиям <evo-tool-token-actions>` (например, перевод).

source: Token details screen
ru: Экран сведений о токене

source: Token actions
ru: Действия с токеном

source: Token actions can only be used when they are enabled by the token's data contract configuration. Enabled actions can only be performed by authorized identities as defined in the token's data contract.
ru: Действия с токенами могут использоваться только в том случае, если они разрешены в конфигурации дата-контракта токена. Разрешенные действия могут выполняться только авторизованными личностями, как определено в дата-контракте токена.

source: You can complete the following actions using the Dash Evo Tool:
ru: С помощью инструмента Dash Evo Tool можно выполнить следующие действия:

source: Action
ru: Действие

source: Description
ru: Описание

source: Transfer
ru: Перевод

source: Transfer tokens to another identity
ru: Перевести токены другой личности

source: Claim
ru: Заявка

source: Redeem or withdraw available tokens (e.g., from distribution)
ru: Получить или вывести доступные токены (например, из распределения)

source: Mint
ru: Заминтить

source: Create new tokens and add them to the total supply
ru: Создать новые токены и добавить их к общему предложению

source: Burn
ru: Сжечь

source: Permanently remove tokens from circulation
ru: Навсегда удалить токены из обращения

source: Freeze
ru: Заморозить

source: Temporarily disable token transfers for a specific identity
ru: Временно отключить перевод токенов для определенной личности

source: Destroy
ru: Разрушить

source: Permanently eliminate frozen tokens for a specific identity
ru: Навсегда удалить замороженные токены определенной личности

source: Unfreeze
ru: Разморозить

source: Re-enable transfers for a previously frozen identity
ru: Повторно включить переводы для ранее замороженной личности

source: Pause
ru: Приостановить

source: Halt all token operations temporarily
ru: Временно приостановить все операции с токенами

source: Resume
ru: Возобновить

source: Reactivate operations after a pause
ru: Возобновить работу после приостановки

source: View Claims
ru: Посмотреть заявки

source: Display information about completed token claims
ru: Отображение информации о завершенных заявках на токены

source: Update Config
ru: Обновить Config

source: Modify token configuration settings
ru: Изменить настройки конфигурации токена

source: Purchase
ru: Купить

source: Buy tokens that have set a price
ru: Купить токены, для которых установлена цена

source: Set Price
ru: Установить цену

source: Define or update the price accepted for the token
ru: Установите или измените цену для токена

source: Example transfer action
ru: Пример действия перевода

source: Initiate a transfer action
ru: Инициировать действие по передаче

source: Example group mint action
ru: Пример группового действия минт

source: For tokens configured to use :ref:`groups <evo-tool-token-group-actions>` for multi-party control, a message is displayed indicating the requirement for other group members to sign off on the request.
ru: Для токенов, настроенных на использование :ref:`групп <evo-tool-token-group-actions>` для многостороннего управления, отображается сообщение, указывающее на необходимость того, чтобы другие члены группы подписали запрос.

source: Initiate a minting group action
ru: Инициировать групповое действие по минту монет

source: Search tokens
ru: Поиск токенов

source: The Search Tokens screen enables searching for tokens by the keywords assigned to them by the token creator during token registration.
ru: Экран поиска токенов позволяет осуществлять поиск токенов по ключевым словам, назначенным им создателем токена при регистрации токена.

source: Token search screen
ru: Экран поиска токена

source: Token Creator
ru: Создание токена

source: The Token Creator screen provides a comprehensive interface for creating and registering tokens on Dash Platform. It covers all configurable token attributes, ranging from basic supply details to advanced control mechanisms and distribution rules.
ru: Экран создания токена предоставляет комплексный интерфейс для создания и регистрации токенов на платформе Dash. Он охватывает все настраиваемые атрибуты токенов, от базовых данных о поставке до расширенных механизмов управления и правил распределения.

source: Token creator screen
ru: Экран создания токенов

source: The following sections describe the token creator parameters used to configure your token.
ru: В следующих разделах описываются параметры создания токена, используемые для настройки вашего токена.

source: Identity and Key Selection
ru: Выбор личности и ключа

source: Select an identity and an associated key to register the token contract:
ru: Выберите личность и связанный с ней ключ для регистрации контракта токена:

source: **Identity**: The Dash Platform identity that will own the token contract
ru: **Личность**: Личность на платформе Dash, которая будет владеть контрактом токена.

source: **Key**: The key from the identity used to sign the registration, including purpose and security level
ru: **Ключ**: ключ личности, используемый для подписи регистрации, включая предназначение и уровень безопасности.

source: Only valid identity/key pairs are permitted to register token contracts.
ru: Для регистрации токен-контрактов разрешены только валидные пары личности и ключей.

source: Token Information
ru: Информация о токене

source: **Name and Metadata**
ru: **Имя и метаданные**

source: **Token Name (singular)**: Name for a single unit of the token
ru: **Название токена (единичное)**: название одной единицы токена.

source: **Token Name (plural)**: Name for multiple units
ru: **Название токена (множественное число)**: Название для нескольких единиц

source: **Language**: Localized language for token naming
ru: **Язык**: локализованный язык для наименования токенов

source: **Add singular name to keywords**: Whether the token name will appear in token search queries
ru: **Добавить единственное имя к ключевым словам**: будет ли имя токена отображаться в запросах поиска токенов

source: **Description**: Short (max 100 characters) description of the token
ru: **Описание**: Краткое (максимум 100 символов) описание токена.

source: **Supply Parameters**
ru: **Настройки эмиссии**

source: **Base Supply**: Number of tokens created at registration
ru: **Базовая эмиссия**: Количество токенов, созданных при регистрации.

source: **Max Supply**: Maximum possible token supply
ru: **Максимальная эмиссия**: максимально возможное количество токенов

source: **Keywords**
ru: **Ключевые слова**

source: **Contract Keywords**: Comma-separated tags for categorization and querying
ru: **Ключевые слова контракта**: теги, разделенные запятыми, для категоризации и запросов.

source: Advanced Settings (Optional)
ru: Расширенные настройки (необязательно)

source: **General Options**
ru: **Общие параметры**

source: **Start as paused**: Contract starts paused after creation
ru: **Начать как приостановленное**: контракт начинается как приостановленный после создания

source: **Keep history**: Enables historical recording. Advanced settings allow specifying which actions are logged.
ru: **Сохранять историю**: включает запись истории. Расширенные настройки позволяют указать, какие действия следует регистрировать.

source: **Name should be capitalized**: Forces capitalization of token name on display
ru: **Имя должно быть написано заглавными буквами**: принудительное использование заглавных букв в имени токена при отображении.

source: **Decimals**: Number of decimal places for token divisibility
ru: **Десятичные знаки**: Количество десятичных знаков для делимости токена

source: Action Rules
ru: Правила действий

source: Define which administrative actions are permitted after contract creation:
ru: Определите, какие административные действия разрешены после создания контракта:

source: Token creator action rules
ru: Правила действий создания токенов

source: **Manual Mint**: Allow creating additional tokens
ru: **Ручной минт**: разрешить создание дополнительных токенов

source: **Manual Burn**: Allow destroying tokens
ru: **Ручное сжигание**: разрешить уничтожение токенов

source: **Freeze**: Freeze balances of individual addresses
ru: **Заморозка**: заморозка балансов отдельных адресов.

source: **Destroy Frozen Funds**: Destroy frozen balances
ru: **Уничтожить замороженные средства**: уничтожить замороженные средства

source: **Emergency Action**: Permit emergency actions
ru: **Экстренное действие**: позволяет выполнять экстренные действия.

source: **Max Supply Change**: Allow changes to the maximum supply
ru: **Изменение максимальной эмиссии**: разрешить изменение максимальной эмиссии

source: **Conventions Change**: Allow changes to token conventions (supported languages, etc.)
ru: **Изменение условных обозначений**: Разрешить изменение условных обозначений токенов (поддерживаемые языки и т. д.)

source: **Marketplace Trade Mode Change**: Allow changes to trading mode
ru: **Изменение режима торговли на рынке**: разрешить изменение режима торговли

source: **Direct Purchase Pricing Change**: Allow changes to direct purchase pricing
ru: **Изменение цен на прямую закупку**: Разрешить изменение цен на прямую закупку

source: **Main Control Group Change**: Allow changes to the contract's control group
ru: **Изменение основной группы контроля**: разрешить изменения в группе контроля контракта.

source: **Presets**
ru: **Пресеты**

source: The Dash Evo Tool provides several pre-defined action templates to simplify token configuration:
ru: Dash Evo Tool предоставляет несколько предопределенных шаблонов действий для упрощения настройки токенов:

source: Rule Preset
ru: Предустановленное правило

source: Custom
ru: Пользовательский

source: Allows setting all action rules independently for maximum flexibility.
ru: Позволяет настраивать все правила действий независимо для максимальной гибкости.

source: Most Restrictive
ru: Самый строгий

source: No actions are permitted after initialization. All governance and control settings are immutable. Suitable for tokens that should remain fixed and tamper-proof.
ru: После инициализации никакие действия не допускаются. Все настройки управления и контроля неизменяемы. Подходит для токенов, которые должны оставаться фиксированными и защищенными от несанкционированного доступа.

source: Only Emergency Action
ru: Только экстренные действия

source: Only emergency actions (e.g., pausing the token) are permitted. Minting, burning, and advanced operations (such as freezing) are disallowed. This preset allows minimal control for critical situations without risking token supply or ownership manipulation.
ru: Разрешены только экстренные действия (например, приостановка токена). Минт, сжигание и расширенные операции (например, заморозка) запрещены. Эта предустановка обеспечивает минимальный контроль в критических ситуациях без риска манипуляций с предложением токенов или владением ими.

source: Minting and Burning
ru: Минт и сжигание

source: Allows minting and burning operations, but not advanced features such as freezing. Enables supply management without enabling full administrative capabilities.
ru: Позволяет производить операции минта и сжигания, но не поддерживает расширенные функции, такие как заморозка. Позволяет управлять запасами без включения всех административных функций.

source: Advanced Actions
ru: Продвинутые действия

source: Grants the ability to perform advanced actions, including freezing and unfreezing balances. Minting and burning are also permitted. Suitable for tokens that require moderate administrative control without total override capabilities.
ru: Предоставляет возможность выполнять расширенные действия, включая заморозку и разморозку балансов. Также разрешен минт и сжигание. Подходит для токенов, требующих умеренного административного контроля без возможности полного переопределения.

source: All Allowed
ru: Все разрешено

source: Enables all actions.
ru: Активировать все действия

source: Distribution Options
ru: Типы распределения

source: Define token distribution using perpetual and/or pre-programmed options:
ru: Определите распределение токенов, используя бессрочные и/или предварительно запрограммированные опции:

source: Token creator distribution
ru: Распределение в создателе токен

source: **Perpetual Distribution**
ru: **Постоянное распределение**

source: Automated recurring token distributions:
ru: Автоматизированные повторяющиеся распределения токенов:

source: **Enable**: Activates automated distribution
ru: **Включить**: активирует автоматическое распределение.

source: **Type**: Distribution trigger type (e.g., ``BlockBased``)
ru: **Тип**: Тип триггера распределения (например, «BlockBased»)

source: **Distributes every (interval)**: Block, epoch, or time-based interval between distribution events
ru: **Распределять каждый (интервал)**: блок, эпоха или временной интервал между событиями распределения.

source: **Function**: Distribution model (e.g., ``FixedAmount`` per interval)
ru: **Функция**: Модель распределения (например, ``FixedAmount'' на интервал)

source: **Recipient**: Identity receiving distributed tokens
ru: **Получатель**: Личность, получающая распределенные токены

source: **Pre-Programmed Distribution**
ru: **Предварительно запрограммированное распределение**

source: One-time or scheduled future distributions:
ru: Разовые или запланированные будущие распределения:

source: **Enable Pre-Programmed Distribution**: Enables scheduled events
ru: **Включить предварительно запрограммированное распределние**: включает запланированные события.

source: **Add New Distribution Entry**: Create new pre-programmed distribution event
ru: **Добавить новую запись распределения**: создать новую предварительно запрограммированную запись распределения

source: Groups (Optional)
ru: Группы (Опционально)

source: Define multi-party shared control of the contract:
ru: Определите многосторонний совместный контроль над контрактом:

source: **Add New Group**: Create a control group
ru: **Добавить новую группу**: Создать группу контроля

source: **Main Control Group Position**: Set primary group responsible for contract ownership and administration
ru: **Позиция основной группы управления**: назначение основной группы, ответственной за владение и администрирование контракта.

source: Register and Review
ru: Зарегистрировать и проверить

source: **Register Token Contract**: Submit and register the token contract on Dash Platform
ru: **Регистрация контракта токена**: отправьте и зарегистрируйте контракт токена на платформе Dash.

source: **View JSON**: View full contract schema prior to registration
ru: **Просмотр JSON**: просмотр полной схемы контракта перед регистрацией

source: Group actions
ru: Групповые действия

source: The Group Actions screen allows querying group action requests. Select a contract and an identity, then click **Fetch Group Actions** to see all related group actions request.
ru: Экран «Групповые действия» позволяет запрашивать групповые действия. Выберите контракт и личность, затем нажмите **Получить групповые действия**, чтобы увидеть все запрошенные групповые действия.

source: Click the **Take Action** button to open the approval screen for a specific request.
ru: Нажмите кнопку **Выполнить действие**, чтобы открыть экран одобрения конкретного запроса.

source: Group Actions screen
ru: Экран групповых действий

source: On approval screen, select the key to sign the request. Then, click the **Sign <Action>** button. When the confirmation screen opens, confirm that the action details are correct. Finally, click **Confirm** to complete your approval of the request.
ru: На экране подтверждения выберите ключ для подписи запроса. Затем нажмите кнопку **Подписать <Action>**. Когда откроется экран подтверждения, подтвердите правильность данных действия. Нажмите кнопку **Подтвердить**, чтобы завершить подтверждение запроса.

source: Group Actions Approval screen
ru: Экран группового одобрения действий

source: Wallet operations
ru: Операции с кошельком

source: The Dash Evo Tool wallet features only work if your Dash Core node has a single wallet open. **If you have multiple wallets open in Dash Core, close all of them except the one used by the Dash Evo Tool.**
ru: Функции кошелька Dash Evo Tool работают только в том случае, если на вашем узле Dash Core открыт хотя бы один кошелёк. **Если в Dash Core открыто несколько кошельков, закройте все из них, кроме того, который используется Dash Evo Tool.**

source: Create wallet
ru: Создание кошелька

source: This tool includes a basic wallet feature to support identity registration. Wallets can be added from the wallet screen.
ru: Этот инструмент включает в себя базовую функцию кошелька для поддержки регистрации личности. Кошельки можно добавлять с экрана кошелька.

source: Since this tool adds watching-only addresses to Dash Core when creating identities, it is recommended to close all existing Dash Core wallets and :ref:`create a new wallet <dashcore-installation-macos-create-wallet>` for the Dash Evo Tool. Also, make sure to :ref:`backup your Dash Core wallet <dashcore-backup>`.
ru: Поскольку этот инструмент добавляет адреса, доступные только для просмотра, в Dash Core при создании личности, рекомендуется закрыть все существующие кошельки Dash Core и :ref:`создать новый кошелёк <dashcore-installation-macos-create-wallet>` для инструмента Dash Evo. Также обязательно :ref:`создайте резервную копию кошелька Dash Core <dashcore-backup>`.

source: Click **Create Wallet** to create a new wallet.
ru: Нажмите **Создать кошелёк** чтобы создать новый кошелёк.

source: Wallet screen
ru: Экран кошелька

source: After creating extra randomness with the mouse, select your preferred language and click **Generate** to display you passphrase. Write it down and store it securely.
ru: После создания дополнительной случайности с помощью мыши выберите нужный язык и нажмите кнопку **Сгенерировать**, чтобы увидеть вашу seed фразу. Запишите её и сохраните в надёжном месте.

source: Wallet create screen
ru: Экран создания кошелька

source: Click the checkbox in step 3 to confirm you have saved the passphrase. Next, enter a wallet name and optionally add a password before clicking **Save Wallet** to store the wallet.
ru: Установите флажок на шаге 3, чтобы подтвердить сохранение seed фразы. Затем введите имя кошелька и (при необходимости) пароль, прежде чем нажать кнопку **Сохранить кошелек**, чтобы сохранить его.

source: Use wallet
ru: Используйте кошелек

source: Select your wallet using the dropdown box.
ru: Выберите свой кошелек с помощью выпадающего окна.

source: Select wallet
ru: Выберите кошелек

source: Funds
ru: Средства

source: Several tabs display wallet details. The Funds tab shows your receiving addresses. Click **Add Receiving Address** if you want to add additional addresses to fund the wallet.
ru: На нескольких вкладках отображаются сведения о кошельке. На вкладке «Средства» отображаются адреса получения. Нажмите **Add Receiving Address**, если вы хотите добавить дополнительные адреса для пополнения кошелька.

source: Wallet Funds tab
ru: Вкладка Средства в кошельке

source: After adding addresses, they will appear in a table with balance and other details.
ru: После добавления адресов они появятся в таблице с балансом и другими деталями.

source: Wallet with address added
ru: Кошелек с добавленным адресом
