Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/docs/user/network/dash-evo-tool/index.po
Languages: ru

source: Description of dash evo tool features and usage
ru: Описание возможностей Dash Evo Tool и их использование

source: dash, platform, evonode, masternodes, dash evo tool, token
ru: dash, platform, эвоноды, мастерноды, dash evo tool, токен

source: Dash Evo Tool is an application designed to help you :ref:`vote on usernames <evo-tool-name-voting>`, :ref:`withdraw evonode credits <evo-tool-identity-evo-withdraw>`, :ref:`manage tokens <evo-tool-token>`, and complete an expanding list of Platform actions. This guide describes how to download, install, and use the Dash Evo Tool.
ru: Dash Evo Tool — это приложение, разработанное для того, чтобы помочь вам :ref:`голосовать за имена пользователей <evo-tool-name-voting>`, :ref:`выводить кредиты с эвоноды <evo-tool-identity-evo-withdraw>`, :ref:`управлять токенами <evo-tool-token>` и выполнять растущий список действий на платформе. В этом руководстве описано, как загрузить, установить и использовать Dash Evo Tool.

source: Installation
ru: Установка

source: The Dash Evo Tool requires a running Dash Core full node.
ru: Для работы Dash Evo Tool требуется запущенный полный узел Dash Core.

source: Linux, MacOS, or Windows packages are available on the `GitHub releases page <https://github.com/dashpay/dash-evo-tool/releases/latest>`__. Download the zip file for your Operating System, then unzip the downloaded file:
ru: Пакеты для Linux, MacOS или Windows доступны на странице релизов на `GitHub <https://github.com/dashpay/dash-evo-tool/releases/latest>`__. Загрузите zip-файл для вашей операционной системы, а затем распакуйте его:

source: Configuration
ru: Конфигурация

source: The Dash Evo Tool includes a configuration file that will work without modification. *If you have a custom Dash Core config file that you want to continue using*, expand the dropdown below for advanced configuration details.
ru: Dash Evo Tool включает в себя конфигурационный файл, который будет работать без изменений. *Если у вас есть настраиваемый конфигурационный файл Dash Core, который вы хотите продолжать использовать*, разверните раскрывающийся список ниже, чтобы увидеть подробные сведения о расширенной конфигурации.

source: Advanced configuration - using a custom Dash Core config
ru: Расширенная настройка — использование настраиваемой конфигурации Dash Core

source: The default location of the ``dash.conf`` file can be found in the :ref:`Dash Core documentation <dashcore-rpc>`.
ru: По умолчанию файл ``dash.conf`` находится в :ref:`Dash Core documentation <dashcore-rpc>`.

source: Open the directory where the download was unzipped.
ru: Откройте директорий, в который была распакована загруженная программа.

source: Open the ``.env`` file (you may need to show hidden files to see it). For the network you plan to connect to, make the following changes. Replace the ``*`` with the network name (MAINNET or TESTNET):
ru: Откройте файл ``.env`` (чтобы увидеть его, может потребоваться показать скрытые файлы). Для сети, к которой вы планируете подключиться, сделайте следующие изменения. Замените ``*`` на имя сети (MAINNET или TESTNET):

source: Update ``*_CORE_RPC_USER`` to match the ``rpcuser`` value from your Dash Core dash.conf file.
ru: Обновите ``*_CORE_RPC_USER``, чтобы оно соответствовало значению ``rpcuser`` из вашего файла Dash Core dash.conf.

source: Update ``*_CORE_RPC_PASSWORD`` to match the ``rpcpassword`` value from your Dash Core dash.conf file.
ru: Обновите значение ``*_CORE_RPC_PASSWORD``, чтобы оно соответствовало значению ``rpcpassword`` из файла Dash Core dash.conf

source: If your dash.conf includes ``rpcallowip``, update ``*_CORE_HOST`` with that IP address.
ru: Если ваш dash.conf содержит ``rpcallowip``, измените ``*_CORE_HOST`` на этот IP-адрес.

source: If your dash.conf includes ``rpcport``, update ``*_CORE_RPC_PORT`` with that port.
ru: Если ваш dash.conf содержит ``rpcport``, обновите ``*_CORE_RPC_PORT``, указав этот порт.

source: Enable ZMQ by adding the following lines to your dash.conf file:
ru: Включите ZMQ, добавив следующие строки в файл dash.conf:

source: Mainnet ZMQ setup
ru: Настройка ZMQ в Mainnet

source: Testnet ZMQ setup
ru: Настройка ZMQ в Testnet

source: At a minimum, the following values must be defined for RPC access to be enabled:
ru: Для включения доступа RPC необходимо определить как минимум следующие значения:

source: Updating the env file
ru: Обновление env-файла

source: When the application runs for the first time, it creates a application directory and copies the ``.env`` file into it. It also stores application data in the directory. Any further updates to the ``.env`` file must be made to the copy in the application directory.
ru: Когда приложение запускается в первый раз, оно создает каталог приложения и копирует в него файл ``.env``. В этом каталоге также хранятся данные приложения. Все дальнейшие обновления файла ``.env`` должны производиться в копии в каталоге приложения.

source: Operating System
ru: Операционная система

source: Configuration File Path
ru: Путь к конфигурационному файлу

source: Running the application
ru: Запуск приложения

source: On some macOS devices, you will need to approve the app in your security settings using the process described in `Safely open apps on your Mac <https://support.apple.com/en-us/102445#openanyway>`__.
ru: На некоторых устройствах macOS вам необходимо будет утвердить приложение в настройках безопасности, следуя инструкциям, описанным в разделе «Безопасное открытие приложений на Mac <https://support.apple.com/en-us/102445#openanyway>»__.

source: Once the ``.env`` file is configured, launch the Dash Evo Tool by double-clicking the file named ``dash-evo-tool``.
ru: После того как файл ``.env`` настроен, запустите Dash Evo Tool, дважды щелкнув на файле с именем ``dash-evo-tool``.

source: Alternatively, you can launch the application directly from your terminal. For example, on Linux, run::
ru: Кроме того, вы можете запустить приложение прямо из терминала. Например, в Linux выполните::

source: Network selection
ru: Выбор сети

source: The Dash Evo Tool supports both testnet and mainnet. To choose a network, navigate to the Network Selection screen and click the checkbox in the Select column for the desired network. Then click the **Start** button on that row to launch Dash Core.
ru: Инструмент Dash Evo Tool поддерживает сети mainnet и testnet. Чтобы выбрать сеть, перейдите на экран выбора сети и установите флажок в столбце Select для нужной сети. Затем нажмите кнопку **Start** в этой строке, чтобы запустить Dash Core.

source: If you have Dash Core installed in a non-standard location or want to use a custom dash.conf file, configure those options in the advanced settings.
ru: Если Dash Core установлен в нестандартном месте или вы хотите использовать пользовательский файл dash.conf, настройте эти параметры в расширенных настройках.

source: Network selection screen with testnet selected
ru: Экран выбора сети с выбором testnet

source: Advanced network settings
ru: Расширенные настройки сети

source: If you have Dash Core installed in a non-standard location, click **Show more advanced settings**, then click **Select file** to select the location of your Dash Core installation.
ru: Если Dash Core установлен в нестандартном месте, нажмите **Показать дополнительные настройки**, затем нажмите **Выбрать файл**, чтобы выбрать место установки Dash Core.

source: Also, if you use a custom dash.conf file, uncheck **Overwrite dash.conf** and make sure your file aligns with the RPC and ZMQ settings mentioned in the :hoverxref:`Configuration section <evo-tool-configure>`.
ru: Кроме того, если вы используете настраиваемый файл dash.conf, снимите флажок **Перезаписать dash.conf** и убедитесь, что ваш файл соответствует настройкам RPC и ZMQ, упомянутым в :hoverxref:`Разделе «Конфигурация»<evo-tool-configure>`.

source: Network selection screen with advanced settings displayed
ru: Экран выбора сети с отображением расширенных настроек

source: Identity operations
ru: Операции с личностью

source: Load existing identity
ru: Загрузите существующую личность

source: On the main identity screen, click the **Load Identity** button on the upper right side of the screen.
ru: На главном экране личности нажмите кнопку **Load Identity** в правой верхней части экрана.

source: Main identity screen
ru: Главный экран личности (Identity)

source: Some identity types require different information. Use the **Identity Type** dropdown menu to select the type you want to add. In this example, an evonode identity is being added.
ru: Для некоторых типов личности требуется другая информация. Используйте выпадающее меню **Identity Type**, чтобы выбрать тип, который вы хотите добавить. В этом примере добавляется личность эвоноды.

source: Identity load screen for evonode
ru: Экран загрузки личности для эвоноды

source: Your collateral key is **not** required. Do not enter it into the Dash Evo Tool.
ru: Ваш ключ обеспечения **не** обязателен. Не вводите его в программу Dash Evo Tool.

source: Add the Identity ID and Owner Private Key. You may also want to add the Voting Private Key, but adding the Payout Address Private Key is **not** recommended. For a masternode or evonode, use the protx hash as the Identity ID.
ru: Добавьте ID личности и приватный ключ владельца. Вы также можете добавить приватный ключ голосования, но добавлять приватный ключ адреса выплат **не рекомендуется. Для мастерноды или эвоноды используйте хэш protx в качестве ID личности.

source: If you use the `Dash Masternode Tool <https://github.com/Bertrand256/dash-masternode-tool>`_, you can get the protx hash and private keys from the masternode details screen.
ru: Если вы используете `Dash Masternode Tool <https://github.com/Bertrand256/dash-masternode-tool>`_, вы можете получить хэш protx и приватные ключи с экрана сведений о мастерноде.

source: Click **Load Identity** once you have entered the required information.
ru: После ввода необходимой информации нажмите **Load Identity**.

source: Identity load screen with evonode info filled out
ru: Экран загрузки личности с заполненной информацией об эвоноде

source: Once the identity is loaded, you can view its balance and details about its keys. For evonodes, you can also initiate :ref:`withdrawals <evo-tool-identity-evo-withdraw>`.
ru: После загрузки идентификатора вы можете просмотреть его баланс и подробную информацию о ключах. Для эвонод вы также можете инициировать :ref:`вывод средств <evo-tool-identity-evo-withdraw>`.

source: Identity screen with an evonode identity loaded
ru: Экран личности с загруженной личностью эвоноды

source: Create new identity
ru: Создать новую личность

source: Before creating an identity, make sure you have :ref:`added a Dash Evo Tool wallet <evo-tool-wallet-create>`.
ru: Перед созданием личности убедитесь, что вы :ref:`добавили кошелек Dash Evo Tool <evo-tool-wallet-create>`.

source: On the main identity screen, click the **Create Identity** button on the upper right side of the screen.
ru: На главном экране личности нажмите кнопку **Create Identity** в правой верхней части экрана.

source: On the create identity screen, leave the first two options set to the default and select the funding method.
ru: На экране создания учетной записи оставьте первые два параметра по умолчанию и выберите способ пополнения счета.

source: Identity create options
ru: Параметры создания личности

source: Then, choose your funding method and send the requested amount of DASH to the provided address.
ru: Затем выберите способ оплаты и отправьте требуемую сумму DASH на указанный адрес.

source: Waiting for funds
ru: Ожидание средств

source: The status will change from "Waiting for funds" to "Waiting for Core Chain to produce proof of transfer of funds". Then, the status will change to "Waiting for Platform acknowledgement" once the funds have been received and the identity registration process has started.
ru: Статус изменится с «Ожидание средств» на «Ожидание подтверждения перевода средств от Core Chain». Затем, после получения средств и начала процесса регистрации личности, статус изменится на «Ожидание подтверждения от платформы».

source: Waiting for Platform acknowledgement
ru: Ожидание подтверждения от платформы

source: Once the identity has been registered, you can choose to return to the identity screen or proceed to :ref:`registering a name <evo-tool-name-register>`.
ru: После регистрации личности вы можете вернуться к экрану личности или перейти к :ref:`регистрации юзернейма <evo-tool-name-register>`.

source: Identity creation success
ru: Успешное создания личности

source: Identity screen with the new identity loaded
ru: Экран личностей с загруженной новой личностью

source: Top up identity
ru: Пополнить личность

source: Before topping up an identity, make sure you have :ref:`added a Dash Evo Tool wallet <evo-tool-wallet-create>`.
ru: Перед пополнением личности убедитесь, что вы :ref:`добавили кошелек Dash Evo Tool <evo-tool-wallet-create>`.

source: Your identity's credit balance will decrease as you use applications on Platform. You can increase your balance by doing an identity top up. On the main identity screen, click the **Actions** button for the identity you want to add credits to, then click **Top up**.
ru: Кредитный баланс вашей личности будет уменьшаться по мере использования приложений на Платформе. Вы можете увеличить свой баланс, пополнив счет личности. На главном экране личности нажмите кнопку **Действия** для личности, на счет которой вы хотите добавить кредиты, затем нажмите **Пополнить**.

source: Identity actions menu
ru: Меню действий с личностью

source: On the top up identity screen, select the funding method and funding amount. Then, click **Top Up Identity** to continue.
ru: На экране пополнения счета выберите способ пополнения и сумму. Затем нажмите **Пополнить счет**, чтобы продолжить.

source: The status will change from "Waiting for funds" to "Waiting for Platform acknowledgement" once the funds have been received and the identity top up process has started.
ru: Статус изменится с «Ожидание поступления средств» на «Ожидание подтверждения от платформы» после получения средств и начала процесса пополнения личности

source: Once the top up is complete, a message will indicate it was successful.
ru: После завершения пополнения появится сообщение об успешном завершении операции.

source: Transfer credits
ru: Перевод кредитов

source: You can transfer credits to another identity by providing the identity's ID. On the main identity screen, click the **Actions** button for the identity sending the credits, then click **Transfer**.
ru: Вы можете перевести кредиты на другую личность, указав ее юзерней. На главном экране личности нажмите кнопку **Действия** для учетной записи, отправляющей кредиты, затем нажмите **Перевести**.

source: On the transfer screen, set the amount and the identity ID to receive the transferred credits. Then, click **Transfer** to continue.
ru: На экране перевода установите сумму и ID личности для получения переведенных кредитов. Затем нажмите **«Перевод»**, чтобы продолжить.

source: Transfer screen with transfer details entered
ru: Экран перевода с введенными деталями перевода

source: When the withdrawal confirmation screen opens, confirm that the amount and destination identity ID are correct. Click **Confirm** to transfer the credits.
ru: Когда откроется экран подтверждения вывода средств, убедитесь, что сумма и ID личности получателя верны. Нажмите **Подтвердить**, чтобы перевести средства.

source: Transfer confirmation screen
ru: Экран подтверждения перевода

source: Once the transfer is complete, a message will indicate it was successful.
ru: После завершения перевода появится сообщение об успешном выполнении операции.

source: Evonode withdrawals
ru: Вывод награды Эвоноды

source: Withdrawal requests enter a queue for processing. For security, there is a limit on how much can be withdrawn from Platform daily. If withdrawal requests hit the daily limit, they will remain in the queue longer. For details, see this `DCG development update <https://www.youtube.com/live/rc_avHHqG6E?si=ETv0yX-1b3odCU8F&t=599>`_.
ru: Запросы на вывод средств поступают в очередь на обработку. В целях безопасности существует ограничение на сумму, которую можно вывести с платформы ежедневно. Если запросы на вывод средств достигают дневного лимита, они остаются в очереди дольше. Подробности см. в этом `обновлении по разработке DCG <https://www.youtube.com/live/rc_avHHqG6E?si=ETv0yX-1b3odCU8F&t=599>`_.

source: From the identity main screen, click the **Actions** button for the identity requesting a withdrawal, then click **Withdraw**.
ru: На главном экране личности нажмите кнопку **Действия** для личности, запрашивающей снятие средств, затем нажмите **Вывести**.

source: Withdraw screen
ru: Экран вывода средств

source: On the withdrawal screen, select the key to sign the withdrawal. Selecting the owner key is recommended since this will direct the withdrawal to the payout address. Next, set the amount to withdraw.
ru: На экране вывода средств выберите ключ для подписи вывода. Рекомендуется выбрать ключ владельца, так как это позволит направить вывод средств на адрес выплаты. Затем установите желаемый размер вывода.

source: Click **Withdraw** after entering the information.
ru: После ввода информации нажмите **Withdraw**.

source: Withdraw screen with key and amount selected
ru: Экран снятия средств с выбранным ключом и суммой

source: When the withdrawal confirmation screen opens, confirm that the amount and destination address are correct. Click **Confirm** to request the withdrawal.
ru: Когда откроется окно подтверждения вывода средств, убедитесь, что сумма и адрес назначения указаны верно. Нажмите **Confirm**, чтобы запросить вывод средств.

source: Withdrawal confirmation screen
ru: Экран подтверждения вывода средств

source: Name operations
ru: Операции с юзернеймами

source: Register name
ru: Регистрация юзернейма

source: After :ref:`creating an identity <evo-tool-identity-create>`, you can register a name for it. From the main name screen, click the **Register Name** button on the upper right side of the screen.
ru: После :ref:`создания личности <evo-tool-identity-create>`, вы можете зарегистрировать для нее имя. На главном экране имен нажмите кнопку **Register Name** в правой верхней части экрана.

source: Name screen
ru: Экран юзернеймов

source: First, select the identity to register a name for. This step will be automatically done if you are registering a name as part of the identity creation process.
ru: Сначала выберите личность, для которой нужно зарегистрировать имя. Этот шаг будет выполнен автоматически, если вы регистрируете юзернейм в рамках процесса создания личности.

source: Next, enter the desired name. Notification will be provided if you selected a contested name and the estimated cost will be displayed. Click **Register Name** to complete the registration.
ru: Затем введите желаемый. Если вы выбрали contested юзернейм, будет выдано уведомление, и отобразится примерная стоимость. Нажмите **Register Name**, чтобы завершить регистрацию.

source: Name registration
ru: Регистрация юзернейма

source: Upon successful registration, you can see the name on the **My usernames** screen along with any other names you have registered.
ru: После успешной регистрации вы увидите этот юзернейм на экране **My usernames** вместе с другими зарегистрированными вами юзернеймами.

source: Name registered successfully
ru: Юзернейм зарегистрирован успешно

source: Vote for names
ru: Голосование за юзернеймы

source: The Voting screen displays a list of names that are currently require a vote. Click the **Refresh** button to update the screen at any time.
ru: На экране «Голосование» отображается список юзернеймов, за которые в данный момент требуется проголосовать. Нажмите кнопку **Refresh**, чтобы обновить экран в любое время.

source: Voting can only be done by masternodes and evonodes, and each node can only modify its vote four times. See the :ref:`load identity section <evo-tool-identity-load>` for instructions on importing your keys.
ru: Голосовать могут только мастерноды и эвоноды, и каждая нода может изменить свой голос только четыре раза.

source: To vote for a contestant, click on an entry in the Contestants column. You can also vote to Lock the name or Abstain from voting by clicking the value in those columns. Vote for multiple name contests simultaneously by making several selections.
ru: Чтобы проголосовать за участника, щелкните по записи в столбце «Участники». Вы также можете проголосовать за «Блокировку» юзернейма или «Воздержаться» от голосования, щелкнув по значению в этих столбцах. Проголосуйте за несколько юзернеймов одновременно, выбрав несколько вариантов.

source: Once you have made selections for all contests you want to vote on, click the **Cast/Schedule Votes** button to open the voting screen. There you can chose to cast your votes immediately or schedule them for later.
ru: После того, как вы выбрали все юзернеймы, за которые хотите проголосовать, нажмите кнопку **«Проголосовать/Запланировать голосование»**, чтобы открыть экран голосования. Там вы можете проголосовать сразу или запланировать голосование на более поздний срок.

source: Voting screen
ru: Экран голосования

source: Click **Apply Votes** after determining how to vote for each selected contest.
ru: Нажмите **Применить голоса** после того, как определитесь, как голосовать за каждый выбранный юзернейм.

source: Cast vote
ru: Транслировать голос

source: Cast vote(s) immediately
ru: Транслировать голос(а) сейчас

source: Schedule vote
ru: Отложить голос

source: The Dash Evo Tool must be running and connected for scheduled votes to execute at the planned time.
ru: Для выполнения запланированных голосований в назначенное время инструмент Dash Evo Tool должен быть запущен и подключен.

source: Schedule vote(s) for later
ru: Отложить голосование на более поздний срок

source: Scheduled votes
ru: Отложенные голоса

source: Click **Scheduled votes** to view a list of any pending scheduled votes. Pending votes can be canceled by clicking the **Remove** button.
ru: Нажмите **Отложенные голосования**, чтобы просмотреть список всех ожидающих отложенных голосов. Ожидающие голоса можно отменить, нажав кнопку **Удалить**.

source: Scheduled votes screen
ru: Экран отложенных голосов

source: See the `DPNS page <https://docs.dash.org/projects/platform/en/stable/docs/explanations/dpns.html#voting-details>`_ for more voting details.
ru: Подробности голосования смотрите на странице `DPNS <https://docs.dash.org/projects/platform/en/stable/docs/explanations/dpns.html#voting-details>`_.

source: View contests
ru: Посмотреть голосования

source: Click **Active contests** or **Past contests** to view a list current or previous contests.
ru: Нажмите **Активные голосования** или **Прошедшие голосования**, чтобы просмотреть список текущих или прошлых голосований.

source: Active contests
ru: Активные голосования

source: Active contests screen
ru: Экран активных голосований

source: Past contests
ru: Завершённые голосования

source: Past contests screen
ru: Экран завершённых голосований

source: My usernames
ru: Мои юзернеймы

source: Click **My Usernames** to view a list of usernames owned by your identities.
ru: Нажмите **Мои юзернеймы**, чтобы просмотреть список юзернеймов, принадлежащих вашим личностям.

source: My usernames screen
ru: Экран моих юзернеймов

source: Token operations
ru: Операции с токенами

source: My tokens
ru: Мои токены
