Repository: dashpay/docs
Catalog: locale/*/LC_MESSAGES/mining/p2pool.po
Languages: es

source: Guide to setting up a Dash P2Pool node
es: Guía para configurar un nodo P2Pool de Dash

source: dash, mining, X11, p2pool, node, pool, software, ASIC, mining pool
es: dash, minería, X11, p2pool, nodo, software, ASIC, pool de minería

source: Dash P2Pool Node Setup
es: Configuración del nodo de P2Pool de Dash

source: This guide describes how to set up a Dash P2Pool node to manage a pool of miners. Unlike centralized mining pools, P2Pool is based on the same peer-2-peer (P2P) model as Dash, making the pool as a whole highly resistant to malicious attacks, and preserving and protecting the decentralized nature of Dash. When you launch a P2Pool node, it seeks out, connects with, and shares data with a decentralized network of other P2Pool nodes (also known as peers). P2Pool nodes share a cryptographic chain of data representing value, similar to Dash's blockchain. The P2Pool version is called the sharechain. The decentralized and fair nature of this mining model means mining with P2Pool is strongly encouraged. P2Pool for Dash uses the `p2pool-dash <https://github.com/dashpay/p2pool-dash>`_ software on GitHub, which is a fork of p2pool for Bitcoin. For more information, see `here <https://en.bitcoin.it/wiki/P2Pool>`__.
es: Esta guía describe cómo configurar un nodo Dash P2Pool para administrar un grupo de mineros. A diferencia de las agrupaciones de minería centralizadas, P2Pool se basa en el mismo modelo de pares iguales 2-2 (P2P) que Dash, lo que hace que la agrupación como un todo sea altamente resistente a los ataques maliciosos, y preserva y protege la naturaleza descentralizada de Dash. Cuando inicias un nodo P2Pool, este busca, se conecta y comparte datos con una red descentralizada de otros nodos P2Pool (también conocidos como pares). Los nodos P2Pool comparten una cadena criptográfica de datos que representan el valor, similar a la cadena de bloques de Dash. La versión de P2Pool se llama sharechain. La naturaleza descentralizada y justa de este modelo de minería significa que se recomienda enfáticamente la minería con P2Pool. P2Pool para Dash utiliza el software `p2pool-dash <https://github.com/dashpay/p2pool-dash>`_ en GitHub, que es una bifurcación de p2pool para Bitcoin. Para obtener más información, consulta `aquí <https://en.bitcoin.it/wiki/P2Pool>`__.

source: Because of the way P2Pool manages difficulty adjustments on the sharechain, it is important to maintain low latency between the miners and the P2Pool node to avoid miners submitting shares too late to enter the sharechain. When setting up your node, you need to consider its physical and network location relative to the miners you intend to connect to the node. If you operate a mining farm, your P2Pool node should probably be a physical machine on the same local network as your miners. If you plan to operate a public node, it may be best to set up your P2Pool node as a virtual machine in a data center with a high speed connection so geographically close miners can mine to your pool with relatively low latency.
es: Debido a la manera en que P2Pool maneja los ajustes de dificultad en la sharechain, es importante mantener una baja latencia entre los mineros y el nodo P2Pool para evitar que los mineros envíen acciones demasiado tarde para ingresar a la sharechain. Al configurar tu nodo, debes tener en cuenta su ubicación física y de red en relación con los mineros con los que tienes la intención de conectar a tu nodo. Si operas una granja de minería, tu nodo P2Pool probablemente sea una máquina física en la misma red local que tus mineros. Si planeas operar un nodo público, puede ser mejor configurar tu nodo P2Pool como una máquina virtual en un centro de datos con una conexión de alta velocidad para que los mineros geográficamente cercanos puedan minar en tu grupo con una latencia relativamente baja.

source: This following section describes the steps to setup an Ubuntu Server running P2Pool for Dash. It has been tested with Ubuntu 18.04 LTS and Dash 0.13.1.0. While a reasonable effort will be made to keep it up to date, it should be possible to modify the instructions slightly to support different versions or operating systems as necessary.
es: La siguiente sección describe los pasos para configurar un servidor Ubuntu que ejecute P2Pool para Dash. Ha sido probado con Ubuntu 18.04 LTS y Dash 0.13.1.0. Si bien se hará un esfuerzo razonable para mantenerlo actualizado, debería ser posible modificar las instrucciones ligeramente para admitir diferentes versiones o sistemas operativos según sea necesario.

source: Setting up the host server
es: Configurar servidor de alojamiento

source: Download a copy of Ubuntu Server LTS from https://www.ubuntu.com/download/server and install it on your system according to the steps described `here <https://tutorials.ubuntu.com/tutorial/tutorial-install-ubuntu- server>`__. If you are using a VPS such as Vultr or AWS, your provider will most likely provide an option to install this system during provisioning. Ensure you enable OpenSSH server during setup so you can control your server from a remote console. Once you have access to your server, create a new non-root user if you have not already done so using the following command, replacing ``<username>`` with a username of your choice::
es: Descarga una copia de Ubuntu Server LTS desde https://www.ubuntu.com/download/server e instálalo en tu sistema de acuerdo con los pasos descritos `aquí <https://tutorials.ubuntu.com/tutorial/tutorial-install-ubuntu- server>`__. Si está utilizando un VPS como Vultr o AWS, lo más probable es que tu proveedor proporcione una opción para instalar este sistema durante el aprovisionamiento. Asegúrate de habilitar el servidor OpenSSH durante la configuración para que puedas controlar tu servidor desde una consola remota. Una vez que tengas acceso a tu servidor, cre< un nuevo usuario que no sea root si aún no lo has hecho utilizando el siguiente comando, reemplazando ``<username>`` con el nombre de usuario de tu elección::

source: You will be prompted for a password. Enter and confirm using a new password (different to your root password) and store it in a safe place. You will also see prompts for user information, but this can be left blank. Once the user has been created, we will add them to the sudo group so they can perform commands as root::
es: Se te solicitará una contraseña. Ingresa y confirma usando una nueva contraseña (diferente a tu contraseña de raíz) y guárdala en un lugar seguro. También verás solicitudes de información del usuario, pero esto puede dejarse en blanco. Una vez que el usuario ha sido creado, los agregaremos al grupo sudo para que puedan ejecutar comandos como root::

source: Reboot your server and log in as the new user. At this point it is recommended to connect remotely using `PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ (for Windows) or ssh (for Linux and macOS) if you have not already done so.
es: Reinicia tu servidor e inicia sesión como el nuevo usuario. En este punto, se recomienda conectarse remotamente usando `PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ (para Windows) o ssh (para Linux y macOS) si aún no lo has hecho.

source: Setting up port forwarding
es: Configurar el reenvío de puertos

source: If you are on a private network behind a router, you will need to set up port forwarding for at least port 8999 (UDP/TCP) for access to the sharechain, as well as port 7903 (UDP/TCP) if you want your node to be accessible to the public. How this is done depends on your particular network router and is therefore beyond the scope of this documentation. An example from the popular DD-WRT open source router distribution is shown below. Guides to setting up port forwarding can be found `here <https://www.wikihow.com/Set-Up-Port-Forwarding-on-a-Router>`__ and `here <http://www.noip.com/support/knowledgebase/general-port-forwarding- guide/>`__.
es: Si te encuentras en una red privada detrás de un router, deberás configurar el reenvío de puertos para al menos el puerto 8999 (UDP/TCP) para acceder a sharechain, así como también el puerto 7903 (UDP/TCP) si deseas que tu nodo sea accesible al público. Cómo se hace esto depende de su router de red particular y, por lo tanto, está fuera del alcance de esta documentación. A continuación, se muestra un ejemplo de la distribución popular de routers de fuente abierta DD-WRT. Las guías para configurar el reenvío de puertos se pueden encontrar 'aquí <https://www.wikihow.com/Set-Up-Port-Forwarding-on-a-Router>`__ and `here <http://www.noip.com/support/knowledgebase/general-port-forwarding- guide/>`__.

source: Take note of your IP address either from your router management interface or by visiting https://www.whatismyip.com
es: Toma nota de tu dirección IP ya sea desde la interfaz de administración del router o visitando https://www.whatismyip.com

source: Setting up port forwarding under DD-WRT
es: Configurar el reenvío de puertos en DD-WRT

source: Option 1: Automated script setup
es: Opción 1: configuración automática de scripts

source: Dash community member **dracocephalum** has generously donated a script to automatically deploy everything required to run a p2pool-dash node under Ubuntu Server 16.04 and higher. For more details, see `this forum post <https://www.dash.org/forum/threads/script-to-deploy-p2pool-on- ubuntu.18376/>`_, or simply follow these instructions to get the script. To get fetch the script and get started, type::
es: El miembro de la comunidad Dash **dracocephalum** ha donado generosamente script para implementar automáticamente todo lo requerido para ejecutar un nodo p2pool-dash en Ubuntu Server 16.04 y versiones posteriores. Para más detalles, consulta `esta publicación del foro <https://www.dash.org/forum/threads/script-to-deploy-p2pool-on- ubuntu.18376/>`_, o simplemente sigue estas instrucciones para obtener el script. Para obtener el script y comenzar, escribe::

source: The files will be created in the p2pool-dash-deploy folder. We now need to configure a few variables specific to your system::
es: Los archivos se crearán en la carpeta p2pool-dash-deploy. Ahora necesitamos configurar algunas variables específicas para tu sistema::

source: Scroll down to the section labeled ``#Variables`` and enter the following information, replacing the ``<xxx>`` placeholders after the ``=`` sign. Note that it may also be necessary to update the ``DASH_WALLET_URL``, ``DASH_WALLET_ZIP`` and ``DASH_WALLET_LOCAL`` values if they do not match the current version of Dash:
es: Desplázate hacia abajo a la sección etiquetada ``#Variables`` e ingresamarcadores de posición después del signo `` = ``. la siguiente información, reemplazando los ``<xxx>`` marcadores de posición después del signo ``=``. Ten en cuenta que también puede ser necesario actualizar los valores ``DASH_WALLET_URL``, ``DASH_WALLET_ZIP`` y ``DASH_WALLET_LOCAL`` si no coinciden con la versión actual de Dash:

source: ``PUBLIC_IP`` = your public IP address from the previous step
es: ``PUBLIC_IP`` = tu dirección IP pública del paso anterior

source: ``EMAIL`` = your email address
es: ``EMAIL`` = tu dirección de correo electrónico

source: ``PAYOUT_ADDRESS`` = your DASH wallet address to receive fees
es: ``PAYOUT_ADDRESS`` = tu dirección de wallet DASH para recibir tarifas

source: ``USER_NAME`` = linux user name
es: ``USER_NAME`` = nombre de usuario linux

source: ``RPCUSER`` = enter a random alphanumeric rpc user name
es: ``RPCUSER`` = ingresar un nombre de usuario aleatorio alfanumérico

source: ``RPCPASSWORD`` = enter a random alphanumeric rpc password
es: ``RPCPASSWORD`` = ingresa una contraseña alfanumérica aleatoria tipo RPC

source: Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. Then run the script::
es: Presiona **Ctrl + X** para cerrar el editor y **Y** y **Enter** para guardar el archivo. Luego ejecuta el script::

source: The script will carry out all steps necessary to set up P2pool on Ubuntu Server and start dashd synchronisation. When setup is complete, you should see a message reading **Installation Completed.** You can now run a second script to start p2pool-dash::
es: El script llevará a cabo todos los pasos necesarios para configurar P2pool en Ubuntu Server e iniciar la sincronización de dashd. Cuando finaliza la configuración, deberías ver un mensaje que dice **Instalación finalizada.** Ahora puede ejecutar un segundo script para iniciar p2pool-dash::

source: Your P2Pool node is now running. If you see errors similar to **Error getting work from dashd** or **-10 Dash Core is downloading blocks...** then you must wait until Dash finishes synchronisation. Once this is done, you can point your miners to ``<ip_address>:7903`` to begin mining.
es: Tu nodo P2Pool ahora se está ejecutando. Si ves errores similares a **Error al obtener trabajo de dashd** o **-10 Dash Core está descargando bloques ...** entonces debes esperar hasta que Dash termine la sincronización. Una vez hecho esto, puedes indicar a tus mineros ``<ip_address>:7903`` para que empiecen a minar.

source: Example configuration showing a single Bitmain Antminer D3 connected to a p2pool-dash node on the local network
es: Ejemplo de configuración que muestra un solo Bitmain Antminer D3 conectado a un nodo p2pool-dash en la red local

source: Option 2: Manual setup
es: Opción 2: Configuración manual

source: First update your operating system as follows::
es: Primero actualiza tu sistema operativo de la siguiente manera::

source: Setting up dashd
es: Configurar dashd

source: P2Pool requires a full Dash node to be running to get block and transaction data. To download and install Dash, visit https://www.dash.org/downloads on your computer to find the link to the latest Dash Core wallet. Click **Linux**, then right-click on **Download TGZ** for **Dash Core x64** and select **Copy link address**. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
es: P2Pool requiere que se ejecute un nodo completo de Dash para obtener los datos de bloque y transacción. Para descargar e instalar Dash, visita https://www.dash.org/es/descargas en tu computadora para encontrar el enlace a la última billetera Dash Core. Haz click en **Linux**, luego haz click derecho en **Descargar TGZ** para **Dash Core x64** y selecciona **Copiar dirección de enlace**. Regresa a la ventana de tu terminal e ingresa el siguiente comando, pegando la dirección en la última versión de Dash Core haciendo click derecho o presionando **Ctrl + V**::

source: Verify the integrity of your download by running the following command and comparing the output against the value for the file as shown on the Dash website under **Hash File**::
es: Verifica la integridad de tu descarga ejecutando el siguiente comando y comparando la salida con el valor del archivo como se muestra en el sitio web de Dash en **Hash File**::

source: Link to the hash file to verify download integrity
es: Enlaza el archivo hash para verificar la integridad de la descarga

source: Create a working directory for Dash, extract the compressed archive, copy the necessary files to the directory and set them as executable::
es: Crea un directorio de trabajo para Dash, extrae el archivo comprimido, copia los archivos necesarios en el directorio y configúralos como ejecutables::

source: Clean up unneeded files::
es: Elimina los archivos innecesarios::

source: Create a configuration file using the following command::
es: Crea un archivo de configuración usando el siguiente comando::

source: An editor window will appear. We now need to create a configuration file specifying several variables. Copy and paste the following text to get started, then replace the variables specific to your configuration as follows::
es: Aparecerá una ventana del editor. Ahora necesitamos crear un archivo de configuración que especifique varias variables. Copia y pega el siguiente texto para comenzar, luego reemplaza las variables específicas a tu configuración de la siguiente manera::

source: Replace the fields marked with ``XXXXXXX`` as follows:
es: Reemplaza los campos marcados con ``XXXXXXX`` de la siguiente manera:

source: ``rpcuser``: enter any string of numbers or letters, no special characters allowed
es: ``rpcuser``: ingresa cualquier cadena de números o letras, no se permiten caracteres especiales

source: ``rpcpassword``: enter any string of numbers or letters, no special characters allowed
es: ``rpcpassword``: ingresa cualquier cadena de números o letras, no se permiten caracteres especiales

source: The result should look something like this:
es: El resultado debería verse más o menos así:

source: Entering key data in dash.conf on the P2Pool node
es: Introducción de datos clave en dash.conf en el nodo P2Pool

source: Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. You can now start running Dash on the masternode to begin synchronization with the blockchain::
es: Presiona **Ctrl + X** para cerrar el editor y **Y** y **Entrar** para guardar el archivo. Ahora puedes comenzar a ejecutar Dash en el masternode para comenzar la sincronización con la cadena de bloques::

source: You will see a message reading **Dash Core server starting**. You can continue with the following steps and check synchronization periodically using the following command. Synchronization is complete when the number of ``blocks`` is equal to the current number of blocks in the Dash blockchain, as can be seen from any synchronized Dash wallet or `block explorer <https://insight.dash.org/insight/>`_::
es: Verás un mensaje que dice **Servidor de Dash Core comenzando**. Puede continuar con los siguientes pasos y verificar la sincronización periódicamente con el siguiente comando. La sincronización se completa cuando el número de ``bloques`` es igual al número actual de bloques en la cadena de bloques de Dash, como se puede ver desde cualquier billetera Dash sincronizada o `explorador de bloques <https://insight.dash.org/insight/>`_::

source: Setting up P2Pool
es: Configurar P2Pool

source: We will now set up the P2Pool software and its dependencies. Begin with the dependencies::
es: Ahora configuraremos el software P2Pool y sus dependencias. Comienza con las dependencias::

source: Create working directories and set up p2pool-dash::
es: Crea directorios de trabajo y configura p2pool-dash::

source: We will add some optional extra interfaces to the control panel::
es: Añadiremos algunas interfaces extra opcionales al panel de control::

source: You can now start p2pool and optionally specify the payout address, external IP (if necessary), fee and donation as follows::
es: Ahora puedes iniciar p2pool y, opcionalmente, especificar la dirección de pago, IP externa (si es necesario), comisión y donación de la siguiente manera::

source: You can then monitor your node by browsing to the following addresses, replacing ``<ip_address>`` with the IP address of your P2Pool node:
es: Luego puedes monitorear tu nodo navegando a las siguientes direcciones, reemplazando ``<ip_address>`` con la dirección IP de tu nodo P2Pool:

source: Punchy interface: http://ip_address:7903/static
es: Interfaz Punchy: http://ip_address:7903/static

source: Legacy interface: http://ip_address:7903/static/legacy
es: Interfaz de legado: http://ip_address:7903/static/legacy

source: Status interface: http://ip_address:7903/static/status
es: Estado de la itnerfaz: http://ip_address:7903/static/status

source: Extended interface: http://ip_address:7903/static/ext
es: Interfaz extendida: http://ip_address:7903/static/ext
